       Identification division.
       Program-Id.                                 pdcf4023           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    dcf                 *
      *                                Settore:    com                 *
      *                                   Fase:    dcf402              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 20/02/95    *
      *                       Ultima revisione:    NdK del 17/12/25    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione stampa per il programma dcf402   *
      *                                                                *
      *                    Stampa anagrafiche commerciali fornitori    *
      *                                                                *
      *                    Etichette o archivio sequenziale            *
      *                                                                *
      *                    ------------------------------------------- *
      *                                                                *
      *                    File di esportazione :                      *
      *                                                                *
      *                    /abd/asc/UTENTE/exp/AZI_dcf402.csv          *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Chiave di ordinamento alfanumerica generica       *
      *            *---------------------------------------------------*
               10  srt-key-alf            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Chiave di ordinamento numerica generica           *
      *            *---------------------------------------------------*
               10  srt-key-num            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Chiave di ordinamento alfanumerica generica 2     *
      *            *---------------------------------------------------*
               10  srt-key-al2            pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Chiave di ordinamento numerica per fornitore      *
      *            *---------------------------------------------------*
               10  srt-key-ncl            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Chiave di ordinamento alfanumerica per fornitore  *
      *            *---------------------------------------------------*
               10  srt-key-acl            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Chiave di ordinamento alfanumerica per dipendenza *
      *            * del fornitore                                     *
      *            *---------------------------------------------------*
               10  srt-key-adp            pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Per ospitare un intero 'rf-dcf'                   *
      *            *---------------------------------------------------*
               10  srt-dat-rec-dcf.
                   15  filler  occurs 2048
                                          pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "dcf"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "com"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "dcf402"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pdcf4023"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "STAMPA ANAGRAFICA COMMERCIALE FORNITORI "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mxport" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/x"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records logici                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [yst]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfyst"                          .
      *        *-------------------------------------------------------*
      *        * [gxn]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/geo/fls/rec/rfgxn"                          .
      *        *-------------------------------------------------------*
      *        * [gxr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/geo/fls/rec/rfgxr"                          .
      *        *-------------------------------------------------------*
      *        * [gxp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/geo/fls/rec/rfgxp"                          .
      *        *-------------------------------------------------------*
      *        * [gxc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/geo/fls/rec/rfgxc"                          .
      *        *-------------------------------------------------------*
      *        * [gxs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/geo/fls/rec/rfgxs"                          .
      *        *-------------------------------------------------------*
      *        * [yfp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfyfp"                          .
      *        *-------------------------------------------------------*
      *        * [ydf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfydf"                          .
      *        *-------------------------------------------------------*
      *        * [yvf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfyvf"                          .
      *        *-------------------------------------------------------*
      *        * [axi]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxi"                          .
      *        *-------------------------------------------------------*
      *        * [axs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxs"                          .
      *        *-------------------------------------------------------*
      *        * [cbp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfcbp"                          .

      *    *===========================================================*
      *    * Work-area richieste per stampa                            *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/pdcf4020.pgl"                   .

      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Personalizzazioni relative alle voci descrittive per  *
      *        * la fatturazione                                       *
      *        *-------------------------------------------------------*
           05  w-prs-vde-fat.
      *            *---------------------------------------------------*
      *            * Numero di voci personalizzate caricate            *
      *            *---------------------------------------------------*
               10  w-prs-vde-fat-nvt      pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Numero linea a video per la prima voce diminuito  *
      *            * di uno                                            *
      *            *---------------------------------------------------*
               10  w-prs-vde-fat-lv1      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tabella voci personalizzate, impaccate in alto,   *
      *            * le voci non personalizzate non sono contenute     *
      *            * nella tabella                                     *
      *            *---------------------------------------------------*
               10  w-prs-vde-fat-tbl occurs 06.
      *                *-----------------------------------------------*
      *                * Numero voce 1..6                              *
      *                *-----------------------------------------------*
                   15  w-prs-vde-fat-npt  pic  9(01)                  .
      *                *-----------------------------------------------*
      *                * Descrizione per il video estesa               *
      *                *-----------------------------------------------*
                   15  w-prs-vde-fat-dve  pic  x(25)                  .
      *            *---------------------------------------------------*
      *            * Contatori, indici, e comodi locali                *
      *            *---------------------------------------------------*
               10  w-prs-vde-fat-i01      pic  9(01)                  .
               10  w-prs-vde-fat-i02      pic  9(02)                  .

      *    *===========================================================*
      *    * Work area per routine di sort                             *
      *    *-----------------------------------------------------------*
       01  w-srt.
      *        *-------------------------------------------------------*
      *        * Tipo ordinamento anagrafica fornitori per il sort     *
      *        *-------------------------------------------------------*
           05  w-srt-ord-fnt              pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Selettori per anagrafica fornitori per il sort        *
      *        *-------------------------------------------------------*
           05  w-srt-cof-min              pic  9(07)                  .
           05  w-srt-cof-max              pic  9(07)                  .
           05  w-srt-rsf-min              pic  x(40)                  .
           05  w-srt-rsf-max              pic  x(40)                  .
           05  w-srt-mnf-min              pic  x(10)                  .
           05  w-srt-mnf-max              pic  x(10)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per scansione dipendenze                       *
      *        *-------------------------------------------------------*
           05  w-srt-cod-fnt              pic  9(07)                  .
           05  w-srt-key-ncl              pic  9(07)                  .
           05  w-srt-key-acl              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per composizione chiavi per il sort            *
      *        *-------------------------------------------------------*
           05  w-srt-key-num              pic  9(07)                  .
           05  w-srt-key-alf              pic  x(40)                  .
           05  w-srt-key-al2              pic  x(05)                  .
      *        *-------------------------------------------------------*
      *        * Flag di uscita dalla routine di selezione per il sort *
      *        *                                                       *
      *        *  - spaces : selezione superata                        *
      *        *  - '#'    : selezione non superata                    *
      *        *-------------------------------------------------------*
           05  w-srt-sel-rec              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per estrazione del CAP dalla localita'         *
      *        *-------------------------------------------------------*
           05  w-srt-cap-avp              pic  x(05)                  .
           05  w-srt-cap-avp-r redefines
               w-srt-cap-avp.
               10  w-srt-cap-avp-num      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per selezioni su CAP                           *
      *        *-------------------------------------------------------*
           05  w-srt-cap-in1              pic  x(05)                  .
           05  w-srt-cap-fi1              pic  x(05)                  .
           05  w-srt-cap-in2              pic  x(05)                  .
           05  w-srt-cap-fi2              pic  x(05)                  .
           05  w-srt-cap-in3              pic  x(05)                  .
           05  w-srt-cap-fi3              pic  x(05)                  .
           05  w-srt-cap-in4              pic  x(05)                  .
           05  w-srt-cap-fi4              pic  x(05)                  .
           05  w-srt-cap-in5              pic  x(05)                  .
           05  w-srt-cap-fi5              pic  x(05)                  .
           05  w-srt-cap-in6              pic  x(05)                  .
           05  w-srt-cap-fi6              pic  x(05)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det se CAP stradario                         *
      *        *-------------------------------------------------------*
           05  w-det-std-gxs.
      *            *---------------------------------------------------*
      *            * Esito della determinazione                        *
      *            * - 'spaces' : il CAP e' uno stradario              *
      *            * - '#'      : il CAP non e' uno stradario          *
      *            *---------------------------------------------------*
               10  w-det-std-gxs-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * CAP in input                                      *
      *            *---------------------------------------------------*
               10  w-det-std-gxs-cap      pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Codice comune rilevato                            *
      *            *---------------------------------------------------*
               10  w-det-std-gxs-cmn      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * CAP in output eventualmente rilevato dal codice   *
      *            * comune                                            *
      *            *---------------------------------------------------*
               10  w-det-std-gxs-ccm      pic  x(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det pathname file sequenziale in output      *
      *        *-------------------------------------------------------*
           05  w-det-pth-fso.
               10  w-det-pth-fso-pat      pic  x(80)                  .

      *    *===========================================================*
      *    * Work area per esecuzione stampa                           *
      *    *-----------------------------------------------------------*
       01  w-stp.
      *        *-------------------------------------------------------*
      *        * Sub-work per livello dettaglio stampa di tipo '01' :  *
      *        * senza note aggiuntive                                 *
      *        *-------------------------------------------------------*
           05  w-stp-t01.
      *            *---------------------------------------------------*
      *            * Area di stampa completa per il dettaglio          *
      *            *---------------------------------------------------*
               10  w-stp-t01-cpl.
      *                *-----------------------------------------------*
      *                * Singole righe che compongono l'area di stampa *
      *                * del dettaglio                                 *
      *                *-----------------------------------------------*
                   15  w-stp-t01-rig occurs 20.
      *                    *-------------------------------------------*
      *                    * Colonna 1                                 *
      *                    *-------------------------------------------*
                       20  w-stp-t01-col-001
                                          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Contatori relativi alle colonne, uno per colonna  *
      *            *---------------------------------------------------*
               10  w-stp-t01-cco.
                   15  w-stp-t01-cco-001  pic  9(02)                  .
                   15  w-stp-t01-cco-002  pic  9(02)                  .
                   15  w-stp-t01-cco-003  pic  9(02)                  .
                   15  w-stp-t01-cco-004  pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Indici e contatori per la scansione e la stampa   *
      *            * delle colonne                                     *
      *            *---------------------------------------------------*
               10  w-stp-t01-iec.
      *                *-----------------------------------------------*
      *                * Contatore delle linee effettive da stampare   *
      *                *-----------------------------------------------*
                   15  w-stp-t01-ctr-lin  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Indice di scansione                           *
      *                *-----------------------------------------------*
                   15  w-stp-t01-inx-lin  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Comodo per linee residue                      *
      *                *-----------------------------------------------*
                   15  w-stp-t01-ctr-res  pic  9(02)                  .

      *    *===========================================================*
      *    * Area per controllo su singole etichette                   *
      *    *-----------------------------------------------------------*
       01  w-cnt-eti.
      *        *-------------------------------------------------------*
      *        * Numero etichette stampate nella pagina in corso       *
      *        *-------------------------------------------------------*
           05  w-cnt-eti-num-epc          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Numero colonna in corso di stampa                     *
      *        *-------------------------------------------------------*
           05  w-cnt-eti-num-ccs          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Correttivo per la posizione di stampa                 *
      *        *-------------------------------------------------------*
           05  w-cnt-eti-num-cps          pic  9(03)                  .

      *    *===========================================================*
      *    * Work area totali                                          *
      *    *-----------------------------------------------------------*
       01  w-tot.
      *        *-------------------------------------------------------*
      *        * Work per totale generale                              *
      *        *-------------------------------------------------------*
           05  w-tot-gen.
      *            *---------------------------------------------------*
      *            * Totale generale elementi stampati                 *
      *            *---------------------------------------------------*
               10  w-tot-gen-ele          pic  9(07)                  .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione contatti         *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/dconarc0.dtl"                   .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  filler                 pic  x(01)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni relative alle voci    *
      *              * descrittive per la fatturazione                 *
      *              *-------------------------------------------------*
           perform   prs-vde-fat-000      thru prs-vde-fat-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura delle personalizzazioni relative alle voci de-    *
      *    * scrittive per la fatturazione                             *
      *    *-----------------------------------------------------------*
       prs-vde-fat-000.
      *              *-------------------------------------------------*
      *              * Open tabella [ydf]                              *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofydf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ydf                 .
       prs-vde-fat-100.
      *              *-------------------------------------------------*
      *              * Numero di voci personalizzate caricate : zero   *
      *              *-------------------------------------------------*
           move      zero                 to   w-prs-vde-fat-nvt      .
       prs-vde-fat-200.
      *              *-------------------------------------------------*
      *              * Tentativo di lettura voci da 1 a 6 con carica-  *
      *              * mento in tabella delle voci trovate             *
      *              *-------------------------------------------------*
       prs-vde-fat-250.
      *                  *---------------------------------------------*
      *                  * Indice 1..6 a zero                          *
      *                  *---------------------------------------------*
           move      zero                 to   w-prs-vde-fat-i01      .
       prs-vde-fat-300.
      *                  *---------------------------------------------*
      *                  * Incremento indice 1..6                      *
      *                  *---------------------------------------------*
           add       1                    to   w-prs-vde-fat-i01      .
      *                  *---------------------------------------------*
      *                  * Se oltre il max : a chiusura                *
      *                  *---------------------------------------------*
           if        w-prs-vde-fat-i01    >    6
                     go to prs-vde-fat-900.
       prs-vde-fat-400.
      *                  *---------------------------------------------*
      *                  * Tentativo di lettura della tabella per la   *
      *                  * voce corripsondente all'indice, e con co-   *
      *                  * dice lingua per Italia                      *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODDEF    "         to   f-key                  .
           move      w-prs-vde-fat-i01    to   rf-ydf-num-def         .
           move      "I  "                to   rf-ydf-cod-lng         .
           move      "pgm/dcf/fls/ioc/obj/iofydf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ydf                 .
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione dell'esito della     *
      *                  * lettura                                     *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to prs-vde-fat-500
           else      go to prs-vde-fat-700.
       prs-vde-fat-500.
      *                  *---------------------------------------------*
      *                  * Se record voce descrittiva esistente        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Bufferizzazione voce                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento numero di voci persona-  *
      *                          * lizzate caricate                    *
      *                          *-------------------------------------*
           add       1                    to   w-prs-vde-fat-nvt      .
      *                          *-------------------------------------*
      *                          * Numero voce                         *
      *                          *-------------------------------------*
           move      w-prs-vde-fat-i01    to   w-prs-vde-fat-npt
                                              (w-prs-vde-fat-nvt)     .
      *                          *-------------------------------------*
      *                          * Descrizione per il video estesa     *
      *                          *-------------------------------------*
           move      rf-ydf-des-ves       to   w-prs-vde-fat-dve
                                              (w-prs-vde-fat-nvt)     .
      *                      *-----------------------------------------*
      *                      * Riciclo su voce successiva              *
      *                      *-----------------------------------------*
           go to     prs-vde-fat-800.
       prs-vde-fat-700.
      *                  *---------------------------------------------*
      *                  * Se record voce descrittiva non esistente    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Riciclo a voce successiva               *
      *                      *-----------------------------------------*
           go to     prs-vde-fat-800.
       prs-vde-fat-800.
      *                  *---------------------------------------------*
      *                  * Riciclo a voce successiva                   *
      *                  *---------------------------------------------*
           go to     prs-vde-fat-300.
       prs-vde-fat-900.
      *              *-------------------------------------------------*
      *              * Determinazione numero linea a video, diminuito  *
      *              * di uno, per la prima spesa (solo video)         *
      *              *-------------------------------------------------*
       prs-vde-fat-950.
      *              *-------------------------------------------------*
      *              * Close tabella [ydf]                             *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofydf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ydf                 .
       prs-vde-fat-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [yst]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yst                 .
      *              *-------------------------------------------------*
      *              * [yvf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyvf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yvf                 .
      *              *-------------------------------------------------*
      *              * [gxn]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxn"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxn                 .
      *              *-------------------------------------------------*
      *              * [gxr]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxr                 .
      *              *-------------------------------------------------*
      *              * [gxp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxp                 .
      *              *-------------------------------------------------*
      *              * [gxc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *              *-------------------------------------------------*
      *              * [gxs]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxs                 .
      *              *-------------------------------------------------*
      *              * [yfp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
      *              *-------------------------------------------------*
      *              * [axi]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
      *              *-------------------------------------------------*
      *              * [axs]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
      *              *-------------------------------------------------*
      *              * [cbp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione contatti          *
      *              *-------------------------------------------------*
           perform   con-arc-tip-opn-000  thru con-arc-tip-opn-999    .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [yst]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yst                 .
      *              *-------------------------------------------------*
      *              * [yvf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyvf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yvf                 .
      *              *-------------------------------------------------*
      *              * [gxn]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxn"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxn                 .
      *              *-------------------------------------------------*
      *              * [gxr]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxr                 .
      *              *-------------------------------------------------*
      *              * [gxp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxp                 .
      *              *-------------------------------------------------*
      *              * [gxc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *              *-------------------------------------------------*
      *              * [gxs]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxs                 .
      *              *-------------------------------------------------*
      *              * [yfp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
      *              *-------------------------------------------------*
      *              * [axi]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
      *              *-------------------------------------------------*
      *              * [axs]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
      *              *-------------------------------------------------*
      *              * [cbp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione contatti         *
      *              *-------------------------------------------------*
           perform   con-arc-tip-cls-000  thru con-arc-tip-cls-999    .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : Si'                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort                                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   prn-rou-pri-000
                                          thru prn-rou-pri-999        .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *                                                           *
      *    * N.B. : Questa parte del programma e' perfettamente uguale *
      *    *        per tutte le overlay 'dcf402'                      *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/pdcf4020.pgs"                   .

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessuna anagrafica entro i limiti assegnati !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-let-seq-100.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-prn-flg-sub
                            go to prn-let-seq-999.
       prn-let-seq-200.
      *              *-------------------------------------------------*
      *              * Record [dcf] da record di sort                  *
      *              *-------------------------------------------------*
           move      srt-dat-rec-dcf      to   rf-dcf                 .
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Test se richiesta emissione di archivio sequen- *
      *              * ziale                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rr-tip-stp           not  = 51
                     go to prn-ini-cic-100.
      *                  *---------------------------------------------*
      *                  * Preparazione ed output record sequenziale   *
      *                  * ad inizio ciclo per labels                  *
      *                  *---------------------------------------------*
           perform   prn-ini-cic-s51-000  thru prn-ini-cic-s51-999    .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-999.
       prn-ini-cic-100.
      *              *-------------------------------------------------*
      *              * Normalizzazione numero colonna in corso di      *
      *              * trattamento                                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-eti-num-ccs      .
       prn-ini-cic-200.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di etichette    *
      *              *-------------------------------------------------*
           if        rr-tip-eti           =    01
                     perform  int-pag-001-000
                                          thru int-pag-001-999
           else if   rr-tip-eti           =    51
                     perform  int-pag-051-000
                                          thru int-pag-051-999
           else      perform  int-pag-001-000
                                          thru int-pag-001-999        .
       prn-ini-cic-300.
      *              *-------------------------------------------------*
      *              * Test sul flag di uscita                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-cic-999.
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *                                                           *
      *    * Preparazione ed output labels esportazione generale       *
      *    *-----------------------------------------------------------*
       prn-ini-cic-s51-000.
      *              *-------------------------------------------------*
      *              * Open file di export                             *
      *              *-------------------------------------------------*
           move      "OP"                 to   x-ope                  .
           move      spaces               to   x-pat                  .
           move      spaces               to   x-nam                  .
           move      02                   to   x-tex                  .
           move      ";"                  to   x-sep                  .
           call      "swd/mod/prg/obj/mxport"
                                        using  x                      .
           move      x-pat                to   w-det-pth-fso-pat      .
       prn-ini-cic-s51-200.
      *              *-------------------------------------------------*
      *              * Intestazioni colonne                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "H"                  to   x-tip                  .
           move      06                   to   x-car                  .
           move      "CODICE"             to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Codice dipendenza                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      04                   to   x-car                  .
           move      "DPZ"                to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Ragione sociale parte 1                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      20                   to   x-car                  .
           move      "RAGIONE SOCIALE - 1"
                                          to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Ragione sociale parte 2                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      20                   to   x-car                  .
           move      "RAGIONE SOCIALE - 2"
                                          to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Indirizzo                                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      10                   to   x-car                  .
           move      "INDIRIZZO"          to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Localita'                                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      10                   to   x-car                  .
           move      "LOCALITA'"          to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Nazione                                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      03                   to   x-car                  .
           move      "NAZ"                to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-300.
      *                  *---------------------------------------------*
      *                  * Dati opzionali                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Agente                                  *
      *                      *-----------------------------------------*
       prn-ini-cic-s51-310.
      *                      *-----------------------------------------*
      *                      * Zona                                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-zon       not  = "X"
                     go to prn-ini-cic-s51-320.
      *                          *-------------------------------------*
      *                          * Codice                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "H"                  to   x-tip                  .
           move      04                   to   x-car                  .
           move      "ZONA"               to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      11                   to   x-car                  .
           move      "DESCRIZIONE"        to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-320.
      *                      *-----------------------------------------*
      *                      * Categoria                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-cat       not  = "X"
                     go to prn-ini-cic-s51-330.
      *                          *-------------------------------------*
      *                          * Codice                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "H"                  to   x-tip                  .
           move      06                   to   x-car                  .
           move      "CATEG."             to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      11                   to   x-car                  .
           move      "DESCRIZIONE"        to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-330.
      *                      *-----------------------------------------*
      *                      * Statistico                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-stt       not  = "X"
                     go to prn-ini-cic-s51-340.
      *                          *-------------------------------------*
      *                          * Codice                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "H"                  to   x-tip                  .
           move      05                   to   x-car                  .
           move      "STAT."              to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      11                   to   x-car                  .
           move      "DESCRIZIONE"        to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-340.
      *                      *-----------------------------------------*
      *                      * Codice listino                          *
      *                      *-----------------------------------------*
       prn-ini-cic-s51-360.
      *                      *-----------------------------------------*
      *                      * Forma di pagamento                      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-pag       not  = "X"
                     go to prn-ini-cic-s51-370.
      *                          *-------------------------------------*
      *                          * Codice                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "H"                  to   x-tip                  .
           move      06                   to   x-car                  .
           move      "PAGAM."             to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      11                   to   x-car                  .
           move      "DESCRIZIONE"        to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-370.
      *                      *-----------------------------------------*
      *                      * Banca d'appoggio                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-ban       not  = "X"
                     go to prn-ini-cic-s51-380.
      *                          *-------------------------------------*
      *                          * Codice ABI                          *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      03                   to   x-car                  .
           move      "ABI"                to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Istituto                            *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      08                   to   x-car                  .
           move      "ISTITUTO"           to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Codice CAB                          *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      03                   to   x-car                  .
           move      "CAB"                to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Sportello                           *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      09                   to   x-car                  .
           move      "SPORTELLO"          to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * C/c appoggio                        *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      11                   to   x-car                  .
           move      "C. CORRENTE"        to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * CIN IT                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      03                   to   x-car                  .
           move      "CIN"                to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * CIN EU                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      03                   to   x-car                  .
           move      "CEU"                to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-380.
      *                      *-----------------------------------------*
      *                      * Telefono                                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-tel       not  = "X"
                     go to prn-ini-cic-s51-390.
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      09                   to   x-car                  .
           move      "TELEFONO"           to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-390.
      *                      *-----------------------------------------*
      *                      * Fax                                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-fax       not  = "X"
                     go to prn-ini-cic-s51-392.
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      09                   to   x-car                  .
           move      "FAX"                to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-392.
      *                      *-----------------------------------------*
      *                      * Cellulare                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-cel       not  = "X"
                     go to prn-ini-cic-s51-395.
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      09                   to   x-car                  .
           move      "CELLULARE"          to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-395.
      *                      *-----------------------------------------*
      *                      * E-mail                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-eml       not  = "X"
                     go to prn-ini-cic-s51-397.
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      09                   to   x-car                  .
           move      "E-MAIL"             to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-397.
      *                      *-----------------------------------------*
      *                      * Email PEC                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-pec       not  = "X"
                     go to prn-ini-cic-s51-400.
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      10                   to   x-car                  .
           move      "E-MAIL PEC"         to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-400.
      *                      *-----------------------------------------*
      *                      * Codice SDI                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-sdi       not  = "X"
                     go to prn-ini-cic-s51-405.
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      10                   to   x-car                  .
           move      "CODICE SDI"         to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-405.
      *                      *-----------------------------------------*
      *                      * Interlocutore                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-int       not  = "X"
                     go to prn-ini-cic-s51-410.
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      13                   to   x-car                  .
           move      "INTERLOCUTORE"      to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-410.
      *                      *-----------------------------------------*
      *                      * Partita Iva                             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-piv       not  = "X"
                     go to prn-ini-cic-s51-415.
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      12                   to   x-car                  .
           move      "PARTITA IVA"        to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-415.
      *                      *-----------------------------------------*
      *                      * Codice fiscale                          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-cfi       not  = "X"
                     go to prn-ini-cic-s51-500.
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      16                   to   x-car                  .
           move      "CODICE FISCALE"     to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-500.
      *                      *-----------------------------------------*
      *                      * Voci descrittive                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-vdf       not  = "X"
                     go to prn-ini-cic-s51-800.
           if        w-prs-vde-fat-nvt    =    zero
                     go to prn-ini-cic-s51-800.
      *                          *-------------------------------------*
      *                          * Ciclo di emissione                  *
      *                          *-------------------------------------*
           perform   prn-ini-cic-vdf-000  thru prn-ini-cic-vdf-999    .
       prn-ini-cic-s51-800.
      *              *-------------------------------------------------*
      *              * Emissione riga                                  *
      *              *-------------------------------------------------*
           move      "PR"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-s51-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-ini-cic-s51-999.
       prn-ini-cic-s51-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *                                                           *
      *    * Preparazione ed output labels per voci descrittive        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-vdf-000.
      *              *-------------------------------------------------*
      *              * Preparazione valori                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione contatore 01..06           *
      *                  *---------------------------------------------*
           move      zero                 to   w-prs-vde-fat-i01      .
       prn-ini-cic-vdf-200.
      *                  *---------------------------------------------*
      *                  * Incremento contatore 01..06                 *
      *                  *---------------------------------------------*
           add       01                   to   w-prs-vde-fat-i01      .
      *                  *---------------------------------------------*
      *                  * Se maggiore del massimo numero di voci      *
      *                  * personalizzate : uscita                     *
      *                  *---------------------------------------------*
           if        w-prs-vde-fat-i01    >    w-prs-vde-fat-nvt
                     go to prn-ini-cic-vdf-900.
       prn-ini-cic-vdf-300.
      *                  *---------------------------------------------*
      *                  * In area di stampa                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      30                   to   x-car                  .
           move      w-prs-vde-fat-dve
                    (w-prs-vde-fat-i01)   to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-ini-cic-vdf-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     prn-ini-cic-vdf-200.
       prn-ini-cic-vdf-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-ini-cic-vdf-999.
       prn-ini-cic-vdf-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-cic-100.
      *              *-------------------------------------------------*
      *              * Test se richiesta emissione di archivio sequen- *
      *              * ziale                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rr-tip-stp           not  = 51
                     go to prn-fin-cic-999.
      *                  *---------------------------------------------*
      *                  * Close file di export                        *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           move      w-det-pth-fso-pat    to   x-pat                  .
           call      "swd/mod/prg/obj/mxport"
                                        using  x                      .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo export                 *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mxport"                         .
      *                  *---------------------------------------------*
      *                  * Eventuali messaggi di dati elaborati        *
      *                  *---------------------------------------------*
           if        x-msg                =    spaces
                     go to prn-fin-cic-999.
           move      "WR"                 to   m-ope                  .
           move      x-ms1                to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
           if        x-ms2                =    spaces
                     go to prn-fin-cic-999.
           move      "WR"                 to   m-ope                  .
           move      x-ms2                to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-fin-cic-900.
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-fin-cic-999.
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-liv-det-010.
      *              *-------------------------------------------------*
      *              * Record [fnt] corrispondente                     *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT"             to   f-key                  .
           move      rf-dcf-cod-fnt       to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                  *---------------------------------------------*
      *                  * Se record [fnt] non trovato : mnemonico con *
      *                  * puntini                                     *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  all "."        to   rf-fnt-cod-mne         .
       prn-liv-det-050.
      *              *-------------------------------------------------*
      *              * Test se richiesta emissione di archivio sequen- *
      *              * ziale                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rr-tip-stp           not  = 51
                     go to prn-liv-det-100.
      *                  *---------------------------------------------*
      *                  * Preparazione ed output record sequenziale   *
      *                  *---------------------------------------------*
           perform   prn-liv-det-sqz-000  thru prn-liv-det-sqz-999    .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-100.
      *              *-------------------------------------------------*
      *              * Preparazione del testo da stampare nelle eti-   *
      *              * chette                                          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-pcs-000  thru prn-liv-det-pcs-999    .
       prn-liv-det-200.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di etichette    *
      *              *-------------------------------------------------*
           if        rr-tip-eti           =    01
                     perform  prn-liv-det-e01-000
                                          thru prn-liv-det-e01-999
           else if   rr-tip-eti           =    51
                     perform  prn-liv-det-e51-000
                                          thru prn-liv-det-e51-999
           else      perform  prn-liv-det-e01-000
                                          thru prn-liv-det-e01-999    .
       prn-liv-det-300.
      *              *-------------------------------------------------*
      *              * Test sul flag di uscita                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Preparazione ed output record sequenziale completo        *
      *    *-----------------------------------------------------------*
       prn-liv-det-sqz-000.
      *              *-------------------------------------------------*
      *              * Composizione record di output                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice fornitore                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "N"                  to   x-tip                  .
           move      07                   to   x-car                  .
           move      zero                 to   x-dec                  .
           move      spaces               to   x-sgn                  .
           move      "<B"                 to   x-edm                  .
           move      rf-dcf-cod-fnt       to   x-num                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Codice dipendenza fornitore                 *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      04                   to   x-car                  .
           move      rf-dcf-dpz-fnt       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Ragione sociale fornitore 1                 *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      40                   to   x-car                  .
           move      rf-dcf-rs1-doc       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Ragione sociale fornitore 2                 *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      40                   to   x-car                  .
           move      rf-dcf-rs2-doc       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Indirizzo                                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      40                   to   x-car                  .
           move      rf-dcf-via-dcf       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Localita'                                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      40                   to   x-car                  .
           move      rf-dcf-loc-dcf       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Nazione                                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      03                   to   x-car                  .
           move      rf-dcf-cod-naz       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-300.
      *                  *---------------------------------------------*
      *                  * Dati opzionali                              *
      *                  *---------------------------------------------*
       prn-liv-det-sqz-310.
      *                      *-----------------------------------------*
      *                      * Agente                                  *
      *                      *-----------------------------------------*
       prn-liv-det-sqz-320.
      *                      *-----------------------------------------*
      *                      * Zona                                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-zon       not  = "X"
                     go to prn-liv-det-sqz-330.
      *                          *-------------------------------------*
      *                          * Codice                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "N"                  to   x-tip                  .
           move      05                   to   x-car                  .
           move      zero                 to   x-dec                  .
           move      spaces               to   x-sgn                  .
           move      "<B"                 to   x-edm                  .
           move      rf-dcf-cod-zon       to   x-num                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Normalizzazione record [yst]        *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yst                 .
      *                          *-------------------------------------*
      *                          * Lettura                             *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLS    "         to   f-key                  .
           move      01                   to   rf-yst-tip-cls         .
           move      rf-dcf-cod-zon       to   rf-yst-cod-cls         .
           move      "pgm/dcf/fls/ioc/obj/iofyst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yst                 .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      20                   to   x-car                  .
           move      rf-yst-des-cls       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-330.
      *                      *-----------------------------------------*
      *                      * Categoria                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-cat       not  = "X"
                     go to prn-liv-det-sqz-340.
      *                          *-------------------------------------*
      *                          * Codice                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "N"                  to   x-tip                  .
           move      05                   to   x-car                  .
           move      zero                 to   x-dec                  .
           move      spaces               to   x-sgn                  .
           move      "<B"                 to   x-edm                  .
           move      rf-dcf-cod-cat       to   x-num                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Normalizzazione record [yst]        *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yst                 .
      *                          *-------------------------------------*
      *                          * Lettura                             *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLS    "         to   f-key                  .
           move      02                   to   rf-yst-tip-cls         .
           move      rf-dcf-cod-cat       to   rf-yst-cod-cls         .
           move      "pgm/dcf/fls/ioc/obj/iofyst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yst                 .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      20                   to   x-car                  .
           move      rf-yst-des-cls       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-340.
      *                      *-----------------------------------------*
      *                      * Statistico                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-stt       not  = "X"
                     go to prn-liv-det-sqz-350.
      *                          *-------------------------------------*
      *                          * Codice                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "N"                  to   x-tip                  .
           move      05                   to   x-car                  .
           move      zero                 to   x-dec                  .
           move      spaces               to   x-sgn                  .
           move      "<B"                 to   x-edm                  .
           move      rf-dcf-cod-stt       to   x-num                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Normalizzazione record [yst]        *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yst                 .
      *                          *-------------------------------------*
      *                          * Lettura                             *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLS    "         to   f-key                  .
           move      03                   to   rf-yst-tip-cls         .
           move      rf-dcf-cod-stt       to   rf-yst-cod-cls         .
           move      "pgm/dcf/fls/ioc/obj/iofyst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yst                 .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      20                   to   x-car                  .
           move      rf-yst-des-cls       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-350.
      *                      *-----------------------------------------*
      *                      * Listino                                 *
      *                      *-----------------------------------------*
       prn-liv-det-sqz-360.
      *                      *-----------------------------------------*
      *                      * Forma di pagamento                      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-pag       not  = "X"
                     go to prn-liv-det-sqz-370.
      *                          *-------------------------------------*
      *                          * Codice                              *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "N"                  to   x-tip                  .
           move      07                   to   x-car                  .
           move      zero                 to   x-dec                  .
           move      spaces               to   x-sgn                  .
           move      "<B"                 to   x-edm                  .
           move      rf-dcf-cod-fop       to   x-num                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                              *---------------------------------*
      *                              * Normalizzazione record [yfp]    *
      *                              *---------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
      *                              *---------------------------------*
      *                              * Lettura anagrafica              *
      *                              *---------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFOP    "         to   f-key                  .
           move      rf-dcf-cod-fop       to   rf-yfp-cod-fop         .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      20                   to   x-car                  .
           move      rf-yfp-des-fop       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-370.
      *                      *-----------------------------------------*
      *                      * Banca d'appoggio                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-ban       not  = "X"
                     go to prn-liv-det-sqz-380.
      *                          *-------------------------------------*
      *                          * Codice ABI                          *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "N"                  to   x-tip                  .
           move      05                   to   x-car                  .
           move      zero                 to   x-dec                  .
           move      spaces               to   x-sgn                  .
           move      "9"                  to   x-edm                  .
           move      rf-dcf-cod-abi       to   x-num                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Normalizzazione record              *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
      *                          *-------------------------------------*
      *                          * Lettura                             *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODABI"             to   f-key                  .
           move      rf-dcf-cod-abi       to   rf-axi-cod-abi         .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      40                   to   x-car                  .
           move      rf-axi-den-abi       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-375.
      *                          *-------------------------------------*
      *                          * Codice CAB                          *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "N"                  to   x-tip                  .
           move      05                   to   x-car                  .
           move      zero                 to   x-dec                  .
           move      spaces               to   x-sgn                  .
           move      "9"                  to   x-edm                  .
           move      rf-dcf-cod-cab       to   x-num                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Normalizzazione record              *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
      *                          *-------------------------------------*
      *                          * Lettura                             *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "ABICAB    "         to   f-key                  .
           move      rf-dcf-cod-abi       to   rf-axs-cod-abi         .
           move      rf-dcf-cod-cab       to   rf-axs-cod-cab         .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      40                   to   x-car                  .
           move      rf-axs-den-spt       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * C/c appoggio                        *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      12                   to   x-car                  .
           move      rf-dcf-ccc-app       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Cin Ita                             *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      01                   to   x-car                  .
           move      rf-dcf-cin-ita       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
      *                          *-------------------------------------*
      *                          * Cin Europeo                         *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      02                   to   x-car                  .
           move      rf-dcf-cin-eur       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-380.
      *                      *-----------------------------------------*
      *                      * Telefono                                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-tel       not  = "X"
                     go to prn-liv-det-sqz-390.
      *                          *-------------------------------------*
      *                          * Determinazione contatti - telefono  *
      *                          *-------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      12                   to   d-con-arc-tip-arc      .
           move      rf-dcf-cod-fnt       to   d-con-arc-cod-arc      .
           move      rf-dcf-dpz-fnt       to   d-con-arc-dpz-arc      .
           move      "TEL"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           perform   con-arc-tip-cll-000  thru con-arc-tip-cll-999    .
      *                          *-------------------------------------*
      *                          * In campo di output                  *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      20                   to   x-car                  .
           move      d-con-arc-num-con (1)
                                          to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-390.
      *                      *-----------------------------------------*
      *                      * Fax                                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-fax       not  = "X"
                     go to prn-liv-det-sqz-392.
      *                          *-------------------------------------*
      *                          * Determinazione contatti - fax       *
      *                          *-------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      12                   to   d-con-arc-tip-arc      .
           move      rf-dcf-cod-fnt       to   d-con-arc-cod-arc      .
           move      rf-dcf-dpz-fnt       to   d-con-arc-dpz-arc      .
           move      "FAX"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           perform   con-arc-tip-cll-000  thru con-arc-tip-cll-999    .
      *                          *-------------------------------------*
      *                          * In campo di output                  *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      20                   to   x-car                  .
           move      d-con-arc-num-con (1)
                                          to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-392.
      *                      *-----------------------------------------*
      *                      * Cellulare                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-cel       not  = "X"
                     go to prn-liv-det-sqz-395.
      *                          *-------------------------------------*
      *                          * Determinazione contatti - cellulare *
      *                          *-------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      12                   to   d-con-arc-tip-arc      .
           move      rf-dcf-cod-fnt       to   d-con-arc-cod-arc      .
           move      rf-dcf-dpz-fnt       to   d-con-arc-dpz-arc      .
           move      "CEL"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           perform   con-arc-tip-cll-000  thru con-arc-tip-cll-999    .
      *                          *-------------------------------------*
      *                          * In campo di output                  *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      20                   to   x-car                  .
           move      d-con-arc-num-con (1)
                                          to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-395.
      *                      *-----------------------------------------*
      *                      * E-mail                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-eml       not  = "X"
                     go to prn-liv-det-sqz-397.
      *                          *-------------------------------------*
      *                          * Determinazione contatti - e-mail    *
      *                          *-------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      12                   to   d-con-arc-tip-arc      .
           move      rf-dcf-cod-fnt       to   d-con-arc-cod-arc      .
           move      rf-dcf-dpz-fnt       to   d-con-arc-dpz-arc      .
           move      "EML"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           perform   con-arc-tip-cll-000  thru con-arc-tip-cll-999    .
      *                          *-------------------------------------*
      *                          * In campo di output                  *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      80                   to   x-car                  .
           move      d-con-arc-num-con (1)
                                          to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-397.
      *                      *-----------------------------------------*
      *                      * E-mail PEC                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-pec       not  = "X"
                     go to prn-liv-det-sqz-400.
      *                          *-------------------------------------*
      *                          * Determinazione contatti - mail      *
      *                          *-------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      12                   to   d-con-arc-tip-arc      .
           move      rf-dcf-cod-fnt       to   d-con-arc-cod-arc      .
           move      rf-dcf-dpz-fnt       to   d-con-arc-dpz-arc      .
           move      "PEC"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           perform   con-arc-tip-cll-000  thru con-arc-tip-cll-999    .
      *                          *-------------------------------------*
      *                          * In campo di output                  *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      80                   to   x-car                  .
           move      d-con-arc-num-con (1)
                                          to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-400.
      *                      *-----------------------------------------*
      *                      * Codice SDI                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-sdi       not  = "X"
                     go to prn-liv-det-sqz-405.
      *                          *-------------------------------------*
      *                          * In campo di output                  *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      10                   to   x-car                  .
           move      rf-dcf-num-tlx       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-405.
      *                      *-----------------------------------------*
      *                      * Interlocutore                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-pec       not  = "X"
                     go to prn-liv-det-sqz-410.
      *                          *-------------------------------------*
      *                          * Determinazione contatti - telefono  *
      *                          *-------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      12                   to   d-con-arc-tip-arc      .
           move      rf-dcf-cod-fnt       to   d-con-arc-cod-arc      .
           move      rf-dcf-dpz-fnt       to   d-con-arc-dpz-arc      .
           move      "TEL"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           perform   con-arc-tip-cll-000  thru con-arc-tip-cll-999    .
      *                          *-------------------------------------*
      *                          * In campo di output                  *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      80                   to   x-car                  .
           move      d-con-arc-int-con (1)
                                          to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-410.
      *                      *-----------------------------------------*
      *                      * Partita Iva                             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-piv       not  = "X"
                     go to prn-liv-det-sqz-415.
      *                          *-------------------------------------*
      *                          * In campo di output                  *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "N"                  to   x-tip                  .
           move      11                   to   x-car                  .
           move      zero                 to   x-dec                  .
           move      spaces               to   x-sgn                  .
           move      "9B"                 to   x-edm                  .
           move      rf-fnt-prt-iva       to   x-num                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-415.
      *                      *-----------------------------------------*
      *                      * Codice fiscale                          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-cfi       not  = "X"
                     go to prn-liv-det-sqz-500.
      *                          *-------------------------------------*
      *                          * In campo di output                  *
      *                          *-------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      16                   to   x-car                  .
           move      rf-fnt-cod-fis       to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-500.
      *                      *-----------------------------------------*
      *                      * Voci descrittive                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da preparare                *
      *                          *-------------------------------------*
           if        rr-vag-dst-vdf       not  = "X"
                     go to prn-liv-det-sqz-800.
           if        w-prs-vde-fat-nvt    =    zero
                     go to prn-liv-det-sqz-800.
      *                          *-------------------------------------*
      *                          * Ciclo di emissione                  *
      *                          *-------------------------------------*
           perform   prn-liv-det-vdf-000  thru prn-liv-det-vdf-999    .
       prn-liv-det-sqz-800.
      *              *-------------------------------------------------*
      *              * Emissione riga                                  *
      *              *-------------------------------------------------*
           move      "PR"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-sqz-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-sqz-999.
       prn-liv-det-sqz-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Subroutine di stampa delle voci aggiuntive                *
      *    *-----------------------------------------------------------*
       prn-liv-det-vdf-000.
      *              *-------------------------------------------------*
      *              * Preparazione valori                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione contatore 01..06           *
      *                  *---------------------------------------------*
           move      zero                 to   w-prs-vde-fat-i01      .
       prn-liv-det-vdf-200.
      *                  *---------------------------------------------*
      *                  * Incremento contatore 01..06                 *
      *                  *---------------------------------------------*
           add       01                   to   w-prs-vde-fat-i01      .
      *                  *---------------------------------------------*
      *                  * Se maggiore del massimo numero di voci      *
      *                  * personalizzate : uscita                     *
      *                  *---------------------------------------------*
           if        w-prs-vde-fat-i01    >    w-prs-vde-fat-nvt
                     go to prn-liv-det-vdf-900.
       prn-liv-det-vdf-300.
      *                  *---------------------------------------------*
      *                  * Preparazione indice reale per la voce       *
      *                  *---------------------------------------------*
           move      w-prs-vde-fat-npt
                    (w-prs-vde-fat-i01)   to   w-prs-vde-fat-i02      .
       prn-liv-det-vdf-400.
      *                  *---------------------------------------------*
      *                  * Test se codice voce descrittiva a spazi     *
      *                  *---------------------------------------------*
           if        rf-dcf-vde-cod
                    (w-prs-vde-fat-i01)   =    spaces
                     move "-"             to   w-all-str-alf
                     go to prn-liv-det-vdf-600.
       prn-liv-det-vdf-500.
      *                  *---------------------------------------------*
      *                  * Normalizzazione [yvf]                       *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyvf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yvf                 .
      *                  *---------------------------------------------*
      *                  * Lettura voce descrittiva                    *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODVDF    "         to   f-key                  .
           move      w-prs-vde-fat-i02    to   rf-yvf-num-def         .
           move      rf-dcf-vde-cod
                    (w-prs-vde-fat-i01)   to   rf-yvf-cod-def         .
           move      "I  "                to   rf-yvf-cod-lng         .
           move      "pgm/dcf/fls/ioc/obj/iofyvf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yvf                 .
      *                  *---------------------------------------------*
      *                  * Concatenamento                              *
      *                  *---------------------------------------------*
           move      62                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      rf-dcf-vde-cod
                    (w-prs-vde-fat-i01)   to   w-all-str-cat (1)      .
           move      "-"                  to   w-all-str-cat (2)      .
           move      rf-yvf-des-stp       to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
       prn-liv-det-vdf-600.
      *                  *---------------------------------------------*
      *                  * In area di stampa                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   x-ope                  .
           move      "A"                  to   x-tip                  .
           move      62                   to   x-car                  .
           move      w-all-str-alf        to   x-alf                  .
           call      "swd/mod/prg/obj/mxport"
                                         using x                      .
       prn-liv-det-vdf-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     prn-liv-det-vdf-200.
       prn-liv-det-vdf-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-vdf-999.
       prn-liv-det-vdf-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Preparazione colonne di stampa                            *
      *    *-----------------------------------------------------------*
       prn-liv-det-pcs-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di stampa       *
      *              *-------------------------------------------------*
           if        rr-tip-stp           =    31
                     go to prn-liv-det-pcs-100
           else if   rr-tip-stp           =    32
                     go to prn-liv-det-pcs-500
           else      go to prn-liv-det-pcs-900.
       prn-liv-det-pcs-100.
      *              *-------------------------------------------------*
      *              * Se stampa etichette per corrispondenza          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine di preparazione                  *
      *                  *---------------------------------------------*
           perform   prn-liv-det-p31-000  thru prn-liv-det-p31-999    .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-pcs-900.
       prn-liv-det-pcs-500.
      *              *-------------------------------------------------*
      *              * Se stampa etichette ad uso interno              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine di preparazione                  *
      *                  *---------------------------------------------*
           perform   prn-liv-det-p32-000  thru prn-liv-det-p32-999    .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-pcs-900.
       prn-liv-det-pcs-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-pcs-999.
       prn-liv-det-pcs-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Preparazione colonne di stampa etichette per corrispon-   *
      *    * denza                                                     *
      *    *-----------------------------------------------------------*
       prn-liv-det-p31-000.
      *              *-------------------------------------------------*
      *              * Preliminari                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Area di stampa completamente a spaces       *
      *                  *---------------------------------------------*
           move      spaces               to   w-stp-t01-cpl          .
      *                  *---------------------------------------------*
      *                  * Contatori relativi alle colonne tutti a ze- *
      *                  * ro                                          *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-t01-cco-001      .
       prn-liv-det-p31-100.
      *              *-------------------------------------------------*
      *              * Preparazione vera e propria                     *
      *              *-------------------------------------------------*
       prn-liv-det-p31-110.
      *                  *---------------------------------------------*
      *                  * Colonna 1                                   *
      *                  *---------------------------------------------*
       prn-liv-det-p31-120.
      *                      *-----------------------------------------*
      *                      * Intestazione etichetta                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore colonna 001    *
      *                          *-------------------------------------*
           add       1                    to   w-stp-t01-cco-001      .
      *                          *-------------------------------------*
      *                          * In area di stampa                   *
      *                          *-------------------------------------*
           move      "Spettabile"         to   w-stp-t01-col-001
                                              (w-stp-t01-cco-001)     .
       prn-liv-det-p31-130.
      *                      *-----------------------------------------*
      *                      * III riga vuota                          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore colonna 001    *
      *                          *-------------------------------------*
           add       1                    to   w-stp-t01-cco-001      .
      *                          *-------------------------------------*
      *                          * In area di stampa                   *
      *                          *-------------------------------------*
           move      spaces               to   w-stp-t01-col-001
                                              (w-stp-t01-cco-001)     .
       prn-liv-det-p31-140.
      *                      *-----------------------------------------*
      *                      * Ragione sociale per invio documenti - 1 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore colonna 001    *
      *                          *-------------------------------------*
           add       1                    to   w-stp-t01-cco-001      .
      *                          *-------------------------------------*
      *                          * In area di stampa                   *
      *                          *-------------------------------------*
           move      rf-dcf-rs1-doc       to   w-stp-t01-col-001
                                              (w-stp-t01-cco-001)     .
       prn-liv-det-p31-150.
      *                      *-----------------------------------------*
      *                      * Ragione sociale per invio documenti - 2 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore colonna 001    *
      *                          *-------------------------------------*
           add       1                    to   w-stp-t01-cco-001      .
      *                          *-------------------------------------*
      *                          * In area di stampa                   *
      *                          *-------------------------------------*
           move      rf-dcf-rs2-doc       to   w-stp-t01-col-001
                                              (w-stp-t01-cco-001)     .
       prn-liv-det-p31-160.
      *                      *-----------------------------------------*
      *                      * Indirizzo                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore colonna 001    *
      *                          *-------------------------------------*
           add       1                    to   w-stp-t01-cco-001      .
      *                          *-------------------------------------*
      *                          * In area di stampa                   *
      *                          *-------------------------------------*
           move      rf-dcf-via-dcf       to   w-stp-t01-col-001
                                              (w-stp-t01-cco-001)     .
       prn-liv-det-p31-170.
      *                      *-----------------------------------------*
      *                      * Localita'                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore colonna 001    *
      *                          *-------------------------------------*
           add       1                    to   w-stp-t01-cco-001      .
      *                          *-------------------------------------*
      *                          * In area di stampa                   *
      *                          *-------------------------------------*
           move      rf-dcf-loc-dcf       to   w-stp-t01-col-001
                                              (w-stp-t01-cco-001)     .
       prn-liv-det-p31-190.
      *                      *-----------------------------------------*
      *                      * Fine colonna 1                          *
      *                      *-----------------------------------------*
           go to     prn-liv-det-p31-900.
       prn-liv-det-p31-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-p31-999.
       prn-liv-det-p31-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Preparazione colonne di stampa etichette per uso interno  *
      *    *-----------------------------------------------------------*
       prn-liv-det-p32-000.
      *              *-------------------------------------------------*
      *              * Preliminari                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Area di stampa completamente a spaces       *
      *                  *---------------------------------------------*
           move      spaces               to   w-stp-t01-cpl          .
      *                  *---------------------------------------------*
      *                  * Contatori relativi alle colonne tutti a ze- *
      *                  * ro                                          *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-t01-cco-001      .
       prn-liv-det-p32-100.
      *              *-------------------------------------------------*
      *              * Preparazione vera e propria                     *
      *              *-------------------------------------------------*
       prn-liv-det-p32-110.
      *                  *---------------------------------------------*
      *                  * Colonna 1                                   *
      *                  *---------------------------------------------*
       prn-liv-det-p32-120.
      *                      *-----------------------------------------*
      *                      * Codice fornitore                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore colonna 001    *
      *                          *-------------------------------------*
           add       1                    to   w-stp-t01-cco-001      .
      *                          *-------------------------------------*
      *                          * Editing codice fornitore            *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      rf-dcf-cod-fnt       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Concatenamento con codice dipenden- *
      *                          * za                                  *
      *                          *-------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      p-edt                to   w-all-str-cat (1)      .
           if        rf-dcf-dpz-fnt       =    spaces
                     move  spaces         to   w-all-str-cat (2)
           else      move  "-"            to   w-all-str-cat (2)      .
           move      rf-dcf-dpz-fnt       to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                          *-------------------------------------*
      *                          * Allineamento a destra               *
      *                          *-------------------------------------*
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                          *-------------------------------------*
      *                          * In area di stampa                   *
      *                          *-------------------------------------*
           move      w-all-str-alf        to   w-stp-t01-col-001
                                              (w-stp-t01-cco-001)     .
       prn-liv-det-p32-130.
      *                      *-----------------------------------------*
      *                      * III riga vuota                          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore colonna 001    *
      *                          *-------------------------------------*
           add       1                    to   w-stp-t01-cco-001      .
      *                          *-------------------------------------*
      *                          * In area di stampa                   *
      *                          *-------------------------------------*
           move      spaces               to   w-stp-t01-col-001
                                              (w-stp-t01-cco-001)     .
       prn-liv-det-p32-140.
      *                      *-----------------------------------------*
      *                      * Ragione sociale per invio documenti - 1 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore colonna 001    *
      *                          *-------------------------------------*
           add       1                    to   w-stp-t01-cco-001      .
      *                          *-------------------------------------*
      *                          * In area di stampa                   *
      *                          *-------------------------------------*
           move      rf-dcf-rs1-doc       to   w-stp-t01-col-001
                                              (w-stp-t01-cco-001)     .
       prn-liv-det-p32-150.
      *                      *-----------------------------------------*
      *                      * Ragione sociale per invio documenti - 2 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore colonna 001    *
      *                          *-------------------------------------*
           add       1                    to   w-stp-t01-cco-001      .
      *                          *-------------------------------------*
      *                          * In area di stampa                   *
      *                          *-------------------------------------*
           move      rf-dcf-rs2-doc       to   w-stp-t01-col-001
                                              (w-stp-t01-cco-001)     .
       prn-liv-det-p32-160.
      *                      *-----------------------------------------*
      *                      * Indirizzo                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore colonna 001    *
      *                          *-------------------------------------*
           add       1                    to   w-stp-t01-cco-001      .
      *                          *-------------------------------------*
      *                          * In area di stampa                   *
      *                          *-------------------------------------*
           move      rf-dcf-via-dcf       to   w-stp-t01-col-001
                                              (w-stp-t01-cco-001)     .
       prn-liv-det-p32-170.
      *                      *-----------------------------------------*
      *                      * Localita'                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore colonna 001    *
      *                          *-------------------------------------*
           add       1                    to   w-stp-t01-cco-001      .
      *                          *-------------------------------------*
      *                          * In area di stampa                   *
      *                          *-------------------------------------*
           move      rf-dcf-loc-dcf       to   w-stp-t01-col-001
                                              (w-stp-t01-cco-001)     .
       prn-liv-det-p32-190.
      *                      *-----------------------------------------*
      *                      * Fine colonna 1                          *
      *                      *-----------------------------------------*
           go to     prn-liv-det-p32-900.
       prn-liv-det-p32-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-p32-999.
       prn-liv-det-p32-999.
           exit.

      *    *===========================================================*
      *    * Stampa etichette di tipo '01' - Monocolonna continuo (8)  *
      *    *-----------------------------------------------------------*
       prn-liv-det-e01-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-liv-det-e01-010.
      *              *-------------------------------------------------*
      *              * Stampa etichette                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    9
                     go to prn-liv-det-e01-100.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-001-000      thru int-pag-001-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-e01-999.
       prn-liv-det-e01-100.
      *                  *---------------------------------------------*
      *                  * Numero etichette stampate nella pagina : +1 *
      *                  *---------------------------------------------*
           add       1                    to   w-cnt-eti-num-epc      .
      *                  *---------------------------------------------*
      *                  * Posizionamento fisso                        *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-cnt-eti-num-epc    to   p-lin                  .
           subtract  1                    from p-lin                  .
           multiply  9                    by   p-lin                  .
           add       2                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-e01-200.
      *                  *---------------------------------------------*
      *                  * Stampa colonne di dettaglio preparate       *
      *                  *---------------------------------------------*
           perform   prn-liv-det-s01-000  thru prn-liv-det-s01-999    .
       prn-liv-det-e01-300.
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-e01-900.
       prn-liv-det-e01-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-e01-999.
       prn-liv-det-e01-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Stampa colonne di dettaglio preparate per etichette per   *
      *    * corrispondenza                                            *
      *    *-----------------------------------------------------------*
       prn-liv-det-s01-000.
      *              *-------------------------------------------------*
      *              * Preliminari                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero di linee preparate in comodo per la  *
      *                  * scansione                                   *
      *                  *---------------------------------------------*
           move      w-stp-t01-cco-001    to   w-stp-t01-ctr-lin      .
       prn-liv-det-s01-100.
      *                  *---------------------------------------------*
      *                  * Inizializzazione indice per la scansione    *
      *                  * sione delle linee effettive da stampare     *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-t01-inx-lin      .
       prn-liv-det-s01-200.
      *                      *-----------------------------------------*
      *                      * Incremento indice per la scansione del- *
      *                      * le linee effettive da stampare          *
      *                      *-----------------------------------------*
           add       1                    to   w-stp-t01-inx-lin      .
      *                      *-----------------------------------------*
      *                      * Se oltre il numero di linee effettive   *
      *                      * da stampare : ad uscita                 *
      *                      *-----------------------------------------*
           if        w-stp-t01-inx-lin    >    w-stp-t01-ctr-lin
                     go to prn-liv-det-s01-260.
      *                      *-----------------------------------------*
      *                      * Se prima linea in corso di stampa : no  *
      *                      * interlinea                              *
      *                      *-----------------------------------------*
           if       w-stp-t01-inx-lin     =    01
                    go to prn-liv-det-s01-230.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-s01-230.
      *                      *-----------------------------------------*
      *                      * Composizione della linea di stampa      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Colonna 1                           *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      003                  to   p-pos                  .
           move      w-stp-t01-col-001
                    (w-stp-t01-inx-lin)   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-s01-250.
      *                      *-----------------------------------------*
      *                      * Riciclo alla linea di stampa successiva *
      *                      *-----------------------------------------*
           go to     prn-liv-det-s01-200.
       prn-liv-det-s01-260.
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-s01-900.
       prn-liv-det-s01-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-s01-999.
       prn-liv-det-s01-999.
           exit.

      *    *===========================================================*
      *    * Stampa etichette di tipo 51 - Laser A4 (8x3)              *
      *    *-----------------------------------------------------------*
       prn-liv-det-e51-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-liv-det-e51-050.
      *              *-------------------------------------------------*
      *              * Stampa riga di dettaglio                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    9
                     go to prn-liv-det-e51-100.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-051-000      thru int-pag-051-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-e51-999.
       prn-liv-det-e51-100.
      *                  *---------------------------------------------*
      *                  * Numero etichette stampate nella pagina : +1 *
      *                  *---------------------------------------------*
           add       1                    to   w-cnt-eti-num-epc      .
      *                  *---------------------------------------------*
      *                  * Posizionamento fisso                        *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-cnt-eti-num-epc    to   p-lin                  .
           subtract  1                    from p-lin                  .
           multiply  9                    by   p-lin                  .
           add       2                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-e51-200.
      *                  *---------------------------------------------*
      *                  * Stampa colonne di dettaglio preparate       *
      *                  *---------------------------------------------*
           perform   prn-liv-det-s51-000  thru prn-liv-det-s51-999    .
       prn-liv-det-e51-300.
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-e51-900.
       prn-liv-det-e51-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-e51-999.
       prn-liv-det-e51-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Stampa colonne di dettaglio preparate per etichette per   *
      *    * uso interno                                               *
      *    *-----------------------------------------------------------*
       prn-liv-det-s51-000.
      *              *-------------------------------------------------*
      *              * Preliminari                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero di linee preparate in comodo per la  *
      *                  * scansione                                   *
      *                  *---------------------------------------------*
           move      w-stp-t01-cco-001    to   w-stp-t01-ctr-lin      .
      *                  *---------------------------------------------*
      *                  * Determinazione del correttivo per la posi-  *
      *                  * zione di stampa                             *
      *                  *---------------------------------------------*
           if        w-cnt-eti-num-ccs    =    01
                     move  zero           to   w-cnt-eti-num-cps
           else if   w-cnt-eti-num-ccs    =    02
                     move  44             to   w-cnt-eti-num-cps
           else if   w-cnt-eti-num-ccs    =    03
                     move  88             to   w-cnt-eti-num-cps
           else      move  zero           to   w-cnt-eti-num-cps      .
       prn-liv-det-s51-100.
      *                  *---------------------------------------------*
      *                  * Inizializzazione indice per la scansione    *
      *                  * sione delle linee effettive da stampare     *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-t01-inx-lin      .
       prn-liv-det-s51-200.
      *                      *-----------------------------------------*
      *                      * Incremento indice per la scansione del- *
      *                      * le linee effettive da stampare          *
      *                      *-----------------------------------------*
           add       1                    to   w-stp-t01-inx-lin      .
      *                      *-----------------------------------------*
      *                      * Se oltre il numero di linee effettive   *
      *                      * da stampare : ad uscita                 *
      *                      *-----------------------------------------*
           if        w-stp-t01-inx-lin    >    w-stp-t01-ctr-lin
                     go to prn-liv-det-s51-260.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-s51-230.
      *                      *-----------------------------------------*
      *                      * Composizione della linea di stampa      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Colonna 1                           *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      003                  to   p-pos                  .
           add       w-cnt-eti-num-cps    to   p-pos                  .
           move      w-stp-t01-col-001
                    (w-stp-t01-inx-lin)   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-s51-250.
      *                      *-----------------------------------------*
      *                      * Riciclo alla linea di stampa successiva *
      *                      *-----------------------------------------*
           go to     prn-liv-det-s51-200.
       prn-liv-det-s51-260.
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-s51-900.
       prn-liv-det-s51-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-s51-999.
       prn-liv-det-s51-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio per etichette di tipo 01              *
      *    *-----------------------------------------------------------*
       int-pag-001-000.
      *              *-------------------------------------------------*
      *              * Intestazione standard                           *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per interruzione forzata          *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-001-999.
      *              *-------------------------------------------------*
      *              * Numero etichette stampate nella pagina : zero   *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-eti-num-epc      .
      *              *-------------------------------------------------*
      *              * Numero colonna in corso di stampa : zero        *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-eti-num-ccs      .
       int-pag-001-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio per etichette di tipo 51              *
      *    *-----------------------------------------------------------*
       int-pag-051-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione della colonna in corso   *
      *              * trattamento                                     *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-eti-num-ccs      .
           if        w-cnt-eti-num-ccs    >    3
                     move  zero           to   w-cnt-eti-num-ccs
                     go to int-pag-051-000.
           if        w-cnt-eti-num-ccs    =    1
                     go to int-pag-051-100
           else      go to int-pag-051-200.
       int-pag-051-100.
      *              *-------------------------------------------------*
      *              * Se prima colonna in corso di trattamento        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Intestazione standard                       *
      *                  *---------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                      *-----------------------------------------*
      *                      * Se uscita per interruzione forzata      *
      *                      *-----------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-051-999.
      *                  *---------------------------------------------*
      *                  * Normalizzazione numero etichette stampate   *
      *                  * pagina                                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-cnt-eti-num-epc      .
      *                  *---------------------------------------------*
      *                  * Salvataggio di questa linea di stampa       *
      *                  *---------------------------------------------*
           move      "LS"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     int-pag-051-999.
       int-pag-051-200.
      *              *-------------------------------------------------*
      *              * Se colonne oltre la prima                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ripristino linea salvata                    *
      *                  *---------------------------------------------*
           move      "LR"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione numero etichette stampate   *
      *                  * pagina                                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-cnt-eti-num-epc      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     int-pag-051-999.
       int-pag-051-999.
           exit.

      *    *===========================================================*
      *    * Determinazione se CAP stradario                           *
      *    *                                                           *
      *    * N.B.: Se il CAP in corso di trattamento e' relativo a     *
      *    *       una frazione o ad una localita', si ricicla fino    *
      *    *       a che non si trova uno stradario di un comune.      *
      *    *-----------------------------------------------------------*
       det-std-gxs-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di esito                   *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-std-gxs-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione codice comune                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-std-gxs-cmn      .
      *              *-------------------------------------------------*
      *              * Normalizzazione codice CAP per il comune        *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-std-gxs-ccm      .
       det-std-gxs-100.
      *              *-------------------------------------------------*
      *              * Start su file [gxs]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "CAPDES    "         to   f-key                  .
           move      w-det-std-gxs-cap    to   rf-gxs-cap-avp         .
           move      spaces               to   rf-gxs-sgl-std         .
           move      spaces               to   rf-gxs-des-key         .
           move      spaces               to   rf-gxs-spc-key         .
           move      "pgm/geo/fls/ioc/obj/iofgxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxs                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a test di controllo       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-std-gxs-800.
       det-std-gxs-200.
      *              *-------------------------------------------------*
      *              * Next su [gxs]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxs                 .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : a test di controllo           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-std-gxs-800.
       det-std-gxs-300.
      *              *-------------------------------------------------*
      *              * Max su [gxs], se non superato : a test di con-  *
      *              *                                 trollo          *
      *              *-------------------------------------------------*
           if        rf-gxs-cap-avp       not  = w-det-std-gxs-cap
                     go to det-std-gxs-800.
       det-std-gxs-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se elemento 'frazione' : a riciclo          *
      *                  *---------------------------------------------*
           if        rf-gxs-cod-fzn       not  = zero
                     go to det-std-gxs-200.
      *                  *---------------------------------------------*
      *                  * Se elemento 'localita'' : a riciclo         *
      *                  *---------------------------------------------*
           if        rf-gxs-cod-lct       not  = zero
                     go to det-std-gxs-200.
       det-std-gxs-600.
      *              *-------------------------------------------------*
      *              * Bufferizzazione del codice comune rilevato      *
      *              *-------------------------------------------------*
           move      rf-gxs-cod-cmn       to   w-det-std-gxs-cmn      .
      *                  *---------------------------------------------*
      *                  * A test di controllo                         *
      *                  *---------------------------------------------*
           go to     det-std-gxs-800.
       det-std-gxs-500.
      *              *-------------------------------------------------*
      *              * Riciclo a record [gxs] successivo               *
      *              *-------------------------------------------------*
           go to     det-std-gxs-200.
       det-std-gxs-800.
      *              *-------------------------------------------------*
      *              * Test di controllo                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se il codice comune e' a zero : uscita per  *
      *                  * rilevamento non effettuato                  *
      *                  *---------------------------------------------*
           if        w-det-std-gxs-cmn    =    zero
                     go to det-std-gxs-900.
      *                  *---------------------------------------------*
      *                  * Lettura del codice comune rilevato per ot-  *
      *                  * tenere il CAP                               *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      w-det-std-gxs-cmn    to   rf-gxc-cod-cmn         .
           move      zero                 to   rf-gxc-cod-fzn         .
           move      zero                 to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                      *-----------------------------------------*
      *                      * Se record non trovato : uscita per ri-  *
      *                      * levamento non effettuato                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-std-gxs-900.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione del CAP ottenuto            *
      *                  *---------------------------------------------*
           move      rf-gxc-cap-avp       to   w-det-std-gxs-ccm      .
      *                  *---------------------------------------------*
      *                  * Ad uscita per rilevamento effettuato        *
      *                  *---------------------------------------------*
           go to     det-std-gxs-890.
       det-std-gxs-890.
      *              *-------------------------------------------------*
      *              * Uscita per rilevamento effettuato               *
      *              *-------------------------------------------------*
           go to     det-std-gxs-999.
       det-std-gxs-900.
      *              *-------------------------------------------------*
      *              * Uscita per rilevamento non effettuato           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di rilevamento non effettuato          *
      *                  *---------------------------------------------*
           move      "#"                  to   w-det-std-gxs-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-std-gxs-999.
       det-std-gxs-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per determinazione contatti                   *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/dconarc0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

