       Identification Division.
       Program-Id.                                 pffo300a           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    ffo                 *
      *                                Settore:    mov                 *
      *                                   Fase:    ffo300              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 27/07/94    *
      *                       Ultima revisione:    NdK del 18/01/24    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Evasione bolle fornitori                    *
      *                                                                *
      *                    Richiamata in bfo300 da funzione 'PF4'      *
      *                                                                *
      *================================================================*
      *                                                                *
      * Tipi operazione                                                *
      *                                                                *
      * "OP" - Open, inizio utilizzo                                   *
      *                                                                *
      *        Input  : l-eva-bfo-tip-ope = "OP"                       *
      *                 l-eva-bfo-cod-dpz = codice dipendenza in uso   *
      *                                                                *
      *        Output : nessuno                                        *
      *                                                                *
      * "CL" - Close, fine utilizzo                                    *
      *                                                                *
      *        Input  : l-eva-bfo-tip-ope = "CL"                       *
      *                                                                *
      *        Output : nessuno                                        *
      *                                                                *
      * "C?" - Test se modulo cancellabile                             *
      *                                                                *
      *        Input  : l-eva-bfo-tip-ope = "C?"                       *
      *                                                                *
      *        Output : l-eva-bfo-exi-sts = spaces: Si                 *
      *                                     #     : No                 *
      *                                                                *
      * "DI" - Dichiarazione di inizio ciclo evasione bolla fornitore  *
      *                                                                *
      *        Input  : l-eva-bfo-tip-ope = "DI"                       *
      *                                                                *
      *        Output : nessuno                                        *
      *                                                                *
      * "BF" - Accettazione dati identificativi bolla fornitore        *
      *                                                                *
      *        Input  : l-eva-bfo-tip-ope = "BF"                       *
      *                 l-eva-bfo-cod-tmb = codice tipo movimento bol- *
      *                                     le fornitori da proporre   *
      *                                     come default               *
      *                                                                *
      *        Output : l-eva-bfo-exi-sts = spaces: Accettazione ese-  *
      *                                             guita con successo *
      *                                     #     : Uscita per Exit    *
      *                                                                *
      * "T1" - Bufferizzazione testata primo bolla fornitore richia-   *
      *        mata                                                    *
      *                                                                *
      *        Input  : l-eva-bfo-tip-ope = "T1"                       *
      *                                                                *
      *        Output : l-eva-bfo-exi-sts = spaces: Tutto Ok           *
      *                                     #     : Uscita con errore  *
      *                                                                *
      * "T+" - Confronto dati testata bolla fornitore in esame con     *
      *        dati di testata del documento                           *
      *                                                                *
      *        Input  : l-eva-bfo-tip-ope = "T+"                       *
      *                                                                *
      *        Output : l-eva-bfo-exi-sts = spaces: Tutto Ok           *
      *                                     #     : Uscita con errore  *
      *                                                                *
      * "SC" - Saldaconto per evasione bolla                           *
      *                                                                *
      *        Input  : l-eva-bfo-tip-ope = "SC"                       *
      *                                                                *
      *        Output : l-eva-bfo-exi-sts = spaces: Tutto Ok           *
      *                                     #     : Uscita per Exit    *
      *                                                                *
      * "CC" - Caricamento righe bolla selezionate in catena           *
      *                                                                *
      *        Input  : l-eva-bfo-tip-ope = "CC"                       *
      *                                                                *
      *        Output : nessuno                                        *
      *                                                                *
      * "AM" - Aggiornamento movimenti di magazzino associati alle     *
      *        bolle fornitori considerate per quanto riguarda i       *
      *        valori                                                  *
      *                                                                *
      *        Input  : l-eva-bfo-tip-ope = "AM"                       *
      *                                                                *
      *        Output : nessuno                                        *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mvideo"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Record files area 'bfo'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [bft]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bfo/fls/rec/rfbft"                          .
      *        *-------------------------------------------------------*
      *        * [bfr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bfo/fls/rec/rfbfr"                          .
      *        *-------------------------------------------------------*
      *        * [bfx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bfo/fls/rec/rfbfx"                          .
      *        *-------------------------------------------------------*
      *        * [ybf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bfo/fls/rec/rfybf"                          .

      *    *===========================================================*
      *    * Record files area 'ffo'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [fft]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/ffo/fls/rec/rffft"                          .
      *        *-------------------------------------------------------*
      *        * [ffr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/ffo/fls/rec/rfffr"                          .

      *    *===========================================================*
      *    * Record files area 'cge'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [pdc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfpdc"                          .
      *        *-------------------------------------------------------*
      *        * [zci]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfzci"                          .

      *    *===========================================================*
      *    * Record files area 'dcf'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [aaf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfaaf"                          .
      *        *-------------------------------------------------------*
      *        * [yfp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfyfp"                          .
      *        *-------------------------------------------------------*
      *        * [yin]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfyin"                          .
      *        *-------------------------------------------------------*
      *        * [ybo]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfybo"                          .

      *    *===========================================================*
      *    * Record files area 'mag'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [zmc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfzmc"                          .

      *    *===========================================================*
      *    * Record files area 'dcc'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [vlt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfvlt"                          .
      *        *-------------------------------------------------------*
      *        * [zvl]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfzvl"                          .

      *    *===========================================================*
      *    * Record files area 'dcp'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [pdx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfpdx"                          .

      *    *===========================================================*
      *    * Record files area 'mtv'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [mtv]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mtv/fls/rec/rfmtv"                          .

      *    *===========================================================*
      *    * Record files area 'gep'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [cbp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfcbp"                          .
      *        *-------------------------------------------------------*
      *        * [zpg]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfzpg"                          .

      *    *===========================================================*
      *    * Record files area 'abi'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [axs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxs"                          .
      *        *-------------------------------------------------------*
      *        * [axi]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxi"                          .

      *    *===========================================================*
      *    * Work-area generica per il programma                       *
      *    *-----------------------------------------------------------*
       01  w-gen.
      *        *-------------------------------------------------------*
      *        * Contatore di Open modulo                              *
      *        *-------------------------------------------------------*
           05  w-gen-ctr-opn              pic s9(05) value zero       .
      *        *-------------------------------------------------------*
      *        * Numero protocollo bolla fornitore in corso di tratta- *
      *        * mento                                                 *
      *        *-------------------------------------------------------*
           05  w-gen-prt-bfo              pic  9(11)                  .

      *    *===========================================================*
      *    * Work-area per campi di accettazione                       *
      *    *-----------------------------------------------------------*
       01  w-acc.
      *        *-------------------------------------------------------*
      *        * Codice dipendenza in uso                              *
      *        *-------------------------------------------------------*
           05  w-acc-cod-dpz              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Numero protocollo                                     *
      *        *-------------------------------------------------------*
           05  w-acc-num-prt              pic  9(11)                  .
           05  w-acc-num-prt-r redefines
               w-acc-num-prt.
               10  w-acc-num-prt-saa      pic  9(03)                  .
               10  w-acc-num-prt-dpz      pic  9(02)                  .
               10  w-acc-num-prt-prg      pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Data documento                                        *
      *        *-------------------------------------------------------*
           05  w-acc-dat-doc              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Numero documento                                      *
      *        *-------------------------------------------------------*
           05  w-acc-num-doc              pic  x(10)                  .

      *    *===========================================================*
      *    * Work per ridefinizione numero protocollo per accettazione *
      *    *-----------------------------------------------------------*
       01  w-rnp.
           05  w-rnp-num-prt-num      pic  9(09)                  .
           05  w-rnp-num-prt-num-r    redefines
               w-rnp-num-prt-num.
               10  w-rnp-num-prt-saa  pic  9(03)                  .
               10  w-rnp-num-prt-prg  pic  9(06)                  .

      *    *===========================================================*
      *    * Work-area per salvataggi                                  *
      *    *-----------------------------------------------------------*
       01  w-sav.
           05  w-sav-val-acc.
               10  filler   occurs 200    pic  x(01)                  .
           05  w-sav-qta-ffo              pic s9(06)v9(03)            .
           05  w-sav-flg-fzs              pic  x(01)                  .
           05  w-sav-snx-aoc              pic  x(01)                  .
           05  w-sav-prz-acq              pic  9(09)                  .

      *    *===========================================================*
      *    * Work-area per bufferizzazione protocolli bolle fornitori  *
      *    *-----------------------------------------------------------*
       01  w-pbf.
      *        *-------------------------------------------------------*
      *        * Numero elementi in tabella                            *
      *        *-------------------------------------------------------*
           05  w-pbf-num-ele              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Numero massimo elementi in tabella                    *
      *        *-------------------------------------------------------*
           05  w-pbf-max-ele              pic  9(05) value 99         .
      *        *-------------------------------------------------------*
      *        * Tabella elementi                                      *
      *        *-------------------------------------------------------*
           05  w-pbf-tbl.
               10  w-pbf-sng-ele occurs 99.
                   15  w-pbf-num-prt      pic  9(11)                  .
               10  w-pbf-ctr-001          pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per bufferizzazione righe bolla fornitore       *
      *    *-----------------------------------------------------------*
       01  w-brb.
      *        *-------------------------------------------------------*
      *        * Numero elementi in tabella                            *
      *        *-------------------------------------------------------*
           05  w-brb-num-ele              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Numero massimo elementi in tabella                    *
      *        *-------------------------------------------------------*
           05  w-brb-max-ele              pic  9(05) value 500        .
      *        *-------------------------------------------------------*
      *        * Tabella elementi                                      *
      *        *-------------------------------------------------------*
           05  w-brb-tbl.
               10  w-brb-sng-ele occurs 900.
                   15  w-brb-num-prg      pic  9(05)       comp-3     .
                   15  w-brb-tip-rig      pic  x(01)                  .
                   15  w-brb-des-rig      pic  x(40)                  .
                   15  w-brb-dec-qta      pic  9(01)                  .
                   15  w-brb-qta-bfo      pic s9(10)v9(03) comp-3     .
                   15  w-brb-qta-ffo      pic s9(10)v9(03) comp-3     .
                   15  w-brb-flg-idr      pic  x(01)                  .
                   15  w-brb-flg-ids      pic  x(01)                  .
                   15  w-brb-flg-fzs      pic  x(01)                  .
                   15  w-brb-qta-res      pic s9(10)v9(03) comp-3     .
                   15  w-brb-snx-aoc      pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per bufferizzazione valute per legame valutario *
      *    *-----------------------------------------------------------*
       01  w-vpl.
      *        *-------------------------------------------------------*
      *        * Numero elementi in tabella                            *
      *        *-------------------------------------------------------*
           05  w-vpl-num-ele              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Numero massimo elementi in tabella                    *
      *        *-------------------------------------------------------*
           05  w-vpl-max-ele              pic  9(05) value 999        .
      *        *-------------------------------------------------------*
      *        * Tabella elementi                                      *
      *        *-------------------------------------------------------*
           05  w-vpl-tbl.
               10  w-vpl-sng-ele occurs 999.
                   15  w-vpl-sgl-vpl      pic  x(03)                  .
                   15  w-vpl-cdc-vpl      pic  9(06)v9(05)            .
                   15  w-vpl-cdc-rif      pic  9(06)v9(05)            .
                   15  w-vpl-dat-rif      pic  9(07)                  .
                   15  w-vpl-per-scs      pic s9(03)v9(01)            .
               10  w-vpl-ctr-001          pic  9(05)                  .
               10  w-vpl-ctr-002          pic  9(05)                  .
               10  w-vpl-wrk-scs          pic s9(08)v9(05)            .

      *    *===========================================================*
      *    * Work-area per funzione saldaconto                         *
      *    *-----------------------------------------------------------*
       01  w-sdc.
      *        *-------------------------------------------------------*
      *        * Flag di uscita da saldaconto                          *
      *        * - spaces : Saldaconto eseguito                        *
      *        * - #      : Uscita per Exit                            *
      *        *-------------------------------------------------------*
           05  w-sdc-flg-exi              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Numero pagine massimo                                 *
      *        *-------------------------------------------------------*
           05  w-sdc-npg-max              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Numero pagina attualmente visualizzato                *
      *        *-------------------------------------------------------*
           05  w-sdc-npg-vis              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Numero pagina da trattare                             *
      *        *-------------------------------------------------------*
           05  w-sdc-npg-dat              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Contatore righe saldaconto                            *
      *        *-------------------------------------------------------*
           05  w-sdc-ctr-rig              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Work-area di appoggio                                 *
      *        *-------------------------------------------------------*
           05  w-sdc-wrk-rig              pic  9(03)                  .
           05  w-sdc-wrk-lin              pic  9(03)                  .
           05  w-sdc-wrk-rem              pic  9(03)                  .
           05  w-sdc-wrk-c01              pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area di comodo per quantita' senza segno             *
      *    *-----------------------------------------------------------*
       01  w-qss.
           05  w-qss-qta-bfo              pic  9(06)v9(03)            .
           05  w-qss-qta-ffo              pic  9(06)v9(03)            .

      *    *===========================================================*
      *    * Work-area per caricamento righe ordine in catena          *
      *    *-----------------------------------------------------------*
       01  w-crc.
      *        *-------------------------------------------------------*
      *        * Contatore di lavoro                                   *
      *        *-------------------------------------------------------*
           05  w-crc-wrk-ctr              pic  9(05)                  .

      *    *===========================================================*
      *    * Work-area per routine buf-tes-bfo-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-buf-tes-bfo.
           05  w-buf-tes-bfo-ctr          pic  9(05)                  .

      *    *===========================================================*
      *    * Work per subroutines di Vis                               *
      *    *-----------------------------------------------------------*
       01  w-vis.
      *        *-------------------------------------------------------*
      *        * Work per Vis : Numero protocollo                      *
      *        *-------------------------------------------------------*
           05  w-vis-num-prt.
               10  w-vis-num-prt-num      pic  9(11)                  .
               10  w-vis-num-prt-num-r    redefines
                   w-vis-num-prt-num.
                   15  w-vis-num-prt-saa  pic  9(03)                  .
                   15  w-vis-num-prt-dpz  pic  9(02)                  .
                   15  w-vis-num-prt-prg  pic  9(06)                  .
               10  w-vis-num-prt-nvi      pic  9(09)                  .
               10  w-vis-num-prt-nvi-r    redefines
                   w-vis-num-prt-nvi.
                   15  w-vis-num-prt-nvs  pic  9(03)                  .
                   15  w-vis-num-prt-nvp  pic  9(06)                  .

      *    *===========================================================*
      *    * Work-area per routine buf-rig-bfo-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-buf-rig-bfo.
      *        *-------------------------------------------------------*
      *        * Flag di uscita                                        *
      *        *-------------------------------------------------------*
           05  w-buf-rig-bfo-flg          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Numero protocollo fattura fornitore                   *
      *        *-------------------------------------------------------*
           05  w-buf-rig-bfo-ffo          pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Numero protocollo bolla fornitore                     *
      *        *-------------------------------------------------------*
           05  w-buf-rig-bfo-prt          pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per ridefinizione tipo riga                    *
      *        *-------------------------------------------------------*
           05  w-buf-rig-bfo-wtr.
               10  w-buf-rig-bfo-wtp      pic  x(01)                  .
               10  w-buf-rig-bfo-wtf      pic  x(01)                  .
               10  filler                 pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione in riga                                   *
      *        *-------------------------------------------------------*
           05  w-buf-rig-bfo-wde          pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per routine agg-mag-bfo-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-agg-mag-bfo.
      *        *-------------------------------------------------------*
      *        * Comodo per causale di magazzino                       *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-cam          pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per conto merce                                *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-ctm          pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per codice dislocazione di default             *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-ddd          pic  x(07)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per codice dislocazione effettivo              *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-dsl          pic  x(07)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per contatore righe movimento scritte          *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-ctr          pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per ridefinizione tipo riga                    *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-tri.
               10  w-agg-mag-bfo-tpr      pic  x(01)                  .
               10  w-agg-mag-bfo-tfu      pic  x(01)                  .
               10  filler                 pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per determinazione costo unitario              *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-cun          pic  9(09)v9(02)            .
           05  w-agg-mag-bfo-cuw          pic  9(09)v9(02)            .
      *        *-------------------------------------------------------*
      *        * Comodo per valore movimento                           *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-vlm          pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per % di maggiorazione                         *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-mpa      pic s9(09)v9(05)            .
      *        *-------------------------------------------------------*
      *        * Comodo per totale sconti in fattura o in bolla        *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-tsc          pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per totale lordo fattura o bolla               *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-tlo          pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per numero di 17 cifre                         *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-s17          pic s9(17)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per numero di 11 cifre                         *
      *        *-------------------------------------------------------*
           05  w-agg-mag-bfo-s11          pic s9(11)                  .

      *    *===========================================================*
      *    * Work per routine nor-nok-reg-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-nor-nok-reg.
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-nor-nok-reg-ctr          pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per ridefinizione descrizione riga di scroll    *
      *    *-----------------------------------------------------------*
       01  w-des-scr.
      *        *-------------------------------------------------------*
      *        * Personalizzazione : 00                                *
      *        *-------------------------------------------------------*
           05  w-des-scr-000.
               10  w-des-scr-000-d40      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Personalizzazione : 01                                *
      *        *-------------------------------------------------------*
           05  w-des-scr-001 redefines
               w-des-scr-000.
               10  w-des-scr-001-d25      pic  x(25)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-001-cod      pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Personalizzazione : 02                                *
      *        *-------------------------------------------------------*
           05  w-des-scr-002 redefines
               w-des-scr-000.
               10  w-des-scr-002-d21      pic  x(21)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-002-pqs      pic  x(01)                  .
               10  w-des-scr-002-tco      pic  x(01)                  .
               10  w-des-scr-002-pqd      pic  x(01)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-002-cod      pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Personalizzazione : 03                                *
      *        *-------------------------------------------------------*
           05  w-des-scr-003 redefines
               w-des-scr-000.
               10  w-des-scr-003-cod      pic  x(14)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-003-d25      pic  x(25)                  .
      *        *-------------------------------------------------------*
      *        * Personalizzazione : 04                                *
      *        *-------------------------------------------------------*
           05  w-des-scr-004 redefines
               w-des-scr-000.
               10  w-des-scr-004-pqs      pic  x(01)                  .
               10  w-des-scr-004-tco      pic  x(01)                  .
               10  w-des-scr-004-pqd      pic  x(01)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-004-cod      pic  x(14)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-004-d21      pic  x(21)                  .
      *        *-------------------------------------------------------*
      *        * Personalizzazione : 05                                *
      *        *-------------------------------------------------------*
           05  w-des-scr-005 redefines
               w-des-scr-000.
               10  filler                 pic  x(26)                  .
               10  w-des-scr-005-cod      pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Personalizzazione : 06                                *
      *        *-------------------------------------------------------*
           05  w-des-scr-006 redefines
               w-des-scr-000.
               10  filler                 pic  x(22)                  .
               10  w-des-scr-006-pqs      pic  x(01)                  .
               10  w-des-scr-006-tco      pic  x(01)                  .
               10  w-des-scr-006-pqd      pic  x(01)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-006-cod      pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Personalizzazione : 11                                *
      *        *-------------------------------------------------------*
           05  w-des-scr-011 redefines
               w-des-scr-000.
               10  filler                 pic  x(03)                  .
               10  w-des-scr-011-pfp      pic  x(03)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-011-cdf      pic  x(14)                  .
               10  filler                 pic  x(05)                  .
               10  w-des-scr-011-cod      pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Personalizzazione : 12                                *
      *        *-------------------------------------------------------*
           05  w-des-scr-012 redefines
               w-des-scr-000.
               10  filler                 pic  x(01)                  .
               10  w-des-scr-012-pfp      pic  x(03)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-012-cdf      pic  x(14)                  .
               10  filler                 pic  x(03)                  .
               10  w-des-scr-012-pqs      pic  x(01)                  .
               10  w-des-scr-012-tco      pic  x(01)                  .
               10  w-des-scr-012-pqd      pic  x(01)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-012-cod      pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Personalizzazione : 13                                *
      *        *-------------------------------------------------------*
           05  w-des-scr-013 redefines
               w-des-scr-000.
               10  w-des-scr-013-cod      pic  x(14)                  .
               10  filler                 pic  x(04)                  .
               10  w-des-scr-013-pfp      pic  x(03)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-013-cdf      pic  x(14)                  .
               10  filler                 pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Personalizzazione : 14                                *
      *        *-------------------------------------------------------*
           05  w-des-scr-014 redefines
               w-des-scr-000.
               10  w-des-scr-014-pqs      pic  x(01)                  .
               10  w-des-scr-014-tco      pic  x(01)                  .
               10  w-des-scr-014-pqd      pic  x(01)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-014-cod      pic  x(14)                  .
               10  filler                 pic  x(02)                  .
               10  w-des-scr-014-pfp      pic  x(03)                  .
               10  filler                 pic  x(01)                  .
               10  w-des-scr-014-cdf      pic  x(14)                  .
               10  filler                 pic  x(02)                  .

      *    *===========================================================*
      *    * Work per routine dec-tip-rig-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-dec-tip-rig.
           05  w-dec-tip-rig-inx          pic  9(02)                  .
           05  w-dec-tip-rig-pnt          pic  9(02)                  .
           05  w-dec-tip-rig-str.
               10  w-dec-tip-rig-chr      occurs 05
                                          pic  x(01)                  .
           05  w-dec-tip-rig-cod.
               10  w-dec-tip-rig-num      occurs 03
                                          pic  9(01)                  .
           05  w-dec-tip-rig-c01          pic  9(02)                  .
           05  w-dec-tip-rig-c02          pic  9(02)                  .

      *    *===========================================================*
      *    * Work per subroutines di Find                              *
      *    *-----------------------------------------------------------*
       01  w-fnd.
      *        *-------------------------------------------------------*
      *        * Work per Find su archivio [bft]                       *
      *        *-------------------------------------------------------*
           05  w-fnd-arc-bft.
               10  w-fnd-arc-bft-sel      pic  x(01)                  .
               10  w-fnd-arc-bft-dpz      pic  9(02)                  .
               10  w-fnd-arc-bft-fnt      pic  9(07)                  .
               10  w-fnd-arc-bft-dpf      pic  x(04)                  .
               10  w-fnd-arc-bft-tmb      pic  x(05)                  .
               10  w-fnd-arc-bft-dat      pic  9(07)                  .
               10  w-fnd-arc-bft-prt      pic  9(11)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [fnt]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-fnt.
               10  w-let-arc-fnt-flg      pic  x(01)                  .
               10  w-let-arc-fnt-cod      pic  9(07)                  .
               10  w-let-arc-fnt-rag      pic  x(40)                  .
               10  w-let-arc-fnt-via      pic  x(40)                  .
               10  w-let-arc-fnt-loc      pic  x(40)                  .
               10  w-let-arc-fnt-piv      pic  9(11)                  .
               10  w-let-arc-fnt-cge      pic  9(07)                  .
               10  w-let-arc-fnt-ass      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcf]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcf.
               10  w-let-arc-dcf-flg      pic  x(01)                  .
               10  w-let-arc-dcf-tle      pic  x(01)                  .
               10  w-let-arc-dcf-cod      pic  9(07)                  .
               10  w-let-arc-dcf-dpz      pic  x(04)                  .
               10  w-let-arc-dcf-rag      pic  x(40)                  .
               10  w-let-arc-dcf-via      pic  x(40)                  .
               10  w-let-arc-dcf-loc      pic  x(40)                  .
               10  w-let-arc-dcf-abi      pic  9(05)                  .
               10  w-let-arc-dcf-cab      pic  9(05)                  .
               10  w-let-arc-dcf-ccc      pic  x(12)                  .
               10  w-let-arc-dcf-ccp      pic  x(12)                  .
               10  w-let-arc-dcf-ban      pic  x(10)                  .
               10  w-let-arc-dcf-vlt      pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zvl]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zvl.
               10  w-let-arc-zvl-flg      pic  x(01)                  .
               10  w-let-arc-zvl-cod      pic  x(03)                  .
               10  w-let-arc-zvl-des      pic  x(20)                  .
               10  w-let-arc-zvl-din      pic  x(20)                  .
               10  w-let-arc-zvl-dec      pic  9(01)                  .
               10  w-let-arc-zvl-tdc      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [pdc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-pdc.
               10  w-let-arc-pdc-flg      pic  x(01)                  .
               10  w-let-arc-pdc-cod      pic  9(07)                  .
               10  w-let-arc-pdc-des      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [yfp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-yfp.
               10  w-let-arc-yfp-flg      pic  x(01)                  .
               10  w-let-arc-yfp-cod      pic  9(07)                  .
               10  w-let-arc-yfp-des      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [cbp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-cbp.
               10  w-let-arc-cbp-flg      pic  x(01)                  .
               10  w-let-arc-cbp-tip      pic  9(02)                  .
               10  w-let-arc-cbp-cod      pic  x(10)                  .
               10  w-let-arc-cbp-des      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [axi]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-axi.
               10  w-let-arc-axi-flg      pic  x(01)                  .
               10  w-let-arc-axi-cod      pic  9(05)                  .
               10  w-let-arc-axi-den      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [axs]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-axs.
               10  w-let-arc-axs-flg      pic  x(01)                  .
               10  w-let-arc-axs-abi      pic  9(05)                  .
               10  w-let-arc-axs-cab      pic  9(05)                  .
               10  w-let-arc-axs-den      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [yin]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-yin.
               10  w-let-arc-yin-flg      pic  x(01)                  .
               10  w-let-arc-yin-cod      pic  x(03)                  .
               10  w-let-arc-yin-tpg      pic  9(02)                  .
               10  w-let-arc-yin-des      pic  x(40)                  .
               10  w-let-arc-yin-coi      pic  9(05)                  .
               10  w-let-arc-yin-ccp      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [ybo]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-ybo.
               10  w-let-arc-ybo-flg      pic  x(01)                  .
               10  w-let-arc-ybo-cod      pic  x(03)                  .
               10  w-let-arc-ybo-tpg      pic  9(02)                  .
               10  w-let-arc-ybo-des      pic  x(40)                  .
               10  w-let-arc-ybo-coi      pic  9(05)                  .
               10  w-let-arc-ybo-ccp      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcp.
               10  w-let-arc-dcp-flg      pic  x(01)                  .
               10  w-let-arc-dcp-cod      pic  9(07)                  .
               10  w-let-arc-dcp-alf      pic  x(14)                  .
               10  w-let-arc-dcp-des.
                   15  w-let-arc-dcp-drg occurs 10
                                          pic  x(40)                  .
               10  w-let-arc-dcp-dui      pic  x(40)                  .
               10  w-let-arc-dcp-tpr      pic  9(02)                  .
               10  w-let-arc-dcp-civ      pic  9(05)                  .
               10  w-let-arc-dcp-umi      pic  x(03)                  .
               10  w-let-arc-dcp-deq      pic  9(01)                  .
               10  w-let-arc-dcp-plb      pic  9(09)                  .
               10  w-let-arc-dcp-ctr      pic  9(02)                  .
               10  w-let-arc-dcp-lng      pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [mtv]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-mtv.
               10  w-let-arc-mtv-flg      pic  x(01)                  .
               10  w-let-arc-mtv-cod      pic  9(07)                  .
               10  w-let-arc-mtv-des      pic  x(40)                  .
               10  w-let-arc-mtv-umi      pic  x(03)                  .
               10  w-let-arc-mtv-deq      pic  9(01)                  .
               10  w-let-arc-mtv-snm      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [aaf]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-aaf.
               10  w-let-arc-aaf-flg      pic  x(01)                  .
               10  w-let-arc-aaf-tpm      pic  9(02)                  .
               10  w-let-arc-aaf-cdm      pic  9(07)                  .
               10  w-let-arc-aaf-fnt      pic  9(07)                  .
               10  w-let-arc-aaf-fda      pic  x(14)                  .
               10  w-let-arc-aaf-csf      pic  x(14)                  .
               10  w-let-arc-aaf-dmg.
                   15  w-let-arc-aaf-drm occurs 10
                                          pic  x(40)                  .
               10  w-let-arc-aaf-des.
                   15  w-let-arc-aaf-drg occurs 10
                                          pic  x(40)                  .
               10  w-let-arc-aaf-snu      pic  x(01)                  .
               10  w-let-arc-aaf-umf      pic  x(03)                  .
               10  w-let-arc-aaf-ndu      pic  9(01)                  .
               10  w-let-arc-aaf-cmu      pic  9(06)v9(03)            .
               10  w-let-arc-aaf-cdu      pic  9(06)v9(03)            .
               10  w-let-arc-aaf-tpa      pic  9(02)                  .
               10  w-let-arc-aaf-vlt      pic  x(03)                  .
               10  w-let-arc-aaf-dcv      pic  9(01)                  .
               10  w-let-arc-aaf-ndp      pic  9(01)                  .
               10  w-let-arc-aaf-lda      pic  9(06)v9(03)            .
               10  w-let-arc-aaf-tap      pic  9(02)                  .
               10  w-let-arc-aaf-lvv      pic  x(03)                  .
               10  w-let-arc-aaf-lvd      pic  9(01)                  .
               10  w-let-arc-aaf-lvt      pic  x(01)                  .
               10  w-let-arc-aaf-lvc      pic  9(06)v9(05)            .
               10  w-let-arc-aaf-lvp      pic  9(01)v9(02)            .
               10  w-let-arc-aaf-mpa      pic  9(02)v9(01)            .
               10  w-let-arc-aaf-tbp.
                   15  w-let-arc-aaf-etp occurs 06.
                       20  w-let-arc-aaf-qtp
                                          pic  9(06)v9(03)            .
                       20  w-let-arc-aaf-pzp
                                          pic  9(09)                  .
                       20  w-let-arc-aaf-csp
                                          pic  9(05)                  .
                       20  w-let-arc-aaf-psp occurs 05
                                          pic  9(02)v9(01)            .
               10  w-let-arc-aaf-ctr      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [bfx]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-bfx.
               10  w-let-arc-bfx-flg      pic  x(01)                  .
               10  w-let-arc-bfx-prt      pic  9(11)                  .
               10  w-let-arc-bfx-prg      pic  9(05)                  .
               10  w-let-arc-bfx-trc      pic  9(02)                  .
               10  w-let-arc-bfx-des.
                   15  w-let-arc-bfx-drg occurs 10
                                          pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zmc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zmc.
               10  w-let-arc-zmc-flg      pic  x(01)                  .
               10  w-let-arc-zmc-cod      pic  9(05)                  .
               10  w-let-arc-zmc-trv      pic  x(01)                  .
               10  w-let-arc-zmc-tip      pic  9(02)                  .
               10  w-let-arc-zmc-tmc      pic  9(02)                  .
               10  w-let-arc-zmc-tcm      pic  x(01)                  .
               10  w-let-arc-zmc-cmc      pic  x(03)                  .
               10  w-let-arc-zmc-vmc      pic  x(01)                  .
               10  w-let-arc-zmc-dta      pic  x(01)                  .
               10  w-let-arc-zmc-vta      pic  x(01)                  .
               10  w-let-arc-zmc-lta      pic  x(04)                  .
               10  w-let-arc-zmc-dtm      pic  x(01)                  .
               10  w-let-arc-zmc-vtm      pic  x(01)                  .
               10  w-let-arc-zmc-ltm      pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [ybf]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-ybf.
               10  w-let-arc-ybf-flg      pic  x(01)                  .
               10  w-let-arc-ybf-cod      pic  x(05)                  .
               10  w-let-arc-ybf-dpz      pic  9(02)                  .
               10  w-let-arc-ybf-des      pic  x(30)                  .
               10  w-let-arc-ybf-mif      pic  9(02)                  .
               10  w-let-arc-ybf-tmf      pic  x(05)                  .
               10  w-let-arc-ybf-acm      pic  x(01)                  .
               10  w-let-arc-ybf-dtc      pic  x(01)                  .
               10  w-let-arc-ybf-dct      pic  x(03)                  .
               10  w-let-arc-ybf-cam      pic  9(05)                  .
               10  w-let-arc-ybf-ctm      pic  x(03)                  .
               10  w-let-arc-ybf-dfa      pic  x(01)                  .
               10  w-let-arc-ybf-vaa      pic  x(01)                  .
               10  w-let-arc-ybf-lsa      pic  x(04)                  .
               10  w-let-arc-ybf-ord      pic  9(02)                  .
               10  w-let-arc-ybf-prd      pic  9(02)                  .
               10  w-let-arc-ybf-sgl      pic  x(03)                  .
               10  w-let-arc-ybf-maf      pic  9(02)                  .
               10  w-let-arc-ybf-dmf      pic  x(05)                  .
               10  w-let-arc-ybf-tvd      pic  x(01)                  .
               10  w-let-arc-ybf-dsl      pic  x(07)                  .
               10  w-let-arc-ybf-dtr      pic  x(05)                  .

      *    *===========================================================*
      *    * Work per Let su archivio [zci]                            *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/larczci0.ltw"                   .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det valori testata associati alla forma paga-*
      *        * mento                                                 *
      *        *-------------------------------------------------------*
           05  w-det-vlt-yfp.
               10  w-det-vlt-yfp-ctr      pic  9(02)                  .
               10  w-det-vlt-yfp-wtp      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det funzionamento spese in fattura           *
      *        *-------------------------------------------------------*
           05  w-det-fun-spe.
               10  w-det-fun-spe-ctr      pic  9(02)                  .
               10  w-det-fun-spe-inx      pic  9(02)                  .

      *    *===========================================================*
      *    * Work per determinazione quantita' secondaria              *
      *    *-----------------------------------------------------------*
           copy      "pgm/ffo/prg/cpy/wdetqts0.wkl"                   .

      *    *===========================================================*
      *    * Work-area per conversioni rispetto alla valuta base       *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wcvsvlt0.cpw"                   .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale, o per messaggi centra- *
      *        * li circondati da un box                               *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .

      *    *===========================================================*
      *    * Link-area per accettazione coefficiente cambio valuta     *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoecmb0.acl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per movimento di magazzino          *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/pmag300z.pgl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione importo in riga  *
      *    *-----------------------------------------------------------*
           copy      "pgm/ffo/prg/cpy/dimpacq0.dtl"                   .

      *    *===========================================================*
      *    * Work per subroutines di editing quantita' da incolonnare  *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wedtqta0.wkl"                   .

      *    *===========================================================*
      *    * Work per subroutines di editing codice iva                *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/wedtzci0.wkl"                   .

      *    *===========================================================*
      *    * Work-area per calcolo prezzo netto                        *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wcalprz0.cpw"                   .

      *    *===========================================================*
      *    * Work-area per prezzo sottoposto a legame valutario        *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wlvlprz0.cpw"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per evasione bolle fornitori        *
      *    *-----------------------------------------------------------*
       01  l-eva-bfo.
      *        *-------------------------------------------------------*
      *        * Tipo operazione                                       *
      *        *-------------------------------------------------------*
           05  l-eva-bfo-tip-ope          pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * Return status code                                    *
      *        * - Spaces : operazione eseguita                        *
      *        * - #      : errore di esecuzione                       *
      *        *-------------------------------------------------------*
           05  l-eva-bfo-exi-sts          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza in uso                              *
      *        *-------------------------------------------------------*
           05  l-eva-bfo-cod-dpz          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Default per codice tipo movimento bolle fornitori     *
      *        *-------------------------------------------------------*
           05  l-eva-bfo-cod-tmb          pic  x(05)                  .
      *        *-------------------------------------------------------*
      *        * Flag di trattamento bolla fornitore                   *
      *        *-------------------------------------------------------*
           05  l-eva-bfo-flg-bfo          pic  x(01)                  .

      *    *===========================================================*
      *    * Link-area comune per programmi della serie pffo3000       *
      *    *                                                           *
      *    * La link-area comprende :                                  *
      *    *                                                           *
      *    *  - 'w-prs'     : Work-area per personalizzazioni          *
      *    *  - 'w-tes'     : Work-area per bufferizzazione testata    *
      *    *  - 'w-te2'     : Work-area per bufferizzazione testata 2  *
      *    *  - 'w-rig'     : Work-area per bufferizzazione riga       *
      *    *  - 'w-cat-rig' : Work-area di comunicazione per gestione  *
      *    *                  catena righe                             *
      *    *-----------------------------------------------------------*
           copy      "pgm/ffo/prg/cpy/pffo3000.pgl"                   .

      ******************************************************************
       Procedure Division                using l-eva-bfo
                                               w-prs
                                               w-tes
                                               w-te2
                                               w-rig
                                               w-cat-rig              .
      ******************************************************************

      *    *===========================================================*
      *    * Main program                                              *
      *    *-----------------------------------------------------------*
       main-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   l-eva-bfo-exi-sts      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo operazione      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Dichiarazione di inizio ciclo di evasione   *
      *                  *---------------------------------------------*
           if        l-eva-bfo-tip-ope    =    "DI"
                     perform dic-ini-cic-000
                                          thru dic-ini-cic-999
      *                  *---------------------------------------------*
      *                  * Accettazione dati identificativi bolla for- *
      *                  * nitore                                      *
      *                  *---------------------------------------------*
           else if   l-eva-bfo-tip-ope    =    "BF"
                     perform acc-dti-bfo-000
                                          thru acc-dti-bfo-999
      *                  *---------------------------------------------*
      *                  * Bufferizzazione testata prima bolla forni-  *
      *                  * tore richiamata                             *
      *                  *---------------------------------------------*
           else if   l-eva-bfo-tip-ope    =    "T1"
                     perform buf-tes-bfo-000
                                          thru buf-tes-bfo-999
      *                  *---------------------------------------------*
      *                  * Confronto testata bolla fornitore richiama- *
      *                  * ta con i dati di testata del documento      *
      *                  *---------------------------------------------*
           else if   l-eva-bfo-tip-ope    =    "T+"
                     perform cnf-tes-doc-000
                                          thru cnf-tes-doc-999
      *                  *---------------------------------------------*
      *                  * Saldaconto per evasione righe bolla         *
      *                  *---------------------------------------------*
           else if   l-eva-bfo-tip-ope    =    "SC"
                     perform sdc-eva-bfo-000
                                          thru sdc-eva-bfo-999
      *                  *---------------------------------------------*
      *                  * Caricamento righe bolla in catena           *
      *                  *---------------------------------------------*
           else if   l-eva-bfo-tip-ope    =    "CC"
                     perform car-rig-cat-000
                                          thru car-rig-cat-999
      *                  *---------------------------------------------*
      *                  * Aggiornamento movimenti di magazzino asso-  *
      *                  * ciati alle bolle fornitori considerate per  *
      *                  * riguarda i valori                           *
      *                  *---------------------------------------------*
           else if   l-eva-bfo-tip-ope    =    "AM"
                     perform agg-mag-bfo-000
                                          thru agg-mag-bfo-999
      *                  *---------------------------------------------*
      *                  * Open                                        *
      *                  *---------------------------------------------*
           else if   l-eva-bfo-tip-ope    =    "OP"
                     perform exe-fun-opn-000
                                          thru exe-fun-opn-999
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           else if   l-eva-bfo-tip-ope    =    "CL"
                     perform exe-fun-cls-000
                                          thru exe-fun-cls-999
      *                  *---------------------------------------------*
      *                  * Test cancellabilita' modulo                 *
      *                  *---------------------------------------------*
           else if   l-eva-bfo-tip-ope    =    "C?"
                     perform tst-cnc-mod-000
                                          thru tst-cnc-mod-999        .
       main-999.
           exit program.

      *    *===========================================================*
      *    * Open                                                      *
      *    *-----------------------------------------------------------*
       exe-fun-opn-000.
      *              *-------------------------------------------------*
      *              * Incremento contatore Open modulo                *
      *              *-------------------------------------------------*
           add       1                    to   w-gen-ctr-opn          .
      *              *-------------------------------------------------*
      *              * Bufferizzazione codice dipendenza in uso        *
      *              *-------------------------------------------------*
           move      l-eva-bfo-cod-dpz    to   w-acc-cod-dpz          .
      *              *-------------------------------------------------*
      *              * Apertura files                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [bft]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *                  *---------------------------------------------*
      *                  * [bfr]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * [bfx]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfx                 .
      *                  *---------------------------------------------*
      *                  * [ybf]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofybf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ybf                 .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione coefficiente di cambio *
      *              * valuta                                          *
      *              *-------------------------------------------------*
           perform   coe-cmb-vlt-opn-000  thru coe-cmb-vlt-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione importo in riga   *
      *              *-------------------------------------------------*
           perform   det-imp-acq-opn-000  thru det-imp-acq-opn-999    .
       exe-fun-opn-999.
           exit.

      *    *===========================================================*
      *    * Close                                                     *
      *    *-----------------------------------------------------------*
       exe-fun-cls-000.
      *              *-------------------------------------------------*
      *              * Decremento contatore Open modulo                *
      *              *-------------------------------------------------*
           subtract  1                    from w-gen-ctr-opn          .
      *              *-------------------------------------------------*
      *              * Chiusura files                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [bft]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *                  *---------------------------------------------*
      *                  * [bfr]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * [bfx]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfx                 .
      *                  *---------------------------------------------*
      *                  * [ybf]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofybf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ybf                 .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione coefficiente di cam-  *
      *              * bio valuta                                      *
      *              *-------------------------------------------------*
           perform   coe-cmb-vlt-cls-000  thru coe-cmb-vlt-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione importo in riga  *
      *              *-------------------------------------------------*
           perform   det-imp-acq-cls-000  thru det-imp-acq-cls-999    .
       exe-fun-cls-999.
           exit.

      *    *===========================================================*
      *    * Test cancellabilita' modulo                               *
      *    *-----------------------------------------------------------*
       tst-cnc-mod-000.
      *              *-------------------------------------------------*
      *              * Se il contatore di Open e' a zero il modulo e'  *
      *              * cancellabile, altrimenti non lo e'              *
      *              *-------------------------------------------------*
           if        w-gen-ctr-opn        =    zero
                     move  spaces         to   l-eva-bfo-exi-sts
           else      move  "#"            to   l-eva-bfo-exi-sts      .
       tst-cnc-mod-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio ciclo di evasione                 *
      *    *-----------------------------------------------------------*
       dic-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Azzeramento contatore numero elementi in ta-    *
      *              * bella protocolli bolle fornitori                *
      *              *-------------------------------------------------*
           move      zero                 to   w-pbf-num-ele          .
       dic-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Accettazione dati identificativi bolla fornitore          *
      *    *-----------------------------------------------------------*
       acc-dti-bfo-000.
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      17                   to   v-lto                  .
           move      80                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Normalizzazione work-area di accettazione       *
      *              *-------------------------------------------------*
           perform   nor-wrk-acc-000      thru nor-wrk-acc-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Titolo centrale                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      24                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      29                   to   v-pos                  .
           move      "RICHIAMO BOLLA FORNITORE"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Numero protocollo                           *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      27                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Numero protocollo interno :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Data documento                              *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      42                   to   v-pos                  .
           move      "Data :"             to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Numero documento                            *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      60                   to   v-pos                  .
           move      "Numero :"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       acc-dti-bfo-100.
      *              *-------------------------------------------------*
      *              * Accettazione dati identificativi bolla          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Numero protocollo                           *
      *                  *---------------------------------------------*
           perform   acc-num-prt-000      thru acc-num-prt-999        .
           if        v-key                =    "EXIT"
                     go to acc-dti-bfo-800.
           if        v-key                =    "DO  "
                     go to acc-dti-bfo-400.
       acc-dti-bfo-400.
      *              *-------------------------------------------------*
      *              * Determinazione se documento esistente           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [bft]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [bft]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-acc-num-prt        to   rf-bft-num-prt         .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *              *-------------------------------------------------*
      *              * Trattamento valori connessi                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione data documento              *
      *                  *---------------------------------------------*
           move      rf-bft-dat-doc       to   w-acc-dat-doc          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione data documento              *
      *                  *---------------------------------------------*
           perform   vis-dat-doc-000      thru vis-dat-doc-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione numero documento            *
      *                  *---------------------------------------------*
           move      rf-bft-num-doc       to   w-acc-num-doc          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione numero documento            *
      *                  *---------------------------------------------*
           perform   vis-num-doc-000      thru vis-num-doc-999        .
      *                  *---------------------------------------------*
      *                  * Valore a zero non ammesso                   *
      *                  *---------------------------------------------*
           if        w-acc-num-prt-prg    =    zero
                     go to acc-dti-bfo-100.
      *                  *---------------------------------------------*
      *                  * Se record non esistente                     *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to acc-dti-bfo-420.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Movimento non esistente in archivio !             
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-dti-bfo-100.
       acc-dti-bfo-420.
      *              *-------------------------------------------------*
      *              * Test su flag di bolla chiusa                    *
      *              *-------------------------------------------------*
           if        rf-bft-flg-bch       =    spaces
                     go to acc-dti-bfo-430.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Bolla fornitore chiusa !                          
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-dti-bfo-100.
       acc-dti-bfo-430.
      *              *-------------------------------------------------*
      *              * Test su flag di bolla da verificare             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su personalizzazione                   *
      *                  *---------------------------------------------*
           if        w-prs-snx-dav        not  = "S"
                     go to acc-dti-bfo-440.
      *                  *---------------------------------------------*
      *                  * Test su flag                                *
      *                  *---------------------------------------------*
           if        rf-bft-flg-nbx (1)   =    spaces
                     go to acc-dti-bfo-440.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Bolla fornitore non ancora verificata !           
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-dti-bfo-100.
       acc-dti-bfo-440.
      *              *-------------------------------------------------*
      *              * Test su tipo archivio                           *
      *              *-------------------------------------------------*
           if        rf-bft-tip-arc       =    "F"
                     go to acc-dti-bfo-500.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Bolla non riguardante l'archivio fornitori !      
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-dti-bfo-100.
       acc-dti-bfo-500.
      *              *-------------------------------------------------*
      *              * Test se la bolla e' gia' stata richiamata       *
      *              *-------------------------------------------------*
           move      zero                 to   w-pbf-ctr-001          .
       acc-dti-bfo-520.
           add       1                    to   w-pbf-ctr-001          .
           if        w-pbf-ctr-001        >    w-pbf-max-ele
                     go to acc-dti-bfo-540.
           if        w-pbf-ctr-001        >    w-pbf-num-ele
                     go to acc-dti-bfo-540.
           if        w-acc-num-prt        not  = w-pbf-num-prt
                                                (w-pbf-ctr-001)
                     go to acc-dti-bfo-520.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Bolla fornitore gia' richiamata !                 
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-dti-bfo-100.
       acc-dti-bfo-540.
      *              *-------------------------------------------------*
      *              * Bufferizzazione righe bolla da trattare         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine                                  *
      *                  *---------------------------------------------*
           move      w-acc-num-prt        to   w-buf-rig-bfo-prt      .
           perform   buf-rig-bfo-000      thru buf-rig-bfo-999        .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        w-buf-rig-bfo-flg    =    spaces
                     go to acc-dti-bfo-600.
      *                  *---------------------------------------------*
      *                  * Editing protocollo fattura                  *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      "<"                  to   v-edm                  .
           move      w-buf-rig-bfo-ffo    to   w-vis-num-prt-num      .
           move      w-vis-num-prt-saa    to   w-vis-num-prt-nvs      .
           move      w-vis-num-prt-prg    to   w-vis-num-prt-nvp      .
           move      w-vis-num-prt-nvi    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      65                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "Documento gia' fatturato ! (Ns. Prot."
                                          to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      ")"                  to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *
           move      w-all-str-alf        to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-dti-bfo-100.
       acc-dti-bfo-600.
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           perform   acc-car-prv-000      thru acc-car-prv-999        .
           if        v-key                =    "UP  "
                     go to acc-dti-bfo-100.
           if        v-key                =    "EXIT"
                     go to acc-dti-bfo-800.
       acc-dti-bfo-650.
      *              *-------------------------------------------------*
      *              * Accettazione castelletto valute per legame va-  *
      *              * lutario                                         *
      *              *-------------------------------------------------*
           perform   acc-cdc-vpl-000      thru acc-cdc-vpl-999
           if        v-key                =    "EXIT"
                     go to acc-dti-bfo-800.
      *              *-------------------------------------------------*
      *              * Incremento contatore protocolli bolle fornitori *
      *              *-------------------------------------------------*
           add       1                    to   w-pbf-num-ele          .
           if        w-pbf-num-ele        not  >  w-pbf-max-ele
                     go to acc-dti-bfo-700.
      *                  *---------------------------------------------*
      *                  * Se oltre il massimo                         *
      *                  *---------------------------------------------*
           move      "Numero bolle fornitori trattate oltre il massimo  
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * A uscita per Exit                           *
      *                  *---------------------------------------------*
           go to     acc-dti-bfo-800.
       acc-dti-bfo-700.
      *              *-------------------------------------------------*
      *              * Bufferizzazione numero protocollo in tabella    *
      *              *-------------------------------------------------*
           move      w-acc-num-prt        to   w-pbf-num-prt
                                              (w-pbf-num-ele)         .
      *              *-------------------------------------------------*
      *              * Aggiornamento protocollo bolla fornitore in     *
      *              * corso di trattamento                            *
      *              *-------------------------------------------------*
           move      w-acc-num-prt        to   w-gen-prt-bfo          .
      *              *-------------------------------------------------*
      *              * A uscita                                        *
      *              *-------------------------------------------------*
           go to     acc-dti-bfo-900.
       acc-dti-bfo-800.
      *              *-------------------------------------------------*
      *              * Se uscita per Exit                              *
      *              *-------------------------------------------------*
           move      "#"                  to   l-eva-bfo-exi-sts      .
       acc-dti-bfo-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-dti-bfo-999.
       acc-dti-bfo-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Numero protocollo                    *
      *    *-----------------------------------------------------------*
       acc-num-prt-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione work per accettazione          *
      *                  *---------------------------------------------*
           move      w-acc-num-prt-saa    to   w-rnp-num-prt-saa      .
           move      w-acc-num-prt-prg    to   w-rnp-num-prt-prg      .
       acc-num-prt-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      "<B"                 to   v-edm                  .
           move      14                   to   v-lin                  .
           move      31                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-rnp-num-prt-num    to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-num-prt-999.
       acc-num-prt-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rnp-num-prt-num      .
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Decomposizione work di accettazione         *
      *                  *---------------------------------------------*
           move      w-rnp-num-prt-saa    to   w-acc-num-prt-saa      .
           move      w-acc-cod-dpz        to   w-acc-num-prt-dpz      .
           move      w-rnp-num-prt-prg    to   w-acc-num-prt-prg      .
       acc-num-prt-300.
      *              *-------------------------------------------------*
      *              * Se Find                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "FIND"
                     go to acc-num-prt-400.
      *                  *---------------------------------------------*
      *                  * Find su archivio [bft]                      *
      *                  *---------------------------------------------*
           move      w-acc-cod-dpz        to   w-fnd-arc-bft-dpz      .
           move      w-tes-cod-arc (1)    to   w-fnd-arc-bft-fnt      .
           move      w-tes-dpz-arc (1)    to   w-fnd-arc-bft-dpf      .
           perform   fnd-arc-bft-000      thru fnd-arc-bft-999        .
           if        w-fnd-arc-bft-sel    not  = spaces
                     go to acc-num-prt-100.
      *                  *---------------------------------------------*
      *                  * Forzatura function-key Do                   *
      *                  *---------------------------------------------*
           move      "DO  "               to   v-key                  .
       acc-num-prt-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-num-prt-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-num-prt-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
       acc-num-prt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Numero protocollo                 *
      *    *-----------------------------------------------------------*
       vis-num-prt-000.
      *              *-------------------------------------------------*
      *              * Composizione work per visualizzazione           *
      *              *-------------------------------------------------*
           move      w-acc-num-prt-saa    to   w-rnp-num-prt-saa      .
           move      w-acc-num-prt-prg    to   w-rnp-num-prt-prg      .
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      "<B"                 to   v-edm                  .
           move      14                   to   v-lin                  .
           move      31                   to   v-pos                  .
           move      w-rnp-num-prt-num    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-num-prt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Data documento                    *
      *    *-----------------------------------------------------------*
       vis-dat-doc-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      14                   to   v-lin                  .
           move      49                   to   v-pos                  .
           move      w-acc-dat-doc        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dat-doc-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Numero documento                  *
      *    *-----------------------------------------------------------*
       vis-num-doc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      69                   to   v-pos                  .
           move      w-acc-num-doc        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-num-doc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Carattere di presa visione           *
      *    *-----------------------------------------------------------*
       acc-car-prv-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Parantesi quadre di delimitazione           *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      76                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-car-prv-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      77                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-car-prv-999.
       acc-car-prv-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-car-prv-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-car-prv-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
       acc-car-prv-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Coefficienti di cambio applicati per lega- *
      *    * me valutario                                              *
      *    *-----------------------------------------------------------*
       acc-cdc-vpl-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da accettare                        *
      *                  *---------------------------------------------*
           if        w-vpl-num-ele        =    zero
                     go to acc-cdc-vpl-999.
      *                  *---------------------------------------------*
      *                  * Preparazione prompts area accettazione      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Salvataggio immagine video              *
      *                      *-----------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Video in Off                            *
      *                      *-----------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Box                                     *
      *                      *-----------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      20                   to   v-lto                  .
           move      75                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Titolo                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      67                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      08                   to   v-pos                  .
           move      "                          CAMBI APPLICATI         
      -              "                 "  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Fincatura                               *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      67                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      08                   to   v-pos                  .
           move      " --------+------------------+---------------------
      -              "--+------------- "  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      67                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      08                   to   v-pos                  .
           move      "  Valuta | Cambio Applicato |       Ns. Cambio    
      -              "  | Scostamento  "  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      67                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      08                   to   v-pos                  .
           move      " --------+------------------+---------------------
      -              "--+------------- "  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Corpo                                   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      67                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      08                   to   v-pos                  .
           move      "         |                  |                     
      -              "  |              "  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      14                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      15                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      16                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      17                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      18                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Parantesi quadre per presa visione      *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      71                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cdc-vpl-050.
      *                  *---------------------------------------------*
      *                  * Visualizzazione preliminare valori          *
      *                  *---------------------------------------------*
           move      zero                 to   w-vpl-ctr-001          .
       acc-cdc-vpl-052.
           add       1                    to   w-vpl-ctr-001          .
           if        w-vpl-ctr-001        >    w-vpl-num-ele
                     go to acc-cdc-vpl-075.
           if        w-vpl-ctr-001        >    6
                     go to acc-cdc-vpl-075.
      *                      *-----------------------------------------*
      *                      * Sigla valuta                            *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           add       12
                     w-vpl-ctr-001    giving   v-lin                  .
           move      11                   to   v-pos                  .
           move      w-vpl-sgl-vpl
                    (w-vpl-ctr-001)       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Coefficiente di cambio applicato        *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      05                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "BD"                 to   v-edm                  .
           add       12
                     w-vpl-ctr-001    giving   v-lin                  .
           move      20                   to   v-pos                  .
           move      w-vpl-cdc-vpl
                    (w-vpl-ctr-001)       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Coefficiente di cambio di riferimento   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      05                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "BD"                 to   v-edm                  .
           add       12
                     w-vpl-ctr-001    giving   v-lin                  .
           move      38                   to   v-pos                  .
           move      w-vpl-cdc-rif
                    (w-vpl-ctr-001)       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Data di riferimento cambio              *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           add       12
                     w-vpl-ctr-001    giving   v-lin                  .
           move      51                   to   v-pos                  .
           move      w-vpl-dat-rif
                    (w-vpl-ctr-001)       to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Percentuale di scostamento              *
      *                      *-----------------------------------------*
           perform   vis-per-scs-000      thru vis-per-scs-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo su scansione                    *
      *                      *-----------------------------------------*
           go to     acc-cdc-vpl-052.
       acc-cdc-vpl-075.
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Inizializzazione contatore                  *
      *                  *---------------------------------------------*
           move      1                    to   w-vpl-ctr-001          .
       acc-cdc-vpl-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      05                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "BD"                 to   v-edm                  .
           add       12
                     w-vpl-ctr-001    giving   v-lin                  .
           move      20                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-vpl-cdc-vpl
                    (w-vpl-ctr-001)       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-cdc-vpl-999.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-vpl-cdc-vpl
                                              (w-vpl-ctr-001)         .
       acc-cdc-vpl-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore a zero non ammesso                   *
      *                  *---------------------------------------------*
           if        w-vpl-cdc-vpl
                    (w-vpl-ctr-001)       =    zero
                     go to acc-cdc-vpl-100.
       acc-cdc-vpl-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione percentuale di scostamento   *
      *                  *---------------------------------------------*
           subtract  w-vpl-cdc-rif
                    (w-vpl-ctr-001)       from w-vpl-cdc-vpl
                                              (w-vpl-ctr-001)
                                        giving w-vpl-wrk-scs          .
           multiply  100                  by   w-vpl-wrk-scs          .
           divide    w-vpl-cdc-rif
                    (w-vpl-ctr-001)       into w-vpl-wrk-scs
                                        giving w-vpl-per-scs
                                              (w-vpl-ctr-001)
                                               rounded                .
      *                  *---------------------------------------------*
      *                  * Visualizzazione percentuale di scostamento  *
      *                  *---------------------------------------------*
           perform   vis-per-scs-000      thru vis-per-scs-999        .
       acc-cdc-vpl-700.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione dell'impostazione        *
      *              *-------------------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-cdc-vpl-710
           else if   v-key                =    "DOWN"
                     go to acc-cdc-vpl-720
           else if   v-key                =    "DO  "
                     go to acc-cdc-vpl-800
           else      go to acc-cdc-vpl-720.
       acc-cdc-vpl-710.
      *              *-------------------------------------------------*
      *              * Se Up                                           *
      *              *-------------------------------------------------*
           if        w-vpl-ctr-001        =    1
                     go to acc-cdc-vpl-100.
           subtract  1                    from w-vpl-ctr-001          .
           go to     acc-cdc-vpl-100.
       acc-cdc-vpl-720.
      *              *-------------------------------------------------*
      *              * Se Down o Return                                *
      *              *-------------------------------------------------*
           if        w-vpl-ctr-001        <    w-vpl-num-ele
                     add   1              to   w-vpl-ctr-001
           else      go to acc-cdc-vpl-722.
           if        w-vpl-ctr-001        >    6
                     go to acc-cdc-vpl-722
           else      go to acc-cdc-vpl-100.
       acc-cdc-vpl-722.
      *                  *---------------------------------------------*
      *                  * Accettazione carattere di presa visione     *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      19                   to   v-lin                  .
           move      72                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
           if        v-key                not  = "UP  "
                     go to acc-cdc-vpl-800.
           move      w-vpl-num-ele        to   w-vpl-ctr-001          .
           if        w-vpl-ctr-001        >    6
                     move  6              to   w-vpl-ctr-001          .
           go to     acc-cdc-vpl-100.
       acc-cdc-vpl-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Controllo che tutti gli elementi siano sta- *
      *                  * ti impostati                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-vpl-ctr-002          .
       acc-cdc-vpl-820.
           add       1                    to   w-vpl-ctr-002          .
           if        w-vpl-ctr-002        >    w-vpl-num-ele
                     go to acc-cdc-vpl-900.
           if        w-vpl-ctr-002        >    6
                     go to acc-cdc-vpl-900.
           if        w-vpl-cdc-vpl
                    (w-vpl-ctr-002)       =    zero
                     go to acc-cdc-vpl-100.
           go to     acc-cdc-vpl-820.
       acc-cdc-vpl-900.
      *                  *---------------------------------------------*
      *                  * Ripristino immagine video                   *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cdc-vpl-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Percentuale di scostamento              *
      *    *-----------------------------------------------------------*
       vis-per-scs-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      01                   to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      spaces               to   v-edm                  .
           add       12
                     w-vpl-ctr-001    giving   v-lin                  .
           move      64                   to   v-pos                  .
           move      w-vpl-per-scs
                    (w-vpl-ctr-001)       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-per-scs-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione work-area di accettazione                 *
      *    *-----------------------------------------------------------*
       nor-wrk-acc-000.
           move      zero                 to   w-acc-num-prt          .
           move      zero                 to   w-acc-dat-doc          .
           move      spaces               to   w-acc-num-doc          .
       nor-wrk-acc-999.
           exit.

      *    *===========================================================*
      *    * Bufferizzazione righe bolla da trattare                   *
      *    *-----------------------------------------------------------*
       buf-rig-bfo-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di uscita ad errore       *
      *              *-------------------------------------------------*
           move      "#"                  to   w-buf-rig-bfo-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione comodi di visualizzazione       *
      *              *-------------------------------------------------*
           move      "NO"                 to   w-edt-qta-inc-ope      .
           perform   edt-qta-inc-000      thru edt-qta-inc-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione protocollo fattura              *
      *              *-------------------------------------------------*
           move      zero                 to   w-buf-rig-bfo-ffo      .
      *              *-------------------------------------------------*
      *              * Normalizzazione numero righe nel buffer         *
      *              *-------------------------------------------------*
           move      zero                 to   w-brb-num-ele          .
      *              *-------------------------------------------------*
      *              * Normalizzazione numero elementi nel buffer      *
      *              * valute per legame                               *
      *              *-------------------------------------------------*
           move      zero                 to   w-vpl-num-ele          .
       buf-rig-bfo-100.
      *              *-------------------------------------------------*
      *              * Start su file [bfr]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-buf-rig-bfo-prt    to   rf-bfr-num-prt         .
           move      zero                 to   rf-bfr-num-prg         .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to buf-rig-bfo-500.
       buf-rig-bfo-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [bfr]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to buf-rig-bfo-500.
      *                  *---------------------------------------------*
      *                  * Test sul massimo                            *
      *                  *---------------------------------------------*
           if        rf-bfr-num-prt       not  = w-buf-rig-bfo-prt
                     go to buf-rig-bfo-500.
       buf-rig-bfo-205.
      *              *-------------------------------------------------*
      *              * Aggiornamento comodi di visualizzazione         *
      *              *-------------------------------------------------*
           move      "AG"                 to   w-edt-qta-inc-ope      .
           move      rf-bfr-qta-acq       to   w-edt-qta-inc-qta      .
           move      rf-bfr-dec-qta       to   w-edt-qta-inc-dec      .
           perform   edt-qta-inc-000      thru edt-qta-inc-999        .
           move      w-edt-qta-inc-din    to   w-tes-dec-qta          .
      *              *-------------------------------------------------*
      *              * Ridefinizione tipo riga                         *
      *              *-------------------------------------------------*
           move      rf-bfr-tip-rig       to   w-buf-rig-bfo-wtr      .
      *              *-------------------------------------------------*
      *              * Se tipo riga "C" : a bufferizzazione riga       *
      *              *-------------------------------------------------*
           if        w-buf-rig-bfo-wtp    =    "C"
                     go to buf-rig-bfo-300.
      *              *-------------------------------------------------*
      *              * Test su flag di riga chiusa                     *
      *              *-------------------------------------------------*
           if        rf-bfr-flg-rch       not  = spaces
                     go to buf-rig-bfo-200.
       buf-rig-bfo-210.
      *              *-------------------------------------------------*
      *              * Start su file [ffr]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "RIFBFO    "         to   f-key                  .
           move      rf-bfr-cod-dpz       to   rf-ffr-cod-dpz         .
           move      rf-bfr-num-prt       to   rf-ffr-bfo-prt         .
           move      rf-bfr-num-prg       to   rf-ffr-bfo-prg         .
           move      zero                 to   rf-ffr-num-prt         .
           move      zero                 to   rf-ffr-num-prg         .
           move      "pgm/ffo/fls/ioc/obj/iofffr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ffr                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to buf-rig-bfo-280.
       buf-rig-bfo-220.
      *              *-------------------------------------------------*
      *              * Lettura primo record [ffr]                      *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/ffo/fls/ioc/obj/iofffr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ffr                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At End'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to buf-rig-bfo-280.
       buf-rig-bfo-230.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-ffr-cod-dpz       not  = rf-bfr-cod-dpz or
                     rf-ffr-bfo-prt       not  = rf-bfr-num-prt or
                     rf-ffr-bfo-prg       not  = rf-bfr-num-prg
                     go to buf-rig-bfo-280.
       buf-rig-bfo-240.
      *              *-------------------------------------------------*
      *              * Bufferizzazione protocollo fattura              *
      *              *-------------------------------------------------*
           move      rf-ffr-num-prt       to   w-buf-rig-bfo-ffo      .
      *              *-------------------------------------------------*
      *              * Se record [ffr] trovato : riciclo               *
      *              *-------------------------------------------------*
           go to     buf-rig-bfo-200.
       buf-rig-bfo-280.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-buf-rig-bfo-flg      .
       buf-rig-bfo-300.
      *              *-------------------------------------------------*
      *              * Bufferizzazione riga ordine                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore elementi nel buffer    *
      *                  *---------------------------------------------*
           if        w-brb-num-ele        <    w-brb-max-ele
                     add   1              to   w-brb-num-ele          .
      *                  *---------------------------------------------*
      *                  * Progressivo riga                            *
      *                  *---------------------------------------------*
           move      rf-bfr-num-prg       to   w-brb-num-prg
                                              (w-brb-num-ele)         .
      *                  *---------------------------------------------*
      *                  * Tipo riga                                   *
      *                  *---------------------------------------------*
           move      w-buf-rig-bfo-wtp    to   w-brb-tip-rig
                                              (w-brb-num-ele)         .
      *                  *---------------------------------------------*
      *                  * Descrizione per la riga                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura preliminare file [bfx]          *
      *                      *-----------------------------------------*
           move      rf-bfr-num-prt       to   w-let-arc-bfx-prt      .
           move      rf-bfr-num-prg       to   w-let-arc-bfx-prg      .
           move      11                   to   w-let-arc-bfx-trc      .
           perform   let-arc-bfx-000      thru let-arc-bfx-999        .
      *
           if        w-let-arc-bfx-flg    not  = spaces
                     go to buf-rig-bfo-305.
      *
           move      w-let-arc-bfx-des    to   w-buf-rig-bfo-wde      .
      *
           go to     buf-rig-bfo-350.
       buf-rig-bfo-305.
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione del flag di e-   *
      *                      * stensione alla descrizione              *
      *                      *-----------------------------------------*
           if        rf-bfr-des-ext       =    0
                     go to buf-rig-bfo-310
           else if   rf-bfr-des-ext       =    1
                     go to buf-rig-bfo-320
           else if   rf-bfr-des-ext       =    2
                     go to buf-rig-bfo-330
           else if   rf-bfr-des-ext       =    3
                     go to buf-rig-bfo-340.
       buf-rig-bfo-310.
      *                      *-----------------------------------------*
      *                      * Se nessuna estensione : bufferizzazione *
      *                      * descrizione contenuta nel record [bfr]  *
      *                      *-----------------------------------------*
           move      rf-bfr-des-rig       to   w-buf-rig-bfo-wde      .
           go to     buf-rig-bfo-350.
       buf-rig-bfo-320.
      *                      *-----------------------------------------*
      *                      * Se estensione nel file [bfx]            *
      *                      *-----------------------------------------*
           go to     buf-rig-bfo-350.
       buf-rig-bfo-330.
      *                      *-----------------------------------------*
      *                      * Se estensione nel file [pdx]            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Lettura archivio [dcp]              *
      *                          *-------------------------------------*
           move      rf-bfr-num-mag       to   w-let-arc-dcp-cod      .
           move      rf-bfr-cod-lng       to   w-let-arc-dcp-lng      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
           move      w-let-arc-dcp-des    to   w-buf-rig-bfo-wde      .
           go to     buf-rig-bfo-350.
       buf-rig-bfo-340.
      *                      *-----------------------------------------*
      *                      * Se estensione nel file [pdx] ma con ti- *
      *                      * po record 13 o 33                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Lettura archivio [dcp]              *
      *                          *-------------------------------------*
           move      rf-bfr-num-mag       to   w-let-arc-dcp-cod      .
           move      rf-bfr-cod-lng       to   w-let-arc-dcp-lng      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
      *                          *-------------------------------------*
      *                          * Lettura archivio [aaf]              *
      *                          *-------------------------------------*
           move      rf-bfr-tip-mag       to   w-let-arc-aaf-tpm      .
           move      rf-bfr-num-mag       to   w-let-arc-aaf-cdm      .
           move      rf-bfr-cod-arc       to   w-let-arc-aaf-fnt      .
           move      rf-bfr-fda-pif       to   w-let-arc-aaf-fda      .
           move      w-let-arc-dcp-des    to   w-let-arc-aaf-dmg      .
           perform   let-arc-aaf-000      thru let-arc-aaf-999        .
           move      w-let-arc-aaf-des    to   w-buf-rig-bfo-wde      .
           go to     buf-rig-bfo-350.
       buf-rig-bfo-350.
      *                      *-----------------------------------------*
      *                      * Composizione descrizione per riga di    *
      *                      * scroll                                  *
      *                      *-----------------------------------------*
           perform   cpz-des-rgs-000      thru cpz-des-rgs-999        .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione                         *
      *                      *-----------------------------------------*
           move      w-buf-rig-bfo-wde    to   w-brb-des-rig
                                              (w-brb-num-ele)         .
       buf-rig-bfo-352.
      *                  *---------------------------------------------*
      *                  * Numero decimali quantita'                   *
      *                  *---------------------------------------------*
           move      rf-bfr-dec-qta       to   w-brb-dec-qta
                                              (w-brb-num-ele)         .
      *                  *---------------------------------------------*
      *                  * Quantita' in bolla                          *
      *                  *---------------------------------------------*
       buf-rig-bfo-353.
      *                      *-----------------------------------------*
      *                      * Se riga di Addebito o Commento : zero   *
      *                      *-----------------------------------------*
           if        w-buf-rig-bfo-wtp    =    "C" or
                     w-buf-rig-bfo-wtp    =    "A"
                     move  zero           to   w-brb-qta-bfo
                                              (w-brb-num-ele)
                     go to buf-rig-bfo-360.
       buf-rig-bfo-354.
      *                      *-----------------------------------------*
      *                      * Se riga con quantita'                   *
      *                      *-----------------------------------------*
       buf-rig-bfo-355.
      *                          *-------------------------------------*
      *                          * Deviazione a seconda del tipo di    *
      *                          * trasformazione per l'unita' di mi-  *
      *                          * sura                                *
      *                          *-------------------------------------*
           if        rf-bfr-snx-tum       =    "P"
                     go to buf-rig-bfo-357.
       buf-rig-bfo-356.
      *                          *-------------------------------------*
      *                          * Se tipo di trasformazione diverso   *
      *                          * da 'P'                              *
      *                          *-------------------------------------*
           move      rf-bfr-qta-fda       to   w-brb-qta-bfo
                                              (w-brb-num-ele)         .
           go to     buf-rig-bfo-360.
       buf-rig-bfo-357.
      *                          *-------------------------------------*
      *                          * Se tipo di trasformazione 'P'       *
      *                          *-------------------------------------*
           move      rf-bfr-qta-acq       to   w-brb-qta-bfo
                                              (w-brb-num-ele)         .
           go to     buf-rig-bfo-360.
       buf-rig-bfo-360.
      *                  *---------------------------------------------*
      *                  * Quantita' fatturata                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Quantita' fatturata                     *
      *                      *-----------------------------------------*
           if        w-prs-snx-dqf        =    "S"
                     move  w-brb-qta-bfo
                          (w-brb-num-ele) to   w-brb-qta-ffo
                                              (w-brb-num-ele)
           else      move  zero           to   w-brb-qta-ffo
                                              (w-brb-num-ele)         .
      *                  *---------------------------------------------*
      *                  * Flag indicatore di residuo                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-brb-flg-idr
                                              (w-brb-num-ele)         .
      *                  *---------------------------------------------*
      *                  * Flag indicatore di saldo                    *
      *                  *---------------------------------------------*
           move      spaces               to   w-brb-flg-ids
                                              (w-brb-num-ele)         .
      *                  *---------------------------------------------*
      *                  * Flag di forzatura a saldo                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-brb-flg-fzs
                                              (w-brb-num-ele)         .
      *                  *---------------------------------------------*
      *                  * Quantita' residua                           *
      *                  *---------------------------------------------*
           move      zero                 to   w-brb-qta-res
                                              (w-brb-num-ele)         .
      *                  *---------------------------------------------*
      *                  * Si/No addebito o commento                   *
      *                  *---------------------------------------------*
           move      "S"                  to   w-brb-snx-aoc
                                              (w-brb-num-ele)         .
       buf-rig-bfo-400.
      *              *-------------------------------------------------*
      *              * Eventuale bufferizzazione valuta per legame     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da effettuare                       *
      *                  *---------------------------------------------*
           if        rf-bfr-sgl-vpl       =    spaces
                     go to buf-rig-bfo-480.
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione buffer : se valuta gia'  *
      *                  * bufferizzata, oltre                         *
      *                  *---------------------------------------------*
           move      zero                 to   w-vpl-ctr-001          .
       buf-rig-bfo-420.
           add       1                    to   w-vpl-ctr-001          .
           if        w-vpl-ctr-001        >    w-vpl-num-ele
                     go to buf-rig-bfo-440.
           if        rf-bfr-sgl-vpl       =    w-vpl-sgl-vpl
                                              (w-vpl-ctr-001)
                     go to buf-rig-bfo-480.
           go to     buf-rig-bfo-420.
       buf-rig-bfo-440.
      *                  *---------------------------------------------*
      *                  * Incremento numero elementi nel buffer valu- *
      *                  * te                                          *
      *                  *---------------------------------------------*
           if        w-vpl-num-ele        <    w-vpl-max-ele
                     add   1              to   w-vpl-num-ele          .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione elemento                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Sigla valuta per legame                 *
      *                      *-----------------------------------------*
           move      rf-bfr-sgl-vpl       to   w-vpl-sgl-vpl
                                              (w-vpl-num-ele)         .
      *                      *-----------------------------------------*
      *                      * Coefficiente di cambio di riferimento   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione                      *
      *                          *-------------------------------------*
           move      "CC"                 to   w-coe-cmb-vlt-ope      .
           move      rf-bfr-sgl-vpl       to   w-coe-cmb-vlt-sdv      .
           move      rf-bfr-tdc-vpl       to   w-coe-cmb-vlt-tdc      .
           if        rf-bfr-dat-doc       not  = zero
                     move  rf-bfr-dat-doc to   w-coe-cmb-vlt-drc
           else      move  rf-bfr-dat-reg to   w-coe-cmb-vlt-drc      .
           move      00                   to   w-coe-cmb-vlt-quc      .
           perform   coe-cmb-vlt-cll-000  thru coe-cmb-vlt-cll-999    .
      *                          *-------------------------------------*
      *                          * Se esito negativo bufferizzazione   *
      *                          * coefficiente contenuto in [bfr]     *
      *                          *-------------------------------------*
           if        w-coe-cmb-vlt-ope    not  = "CC"
                     move  rf-bfr-cdc-vpl to   w-coe-cmb-vlt-cdc      .
      *                          *-------------------------------------*
      *                          * Bufferizzazione                     *
      *                          *-------------------------------------*
           move      w-coe-cmb-vlt-cdc    to   w-vpl-cdc-rif
                                              (w-vpl-num-ele)         .
      *                      *-----------------------------------------*
      *                      * Data di riferimento cambio              *
      *                      *-----------------------------------------*
           move      w-coe-cmb-vlt-drc    to   w-vpl-dat-rif
                                              (w-vpl-num-ele)         .
      *                      *-----------------------------------------*
      *                      * Coefficiente di cambio applicato        *
      *                      *-----------------------------------------*
           move      rf-bfr-cdc-vpl       to   w-vpl-cdc-vpl
                                              (w-vpl-num-ele)         .
      *                      *-----------------------------------------*
      *                      * Percentuale di scostamento              *
      *                      *-----------------------------------------*
           move      zero                 to   w-vpl-per-scs
                                              (w-vpl-num-ele)         .
       buf-rig-bfo-480.
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale file [bfr]       *
      *              *-------------------------------------------------*
           go to     buf-rig-bfo-200.
       buf-rig-bfo-500.
      *              *-------------------------------------------------*
      *              * Test su numero elementi in buffer valute per    *
      *              * legame                                          *
      *              *-------------------------------------------------*
           if        w-vpl-num-ele        not  > 6
                     go to buf-rig-bfo-600.
      *                  *---------------------------------------------*
      *                  * Messaggio                                   *
      *                  *---------------------------------------------*
           move      "Numero valute per legame valutario trattate nel do
      -              "cumento, mag-  "    to   w-err-box-err-msg      .
           move      "giore di quelle gestibili; per esse verra' forzato
      -              " il ns. cambio."    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
       buf-rig-bfo-600.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     buf-rig-bfo-999.
       buf-rig-bfo-999.
           exit.

      *    *===========================================================*
      *    * Composizione descrizione per riga di scroll               *
      *    *-----------------------------------------------------------*
       cpz-des-rgs-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se si sta trattando un co- *
      *              * dice di magazzino oppure no                     *
      *              *-------------------------------------------------*
           if       (w-buf-rig-bfo-wtp    =    "P" or
                     w-buf-rig-bfo-wtp    =    "M" or
                     w-buf-rig-bfo-wtp    =    "V"  ) and
                     w-buf-rig-bfo-wtf    =    spaces
                     go to cpz-des-rgs-200.
       cpz-des-rgs-100.
      *              *-------------------------------------------------*
      *              * Se non si sta trattando un codice di magazzino  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nessuna azione, in quanto la descrizione    *
      *                  * gia' composta va' bene                      *
      *                  *---------------------------------------------*
           go to     cpz-des-rgs-999.
       cpz-des-rgs-200.
      *              *-------------------------------------------------*
      *              * Se si sta trattando un codice di magazzino      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione preliminare dell'area di    *
      *                  * lavoro per la composizione                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-des-scr-000          .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del valore della per-  *
      *                  * sonalizzazione del tipo di visualizzazione  *
      *                  * della riga di scroll                        *
      *                  *---------------------------------------------*
           if        w-prs-rig-scr-des    =    00
                     go to cpz-des-rgs-400
           else if   w-prs-rig-scr-des    =    01
                     go to cpz-des-rgs-420
           else if   w-prs-rig-scr-des    =    02
                     go to cpz-des-rgs-440
           else if   w-prs-rig-scr-des    =    03
                     go to cpz-des-rgs-460
           else if   w-prs-rig-scr-des    =    04
                     go to cpz-des-rgs-480
           else if   w-prs-rig-scr-des    =    05
                     go to cpz-des-rgs-500
           else if   w-prs-rig-scr-des    =    06
                     go to cpz-des-rgs-520
           else if   w-prs-rig-scr-des    =    11
                     go to cpz-des-rgs-540
           else if   w-prs-rig-scr-des    =    12
                     go to cpz-des-rgs-560
           else if   w-prs-rig-scr-des    =    13
                     go to cpz-des-rgs-580
           else if   w-prs-rig-scr-des    =    14
                     go to cpz-des-rgs-600
           else      go to cpz-des-rgs-400.
       cpz-des-rgs-400.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 00              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione di 40 caratteri             *
      *                      *-----------------------------------------*
           move      w-buf-rig-bfo-wde    to   w-des-scr-000-d40      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     cpz-des-rgs-700.
       cpz-des-rgs-420.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 01              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione di 25 caratteri             *
      *                      *-----------------------------------------*
           move      w-buf-rig-bfo-wde    to   w-des-scr-001-d25      .
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
           move      rf-bfr-alf-mag       to   w-des-scr-001-cod      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     cpz-des-rgs-700.
       cpz-des-rgs-440.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 02              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione di 21 caratteri             *
      *                      *-----------------------------------------*
           move      w-buf-rig-bfo-wde    to   w-des-scr-002-d21      .
      *                      *-----------------------------------------*
      *                      * Parentesi quadra sinistra               *
      *                      *-----------------------------------------*
           move      "["                  to   w-des-scr-002-pqs      .
      *                      *-----------------------------------------*
      *                      * Tipo codice                             *
      *                      *-----------------------------------------*
           move      w-buf-rig-bfo-wtp    to   w-des-scr-002-tco      .
      *                      *-----------------------------------------*
      *                      * Parentesi quadra destra                 *
      *                      *-----------------------------------------*
           move      "]"                  to   w-des-scr-002-pqd      .
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
           move      rf-bfr-alf-mag       to   w-des-scr-002-cod      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     cpz-des-rgs-700.
       cpz-des-rgs-460.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 03              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
           move      rf-bfr-alf-mag       to   w-des-scr-003-cod      .
      *                      *-----------------------------------------*
      *                      * Descrizione di 25 caratteri             *
      *                      *-----------------------------------------*
           move      w-buf-rig-bfo-wde    to   w-des-scr-003-d25      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     cpz-des-rgs-700.
       cpz-des-rgs-480.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 04              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Parentesi quadra sinistra               *
      *                      *-----------------------------------------*
           move      "["                  to   w-des-scr-004-pqs      .
      *                      *-----------------------------------------*
      *                      * Tipo codice                             *
      *                      *-----------------------------------------*
           move      w-buf-rig-bfo-wtp    to   w-des-scr-004-tco      .
      *                      *-----------------------------------------*
      *                      * Parentesi quadra destra                 *
      *                      *-----------------------------------------*
           move      "]"                  to   w-des-scr-004-pqd      .
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
           move      rf-bfr-alf-mag       to   w-des-scr-004-cod      .
      *                      *-----------------------------------------*
      *                      * Descrizione di 21 caratteri             *
      *                      *-----------------------------------------*
           move      w-buf-rig-bfo-wde    to   w-des-scr-004-d21      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     cpz-des-rgs-700.
       cpz-des-rgs-500.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 05              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
           move      rf-bfr-alf-mag       to   w-des-scr-005-cod      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     cpz-des-rgs-700.
       cpz-des-rgs-520.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 06              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Parentesi quadra sinistra               *
      *                      *-----------------------------------------*
           move      "["                  to   w-des-scr-006-pqs      .
      *                      *-----------------------------------------*
      *                      * Tipo codice                             *
      *                      *-----------------------------------------*
           move      w-buf-rig-bfo-wtp    to   w-des-scr-006-tco      .
      *                      *-----------------------------------------*
      *                      * Parentesi quadra destra                 *
      *                      *-----------------------------------------*
           move      "]"                  to   w-des-scr-006-pqd      .
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
           move      rf-bfr-alf-mag       to   w-des-scr-006-cod      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     cpz-des-rgs-700.
       cpz-des-rgs-540.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 11              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt per codice prodotto fornitore    *
      *                      *-----------------------------------------*
           move      "[F]"                to   w-des-scr-011-pfp      .
      *                      *-----------------------------------------*
      *                      * Codice prdotto per fornitore            *
      *                      *-----------------------------------------*
           move      rf-bfr-cop-sfn       to   w-des-scr-011-cdf      .
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
           move      rf-bfr-alf-mag       to   w-des-scr-011-cod      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     cpz-des-rgs-700.
       cpz-des-rgs-560.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 12              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt per codice prodotto fornitore    *
      *                      *-----------------------------------------*
           move      "[F]"                to   w-des-scr-012-pfp      .
      *                      *-----------------------------------------*
      *                      * Codice prdotto per fornitore            *
      *                      *-----------------------------------------*
           move      rf-bfr-cop-sfn       to   w-des-scr-012-cdf      .
      *                      *-----------------------------------------*
      *                      * Parentesi quadra sinistra               *
      *                      *-----------------------------------------*
           move      "["                  to   w-des-scr-012-pqs      .
      *                      *-----------------------------------------*
      *                      * Tipo codice                             *
      *                      *-----------------------------------------*
           move      w-buf-rig-bfo-wtp    to   w-des-scr-012-tco      .
      *                      *-----------------------------------------*
      *                      * Parentesi quadra destra                 *
      *                      *-----------------------------------------*
           move      "]"                  to   w-des-scr-012-pqd      .
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
           move      rf-bfr-alf-mag       to   w-des-scr-012-cod      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     cpz-des-rgs-700.
       cpz-des-rgs-580.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 13              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
           move      rf-bfr-alf-mag       to   w-des-scr-013-cod      .
      *                      *-----------------------------------------*
      *                      * Prompt per codice prodotto fornitore    *
      *                      *-----------------------------------------*
           move      "[F]"                to   w-des-scr-013-pfp      .
      *                      *-----------------------------------------*
      *                      * Codice prdotto per fornitore            *
      *                      *-----------------------------------------*
           move      rf-bfr-cop-sfn       to   w-des-scr-013-cdf      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     cpz-des-rgs-700.
       cpz-des-rgs-600.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 14              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Parentesi quadra sinistra               *
      *                      *-----------------------------------------*
           move      "["                  to   w-des-scr-014-pqs      .
      *                      *-----------------------------------------*
      *                      * Tipo codice                             *
      *                      *-----------------------------------------*
           move      w-buf-rig-bfo-wtp    to   w-des-scr-014-tco      .
      *                      *-----------------------------------------*
      *                      * Parentesi quadra destra                 *
      *                      *-----------------------------------------*
           move      "]"                  to   w-des-scr-014-pqd      .
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
           move      rf-bfr-alf-mag       to   w-des-scr-014-cod      .
      *                      *-----------------------------------------*
      *                      * Prompt per codice prodotto fornitore    *
      *                      *-----------------------------------------*
           move      "[F]"                to   w-des-scr-014-pfp      .
      *                      *-----------------------------------------*
      *                      * Codice prdotto per fornitore            *
      *                      *-----------------------------------------*
           move      rf-bfr-cop-sfn       to   w-des-scr-014-cdf      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     cpz-des-rgs-700.
       cpz-des-rgs-700.
      *                  *---------------------------------------------*
      *                  * Composizione eseguita in area di destina-   *
      *                  * zione                                       *
      *                  *---------------------------------------------*
           move      w-des-scr-000        to   w-buf-rig-bfo-wde      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     cpz-des-rgs-999.
       cpz-des-rgs-999.
           exit.

      *    *===========================================================*
      *    * Bufferizzazione testata prima bolla fornitore richiamata  *
      *    *-----------------------------------------------------------*
       buf-tes-bfo-000.
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Forzatura valori attuali testata                *
      *              *-------------------------------------------------*
           move      "#"                  to   w-tes-fda-pt1 (1)      .
           move      "#"                  to   w-tes-fda-pt2 (1)      .
           move      "#"                  to   w-tes-fda-pt3 (1)      .
       buf-tes-bfo-100.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda che il tipo movimento sia  *
      *              * sottoponibile a fatturazione successiva o meno  *
      *              *-------------------------------------------------*
           if        rf-bft-int-ftr       =    02
                     go to buf-tes-bfo-300
           else      go to buf-tes-bfo-200.
       buf-tes-bfo-200.
      *              *-------------------------------------------------*
      *              * Se tipo movimento che non interessa la fattura- *
      *              * zione : prelievo elementi testata da record     *
      *              * [fnt] e [dcf]                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura record [fnt]                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione                         *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                      *-----------------------------------------*
      *                      * Lettura                                 *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT"             to   f-key                  .
           move      rf-bft-cod-arc       to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [dcf]                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione                         *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                      *-----------------------------------------*
      *                      * Lettura                                 *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT"             to   f-key                  .
           move      rf-bft-cod-arc       to   rf-dcf-cod-fnt         .
           move      spaces               to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valori                      *
      *                  *---------------------------------------------*
           move      rf-bft-tip-arc       to   w-tes-tip-arc (1)      .
           move      rf-bft-cod-arc       to   w-tes-cod-arc (1)      .
           move      rf-bft-dpz-arc       to   w-tes-dpz-arc (1)      .
           move      rf-dcf-inl-pgt       to   w-tes-inl-pgt (1)      .
           move      rf-dcf-cod-vlt       to   w-tes-sgl-vpf (1)      .
           move      w-tes-sgl-vpf (1)    to   w-let-arc-zvl-cod      .
           perform   let-arc-zvl-000      thru let-arc-zvl-999        .
           move      w-let-arc-zvl-dec    to   w-tes-dec-vpf (1)      .
           move      w-let-arc-zvl-tdc    to   w-tes-tdc-vpf (1)      .
           move      rf-fnt-cod-iva       to   w-tes-ass-iva (1)      .
           move      rf-dcf-ctp-acq       to   w-tes-ctp-acq (1)      .
           move      rf-dcf-vde-cod (1)   to   w-tes-voc-des (1, 1)   .
           move      rf-dcf-vde-cod (2)   to   w-tes-voc-des (1, 2)   .
           move      rf-dcf-vde-cod (3)   to   w-tes-voc-des (1, 3)   .
           move      rf-dcf-vde-cod (4)   to   w-tes-voc-des (1, 4)   .
           move      rf-dcf-vde-cod (5)   to   w-tes-voc-des (1, 5)   .
           move      rf-dcf-vde-cod (6)   to   w-tes-voc-des (1, 6)   .
           move      rf-dcf-cod-lst       to   w-tes-cod-lst (1)      .
           move      rf-dcf-cat-scr       to   w-tes-csr-aaf (1)      .
           move      rf-dcf-per-scr (1)   to   w-tes-psr-aaf (1, 1)   .
           move      rf-dcf-per-scr (2)   to   w-tes-psr-aaf (1, 2)   .
           move      rf-dcf-per-scr (3)   to   w-tes-psr-aaf (1, 3)   .
           move      rf-dcf-per-scr (4)   to   w-tes-psr-aaf (1, 4)   .
           move      rf-dcf-per-scr (5)   to   w-tes-psr-aaf (1, 5)   .
           move      rf-dcf-cat-scc       to   w-tes-csc-aaf (1)      .
           move      rf-dcf-per-scc       to   w-tes-psc-aaf (1)      .
           move      rf-dcf-cod-aqt       to   w-tes-cod-aqt (1)      .
           move      rf-dcf-cod-fop       to   w-tes-cod-fop (1)      .
           move      rf-dcf-nos-ban       to   w-tes-nos-ban (1)      .
           move      rf-dcf-cod-abi       to   w-tes-cod-abi (1)      .
           move      rf-dcf-cod-cab       to   w-tes-cod-cab (1)      .
           move      rf-dcf-ccc-app       to   w-tes-ccc-app (1)      .
           move      rf-dcf-ccp-app       to   w-tes-ccp-app (1)      .
           move      rf-dcf-add-spi       to   w-tes-add-spi (1)      .
           move      rf-dcf-add-spb       to   w-tes-add-spb (1)      .
           perform   det-fun-spe-000      thru det-fun-spe-999        .
      *                  *---------------------------------------------*
      *                  * Oltre                                       *
      *                  *---------------------------------------------*
           go to     buf-tes-bfo-400.
       buf-tes-bfo-300.
      *              *-------------------------------------------------*
      *              * Se tipo movimento che interessa la fatturazio-  *
      *              * ne                                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valori testata contenuti direttamente in    *
      *                  * record [bft]                                *
      *                  *---------------------------------------------*
           move      rf-bft-tip-arc       to   w-tes-tip-arc (1)      .
           move      rf-bft-cod-arc       to   w-tes-cod-arc (1)      .
           move      rf-bft-dpz-arc       to   w-tes-dpz-arc (1)      .
           move      rf-bft-arc-plf       to   w-tes-arc-plf (1)      .
           move      rf-bft-dpz-plf       to   w-tes-dpz-plf (1)      .
           move      rf-bft-inl-pgt       to   w-tes-inl-pgt (1)      .
           move      rf-bft-cod-lng       to   w-tes-cod-lng (1)      .
           move      rf-bft-sgl-vpf       to   w-tes-sgl-vpf (1)      .
           move      rf-bft-dec-vpf       to   w-tes-dec-vpf (1)      .
           move      rf-bft-tdc-vpf       to   w-tes-tdc-vpf (1)      .
           move      rf-bft-ass-iva       to   w-tes-ass-iva (1)      .
           move      rf-bft-ctp-acq       to   w-tes-ctp-acq (1)      .
           move      rf-bft-voc-des (1)   to   w-tes-voc-des (1, 1)   .
           move      rf-bft-voc-des (2)   to   w-tes-voc-des (1, 2)   .
           move      rf-bft-voc-des (3)   to   w-tes-voc-des (1, 3)   .
           move      rf-bft-voc-des (4)   to   w-tes-voc-des (1, 4)   .
           move      rf-bft-voc-des (5)   to   w-tes-voc-des (1, 5)   .
           move      rf-bft-voc-des (6)   to   w-tes-voc-des (1, 6)   .
           move      rf-bft-cod-lst       to   w-tes-cod-lst (1)      .
           move      rf-bft-csr-aaf       to   w-tes-csr-aaf (1)      .
           move      rf-bft-psr-aaf (1)   to   w-tes-psr-aaf (1, 1)   .
           move      rf-bft-psr-aaf (2)   to   w-tes-psr-aaf (1, 2)   .
           move      rf-bft-psr-aaf (3)   to   w-tes-psr-aaf (1, 3)   .
           move      rf-bft-psr-aaf (4)   to   w-tes-psr-aaf (1, 4)   .
           move      rf-bft-psr-aaf (5)   to   w-tes-psr-aaf (1, 5)   .
           move      rf-bft-csc-aaf       to   w-tes-csc-aaf (1)      .
           move      rf-bft-psc-aaf       to   w-tes-psc-aaf (1)      .
           move      rf-bft-cod-aqt       to   w-tes-cod-aqt (1)      .
           move      rf-bft-pvf-aqt       to   w-tes-pvf-aqt (1)      .
           move      rf-bft-cod-ime       to   w-tes-cod-ime (1)      .
           move      rf-bft-pvf-ime       to   w-tes-pvf-ime (1)      .
           move      rf-bft-cod-fop       to   w-tes-cod-fop (1)      .
           move      rf-bft-scp-aap       to   w-tes-scp-aap (1)      .
           move      rf-bft-nos-ban       to   w-tes-nos-ban (1)      .
           move      rf-bft-cod-abi       to   w-tes-cod-abi (1)      .
           move      rf-bft-cod-cab       to   w-tes-cod-cab (1)      .
           move      rf-bft-ccc-app       to   w-tes-ccc-app (1)      .
           move      rf-bft-ccp-app       to   w-tes-ccp-app (1)      .
           move      rf-bft-add-spi       to   w-tes-add-spi (1)      .
           move      rf-bft-add-spb       to   w-tes-add-spb (1)      .
           move      rf-bft-pag-dsm       to   w-tes-pag-dsm (1)      .
           move      rf-bft-pag-qaf       to   w-tes-pag-qaf (1)      .
           move      rf-bft-pag-act       to   w-tes-pag-act (1)      .
           move      rf-bft-ipr-iel       to   w-tes-ipr-iel (1)      .
      *                  *---------------------------------------------*
      *                  * Valori testata 2 contenuti direttamente in  *
      *                  * record [bft]                                *
      *                  *---------------------------------------------*
           move      rf-bft-tot-scc       to   w-te2-tot-scc (1)      .
           move      rf-bft-per-scc       to   w-te2-per-scc (1)      .
           move      rf-bft-tot-scp       to   w-te2-tot-scp (1)      .
           move      rf-bft-per-scp       to   w-te2-per-scp (1)      .
           move      zero                 to   w-buf-tes-bfo-ctr      .
       buf-tes-bfo-320.
           add       1                    to   w-buf-tes-bfo-ctr      .
           if        w-buf-tes-bfo-ctr    >    6
                     go to buf-tes-bfo-340.
           move      rf-bft-spe-snx
                    (w-buf-tes-bfo-ctr)   to   w-te2-spe-snx
                                              (1, w-buf-tes-bfo-ctr)  .
           move      rf-bft-spe-mad
                    (w-buf-tes-bfo-ctr)   to   w-te2-spe-mad
                                              (1, w-buf-tes-bfo-ctr)  .
           move      rf-bft-spe-per
                    (w-buf-tes-bfo-ctr)   to   w-te2-spe-per
                                              (1, w-buf-tes-bfo-ctr)  .
           move      rf-bft-spe-ibl
                    (w-buf-tes-bfo-ctr)   to   w-te2-spe-ibl
                                              (1, w-buf-tes-bfo-ctr)  .
           move      rf-bft-ibt-spe
                    (w-buf-tes-bfo-ctr)   to   w-te2-spe-ibt
                                              (1, w-buf-tes-bfo-ctr)  .
           move      rf-bft-spe-imp
                    (w-buf-tes-bfo-ctr)   to   w-te2-spe-imp
                                              (1, w-buf-tes-bfo-ctr)  .
           move      rf-bft-spe-civ
                    (w-buf-tes-bfo-ctr)   to   w-te2-spe-civ
                                              (1, w-buf-tes-bfo-ctr)  .
           move      rf-bft-spe-ccp
                    (w-buf-tes-bfo-ctr)   to   w-te2-spe-ccp
                                              (1, w-buf-tes-bfo-ctr)  .
           go to     buf-tes-bfo-320.
       buf-tes-bfo-340.
      *                  *---------------------------------------------*
      *                  * Oltre                                       *
      *                  *---------------------------------------------*
           go to     buf-tes-bfo-400.
       buf-tes-bfo-400.
      *              *-------------------------------------------------*
      *              * Valori indiretti                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Anagrafica archivio                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura archivio [fnt]                  *
      *                      *-----------------------------------------*
           move      w-tes-cod-arc (1)    to   w-let-arc-fnt-cod      .
           perform   let-arc-fnt-000      thru let-arc-fnt-999        .
           move      w-let-arc-fnt-rag    to   w-tes-cod-arc-rag (1)  .
           move      w-let-arc-fnt-via    to   w-tes-cod-arc-via (1)  .
           move      w-let-arc-fnt-loc    to   w-tes-cod-arc-loc (1)  .
           move      w-let-arc-fnt-piv    to   w-tes-cod-arc-piv (1)  .
           move      w-let-arc-fnt-cge    to   w-tes-cod-arc-cge (1)  .
      *                      *-----------------------------------------*
      *                      * Test su codice sottoconto associato al  *
      *                      * fornitore                               *
      *                      *-----------------------------------------*
           if        w-tes-cod-arc-cge (1)
                                          not  = zero
                     go to buf-tes-bfo-420.
      *                          *-------------------------------------*
      *                          * Composizione messaggio di errore    *
      *                          *-------------------------------------*
           move      "Manca il sottoconto contabile per il fornitore !  
      -              "               "    to   w-err-box-err-msg      .
      *                          *-------------------------------------*
      *                          * A trattamento errore                *
      *                          *-------------------------------------*
           go to     buf-tes-bfo-900.
       buf-tes-bfo-420.
      *                  *---------------------------------------------*
      *                  * Lettura record [dcf] principale             *
      *                  *---------------------------------------------*
           move      "C"                  to   w-let-arc-dcf-tle      .
           move      w-tes-cod-arc (1)    to   w-let-arc-dcf-cod      .
           move      spaces               to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                      *-----------------------------------------*
      *                      * Test su esito lettura                   *
      *                      *-----------------------------------------*
           if        w-let-arc-dcf-flg    =    spaces
                     go to buf-tes-bfo-440.
      *                          *-------------------------------------*
      *                          * Composizione messaggio di errore    *
      *                          *-------------------------------------*
           move      "Manca l'anagrafica commerciale per il fornitore ! 
      -              "               "    to   w-err-box-err-msg      .
      *                          *-------------------------------------*
      *                          * A trattamento errore                *
      *                          *-------------------------------------*
           go to     buf-tes-bfo-900.
       buf-tes-bfo-440.
      *                  *---------------------------------------------*
      *                  * Determinazione valori testata indotti da    *
      *                  * record [dcf] principale                     *
      *                  *---------------------------------------------*
           perform   det-vlt-dcf-000      thru det-vlt-dcf-999        .
      *                  *---------------------------------------------*
      *                  * Lettura record [dcf] dipendenza             *
      *                  *---------------------------------------------*
           if        w-tes-dpz-arc (1)    not  = spaces
                     move  "D"            to   w-let-arc-dcf-tle
           else      move  "C"            to   w-let-arc-dcf-tle      .
           move      w-tes-cod-arc (1)    to   w-let-arc-dcf-cod      .
           move      w-tes-dpz-arc (1)    to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
           move      w-let-arc-dcf-rag    to   w-tes-dpz-arc-rag (1)  .
           move      w-let-arc-dcf-via    to   w-tes-dpz-arc-via (1)  .
           move      w-let-arc-dcf-loc    to   w-tes-dpz-arc-loc (1)  .
      *                  *---------------------------------------------*
      *                  * Determinazione valori testata indotti da    *
      *                  * record [dcf] relativo alla dipendenza del   *
      *                  * fornitore                                   *
      *                  *---------------------------------------------*
           perform   det-vlt-dcd-000      thru det-vlt-dcd-999        .
      *                  *---------------------------------------------*
      *                  * Anagrafica valuta                           *
      *                  *---------------------------------------------*
           move      w-tes-sgl-vpf (1)    to   w-let-arc-zvl-cod      .
           perform   let-arc-zvl-000      thru let-arc-zvl-999        .
           move      w-let-arc-zvl-des    to   w-tes-sgl-vpf-des (1)  .
      *                  *---------------------------------------------*
      *                  * Coefficiente di cambio                      *
      *                  *---------------------------------------------*
           move      "CC"                 to   w-coe-cmb-vlt-ope      .
           move      w-tes-sgl-vpf (1)    to   w-coe-cmb-vlt-sdv      .
           move      w-tes-tdc-vpf (1)    to   w-coe-cmb-vlt-tdc      .
           move      w-tes-dat-reg        to   w-coe-cmb-vlt-drc      .
           move      00                   to   w-coe-cmb-vlt-quc      .
           perform   coe-cmb-vlt-cll-000  thru coe-cmb-vlt-cll-999    .
           move      w-coe-cmb-vlt-cdc    to   w-tes-cdc-vpf (1)      .
      *                      *-----------------------------------------*
      *                      * Test su esito determinazione            *
      *                      *-----------------------------------------*
           if        w-coe-cmb-vlt-ope    =    "CC"
                     go to buf-tes-bfo-460.
      *                          *-------------------------------------*
      *                          * Composizione messaggio di errore    *
      *                          *-------------------------------------*
           move      "Coefficiente di cambio indeterminato !            
      -              "               "    to   w-err-box-err-msg      .
      *                          *-------------------------------------*
      *                          * A trattamento errore                *
      *                          *-------------------------------------*
           go to     buf-tes-bfo-900.
       buf-tes-bfo-460.
      *                  *---------------------------------------------*
      *                  * Tabella codici iva per descrizione assog-   *
      *                  * gettamento                                  *
      *                  *---------------------------------------------*
           move      w-tes-ass-iva (1)    to   w-let-arc-zci-cod      .
           perform   let-arc-zci-000      thru let-arc-zci-999        .
           move      w-let-arc-zci-des    to   w-tes-ass-iva-des (1)  .
           if        w-tes-ass-iva (1)    =    zero
                     move  "Soggetto ad iva"
                                          to   w-tes-ass-iva-des (1)  .
      *                  *---------------------------------------------*
      *                  * Anagrafica piano dei conti                  *
      *                  *---------------------------------------------*
           move      w-tes-ctp-acq (1)    to   w-let-arc-pdc-cod      .
           perform   let-arc-pdc-000      thru let-arc-pdc-999        .
           move      w-let-arc-pdc-des    to   w-tes-ctp-acq-des (1)  .
      *                  *---------------------------------------------*
      *                  * Anagrafica forme di pagamento               *
      *                  *---------------------------------------------*
           move      w-tes-cod-fop (1)    to   w-let-arc-yfp-cod      .
           perform   let-arc-yfp-000      thru let-arc-yfp-999        .
           move      w-let-arc-yfp-des    to   w-tes-cod-fop-des (1)  .
      *                  *---------------------------------------------*
      *                  * Determinazione valori testata dipendenti    *
      *                  * dalla forma di pagamento                    *
      *                  *---------------------------------------------*
           if        w-let-arc-yfp-flg    not  = spaces
                     go to buf-tes-bfo-462.
           perform   det-vlt-yfp-000      thru det-vlt-yfp-999        .
       buf-tes-bfo-462.
      *                  *---------------------------------------------*
      *                  * Anagrafica nostre banche                    *
      *                  *---------------------------------------------*
           move      02                   to   w-let-arc-cbp-tip      .
           move      w-tes-nos-ban (1)    to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
           move      w-let-arc-cbp-des    to   w-tes-nos-ban-des (1)  .
      *                  *---------------------------------------------*
      *                  * Anagrafica istituti di credito              *
      *                  *---------------------------------------------*
           move      w-tes-cod-abi (1)    to   w-let-arc-axi-cod      .
           perform   let-arc-axi-000      thru let-arc-axi-999        .
           move      w-let-arc-axi-den    to   w-tes-cod-abi-den (1)  .
      *                  *---------------------------------------------*
      *                  * Anagrafica sportelli istituti di credito    *
      *                  *---------------------------------------------*
           move      w-tes-cod-abi (1)    to   w-let-arc-axs-abi      .
           move      w-tes-cod-cab (1)    to   w-let-arc-axs-cab      .
           perform   let-arc-axs-000      thru let-arc-axs-999        .
           move      w-let-arc-axs-den    to   w-tes-cod-cab-den (1)  .
      *                  *---------------------------------------------*
      *                  * Anagrafica categoria spese incasso          *
      *                  *---------------------------------------------*
           move      w-tes-add-spi (1)    to   w-let-arc-yin-cod      .
           move      00                   to   w-let-arc-yin-tpg      .
           perform   let-arc-yin-000      thru let-arc-yin-999        .
           move      w-let-arc-yin-des    to   w-tes-add-spi-des (1)  .
      *                  *---------------------------------------------*
      *                  * Anagrafica categoria spese bollo            *
      *                  *---------------------------------------------*
           move      w-tes-add-spb (1)    to   w-let-arc-ybo-cod      .
           move      00                   to   w-let-arc-ybo-tpg      .
           perform   let-arc-ybo-000      thru let-arc-ybo-999        .
           move      w-let-arc-ybo-des    to   w-tes-add-spb-des (1)  .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     buf-tes-bfo-999.
       buf-tes-bfo-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione messaggio di errore         *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Uscita con status ad errore                 *
      *                  *---------------------------------------------*
           move      "#"                  to   l-eva-bfo-exi-sts      .
       buf-tes-bfo-999.
           exit.

      *    *===========================================================*
      *    * Confronto tra dati testata bolla fornitore in esame con   *
      *    * dati testata del documento                                *
      *    *-----------------------------------------------------------*
       cnf-tes-doc-000.
      *              *-------------------------------------------------*
      *              * Valori bloccanti                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo archivio                               *
      *                  *---------------------------------------------*
           if        rf-bft-tip-arc       =    w-tes-tip-arc (1)
                     go to cnf-tes-doc-020.
           move      "La bolla richiamata e' incompatibile con la testat
      -              "a del documento"    to   w-err-box-err-msg      .
           move      "per quanto riguarda il tipo archivio              
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
           go to     cnf-tes-doc-900.
       cnf-tes-doc-020.
      *                  *---------------------------------------------*
      *                  * Codice archivio                             *
      *                  *---------------------------------------------*
           if        rf-bft-cod-arc       =    w-tes-cod-arc (1)
                     go to cnf-tes-doc-040.
           move      "La bolla richiamata e' incompatibile con la testat
      -              "a del documento"    to   w-err-box-err-msg      .
           move      "per quanto riguarda il codice fornitore           
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
           go to     cnf-tes-doc-900.
       cnf-tes-doc-040.
      *                  *---------------------------------------------*
      *                  * Se movimento che non intressa la fattura-   *
      *                  * zione : fine controllo valori bloccanti     *
      *                  *---------------------------------------------*
           if        rf-bft-int-ftr       not  = 02
                     go to cnf-tes-doc-200.
       cnf-tes-doc-050.
      *                  *---------------------------------------------*
      *                  * Assoggettamento iva                         *
      *                  *---------------------------------------------*
           if        rf-bft-ass-iva       =    w-tes-ass-iva (1)
                     go to cnf-tes-doc-060.
           move      "La bolla richiamata e' incompatibile con la testat
      -              "a del documento"    to   w-err-box-err-msg      .
           move      "per quanto riguarda l'assoggettamento iva         
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
           go to     cnf-tes-doc-900.
       cnf-tes-doc-060.
      *                  *---------------------------------------------*
      *                  * Inoltro pagamenti                           *
      *                  *---------------------------------------------*
           if        rf-bft-inl-pgt       =    w-tes-inl-pgt (1)
                     go to cnf-tes-doc-080.
           move      "La bolla richiamata e' incompatibile con la testat
      -              "a del documento"    to   w-err-box-err-msg      .
           move      "per quanto riguarda l'inoltro pagamenti           
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
           go to     cnf-tes-doc-900.
       cnf-tes-doc-080.
      *                  *---------------------------------------------*
      *                  * Sigla valuta                                *
      *                  *---------------------------------------------*
           if        rf-bft-sgl-vpf       =    w-tes-sgl-vpf (1)
                     go to cnf-tes-doc-100.
           move      "La bolla richiamata e' incompatibile con la testat
      -              "a del documento"    to   w-err-box-err-msg      .
           move      "per quanto riguarda la sigla valuta               
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
           go to     cnf-tes-doc-900.
       cnf-tes-doc-100.
      *                  *---------------------------------------------*
      *                  * Decimali valuta                             *
      *                  *---------------------------------------------*
           if        rf-bft-dec-vpf       =    w-tes-dec-vpf (1)
                     go to cnf-tes-doc-120.
           move      "La bolla richiamata e' incompatibile con la testat
      -              "a del documento"    to   w-err-box-err-msg      .
           move      "per quanto riguarda il numero decimali della valut
      -              "a              "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
           go to     cnf-tes-doc-900.
       cnf-tes-doc-120.
      *                  *---------------------------------------------*
      *                  * Data scadenza manuale pagamento             *
      *                  *---------------------------------------------*
           if        rf-bft-pag-dsm       =    w-tes-pag-dsm (1)
                     go to cnf-tes-doc-140.
           move      "La bolla richiamata e' incompatibile con la testat
      -              "a del documento"    to   w-err-box-err-msg      .
           move      "per quanto riguarda la data scadenza manuale del p
      -              "agamento       "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
           go to     cnf-tes-doc-900.
       cnf-tes-doc-140.
      *                  *---------------------------------------------*
      *                  * Quota a forfait pagamento                   *
      *                  *---------------------------------------------*
           if        rf-bft-pag-qaf       =    w-tes-pag-qaf (1)
                     go to cnf-tes-doc-160.
           move      "La bolla richiamata e' incompatibile con la testat
      -              "a del documento"    to   w-err-box-err-msg      .
           move      "per quanto riguarda la quota a forfait del pagamen
      -              "to             "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
           go to     cnf-tes-doc-900.
       cnf-tes-doc-160.
      *                  *---------------------------------------------*
      *                  * Fine controlli su valori bloccanti          *
      *                  *---------------------------------------------*
       cnf-tes-doc-200.
      *              *-------------------------------------------------*
      *              * Valori non-bloccanti                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Dipendenza archivio                         *
      *                  *---------------------------------------------*
           if        rf-bft-dpz-arc       =    w-tes-dpz-arc (1)
                     go to cnf-tes-doc-220.
           move      "La bolla richiamata e' difforme dalla testata del 
      -              "documento per  "    to   w-err-box-err-msg      .
           move      "quanto riguarda la dipendenza del fornitore       
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
       cnf-tes-doc-220.
      *                  *---------------------------------------------*
      *                  * Se movimento che non intressa la fattura-   *
      *                  * zione : fine controllo valori non bloccanti *
      *                  *---------------------------------------------*
           if        rf-bft-int-ftr       not  = 02
                     go to cnf-tes-doc-400.
       cnf-tes-doc-230.
      *                  *---------------------------------------------*
      *                  * Contropartita acquisti                      *
      *                  *---------------------------------------------*
           if        rf-bft-ctp-acq       =    w-tes-ctp-acq (1)
                     go to cnf-tes-doc-240.
           move      "La bolla richiamata e' difforme dalla testata del 
      -              "documento per  "    to   w-err-box-err-msg      .
           move      "quanto riguarda la contropartita acquisti         
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
       cnf-tes-doc-240.
      *                  *---------------------------------------------*
      *                  * Forma di pagamento                          *
      *                  *---------------------------------------------*
           if        rf-bft-cod-fop       =    w-tes-cod-fop (1)
                     go to cnf-tes-doc-260.
           move      "La bolla richiamata e' difforme dalla testata del 
      -              "documento per  "    to   w-err-box-err-msg      .
           move      "quanto riguarda la contropartita acquisti         
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
       cnf-tes-doc-260.
      *                  *---------------------------------------------*
      *                  * Banca di appoggio                           *
      *                  *---------------------------------------------*
           if        rf-bft-nos-ban       =    w-tes-nos-ban (1)
                     go to cnf-tes-doc-280.
           move      "La bolla richiamata e' difforme dalla testata del 
      -              "documento per  "    to   w-err-box-err-msg      .
           move      "quanto riguarda il codice nostra banca d'appoggio 
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
       cnf-tes-doc-280.
      *                  *---------------------------------------------*
      *                  * Codice ABI banca di appoggio                *
      *                  *---------------------------------------------*
           if        rf-bft-cod-abi       =    w-tes-cod-abi (1)
                     go to cnf-tes-doc-300.
           move      "La bolla richiamata e' difforme dalla testata del 
      -              "documento per  "    to   w-err-box-err-msg      .
           move      "quanto riguarda il codice ABI della banca di appo
      -              "ggio           "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
       cnf-tes-doc-300.
      *                  *---------------------------------------------*
      *                  * Codice CAB banca di appoggio                *
      *                  *---------------------------------------------*
           if        rf-bft-cod-cab       =    w-tes-cod-cab (1)
                     go to cnf-tes-doc-320.
           move      "La bolla richiamata e' difforme dalla testata del 
      -              "documento per  "    to   w-err-box-err-msg      .
           move      "quanto riguarda il codice CAB sportello della banc
      -              "a di appoggio  "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
       cnf-tes-doc-320.
      *                  *---------------------------------------------*
      *                  * Conto corrente di appoggio del fornitore    *
      *                  *---------------------------------------------*
           if        rf-bft-ccp-app       =    w-tes-ccp-app (1)
                     go to cnf-tes-doc-340.
           move      "La bolla richiamata e' difforme dalla testata del 
      -              "documento per  "    to   w-err-box-err-msg      .
           move      "quanto riguarda il numero c/c della banca di appog
      -              "gio            "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
       cnf-tes-doc-340.
      *                  *---------------------------------------------*
      *                  * Conto corrente postale del fornitore        *
      *                  *---------------------------------------------*
           if        rf-bft-ccp-app       =    w-tes-ccp-app (1)
                     go to cnf-tes-doc-360.
           move      "La bolla richiamata e' difforme dalla testata del 
      -              "documento per  "    to   w-err-box-err-msg      .
           move      "quanto riguarda il numero c/c postale del fornitor
      -              "e              "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
       cnf-tes-doc-360.
      *                  *---------------------------------------------*
      *                  * Addebito spese incasso                      *
      *                  *---------------------------------------------*
           if        rf-bft-add-spi       =    w-tes-add-spi (1)
                     go to cnf-tes-doc-380.
           move      "La bolla richiamata e' difforme dalla testata del 
      -              "documento per  "    to   w-err-box-err-msg      .
           move      "quanto riguarda il codice spese incasso           
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
       cnf-tes-doc-380.
      *                  *---------------------------------------------*
      *                  * Addebito spese bollo                        *
      *                  *---------------------------------------------*
           if        rf-bft-add-spb       =    w-tes-add-spb (1)
                     go to cnf-tes-doc-390.
           move      "La bolla richiamata e' difforme dalla testata del 
      -              "documento per  "    to   w-err-box-err-msg      .
           move      "quanto riguarda il codice spese bollo             
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
       cnf-tes-doc-390.
      *                  *---------------------------------------------*
      *                  * Fine controlli su valori non bloccanti      *
      *                  *---------------------------------------------*
       cnf-tes-doc-400.
      *              *-------------------------------------------------*
      *              * Aggiornamento progressivi per testata           *
      *              *-------------------------------------------------*
           add       rf-bft-pag-act       to   w-tes-pag-act (1)      .
      *              *-------------------------------------------------*
      *              * Aggiornamento progressivi per testata 2         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Totale sconto in chiusura                   *
      *                  *---------------------------------------------*
           add       rf-bft-tot-scc       to   w-te2-tot-scc (1)      .
      *                  *---------------------------------------------*
      *                  * Percentuale sconto in chiusura              *
      *                  *---------------------------------------------*
           if        rf-bft-per-scc       not  = w-te2-per-scc (1)
                     move  zero           to   w-te2-per-scc (1)      .
      *                  *---------------------------------------------*
      *                  * Totale sconto pagamento                     *
      *                  *---------------------------------------------*
           add       rf-bft-tot-scp       to   w-te2-tot-scp (1)      .
      *                  *---------------------------------------------*
      *                  * Percentuale sconto in chiusura              *
      *                  *---------------------------------------------*
           if        rf-bft-per-scp       not  = w-te2-per-scp (1)
                     move  zero           to   w-te2-per-scp (1)      .
      *                  *---------------------------------------------*
      *                  * Totale spese in fattura                     *
      *                  *---------------------------------------------*
           add       rf-bft-spe-imp (1)   to   w-te2-spe-imp (1, 1)   .
           add       rf-bft-spe-imp (2)   to   w-te2-spe-imp (1, 2)   .
           add       rf-bft-spe-imp (3)   to   w-te2-spe-imp (1, 3)   .
           add       rf-bft-spe-imp (4)   to   w-te2-spe-imp (1, 4)   .
           add       rf-bft-spe-imp (5)   to   w-te2-spe-imp (1, 5)   .
           add       rf-bft-spe-imp (6)   to   w-te2-spe-imp (1, 6)   .
      *                  *---------------------------------------------*
      *                  * Percentuali spese in fattura                *
      *                  *---------------------------------------------*
           if        rf-bft-spe-snx (1)   =    0 or
                     rf-bft-spe-per (1)   not  = w-te2-spe-per (1, 1)
                     move  zero           to   w-te2-spe-per (1, 1)   .
           if        rf-bft-spe-snx (2)   =    0 or
                     rf-bft-spe-per (2)   not  = w-te2-spe-per (1, 2)
                     move  zero           to   w-te2-spe-per (1, 2)   .
           if        rf-bft-spe-snx (3)   =    0 or
                     rf-bft-spe-per (3)   not  = w-te2-spe-per (1, 3)
                     move  zero           to   w-te2-spe-per (1, 3)   .
           if        rf-bft-spe-snx (4)   =    0 or
                     rf-bft-spe-per (4)   not  = w-te2-spe-per (1, 4)
                     move  zero           to   w-te2-spe-per (1, 4)   .
           if        rf-bft-spe-snx (5)   =    0 or
                     rf-bft-spe-per (5)   not  = w-te2-spe-per (1, 5)
                     move  zero           to   w-te2-spe-per (1, 5)   .
           if        rf-bft-spe-snx (6)   =    0 or
                     rf-bft-spe-per (6)   not  = w-te2-spe-per (1, 6)
                     move  zero           to   w-te2-spe-per (1, 6)   .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     cnf-tes-doc-999.
       cnf-tes-doc-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   l-eva-bfo-exi-sts      .
       cnf-tes-doc-999.
           exit.

      *    *===========================================================*
      *    * Saldaconto per evasione righe bolla fornitore             *
      *    *-----------------------------------------------------------*
       sdc-eva-bfo-000.
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Richiamo funzione di saldaconto                 *
      *              *-------------------------------------------------*
           perform   acc-fun-sdc-000      thru acc-fun-sdc-999        .
      *              *-------------------------------------------------*
      *              * Se esito operazione negativo                    *
      *              *-------------------------------------------------*
           if        w-sdc-flg-exi        =    spaces
                     go to sdc-eva-bfo-999.
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   l-eva-bfo-exi-sts      .
      *                  *---------------------------------------------*
      *                  * Aggiustamento tabella protocolli bolle      *
      *                  *---------------------------------------------*
           move      zero                 to   w-pbf-num-prt
                                              (w-pbf-num-ele)         .
           if        w-pbf-num-ele        >    zero
                     subtract 1           from w-pbf-num-ele          .
       sdc-eva-bfo-999.
           exit.

      *    *===========================================================*
      *    * Saldaconto per evasione righe bolla fornitore             *
      *    *-----------------------------------------------------------*
       acc-fun-sdc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-sdc-flg-exi          .
      *              *-------------------------------------------------*
      *              * Determinazione numero massimo pagine            *
      *              *-------------------------------------------------*
           move      w-brb-num-ele        to   w-sdc-npg-max          .
           divide    14                   into w-sdc-npg-max
                                        giving w-sdc-npg-max
                                     remainder w-sdc-wrk-rem          .
           if        w-sdc-wrk-rem        >    zero
                     add    1             to   w-sdc-npg-max          .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
           perform   pmt-fun-sdc-000      thru pmt-fun-sdc-999        .
      *              *-------------------------------------------------*
      *              * Numero pagina visualizzata                      *
      *              *-------------------------------------------------*
           move      zero                 to   w-sdc-npg-vis          .
      *              *-------------------------------------------------*
      *              * Numero riga da trattare                         *
      *              *-------------------------------------------------*
           move      zero                 to   w-sdc-ctr-rig          .
       acc-fun-sdc-200.
           add       1                    to   w-sdc-ctr-rig          .
           if        w-sdc-ctr-rig        >    w-brb-num-ele
                     go to  acc-fun-sdc-800.
       acc-fun-sdc-300.
      *              *-------------------------------------------------*
      *              * Determinazione numero pagina da trattare        *
      *              *-------------------------------------------------*
           divide    14                   into w-sdc-ctr-rig
                                        giving w-sdc-npg-dat
                                     remainder w-sdc-wrk-rem          .
           if        w-sdc-wrk-rem        >    zero
                     add    1             to   w-sdc-npg-dat          .
      *              *-------------------------------------------------*
      *              * Visualizzazione pagina da trattare              *
      *              *-------------------------------------------------*
           if        w-sdc-npg-dat        not  = w-sdc-npg-vis
                     perform vis-pag-sdc-000
                                          thru vis-pag-sdc-999        .
      *              *-------------------------------------------------*
      *              * Determinazione numero linea                     *
      *              *-------------------------------------------------*
           subtract  1                    from w-sdc-npg-dat
                                        giving w-sdc-wrk-rig          .
           multiply  14                   by   w-sdc-wrk-rig          .
           subtract  w-sdc-wrk-rig        from w-sdc-ctr-rig
                                        giving w-sdc-wrk-lin          .
           add       7                    to   w-sdc-wrk-lin          .
       acc-fun-sdc-400.
      *              *-------------------------------------------------*
      *              * Accettazione riga saldaconto                    *
      *              *-------------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Quantita' fatturata                         *
      *                  *---------------------------------------------*
           perform   acc-qta-ffo-000      thru acc-qta-ffo-999        .
      *                  *---------------------------------------------*
      *                  * Si/No addebito o commento                   *
      *                  *---------------------------------------------*
           perform   acc-snx-aoc-000      thru acc-snx-aoc-999        .
      *                  *---------------------------------------------*
      *                  * Test su tipo uscita                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se Do                                   *
      *                      *-----------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-fun-sdc-900.
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-fun-sdc-920.
      *                      *-----------------------------------------*
      *                      * Se Up                                   *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     subtract 1           from w-sdc-ctr-rig
                     go to  acc-fun-sdc-300.
      *                      *-----------------------------------------*
      *                      * Se Down                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "DOWN"
                     go to  acc-fun-sdc-200.
      *                      *-----------------------------------------*
      *                      * Se Next Screen                          *
      *                      *-----------------------------------------*
           if        v-key                not  = "NXSC"
                     go to  acc-fun-sdc-500.
           multiply  14                   by   w-sdc-npg-dat
                                        giving w-sdc-ctr-rig          .
           add       1                    to   w-sdc-ctr-rig          .
           go to     acc-fun-sdc-300.
       acc-fun-sdc-500.
      *                      *-----------------------------------------*
      *                      * Se Prev Screen                          *
      *                      *-----------------------------------------*
           if        v-key                not  = "PRSC"
                     go to  acc-fun-sdc-600.
           subtract  1                    from w-sdc-npg-dat          .
           multiply  14                   by   w-sdc-npg-dat
                                        giving w-sdc-ctr-rig          .
           subtract  13                   from w-sdc-ctr-rig          .
           go to     acc-fun-sdc-300.
       acc-fun-sdc-600.
      *                      *-----------------------------------------*
      *                      * Se Tab                                  *
      *                      *-----------------------------------------*
           if        v-key                =    "TAB "
                     move   w-brb-num-ele to   w-sdc-ctr-rig
                     go to  acc-fun-sdc-300.
      *                      *-----------------------------------------*
      *                      * Se Back                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "BACK"
                     move   1             to   w-sdc-ctr-rig
                     go to  acc-fun-sdc-300.
      *              *-------------------------------------------------*
      *              * Riciclo a riga successiva                       *
      *              *-------------------------------------------------*
           go to     acc-fun-sdc-200.
       acc-fun-sdc-800.
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#SAV"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-fun-sdc-810.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-fun-sdc-810.
      *              *-------------------------------------------------*
      *              * Test su risposta dell'utente                    *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-fun-sdc-900
           else if   v-key                =    "EXIT"
                     go to acc-fun-sdc-920
           else if   v-key                =    "UP  "
                     go to acc-fun-sdc-820
           else      go to acc-fun-sdc-800.
       acc-fun-sdc-820.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
           subtract  1                    from w-sdc-ctr-rig          .
           go to     acc-fun-sdc-300.
       acc-fun-sdc-900.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           go to     acc-fun-sdc-999.
       acc-fun-sdc-920.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita                              *
      *                  *---------------------------------------------*
           move      "#"                  to   w-sdc-flg-exi          .
           go to     acc-fun-sdc-999.
       acc-fun-sdc-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Funzione saldaconto              *
      *    *-----------------------------------------------------------*
       pmt-fun-sdc-000.
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Erase linee impegnate                           *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-fun-sdc-100.
      *              *-------------------------------------------------*
      *              * Intestazione documento                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero protocollo                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      27                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero protocollo interno :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      "<B"                 to   v-edm                  .
           move      04                   to   v-lin                  .
           move      29                   to   v-pos                  .
           move      w-acc-num-prt-saa    to   w-rnp-num-prt-saa      .
           move      w-acc-num-prt-prg    to   w-rnp-num-prt-prg      .
           move      w-rnp-num-prt-num    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Data documento                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      42                   to   v-pos                  .
           move      "Data :"             to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      04                   to   v-lin                  .
           move      49                   to   v-pos                  .
           move      w-acc-dat-doc        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Numero                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      62                   to   v-pos                  .
           move      "Numero :"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      71                   to   v-pos                  .
           move      w-acc-num-doc        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-fun-sdc-200.
      *              *-------------------------------------------------*
      *              * Linea di trattini                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-fun-sdc-300.
      *              *-------------------------------------------------*
      *              * Linea di fincatura                              *
      *              *-------------------------------------------------*
       pmt-fun-sdc-320.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del valore della per-  *
      *                  * sonalizzazione del tipo di visualizzazione  *
      *                  * della riga di scroll                        *
      *                  *---------------------------------------------*
           if        w-prs-rig-scr-des    =    00
                     go to pmt-fun-sdc-340
           else if   w-prs-rig-scr-des    =    01
                     go to pmt-fun-sdc-360
           else if   w-prs-rig-scr-des    =    02
                     go to pmt-fun-sdc-380
           else if   w-prs-rig-scr-des    =    03
                     go to pmt-fun-sdc-400
           else if   w-prs-rig-scr-des    =    04
                     go to pmt-fun-sdc-420
           else if   w-prs-rig-scr-des    =    05
                     go to pmt-fun-sdc-440
           else if   w-prs-rig-scr-des    =    06
                     go to pmt-fun-sdc-460
           else if   w-prs-rig-scr-des    =    11
                     go to pmt-fun-sdc-480
           else if   w-prs-rig-scr-des    =    12
                     go to pmt-fun-sdc-500
           else if   w-prs-rig-scr-des    =    13
                     go to pmt-fun-sdc-520
           else if   w-prs-rig-scr-des    =    14
                     go to pmt-fun-sdc-540
           else      go to pmt-fun-sdc-340.
       pmt-fun-sdc-340.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 00              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea di fincatura                      *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "               Descrizione              | In Bolla
      -              "  | Fatturato | I | Differenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "----------------------------------------|---------
      -              "--|-----------|---|-----------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-fun-sdc-700.
       pmt-fun-sdc-360.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 01              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea di fincatura                      *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "       Descrizione            Codice    | In Bolla
      -              "  | Fatturato | I | Differenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "------------------------- --------------|---------
      -              "--|-----------|---|-----------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-fun-sdc-700.
       pmt-fun-sdc-380.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 02              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea di fincatura                      *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "     Descrizione            Codice      | In Bolla
      -              "  | Fatturato | I | Differenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "--------------------- ------------------|---------
      -              "--|-----------|---|-----------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-fun-sdc-700.
       pmt-fun-sdc-400.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 03              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea di fincatura                      *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "    Codice            Descrizione       | In Bolla
      -              "  | Fatturato | I | Differenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "-------------- -------------------------|---------
      -              "--|-----------|---|-----------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-fun-sdc-700.
       pmt-fun-sdc-420.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 04              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea di fincatura                      *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "      Codice            Descrizione     | In Bolla
      -              "  | Fatturato | I | Differenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "------------------ ---------------------|---------
      -              "--|-----------|---|-----------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-fun-sdc-700.
       pmt-fun-sdc-440.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 05              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea di fincatura                      *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "       Descrizione            Codice    | In Bolla
      -              "  | Fatturato | I | Differenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "------------------------- --------------|---------
      -              "--|-----------|---|-----------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-fun-sdc-700.
       pmt-fun-sdc-460.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 06              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea di fincatura                      *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "     Descrizione            Codice      | In Bolla
      -              "  | Fatturato | I | Differenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "--------------------- ------------------|---------
      -              "--|-----------|---|-----------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-fun-sdc-700.
       pmt-fun-sdc-480.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 11              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea di fincatura                      *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "  Codice del fornitore        Codice    | In Bolla
      -              "  | Fatturato | I | Differenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "------------------------- --------------|---------
      -              "--|-----------|---|-----------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-fun-sdc-700.
       pmt-fun-sdc-500.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 12              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea di fincatura                      *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      " Codice del fornitore       Codice      | In Bolla
      -              "  | Fatturato | I | Differenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "--------------------- ------------------|---------
      -              "--|-----------|---|-----------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-fun-sdc-700.
       pmt-fun-sdc-520.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 13              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea di fincatura                      *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "    Codice       Codice del fornitore   | In Bolla
      -              "  | Fatturato | I | Differenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "-------------- -------------------------|---------
      -              "--|-----------|---|-----------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-fun-sdc-700.
       pmt-fun-sdc-540.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 14              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea di fincatura                      *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "      Codice        Codice del fornitore| In Bolla
      -              "  | Fatturato | I | Differenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "------------------ ---------------------|---------
      -              "--|-----------|---|-----------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-fun-sdc-700.
       pmt-fun-sdc-700.
      *              *-------------------------------------------------*
      *              * Colonne per saldaconto                          *
      *              *-------------------------------------------------*
           move      zero                 to   w-sdc-wrk-c01          .
       pmt-fun-sdc-710.
           add       1                    to   w-sdc-wrk-c01          .
           if        w-sdc-wrk-c01        >    14
                     go to pmt-fun-sdc-900.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           add       7
                     w-sdc-wrk-c01      giving v-lin                  .
           move      01                   to   v-pos                  .
           move      "                                        |         
      -              "  |           |   |           "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     pmt-fun-sdc-710.
       pmt-fun-sdc-900.
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-fun-sdc-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina saldaconto                         *
      *    *-----------------------------------------------------------*
       vis-pag-sdc-000.
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Aggiornamento numero pagina visualizzata        *
      *              *-------------------------------------------------*
           move      w-sdc-npg-dat        to   w-sdc-npg-vis          .
      *              *-------------------------------------------------*
      *              * Determinazione contatore righe iniziale         *
      *              *-------------------------------------------------*
           multiply  14                   by   w-sdc-npg-dat
                                      giving   w-sdc-wrk-rig          .
           subtract  14                   from w-sdc-wrk-rig          .
      *              *-------------------------------------------------*
      *              * Ciclo di visualizzazione                        *
      *              *-------------------------------------------------*
           move      zero                 to   w-sdc-wrk-c01          .
       vis-pag-sdc-100.
           add       1                    to   w-sdc-wrk-c01          .
           if        w-sdc-wrk-c01        >    14
                     go to  vis-pag-sdc-900.
           add       1                    to   w-sdc-wrk-rig          .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda che sia una riga vuo-  *
      *                  * ta o piena                                  *
      *                  *---------------------------------------------*
           if        w-sdc-wrk-rig        >    w-brb-num-ele
                     go to vis-pag-sdc-200
           else      go to vis-pag-sdc-300.
       vis-pag-sdc-200.
      *                  *---------------------------------------------*
      *                  * Se riga vuota                               *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           add       7
                     w-sdc-wrk-c01      giving v-lin                  .
           move      01                   to   v-pos                  .
           move      "                                        |         
      -              "  |           |   |           "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     vis-pag-sdc-100.
       vis-pag-sdc-300.
      *                  *---------------------------------------------*
      *                  * Visualizzazione riga piena                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione                             *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           add       7
                     w-sdc-wrk-c01      giving v-lin                  .
           move      01                   to   v-pos                  .
           move      w-brb-des-rig
                    (w-sdc-wrk-rig)       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Quantita' in bolla                      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Editing quantita' da incolonnare    *
      *                          *-------------------------------------*
           move      "ED"                 to   w-edt-qta-inc-ope      .
           move      w-brb-qta-bfo
                    (w-sdc-wrk-rig)       to   w-edt-qta-inc-qta      .
           move      w-brb-dec-qta
                    (w-sdc-wrk-rig)       to   w-edt-qta-inc-dec      .
           move      "S"                  to   w-edt-qta-inc-sgn      .
           move      11                   to   w-edt-qta-inc-car      .
           perform   edt-qta-inc-000      thru edt-qta-inc-999        .
      *                          *-------------------------------------*
      *                          * Visualizzazione                     *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      11                   to   v-car                  .
           add       7
                     w-sdc-wrk-c01      giving v-lin                  .
           move      42                   to   v-pos                  .
           move      w-edt-qta-inc-edt    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione del tipo riga    *
      *                      *-----------------------------------------*
           if        w-brb-tip-rig
                    (w-sdc-wrk-rig)       not  = "C" and
                     w-brb-tip-rig
                    (w-sdc-wrk-rig)       not  = "A"
                     go to vis-pag-sdc-320.
      *                      *-----------------------------------------*
      *                      * Se riga di Addebito o Commento          *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      02                   to   v-car                  .
           add       7
                     w-sdc-wrk-c01      giving v-lin                  .
           move      59                   to   v-pos                  .
           if        w-brb-snx-aoc
                    (w-sdc-wrk-rig)       =    "S"
                     move  "Si"           to   v-alf
           else      move  spaces         to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * A riciclo su riga successiva            *
      *                      *-----------------------------------------*
           go to     vis-pag-sdc-400.
       vis-pag-sdc-320.
      *                      *-----------------------------------------*
      *                      * Se altro tipo riga                      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Quantita' fatturata                 *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      03                   to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "BD"                 to   v-edm                  .
           add       7
                     w-sdc-wrk-c01      giving v-lin                  .
           move      54                   to   v-pos                  .
           move      w-brb-qta-ffo
                    (w-sdc-wrk-rig)       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Flag indicatore di residuo          *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           add       7
                     w-sdc-wrk-c01      giving v-lin                  .
           move      66                   to   v-pos                  .
           move      w-brb-flg-idr
                    (w-sdc-wrk-rig)       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Quantita' residua                   *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing quantita'               *
      *                              *---------------------------------*
           move      "ED"                 to   w-edt-qta-inc-ope      .
           move      w-brb-qta-res
                    (w-sdc-wrk-rig)       to   w-edt-qta-inc-qta      .
           move      w-brb-dec-qta
                    (w-sdc-wrk-rig)       to   w-edt-qta-inc-dec      .
           move      "S"                  to   w-edt-qta-inc-sgn      .
           move      11                   to   w-edt-qta-inc-car      .
           perform   edt-qta-inc-000      thru edt-qta-inc-999        .
      *                              *---------------------------------*
      *                              * Visualizzazione                 *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      11                   to   v-car                  .
           add       7
                     w-sdc-wrk-c01      giving v-lin                  .
           move      70                   to   v-pos                  .
           move      w-edt-qta-inc-edt    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-pag-sdc-400.
      *                      *-----------------------------------------*
      *                      * Riciclo su riga successiva              *
      *                      *-----------------------------------------*
           go to     vis-pag-sdc-100.
       vis-pag-sdc-900.
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-pag-sdc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo saldaconto : Quantita' fatturata       *
      *    *-----------------------------------------------------------*
       acc-qta-ffo-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-brb-tip-rig
                    (w-sdc-ctr-rig)       =    "A" or
                     w-brb-tip-rig
                    (w-sdc-ctr-rig)       =    "C"
                     go to acc-qta-ffo-999.
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-brb-qta-ffo
                    (w-sdc-ctr-rig)       to   w-sav-qta-ffo          .
           move      w-brb-flg-fzs
                    (w-sdc-ctr-rig)       to   w-sav-flg-fzs          .
       acc-qta-ffo-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      w-brb-dec-qta
                    (w-sdc-ctr-rig)       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "BD"                 to   v-edm                  .
           move      w-sdc-wrk-lin        to   v-lin                  .
           move      54                   to   v-pos                  .
           if        w-sdc-ctr-rig        >    1      
                     move   "UP  "        to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           if        w-sdc-npg-dat        <    w-sdc-npg-max
                     move   "NXSC"        to   v-pfk (06)             .
           if        w-sdc-npg-dat        >    1
                     move   "PRSC"        to   v-pfk (07)             .
           if        w-sdc-ctr-rig        <    w-brb-num-ele
                     move   "TAB "        to   v-pfk (08)             .
           if        w-sdc-ctr-rig        >    1
                     move   "BACK"        to   v-pfk (09)             .
           move      "SLCT"               to   v-pfk (10)             .
           move      "[1] "               to   v-pfk (14)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-brb-qta-ffo
                    (w-sdc-ctr-rig)       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-qta-ffo-999.
       acc-qta-ffo-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-brb-qta-ffo
                                              (w-sdc-ctr-rig)         .
       acc-qta-ffo-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Controllo compatibilita' fra segno quantita'*
      *                  * in fattura e segno quantita' in bolla       *
      *                  *---------------------------------------------*
           if        w-brb-qta-bfo
                    (w-sdc-ctr-rig)       >    zero and
                     w-brb-qta-ffo
                    (w-sdc-ctr-rig)       <    zero
                     go to acc-qta-ffo-100
           else if   w-brb-qta-bfo
                    (w-sdc-ctr-rig)       <    zero and
                     w-brb-qta-ffo
                    (w-sdc-ctr-rig)       >    zero
                     go to acc-qta-ffo-100.
      *                  *---------------------------------------------*
      *                  * Se Pf1 : controllo che il valore impostato  *
      *                  * non sia zero                                *
      *                  *---------------------------------------------*
           if        v-key                not  = "[1] "
                     go to acc-qta-ffo-420.
           if        w-brb-qta-ffo
                    (w-sdc-ctr-rig)       =    zero
                     go to acc-qta-ffo-100.
       acc-qta-ffo-420.
      *                  *---------------------------------------------*
      *                  * Se Slct : controllo che il valore impostato *
      *                  * sia uguale al precedente                    *
      *                  *---------------------------------------------*
           if        v-key                not  = "SLCT"
                     go to acc-qta-ffo-600.
           if        w-brb-qta-ffo
                    (w-sdc-ctr-rig)       not  = w-sav-qta-ffo
                     move   w-sav-qta-ffo to   w-brb-qta-ffo
                                              (w-sdc-ctr-rig)
                     go to  acc-qta-ffo-100.
       acc-qta-ffo-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Quantita' in bolla e quantita' in fattura   *
      *                  * in work di comodo senza segno               *
      *                  *---------------------------------------------*
           move      w-brb-qta-bfo
                    (w-sdc-ctr-rig)       to   w-qss-qta-bfo          .
           move      w-brb-qta-ffo
                    (w-sdc-ctr-rig)       to   w-qss-qta-ffo          .
      *                  *---------------------------------------------*
      *                  * Se Slct                                     *
      *                  *---------------------------------------------*
           if        v-key                not  = "SLCT"
                     go to  acc-qta-ffo-620.
      *                      *-----------------------------------------*
      *                      * Se valore gia' presente                 *
      *                      *-----------------------------------------*
           if        w-brb-qta-ffo
                    (w-sdc-ctr-rig)       =    zero
                     go to acc-qta-ffo-610.
      *                          *-------------------------------------*
      *                          * Quantita' in fattura                *
      *                          *-------------------------------------*
           move      zero                 to   w-brb-qta-ffo
                                              (w-sdc-ctr-rig)         .
           move      zero                 to   w-qss-qta-ffo          .
      *                          *-------------------------------------*
      *                          * Flag di saldo forzato               *
      *                          *-------------------------------------*
           move      spaces               to   w-brb-flg-fzs
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-700.
       acc-qta-ffo-610.
      *                      *-----------------------------------------*
      *                      * Se valore non presente                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Quantita' in fattura                *
      *                          *-------------------------------------*
           move      w-brb-qta-bfo
                    (w-sdc-ctr-rig)       to   w-brb-qta-ffo
                                              (w-sdc-ctr-rig)         .
           move      w-brb-qta-bfo
                    (w-sdc-ctr-rig)       to   w-qss-qta-ffo          .
      *                          *-------------------------------------*
      *                          * Flag di saldo forzato               *
      *                          *-------------------------------------*
           move      spaces               to   w-brb-flg-fzs
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-700.
       acc-qta-ffo-620.
      *                  *---------------------------------------------*
      *                  * Se Pf1                                      *
      *                  *---------------------------------------------*
           if        v-key                not  = "[1] "
                     go to  acc-qta-ffo-640.
      *                      *-----------------------------------------*
      *                      * Flag di saldo forzato                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se quantita' in fattura maggiore o  *
      *                          * uguale a quella in bolla : spaces   *
      *                          *-------------------------------------*
           if        w-qss-qta-ffo        <    w-qss-qta-bfo
                     go to  acc-qta-ffo-630.
           move      spaces               to   w-brb-flg-fzs
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-700.
       acc-qta-ffo-630.
      *                          *-------------------------------------*
      *                          * Altrimenti : si inverte il valore   *
      *                          * attuale del flag                    *
      *                          *-------------------------------------*
           if        w-brb-flg-fzs
                    (w-sdc-ctr-rig)       =    spaces
                     move  "S"            to   w-brb-flg-fzs
                                              (w-sdc-ctr-rig)
           else      move  spaces         to   w-brb-flg-fzs
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-700.
       acc-qta-ffo-640.
      *                  *---------------------------------------------*
      *                  * Se Return o altri tasti funzione            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di saldo forzato                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se valore impostato pari al prece-  *
      *                          * dente : nessuna variazione          *
      *                          *-------------------------------------*
           if        w-brb-qta-ffo
                    (w-sdc-ctr-rig)        not  = w-sav-qta-ffo
                     go to  acc-qta-ffo-650.
           go to     acc-qta-ffo-700.
       acc-qta-ffo-650.
      *                          *-------------------------------------*
      *                          * Se valore impostato diverso dal     *
      *                          * precedente                          *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Se quantita' in fattura maggio- *
      *                              * re o uguale a quella in bolla : *
      *                              * spaces                          *
      *                              *---------------------------------*
           if        w-qss-qta-ffo        <    w-qss-qta-bfo
                     go to  acc-qta-ffo-655.
           move      spaces               to   w-brb-flg-fzs
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-700.
       acc-qta-ffo-655.
      *                              *---------------------------------*
      *                              * Altrimenti : valore inalterato  *
      *                              *---------------------------------*
           go to     acc-qta-ffo-700.
       acc-qta-ffo-700.
      *                  *---------------------------------------------*
      *                  * Trattamento altri valori riga               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag indicatore di residuo              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se flag di saldo forzato a 'S'      *
      *                          *-------------------------------------*
           if        w-brb-flg-fzs
                    (w-sdc-ctr-rig)       =    spaces
                     go to acc-qta-ffo-710.
           move      spaces               to   w-brb-flg-idr
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-720.
       acc-qta-ffo-710.
      *                          *-------------------------------------*
      *                          * Se flag di saldo forzato diverso da *
      *                          * 'S'                                 *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Se quantita' in fattura maggio- *
      *                              * re o uguale a quella in bolla : *
      *                              * spaces                          *
      *                              *---------------------------------*
           if        w-qss-qta-ffo        <    w-qss-qta-bfo
                     go to  acc-qta-ffo-715.
           move      spaces               to   w-brb-flg-idr
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-720.
       acc-qta-ffo-715.
      *                              *---------------------------------*
      *                              * Altrimenti : il valore viene    *
      *                              * forzato a '<'                   *
      *                              *---------------------------------*
           move      "<"                  to   w-brb-flg-idr
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-720.
       acc-qta-ffo-720.
      *                      *-----------------------------------------*
      *                      * Flag indicatore di saldo                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se flag di saldo forzato a 'S'      *
      *                          *-------------------------------------*
           if        w-brb-flg-fzs
                    (w-sdc-ctr-rig)       =    spaces
                     go to acc-qta-ffo-730.
           move      "S"                  to   w-brb-flg-ids
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-740.
       acc-qta-ffo-730.
      *                          *-------------------------------------*
      *                          * Se flag di saldo forzato diverso da *
      *                          * 'S'                                 *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Se quantita' in fattura minore  *
      *                              * o uguale a quella in bolla :    *
      *                              * viene forzato il valore spaces  *
      *                              *---------------------------------*
           if        w-qss-qta-ffo        >    w-qss-qta-bfo
                     go to  acc-qta-ffo-735.
           move      spaces               to   w-brb-flg-ids
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-740.
       acc-qta-ffo-735.
      *                              *---------------------------------*
      *                              * Altrimenti : il valore viene    *
      *                              * forzato a "+"                   *
      *                              *---------------------------------*
           move      "+"                  to   w-brb-flg-ids
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-740.
       acc-qta-ffo-740.
      *                      *-----------------------------------------*
      *                      * Quantita' residua                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se flag di saldo forzato a 'S'      *
      *                          *-------------------------------------*
           if        w-brb-flg-fzs
                    (w-sdc-ctr-rig)       =    spaces
                     go to acc-qta-ffo-750.
           move      zero                 to   w-brb-qta-res
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-760.
       acc-qta-ffo-750.
      *                          *-------------------------------------*
      *                          * Se flag di saldo forzato diverso da *
      *                          * 'S'                                 *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Se quantita' in fattura maggio- *
      *                              * re o uguale a quella in bolla : *
      *                              * spaces                          *
      *                              *---------------------------------*
           if        w-qss-qta-ffo        <    w-qss-qta-bfo
                     go to  acc-qta-ffo-755.
           move      zero                 to   w-brb-qta-res
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-760.
       acc-qta-ffo-755.
      *                              *---------------------------------*
      *                              * Altrimenti : il valore e' pari  *
      *                              * alla differenza tra quantita'   *
      *                              * in bolla e quantita' in fattura *
      *                              *---------------------------------*
           subtract  w-brb-qta-ffo
                    (w-sdc-ctr-rig)       from w-brb-qta-bfo
                                              (w-sdc-ctr-rig)
                                        giving w-brb-qta-res
                                              (w-sdc-ctr-rig)         .
           go to     acc-qta-ffo-760.
       acc-qta-ffo-760.
      *                  *---------------------------------------------*
      *                  * Visualizzazione valori riga                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Quantita' in fattura                    *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      03                   to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "BD"                 to   v-edm                  .
           move      w-sdc-wrk-lin        to   v-lin                  .
           move      54                   to   v-pos                  .
           move      w-brb-qta-ffo
                    (w-sdc-ctr-rig)       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Flag indicatore di residuo              *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      w-sdc-wrk-lin        to   v-lin                  .
           move      66                   to   v-pos                  .
           move      w-brb-flg-idr
                    (w-sdc-ctr-rig)       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Flag indicatore di saldo                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      w-sdc-wrk-lin        to   v-lin                  .
           move      68                   to   v-pos                  .
           move      w-brb-flg-ids
                    (w-sdc-ctr-rig)       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Quantita' residua                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Editing quantita'                   *
      *                          *-------------------------------------*
           move      "ED"                 to   w-edt-qta-inc-ope      .
           move      w-brb-qta-res
                    (w-sdc-ctr-rig)       to   w-edt-qta-inc-qta      .
           move      w-brb-dec-qta
                    (w-sdc-ctr-rig)       to   w-edt-qta-inc-dec      .
           move      "S"                  to   w-edt-qta-inc-sgn      .
           move      11                   to   w-edt-qta-inc-car      .
           perform   edt-qta-inc-000      thru edt-qta-inc-999        .
      *                          *-------------------------------------*
      *                          * Visualizzazione                     *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      w-sdc-wrk-lin        to   v-lin                  .
           move      70                   to   v-pos                  .
           move      w-edt-qta-inc-edt    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-qta-ffo-800.
       acc-qta-ffo-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo saldaconto : Si/No Addebito o Commento *
      *    *-----------------------------------------------------------*
       acc-snx-aoc-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-brb-tip-rig
                    (w-sdc-ctr-rig)       not  = "A" and
                     w-brb-tip-rig
                    (w-sdc-ctr-rig)       not  = "C"
                     go to acc-snx-aoc-999.
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-brb-snx-aoc
                    (w-sdc-ctr-rig)       to   w-sav-snx-aoc          .
           move      w-brb-flg-fzs
                    (w-sdc-ctr-rig)       to   w-sav-flg-fzs          .
      *                  *---------------------------------------------*
      *                  * Default a 'Si'                              *
      *                  *---------------------------------------------*
           if        w-brb-snx-aoc
                    (w-sdc-ctr-rig)       =    spaces
                     move  "S"            to   w-brb-snx-aoc
                                              (w-sdc-ctr-rig)         .
       acc-snx-aoc-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      w-sdc-wrk-lin        to   v-lin                  .
           move      59                   to   v-pos                  .
      *                  *---------------------------------------------*
      *                  * Tasti funzione                              *
      *                  *---------------------------------------------*
           if        w-sdc-ctr-rig        >    1      
                     move   "UP  "        to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           if        w-sdc-npg-dat        <    w-sdc-npg-max
                     move   "NXSC"        to   v-pfk (06)             .
           if        w-sdc-npg-dat        >    1
                     move   "PRSC"        to   v-pfk (07)             .
           if        w-sdc-ctr-rig        <    w-brb-num-ele
                     move   "TAB "        to   v-pfk (08)             .
           if        w-sdc-ctr-rig        >    1
                     move   "BACK"        to   v-pfk (09)             .
       acc-snx-aoc-150.
           move      "SLCT"               to   v-pfk (10)             .
           move      "[1] "               to   v-pfk (14)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-brb-snx-aoc
                    (w-sdc-ctr-rig)       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-snx-aoc-999.
       acc-snx-aoc-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-brb-snx-aoc
                                              (w-sdc-ctr-rig)         .
      *              *-------------------------------------------------*
      *              * Se Slct                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "SLCT"
                     go to  acc-snx-aoc-300.
      *                  *---------------------------------------------*
      *                  * Se campo modificato : ripristino valore pre-*
      *                  * cedente e reimpostazione                    *
      *                  *---------------------------------------------*
           if        w-brb-snx-aoc
                    (w-sdc-ctr-rig)       not  = w-sav-snx-aoc
                     move   w-sav-snx-aoc to   w-brb-snx-aoc
                                              (w-sdc-ctr-rig)
                     go to  acc-snx-aoc-100.
      *                  *---------------------------------------------*
      *                  * Se valore presente lo si abblenca, altri-   *
      *                  * menti lo si forza a 'S'                     *
      *                  *---------------------------------------------*
           if        w-brb-snx-aoc
                    (w-sdc-ctr-rig)       not  = spaces
                     move  spaces         to   w-brb-snx-aoc
                                              (w-sdc-ctr-rig)
           else      move  "S"            to   w-brb-snx-aoc
                                              (w-sdc-ctr-rig)         .
       acc-snx-aoc-300.
      *              *-------------------------------------------------*
      *              * Se Pf1                                          *
      *              *-------------------------------------------------*
           if        v-key                not  = "[1] "
                     go to  acc-snx-aoc-400.
      *                  *---------------------------------------------*
      *                  * Flag di saldo forzato                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se indicatore a 'S' : spaces            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se quantita' in fattura maggiore o  *
      *                          * uguale a quella in bolla : spaces   *
      *                          *-------------------------------------*
           if        w-brb-snx-aoc
                    (w-sdc-ctr-rig)        not  = "S"
                     go to  acc-snx-aoc-330.
           move      "-"                   to   w-brb-flg-fzs
                                               (w-sdc-ctr-rig)        .
           go to     acc-snx-aoc-400.
       acc-snx-aoc-330.
      *                          *-------------------------------------*
      *                          * Altrimenti : si inverte il valore   *
      *                          * attuale del flag                    *
      *                          *-------------------------------------*
           if        w-brb-flg-fzs
                    (w-sdc-ctr-rig)       =    spaces
                     move  "S"            to   w-brb-flg-fzs
                                              (w-sdc-ctr-rig)
           else      move  "-"            to   w-brb-flg-fzs
                                              (w-sdc-ctr-rig)         .
           go to     acc-snx-aoc-400.
       acc-snx-aoc-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore non ammesso : reimpostazione      *
      *                  *---------------------------------------------*
           if        w-brb-snx-aoc
                    (w-sdc-ctr-rig)       not  = "S" and
                     w-brb-snx-aoc
                    (w-sdc-ctr-rig)       not  = "N" and
                     w-brb-snx-aoc
                    (w-sdc-ctr-rig)       not  = spaces
                     go to acc-snx-aoc-100.
       acc-snx-aoc-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione valore                      *
      *                  *---------------------------------------------*
           if        w-brb-snx-aoc
                    (w-sdc-ctr-rig)       =    "N"
                     move  spaces         to   w-brb-snx-aoc
                                              (w-sdc-ctr-rig)         .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di forzatura a saldo   *
      *                  *---------------------------------------------*
           if        w-brb-snx-aoc
                    (w-sdc-ctr-rig)       not  = spaces
                     move  spaces         to   w-brb-flg-fzs
                                              (w-sdc-ctr-rig)         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione Si/No addebito o commento   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      w-sdc-wrk-lin        to   v-lin                  .
           move      59                   to   v-pos                  .
           if        w-brb-snx-aoc
                    (w-sdc-ctr-rig)       =    "S"
                     move  "Si"           to   v-alf
           else      move  spaces         to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Flag indicatore di forzatura a saldo        *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      w-sdc-wrk-lin        to   v-lin                  .
           move      68                   to   v-pos                  .
           move      w-brb-flg-fzs
                    (w-sdc-ctr-rig)       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-snx-aoc-800.
       acc-snx-aoc-999.
           exit.

      *    *===========================================================*
      *    * Caricamento righe in catena                               *
      *    *-----------------------------------------------------------*
       car-rig-cat-000.
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Ciclo di scansione buffer righe bolla           *
      *              *-------------------------------------------------*
           move      zero                 to   w-crc-wrk-ctr          .
       car-rig-cat-100.
           add       1                    to   w-crc-wrk-ctr          .
           if        w-crc-wrk-ctr        >    w-brb-num-ele
                     go to car-rig-cat-800.
      *                  *---------------------------------------------*
      *                  * Selezione su righe bolla nel buffer         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione del tipo riga    *
      *                      *-----------------------------------------*
           if        w-brb-tip-rig
                    (w-crc-wrk-ctr)       =    "A" or
                     w-brb-tip-rig
                    (w-crc-wrk-ctr)       =    "C"
                     go to car-rig-cat-110
           else      go to car-rig-cat-120.
       car-rig-cat-110.
      *                      *-----------------------------------------*
      *                      * Se riga di Addebito o Commento          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se si/no da riportare          *
      *                          *-------------------------------------*
           if        w-brb-snx-aoc
                    (w-crc-wrk-ctr)       not  = "S"
                     go to car-rig-cat-115.
      *                          *-------------------------------------*
      *                          * Ad append                           *
      *                          *-------------------------------------*
           go to     car-rig-cat-150.
       car-rig-cat-115.
      *                          *-------------------------------------*
      *                          * Test se forzatura saldo             *
      *                          *-------------------------------------*
           if        w-brb-flg-fzs
                    (w-crc-wrk-ctr)       =    spaces
                     go to car-rig-cat-100.
      *                          *-------------------------------------*
      *                          * Update riga bolla                   *
      *                          *-------------------------------------*
           perform   car-rig-cat-urb-000  thru car-rig-cat-urb-999    .
      *                          *-------------------------------------*
      *                          * A riciclo                           *
      *                          *-------------------------------------*
           go to     car-rig-cat-100.
       car-rig-cat-120.
      *                      *-----------------------------------------*
      *                      * Se altro tipo riga                      *
      *                      *-----------------------------------------*
           if        w-brb-qta-ffo
                    (w-crc-wrk-ctr)       =    zero
                     go to car-rig-cat-100.
           go to     car-rig-cat-150.
       car-rig-cat-150.
      *                  *---------------------------------------------*
      *                  * Append in catena                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se Append non possibile : uscita con    *
      *                      * errore                                  *
      *                      *-----------------------------------------*
           if        w-cat-rig-app        not  = spaces
                     go to  car-rig-cat-900.
      *                      *-----------------------------------------*
      *                      * Append                                  *
      *                      *-----------------------------------------*
           move      "AP"                 to   w-cat-rig-ope          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
       car-rig-cat-200.
      *                  *---------------------------------------------*
      *                  * Normalizzazione riga                        *
      *                  *---------------------------------------------*
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
           move      w-rig-val-aep (1)    to   w-rig-val-aep (2)      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [bfr]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [bfr]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-gen-prt-bfo        to   rf-bfr-num-prt         .
           move      w-brb-num-prg
                    (w-crc-wrk-ctr)       to   rf-bfr-num-prg         .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
       car-rig-cat-300.
      *                  *---------------------------------------------*
      *                  * Composizione riga                           *
      *                  *---------------------------------------------*
       car-rig-cat-400.
      *                      *-----------------------------------------*
      *                      * Valori contenuti direttamente in re-    *
      *                      * cord [bfr]                              *
      *                      *-----------------------------------------*
           move      w-cat-rig-prg        to   w-rig-num-prg (1)      .
           move      rf-bfr-bld-flb       to   w-rig-bld-flb (1)      .
           move      rf-bfr-bld-tpb       to   w-rig-bld-tpb (1)      .
           move      rf-bfr-bld-rgb       to   w-rig-bld-rgb (1)      .
           move      rf-bfr-tip-rig       to   w-rig-tip-rig (1)      .
           perform   dec-tip-rig-000      thru dec-tip-rig-999        .
           move      rf-bfr-tip-mag       to   w-rig-tip-mag (1)      .
           move      rf-bfr-num-mag       to   w-rig-num-mag (1)      .
           move      rf-bfr-alf-mag       to   w-rig-alf-mag (1)      .
           move      rf-bfr-sgl-vrn       to   w-rig-sgl-vrn (1)      .
           move      rf-bfr-fda-pif       to   w-rig-fda-pif (1)      .
           move      rf-bfr-cop-sfn       to   w-rig-cop-sfn (1)      .
           move      rf-bfr-snx-tum       to   w-rig-snx-tum (1)      .
           move      rf-bfr-umf-tum       to   w-rig-umf-tum (1)      .
           move      rf-bfr-nde-tum       to   w-rig-nde-tum (1)      .
           move      rf-bfr-cmo-tum       to   w-rig-cmo-tum (1)      .
           move      rf-bfr-cdi-tum       to   w-rig-cdi-tum (1)      .
           move      rf-bfr-des-ext       to   w-rig-des-ext (1)      .
           move      rf-bfr-des-rig       to   w-rig-des-rig (1)      .
           move      rf-bfr-tip-pro       to   w-rig-tip-pro (1)      .
           move      rf-bfr-cod-iva       to   w-rig-civ-rig (1)      .
           move      rf-bfr-ctp-acq       to   w-rig-ctp-rig (1)      .
           move      rf-bfr-umi-acq       to   w-rig-umi-acq (1)      .
           move      rf-bfr-dec-qta       to   w-rig-dec-qta (1)      .
           move      rf-bfr-snx-2qt       to   w-rig-snx-2qt (1)      .
           move      rf-bfr-dec-2qt       to   w-rig-dec-2qt (1)      .
           move      rf-bfr-qta-a02       to   w-rig-qta-a02 (1)      .
           move      rf-bfr-snx-3qt       to   w-rig-snx-3qt (1)      .
           move      rf-bfr-dec-3qt       to   w-rig-dec-3qt (1)      .
           move      rf-bfr-qta-a03       to   w-rig-qta-a03 (1)      .
           move      rf-bfr-dec-prz       to   w-rig-dec-prz (1)      .
           move      rf-bfr-prz-acq       to   w-rig-prz-acq (1)      .
           move      rf-bfr-snx-2pz       to   w-rig-snx-2pz (1)      .
           move      rf-bfr-dec-2pz       to   w-rig-dec-2pz (1)      .
           move      rf-bfr-prz-a02       to   w-rig-prz-a02 (1)      .
           move      rf-bfr-sgl-vpl       to   w-rig-sgl-vpl (1)      .
           move      rf-bfr-dec-vpl       to   w-rig-dec-vpl (1)      .
           move      rf-bfr-tdc-vpl       to   w-rig-tdc-vpl (1)      .
           move      rf-bfr-prz-vpl       to   w-rig-prz-vpl (1)      .
           move      rf-bfr-cdc-vpl       to   w-rig-cdc-vpl (1)      .
           move      rf-bfr-ccr-vpl       to   w-rig-ccr-vpl (1)      .
           move      rf-bfr-plm-vpl       to   w-rig-plm-vpl (1)      .
           move      rf-bfr-tlm-vpl       to   w-rig-tlm-vpl (1)      .
           move      rf-bfr-map-vpl       to   w-rig-map-vpl (1)      .
           move      rf-bfr-epz-rgf       to   w-rig-epz-rgf (1)      .
           move      rf-bfr-csr-aap       to   w-rig-csr-aap (1)      .
           move      rf-bfr-psr-aap (1)   to   w-rig-psr-aap (1, 1)   .
           move      rf-bfr-psr-aap (2)   to   w-rig-psr-aap (1, 2)   .
           move      rf-bfr-psr-aap (3)   to   w-rig-psr-aap (1, 3)   .
           move      rf-bfr-psr-aap (4)   to   w-rig-psr-aap (1, 4)   .
           move      rf-bfr-psr-aap (5)   to   w-rig-psr-aap (1, 5)   .
           move      rf-bfr-per-scr (1)   to   w-rig-per-scr (1, 1)   .
           move      rf-bfr-per-scr (2)   to   w-rig-per-scr (1, 2)   .
           move      rf-bfr-per-scr (3)   to   w-rig-per-scr (1, 3)   .
           move      rf-bfr-per-scr (4)   to   w-rig-per-scr (1, 4)   .
           move      rf-bfr-per-scr (5)   to   w-rig-per-scr (1, 5)   .
           move      rf-bfr-prz-net       to   w-rig-prz-net (1)      .
           move      rf-bfr-iau-rig       to   w-rig-iau-rig (1)      .
           move      rf-bfr-cpv-aap       to   w-rig-cpv-aap (1)      .
           move      rf-bfr-ppv-aap (1)   to   w-rig-ppv-aap (1, 1)   .
           move      rf-bfr-ppv-aap (2)   to   w-rig-ppv-aap (1, 2)   .
           move      rf-bfr-ppv-aap (3)   to   w-rig-ppv-aap (1, 3)   .
           move      rf-bfr-fsp-rig       to   w-rig-fsp-rig (1)      .
           move      rf-bfr-cpv-rig       to   w-rig-cpv-rig (1)      .
           move      rf-bfr-ppv-rig (1)   to   w-rig-ppv-rig (1, 1)   .
           move      rf-bfr-ppv-rig (2)   to   w-rig-ppv-rig (1, 2)   .
           move      rf-bfr-ppv-rig (3)   to   w-rig-ppv-rig (1, 3)   .
           move      rf-bfr-pvf-rig       to   w-rig-pvf-rig (1)      .
           move      rf-bfr-cod-tmb       to   w-rig-bfo-tip (1)      .
           move      rf-bfr-dat-reg       to   w-rig-bfo-dat (1)      .
           move      rf-bfr-num-prt       to   w-rig-bfo-prt (1)      .
           move      rf-bfr-num-prg       to   w-rig-bfo-prg (1)      .
           move      rf-bfr-dat-doc       to   w-rig-bfo-ddo (1)      .
           move      rf-bfr-num-doc       to   w-rig-bfo-ndo (1)      .
           move      rf-bfr-lot-dat       to   w-rig-lot-dat (1)      .
      *
           if        rf-bfr-lot-dat       not  numeric
                     move  zero           to   w-rig-lot-dat (1)      .
      *
           move      rf-bfr-lot-sgl       to   w-rig-lot-sgl (1)      .
       car-rig-cat-500.
      *                      *-----------------------------------------*
      *                      * Valori contenuti in buffer righe ordine *
      *                      *-----------------------------------------*
       car-rig-cat-505.
      *                          *-------------------------------------*
      *                          * Deviazione a seconda del tipo riga  *
      *                          *-------------------------------------*
           if        w-rig-tip-rig-tpr (1)
                                          =    "A" or
                     w-rig-tip-rig-tpr (1)
                                          =    "C"
                     go to car-rig-cat-510
           else      go to car-rig-cat-515.
       car-rig-cat-510.
      *                          *-------------------------------------*
      *                          * Se riga di addebito o commento      *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Quantita' secondo il formato di *
      *                              * acquisizione                    *
      *                              *---------------------------------*
           move      zero                 to   w-rig-qta-fda (1)      .
      *                              *---------------------------------*
      *                              * Quantita' secondo noi           *
      *                              *---------------------------------*
           move      zero                 to   w-rig-qta-acq (1)      .
      *                              *---------------------------------*
      *                              * Importo in riga                 *
      *                              *---------------------------------*
           move      rf-bfr-imp-rig       to   w-rig-imp-rig (1)      .
      *                              *---------------------------------*
      *                              * Continuazione                   *
      *                              *---------------------------------*
           go to     car-rig-cat-600.
       car-rig-cat-515.
      *                          *-------------------------------------*
      *                          * Se riga con quantita'               *
      *                          *-------------------------------------*
       car-rig-cat-520.
      *                              *---------------------------------*
      *                              * Richiamo routine per la deter-  *
      *                              * minazione della quantita' se-   *
      *                              * condaria                        *
      *                              *---------------------------------*
           move      w-brb-qta-ffo
                    (w-crc-wrk-ctr)       to   w-det-qta-sec-qim      .
           move      w-rig-dec-qta (1)    to   w-det-qta-sec-dgm      .
           move      w-rig-snx-tum (1)    to   w-det-qta-sec-snu      .
           move      w-rig-umf-tum (1)    to   w-det-qta-sec-umf      .
           move      w-rig-nde-tum (1)    to   w-det-qta-sec-ndu      .
           move      w-rig-cmo-tum (1)    to   w-det-qta-sec-cmu      .
           move      w-rig-cdi-tum (1)    to   w-det-qta-sec-cdu      .
           perform   det-qta-sec-000      thru det-qta-sec-999        .
       car-rig-cat-525.
      *                              *---------------------------------*
      *                              * Quantita' secondo il formato di *
      *                              * acquisizione                    *
      *                              *---------------------------------*
           if        w-rig-snx-tum (1)    =    "P"
                     move  w-det-qta-sec-qts
                                          to   w-rig-qta-fda (1)
           else      move  w-brb-qta-ffo
                          (w-crc-wrk-ctr) to   w-rig-qta-fda (1)      .
       car-rig-cat-530.
      *                              *---------------------------------*
      *                              * Quantita' secondo noi           *
      *                              *---------------------------------*
           if        w-rig-snx-tum (1)    =    "P"
                     move  w-brb-qta-ffo
                          (w-crc-wrk-ctr) to   w-rig-qta-acq (1)
           else      move  w-det-qta-sec-qts
                                          to   w-rig-qta-acq (1)      .
       car-rig-cat-540.
      *                              *---------------------------------*
      *                              * Trattamento legame valutario    *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Test se da effettuare       *
      *                                  *-----------------------------*
           if        w-rig-sgl-vpl (1)    =    spaces
                     go to car-rig-cat-560.
      *                                  *-----------------------------*
      *                                  * Ricerca sigla valuta in ta- *
      *                                  * bella valute per legame va- *
      *                                  * lutario                     *
      *                                  *-----------------------------*
           move      zero                 to   w-vpl-ctr-001          .
       car-rig-cat-542.
           add       1                    to   w-vpl-ctr-001          .
           if        w-vpl-ctr-001        >    w-vpl-num-ele
                     go to car-rig-cat-560.
           if        w-rig-sgl-vpl (1)    =    w-vpl-sgl-vpl
                                              (w-vpl-ctr-001)
                     go to car-rig-cat-544.
           go to     car-rig-cat-542.
       car-rig-cat-544.
      *                                  *-----------------------------*
      *                                  * Bufferizzazione coefficien- *
      *                                  * te di cambio applicato      *
      *                                  *-----------------------------*
           move      w-vpl-cdc-vpl
                    (w-vpl-ctr-001)       to   w-rig-cdc-vpl (1)      .
      *                                  *-----------------------------*
      *                                  * Salvataggio prezzo di ac-   *
      *                                  * quisto precedente           *
      *                                  *-----------------------------*
           move      w-rig-prz-acq (1)    to   w-sav-prz-acq          .
      *                                  *-----------------------------*
      *                                  * Applicazione cambio per le- *
      *                                  * game valutario              *
      *                                  *-----------------------------*
           move      w-rig-prz-vpl (1)    to   w-rig-prz-acq (1)      .
      *                                  *-----------------------------*
      *                                  * Parametri in input          *
      *                                  *-----------------------------*
           move      w-rig-prz-acq (1)    to   w-lvl-prz-prz          .
           move      w-rig-sgl-vpl (1)    to   w-lvl-prz-vlt          .
           move      w-rig-tdc-vpl (1)    to   w-lvl-prz-tdc          .
           move      w-rig-ccr-vpl (1)    to   w-lvl-prz-ccr          .
           move      w-rig-cdc-vpl (1)    to   w-lvl-prz-cdc          .
           move      w-rig-plm-vpl (1)    to   w-lvl-prz-plm          .
           move      w-rig-tlm-vpl (1)    to   w-lvl-prz-tlm          .
      *                                  *-----------------------------*
      *                                  * Determinazione              *
      *                                  *-----------------------------*
           perform   lvl-prz-det-000      thru lvl-prz-det-999        .
      *                                  *-----------------------------*
      *                                  * Valore determinato          *
      *                                  *-----------------------------*
           move      w-lvl-prz-prz        to   w-rig-prz-acq (1)      .
      *                                  *-----------------------------*
      *                                  * Se prezzo di acquisto inva- *
      *                                  * riato : oltre               *
      *                                  *-----------------------------*
           if        w-rig-prz-acq (1)    =    w-sav-prz-acq
                     go to car-rig-cat-560.
      *                                  *-----------------------------*
      *                                  * Determinazione prezzo netto *
      *                                  *-----------------------------*
           move      w-rig-prz-acq (1)    to   w-cal-prz-net-prz      .
           move      w-rig-per-scr (1, 1) to   w-cal-prz-net-psc (1)  .
           move      w-rig-per-scr (1, 2) to   w-cal-prz-net-psc (2)  .
           move      w-rig-per-scr (1, 3) to   w-cal-prz-net-psc (3)  .
           move      w-rig-per-scr (1, 4) to   w-cal-prz-net-psc (4)  .
           move      w-rig-per-scr (1, 5) to   w-cal-prz-net-psc (5)  .
           perform   cal-prz-net-000      thru cal-prz-net-999        .
           move      w-cal-prz-net-prz    to   w-rig-prz-net (1)      .
       car-rig-cat-560.
      *                              *---------------------------------*
      *                              * Importo in riga                 *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Si prepara comunque quello  *
      *                                  * proveniente dalle bolle     *
      *                                  *-----------------------------*
           move      rf-bfr-imp-rig       to   w-rig-imp-rig (1)      .
      *                                  *-----------------------------*
      *                                  * Determinazione              *
      *                                  *-----------------------------*
           perform   det-imp-rig-000      thru det-imp-rig-999        .
       car-rig-cat-580.
      *                              *---------------------------------*
      *                              * Continuazione                   *
      *                              *---------------------------------*
           go to     car-rig-cat-600.
       car-rig-cat-600.
      *                      *-----------------------------------------*
      *                      * Valori non contenuti ne' direttamente   *
      *                      * e ne' indirettamente in record [bfr]    *
      *                      *-----------------------------------------*
           move      zero                 to   w-rig-num-mag-dlb (1)  .
           move      zero                 to   w-rig-num-mag-plb (1)  .
           move      spaces               to   w-rig-flg-ela (1)      .
           move      spaces               to   w-rig-flg-pul (1)      .
           move      spaces               to   w-rig-alx-exp (1)      .
       car-rig-cat-700.
      *                      *-----------------------------------------*
      *                      * Valori contenuti indirettamente in re-  *
      *                      * cord [bfr]                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Lettura archivio [dcp]              *
      *                          *-------------------------------------*
           move      w-rig-num-mag (1)    to   w-let-arc-dcp-cod      .
           move      w-tes-cod-lng (1)    to   w-let-arc-dcp-lng      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
      *                          *-------------------------------------*
      *                          * Si/No esistenza formato di acquisi- *
      *                          * zione                               *
      *                          *-------------------------------------*
           move      w-rig-tip-mag (1)    to   w-let-arc-aaf-tpm      .
           move      w-rig-num-mag (1)    to   w-let-arc-aaf-cdm      .
           move      w-tes-cod-arc (1)    to   w-let-arc-aaf-fnt      .
           move      w-rig-fda-pif (1)    to   w-let-arc-aaf-fda      .
           move      w-let-arc-dcp-des    to   w-let-arc-aaf-dmg      .
           perform   let-arc-aaf-000      thru let-arc-aaf-999        .
           if        w-let-arc-aaf-flg    =    spaces
                     move  "S"            to   w-rig-snx-fda (1)
           else      move  "N"            to   w-rig-snx-fda (1)      .
           if        w-let-arc-aaf-des    =    spaces
                     move  "N"            to   w-rig-snx-dep (1)
           else      move  "S"            to   w-rig-snx-dep (1)      .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Lettura preliminare file [bfx]  *
      *                              *---------------------------------*
           move      w-gen-prt-bfo        to   w-let-arc-bfx-prt      .
           move      w-brb-num-prg
                    (w-crc-wrk-ctr)       to   w-let-arc-bfx-prg      .
           move      11                   to   w-let-arc-bfx-trc      .
           perform   let-arc-bfx-000      thru let-arc-bfx-999        .
      *
           if        w-let-arc-bfx-flg    not  = spaces
                     go to car-rig-cat-705.
      *
           move      w-let-arc-bfx-des    to   w-rig-des-por (1)
                                               w-rig-des-rig (1)      .
      *
           go to     car-rig-cat-750.
       car-rig-cat-705.
      *                              *---------------------------------*
      *                              * Deviazione in funzione del tipo *
      *                              * di estensione                   *
      *                              *---------------------------------*
           if        w-rig-des-ext (1)    =    0
                     go to car-rig-cat-710
           else if   w-rig-des-ext (1)    =    1
                     go to car-rig-cat-720
           else if   w-rig-des-ext (1)    =    2
                     go to car-rig-cat-730
           else if   w-rig-des-ext (1)    =    3
                     go to car-rig-cat-740.
       car-rig-cat-710.
      *                              *---------------------------------*
      *                              * Se nessuna estensione : nessuna *
      *                              * azione in quanto la descrizione *
      *                              * e' gia' stata bufferizzata      *
      *                              *---------------------------------*
           go to     car-rig-cat-750.
       car-rig-cat-720.
      *                              *---------------------------------*
      *                              * Se estensione nel file [bfx]:   *
      *                              * nessuna azione in quanto la     *
      *                              * descrizione e' gia' stata buf-  *
      *                              * ferizzata                       *
      *                              *---------------------------------*
           go to     car-rig-cat-750.
       car-rig-cat-730.
      *                              *---------------------------------*
      *                              * Se estensione nel file [pdx]    *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Lettura archivio [dcp]      *
      *                                  *-----------------------------*
           move      w-rig-num-mag (1)    to   w-let-arc-dcp-cod      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
           move      w-let-arc-dcp-des    to   w-rig-des-por (1)
                                               w-rig-des-rig (1)      .
           go to     car-rig-cat-750.
       car-rig-cat-740.
      *                              *---------------------------------*
      *                              * Se estensione nel file [pdx] ma *
      *                              * con tipo record 13 o 33         *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Lettura archivio [dcp]      *
      *                                  *-----------------------------*
           move      w-rig-num-mag (1)    to   w-let-arc-dcp-cod      .
           move      w-tes-cod-lng (1)    to   w-let-arc-dcp-lng      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
      *                                  *-----------------------------*
      *                                  * Lettura archivio [aaf]      *
      *                                  *-----------------------------*
           move      w-rig-tip-mag (1)    to   w-let-arc-aaf-tpm      .
           move      w-rig-num-mag (1)    to   w-let-arc-aaf-cdm      .
           move      w-tes-cod-arc (1)    to   w-let-arc-aaf-fnt      .
           move      w-rig-fda-pif (1)    to   w-let-arc-aaf-fda      .
           move      w-let-arc-dcp-des    to   w-let-arc-aaf-dmg      .
           perform   let-arc-aaf-000      thru let-arc-aaf-999        .
           move      w-let-arc-aaf-des    to   w-rig-des-por (1)
                                               w-rig-des-rig (1)      .
           go to     car-rig-cat-750.
       car-rig-cat-750.
      *                              *---------------------------------*
      *                              * Si/No aggiornamenti di magazzi- *
      *                              * no                              *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Deviazione in funzione del  *
      *                                  * tipo magazzino              *
      *                                  *-----------------------------*
           if        w-rig-tip-mag (1)    =    01
                     go to car-rig-cat-752
           else if   w-rig-tip-mag (1)    =    03
                     go to car-rig-cat-754
           else if   w-rig-tip-mag (1)    =    04
                     go to car-rig-cat-756.
       car-rig-cat-752.
      *                                  *-----------------------------*
      *                                  * Tipo magazzino : Prodotto   *
      *                                  * di vendita                  *
      *                                  *-----------------------------*
           move      "S"                  to   w-rig-snx-mag (1)      .
           go to     car-rig-cat-760.
       car-rig-cat-754.
      *                                  *-----------------------------*
      *                                  * Tipo magazzino : Materia    *
      *                                  * prima                       *
      *                                  *-----------------------------*
           move      "S"                  to   w-rig-snx-mag (1)      .
           go to     car-rig-cat-760.
       car-rig-cat-756.
      *                                  *-----------------------------*
      *                                  * Tipo magazzino : Materiale  *
      *                                  * vario                       *
      *                                  *-----------------------------*
           move      w-rig-num-mag (1)    to   w-let-arc-mtv-cod      .
           perform   let-arc-mtv-000      thru let-arc-mtv-999        .
           move      w-let-arc-mtv-snm    to   w-rig-snx-mag (1)      .
           go to     car-rig-cat-760.
       car-rig-cat-760.
      *                          *-------------------------------------*
      *                          * Anagrafica codici iva               *
      *                          *-------------------------------------*
           move      w-rig-civ-rig (1)    to   w-let-arc-zci-cod      .
           perform   let-arc-zci-000      thru let-arc-zci-999        .
           move      w-let-arc-zci-des    to   w-rig-civ-rig-des (1)  .
      *                          *-------------------------------------*
      *                          * Anagrafica piano dei conti          *
      *                          *-------------------------------------*
           move      w-rig-ctp-rig (1)    to   w-let-arc-pdc-cod      .
           perform   let-arc-pdc-000      thru let-arc-pdc-999        .
           move      w-let-arc-pdc-des    to   w-rig-ctp-rig-des (1)  .
       car-rig-cat-780.
      *                  *---------------------------------------------*
      *                  * Update catena                               *
      *                  *---------------------------------------------*
           move      "UP"                 to   w-cat-rig-ope          .
           move      w-cat-rig-max        to   w-cat-rig-num          .
           move      w-rig                to   w-cat-rig-buf          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *              *-------------------------------------------------*
      *              * Riciclo su riga ordine successiva               *
      *              *-------------------------------------------------*
           go to     car-rig-cat-100.
       car-rig-cat-800.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     car-rig-cat-999.
       car-rig-cat-900.
      *              *-------------------------------------------------*
      *              * Messaggio di errore per esubero numero righe    *
      *              *-------------------------------------------------*
           move      "Numero righe documento oltre il massimo previsto !
      -              ""
                                          to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
       car-rig-cat-999.
           exit.

      *    *===========================================================*
      *    * Caricamento righe in catena                               *
      *    *                                                           *
      *    * Subroutine per eventuale update riga bolla                *
      *    *-----------------------------------------------------------*
       car-rig-cat-urb-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record [bfr]                    *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
       car-rig-cat-urb-100.
      *              *-------------------------------------------------*
      *              * Lettura record [bfr]                            *
      *              *-------------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-gen-prt-bfo        to   rf-bfr-num-prt         .
           move      w-brb-num-prg
                    (w-crc-wrk-ctr)       to   rf-bfr-num-prg         .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
       car-rig-cat-urb-200.
      *              *-------------------------------------------------*
      *              * Forzatura flag di riga chiusa                   *
      *              *-------------------------------------------------*
           move      "#"                  to   rf-bfr-flg-rch         .
       car-rig-cat-urb-400.
      *              *-------------------------------------------------*
      *              * Update record [bfr]                             *
      *              *-------------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *              *-------------------------------------------------*
      *              * Rilascio record [bfr]                           *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
       car-rig-cat-urb-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     car-rig-cat-urb-999.
       car-rig-cat-urb-999.
           exit.

      *    *===========================================================*
      *    * Richiamo sottoprogramma per gestione catena righe         *
      *    *-----------------------------------------------------------*
       cll-sub-cat-000.
           call      "pgm/ffo/prg/obj/pffo3002"
                                         using w-cat-rig              .
       cll-sub-cat-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione campi testata associati alla forma di pa- *
      *    * gamento                                                   *
      *    *-----------------------------------------------------------*
       nor-cpg-ass-000.
           move      zero                 to   w-nor-nok-reg-ctr      .
       nor-cpg-ass-200.
           add       1                    to   w-nor-nok-reg-ctr      .
           if        w-nor-nok-reg-ctr    >    3
                     go to nor-cpg-ass-999.
           move      zero                 to   w-tes-cod-pag
                                              (1, w-nor-nok-reg-ctr)  .
           move      zero                 to   w-tes-tip-amm
                                              (1, w-nor-nok-reg-ctr)  .
           move      zero                 to   w-tes-per-toi
                                              (1, w-nor-nok-reg-ctr)  .
           move      zero                 to   w-tes-dim-act
                                              (1, w-nor-nok-reg-ctr)  .
           move      zero                 to   w-tes-tip-pag
                                              (1, w-nor-nok-reg-ctr)  .
           move      zero                 to   w-tes-num-sca
                                              (1, w-nor-nok-reg-ctr)  .
           move      zero                 to   w-tes-dec-prs
                                              (1, w-nor-nok-reg-ctr)  .
           move      zero                 to   w-tes-dap-mes
                                              (1, w-nor-nok-reg-ctr)  .
           move      zero                 to   w-tes-dap-gio
                                              (1, w-nor-nok-reg-ctr)  .
           move      zero                 to   w-tes-ggg-int
                                              (1, w-nor-nok-reg-ctr)  .
           move      zero                 to   w-tes-tip-scm
                                              (1, w-nor-nok-reg-ctr)  .
           move      zero                 to   w-tes-gio-scm
                                              (1, w-nor-nok-reg-ctr)  .
           go to     nor-cpg-ass-200.
       nor-cpg-ass-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave riga corpo                *
      *    *-----------------------------------------------------------*
       nor-nok-rig-000.
           move      zero                 to   w-rig-num-prg (1)      .
           move      zero                 to   w-rig-bld-flb (1)      .
           move      zero                 to   w-rig-bld-tpb (1)      .
           move      zero                 to   w-rig-bld-rgb (1)      .
           move      spaces               to   w-rig-tip-rig (1)      .
           move      spaces               to   w-rig-tip-rig-tpr (1)  .
           move      spaces               to   w-rig-tip-rig-tfu (1)  .
           move      zero                 to   w-rig-tip-rig-cac (1)  .
           move      spaces               to   w-rig-tip-rig-ast (1)  .
           move      zero                 to   w-rig-tip-mag (1)      .
           move      zero                 to   w-rig-num-mag (1)      .
           move      zero                 to   w-rig-num-mag-dlb (1)  .
           move      zero                 to   w-rig-num-mag-plb (1)  .
           move      spaces               to   w-rig-alf-mag (1)      .
           move      spaces               to   w-rig-sgl-vrn (1)      .
           move      spaces               to   w-rig-snx-fda (1)      .
           move      spaces               to   w-rig-snx-dep (1)      .
           move      spaces               to   w-rig-fda-pif (1)      .
           move      spaces               to   w-rig-cop-sfn (1)      .
           move      spaces               to   w-rig-snx-tum (1)      .
           move      spaces               to   w-rig-umf-tum (1)      .
           move      zero                 to   w-rig-nde-tum (1)      .
           move      zero                 to   w-rig-cmo-tum (1)      .
           move      zero                 to   w-rig-cdi-tum (1)      .
           move      zero                 to   w-rig-des-ext (1)      .
           move      spaces               to   w-rig-des-por (1)      .
           move      spaces               to   w-rig-des-rig (1)      .
           move      zero                 to   w-rig-tip-pro (1)      .
           move      zero                 to   w-rig-civ-rig (1)      .
           move      spaces               to   w-rig-civ-rig-des (1)  .
           move      zero                 to   w-rig-ctp-rig (1)      .
           move      spaces               to   w-rig-ctp-rig-des (1)  .
           move      spaces               to   w-rig-umi-acq (1)      .
           move      zero                 to   w-rig-dec-qta (1)      .
           move      spaces               to   w-rig-snx-mag (1)      .
           move      zero                 to   w-rig-qta-fda (1)      .
           move      zero                 to   w-rig-qta-acq (1)      .
           move      zero                 to   w-rig-snx-2qt (1)      .
           move      zero                 to   w-rig-dec-2qt (1)      .
           move      zero                 to   w-rig-qta-a02 (1)      .
           move      zero                 to   w-rig-snx-3qt (1)      .
           move      zero                 to   w-rig-dec-3qt (1)      .
           move      zero                 to   w-rig-qta-a03 (1)      .
           move      zero                 to   w-rig-dec-prz (1)      .
           move      zero                 to   w-rig-prz-acq (1)      .
           move      zero                 to   w-rig-snx-2pz (1)      .
           move      zero                 to   w-rig-dec-2pz (1)      .
           move      zero                 to   w-rig-prz-a02 (1)      .
           move      spaces               to   w-rig-sgl-vpl (1)      .
           move      zero                 to   w-rig-dec-vpl (1)      .
           move      spaces               to   w-rig-tdc-vpl (1)      .
           move      zero                 to   w-rig-prz-vpl (1)      .
           move      zero                 to   w-rig-cdc-vpl (1)      .
           move      zero                 to   w-rig-ccr-vpl (1)      .
           move      zero                 to   w-rig-plm-vpl (1)      .
           move      spaces               to   w-rig-tlm-vpl (1)      .
           move      spaces               to   w-rig-map-vpl (1)      .
           move      zero                 to   w-rig-epz-rgf (1)      .
           move      zero                 to   w-rig-csr-aap (1)      .
           move      zero                 to   w-rig-psr-aap (1, 1)   .
           move      zero                 to   w-rig-psr-aap (1, 2)   .
           move      zero                 to   w-rig-psr-aap (1, 3)   .
           move      zero                 to   w-rig-psr-aap (1, 4)   .
           move      zero                 to   w-rig-psr-aap (1, 5)   .
           move      zero                 to   w-rig-per-scr (1, 1)   .
           move      zero                 to   w-rig-per-scr (1, 2)   .
           move      zero                 to   w-rig-per-scr (1, 3)   .
           move      zero                 to   w-rig-per-scr (1, 4)   .
           move      zero                 to   w-rig-per-scr (1, 5)   .
           move      spaces               to   w-rig-per-scr-ffp (1)  .
           move      zero                 to   w-rig-prz-net (1)      .
           move      zero                 to   w-rig-imp-rig (1)      .
           move      zero                 to   w-rig-iau-rig (1)      .
           move      zero                 to   w-rig-cpv-aap (1)      .
           move      zero                 to   w-rig-ppv-aap (1, 1)   .
           move      zero                 to   w-rig-ppv-aap (1, 2)   .
           move      zero                 to   w-rig-ppv-aap (1, 3)   .
           move      zero                 to   w-rig-fsp-rig (1)      .
           move      zero                 to   w-rig-cpv-rig (1)      .
           move      zero                 to   w-rig-ppv-rig (1, 1)   .
           move      zero                 to   w-rig-ppv-rig (1, 2)   .
           move      zero                 to   w-rig-ppv-rig (1, 3)   .
           move      zero                 to   w-rig-pvf-rig (1)      .
           move      spaces               to   w-rig-bfo-tip (1)      .
           move      zero                 to   w-rig-bfo-dat (1)      .
           move      zero                 to   w-rig-bfo-prt (1)      .
           move      zero                 to   w-rig-bfo-prg (1)      .
           move      zero                 to   w-rig-bfo-ddo (1)      .
           move      spaces               to   w-rig-bfo-ndo (1)      .
           move      spaces               to   w-rig-flg-ela (1)      .
           move      spaces               to   w-rig-flg-pul (1)      .
           move      spaces               to   w-rig-alx-exp (1)      .
       nor-nok-rig-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento valori movimenti di magazzino generati a    *
      *    * suo tempo dalle bolle fornitori                           *
      *    *-----------------------------------------------------------*
       agg-mag-bfo-000.
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Se zero elementi nel buffer protocolli bolle    *
      *              * fornitori trattate, si ricostruisce tale buf-   *
      *              * fer, rileggendo la catena righe                 *
      *              *-------------------------------------------------*
           if        w-pbf-num-ele        not  = zero
                     go to agg-mag-bfo-080.
      *                  *---------------------------------------------*
      *                  * Start su righe corpo                        *
      *                  *---------------------------------------------*
           move      "ST"                 to   w-cat-rig-ope          .
           move      1                    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *                  *---------------------------------------------*
      *                  * Se start non valida : oltre                 *
      *                  *---------------------------------------------*
           if        w-cat-rig-exs        not  = spaces
                     go to agg-mag-bfo-080.
       agg-mag-bfo-020.
      *                  *---------------------------------------------*
      *                  * Lettura sequenziale righe corpo             *
      *                  *---------------------------------------------*
           move      "RN"                 to   w-cat-rig-ope          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *                  *---------------------------------------------*
      *                  * Se at end : oltre                           *
      *                  *---------------------------------------------*
           if        w-cat-rig-exs        not  = spaces
                     go to agg-mag-bfo-080.
      *                  *---------------------------------------------*
      *                  * Movimento da buffer catena movimenti a work *
      *                  *---------------------------------------------*
           move      w-cat-rig-buf        to   w-rig                  .
      *                  *---------------------------------------------*
      *                  * Test se riga fattura a fronte bolla         *
      *                  *---------------------------------------------*
           if        w-rig-bfo-prt (1)    =    zero
                     go to agg-mag-bfo-020.
      *                  *---------------------------------------------*
      *                  * Test se protocollo bolla gia' memorizzato   *
      *                  *---------------------------------------------*
           move      zero                 to   w-pbf-ctr-001          .
       agg-mag-bfo-040.
           add       1                    to   w-pbf-ctr-001          .
           if        w-pbf-ctr-001        >    w-pbf-num-ele
                     go to agg-mag-bfo-060.
           if        w-rig-bfo-prt (1)    =    w-pbf-num-prt
                                              (w-pbf-ctr-001)
                     go to agg-mag-bfo-020.
           go to     agg-mag-bfo-040.
       agg-mag-bfo-060.
           if        w-pbf-num-ele        <    w-pbf-max-ele
                     add   1              to   w-pbf-num-ele          .
           move      w-rig-bfo-prt (1)    to   w-pbf-num-prt
                                              (w-pbf-num-ele)         .
           go to     agg-mag-bfo-020.
       agg-mag-bfo-080.
      *              *-------------------------------------------------*
      *              * Ciclo di scansione buffer protocolli bolle for- *
      *              * nitori trattate                                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-pbf-ctr-001          .
       agg-mag-bfo-100.
           add       1                    to   w-pbf-ctr-001          .
           if        w-pbf-ctr-001        >    w-pbf-num-ele
                     go to agg-mag-bfo-999.
      *                  *---------------------------------------------*
      *                  * Lettura record [bft]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-pbf-num-prt
                    (w-pbf-ctr-001)       to   rf-bft-num-prt         .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *                  *---------------------------------------------*
      *                  * Se record non trovato : riciclo             *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to agg-mag-bfo-100.
      *                  *---------------------------------------------*
      *                  * Se non e' stato generato alcun movimento di *
      *                  * magazzino a fronte della bolla : riciclo    *
      *                  *---------------------------------------------*
           if        rf-bft-prt-mag       =    zero
                     go to agg-mag-bfo-100.
       agg-mag-bfo-120.
      *                  *---------------------------------------------*
      *                  * Controllo tipo movimento bolla fornitore    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se tipo movimento non esistente : ri-   *
      *                      * ciclo                                   *
      *                      *-----------------------------------------*
           if        rf-bft-cod-tmb       =    spaces
                     go to agg-mag-bfo-100.
      *                      *-----------------------------------------*
      *                      * Lettura record [ybf] principale         *
      *                      *-----------------------------------------*
           move      rf-bft-cod-tmb       to   w-let-arc-ybf-cod      .
           move      zero                 to   w-let-arc-ybf-dpz      .
           perform   let-arc-ybf-000      thru let-arc-ybf-999        .
      *                      *-----------------------------------------*
      *                      * Se record non trovato : riciclo         *
      *                      *-----------------------------------------*
           if        w-let-arc-ybf-flg    not  = spaces
                     go to agg-mag-bfo-100.
      *                      *-----------------------------------------*
      *                      * Bufferizzazione causale di magazzino    *
      *                      *-----------------------------------------*
           move      w-let-arc-ybf-cam    to   w-agg-mag-bfo-cam      .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione codice conto merce      *
      *                      *-----------------------------------------*
           move      w-let-arc-ybf-ctm    to   w-agg-mag-bfo-ctm      .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione codice dislocazione di  *
      *                      * default                                 *
      *                      *-----------------------------------------*
           move      w-let-arc-ybf-dsl    to   w-agg-mag-bfo-ddd      .
      *                      *-----------------------------------------*
      *                      * Lettura record [ybf] della dipendenza   *
      *                      *-----------------------------------------*
           move      rf-bft-cod-tmb       to   w-let-arc-ybf-cod      .
           move      rf-bft-cod-dpz       to   w-let-arc-ybf-dpz      .
           perform   let-arc-ybf-000      thru let-arc-ybf-999        .
      *                      *-----------------------------------------*
      *                      * Se record esistente si bufferizza il    *
      *                      * codice dislocazione in esso contenuto,  *
      *                      * altrimenti si bufferizza quello di de-  *
      *                      * fault                                   *
      *                      *                                         *
      *                      * ___ DA SISTEMARE ___ dipendenza ???     *
      *                      *-----------------------------------------*
______*    if        w-let-arc-ybf-flg    =    spaces
______*              move  w-let-arc-ybf-dsl
______*                                   to   w-agg-mag-bfo-dsl
______*    else      move  w-agg-mag-bfo-ddd
______*                                   to   w-agg-mag-bfo-dsl      .
      
           move      w-agg-mag-bfo-ddd    to   w-agg-mag-bfo-dsl      .
       agg-mag-bfo-140.
      *                  *---------------------------------------------*
      *                  * Controllo causale di magazzino              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se causale di magazzino non esisten-    *
      *                      * te : riciclo                            *
      *                      *-----------------------------------------*
           if        w-agg-mag-bfo-cam    =    zero
                     go to agg-mag-bfo-100.
      *                      *-----------------------------------------*
      *                      * Lettura record [zmc]                    *
      *                      *-----------------------------------------*
           move      w-agg-mag-bfo-cam    to   w-let-arc-zmc-cod      .
           perform   let-arc-zmc-000      thru let-arc-zmc-999        .
      *                      *-----------------------------------------*
      *                      * Se record non trovato : riciclo         *
      *                      *-----------------------------------------*
           if        w-let-arc-zmc-flg    not  = spaces
                     go to agg-mag-bfo-100.
      *                      *-----------------------------------------*
      *                      * Se tipo trattamento valore della cau-   *
      *                      * sale non per impostazione diretta : ri- *
      *                      * ciclo                                   *
      *                      *-----------------------------------------*
           if        w-let-arc-zmc-trv    not  = "I"
                     go to agg-mag-bfo-100.
      *                      *-----------------------------------------*
      *                      * Se causale non di carico : riciclo      *
      *                      *-----------------------------------------*
           if        w-let-arc-zmc-tip    not  = 01
                     go to agg-mag-bfo-100.
       agg-mag-bfo-160.
      *                  *---------------------------------------------*
      *                  * Cancellazione movimento di magazzino pre-   *
      *                  * cedente                                     *
      *                  *---------------------------------------------*
           move      "DE"                 to   l-mag-300-tip-ope      .
           move      rf-bft-dat-reg       to   l-mag-300-dat-reg      .
           move      rf-bft-prt-mag       to   l-mag-300-num-prt      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
       agg-mag-bfo-200.
      *                  *---------------------------------------------*
      *                  * Scrittura testata nuovo movimento di magaz- *
      *                  * zino                                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione testata                 *
      *                      *-----------------------------------------*
           move      "NT"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Scrittura testata                       *
      *                      *-----------------------------------------*
           move      "WT"                 to   l-mag-300-tip-ope      .
           move      rf-bft-dat-reg       to   l-mag-300-dat-reg      .
           move      rf-bft-prt-mag       to   l-mag-300-num-prt      .
           move      rf-bft-cod-dpz       to   l-mag-300-cod-dpz      .
           move      w-agg-mag-bfo-cam    to   l-mag-300-cod-cau      .
           move      w-agg-mag-bfo-ctm    to   l-mag-300-cod-ctm      .
           move      rf-bft-dat-doc       to   l-mag-300-dat-doc      .
           move      rf-bft-num-doc       to   l-mag-300-num-doc      .
           move      w-agg-mag-bfo-dsl    to   l-mag-300-cod-dsl      .
           move      spaces               to   l-mag-300-cod-dsd      .
           move      rf-bft-tip-arc       to   l-mag-300-tip-arc      .
           move      rf-bft-cod-arc       to   l-mag-300-cod-arc      .
           move      rf-bft-dpz-arc       to   l-mag-300-dpz-arc      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                          *-------------------------------------*
      *                          * Test su esito operazione            *
      *                          *-------------------------------------*
           if        l-mag-300-exi-sts    not  = spaces
                     go to agg-mag-bfo-600.
       agg-mag-bfo-300.
      *                  *---------------------------------------------*
      *                  * Scrittura righe nuovo movimento di magazzi- *
      *                  * no                                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Inizializzazione contatore righe scrit- *
      *                      * te                                      *
      *                      *-----------------------------------------*
           move      zero                 to   w-agg-mag-bfo-ctr      .
      *                      *-----------------------------------------*
      *                      * Start su file [bfr]                     *
      *                      *-----------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NUMPRT    "         to   f-key                  .
           move      rf-bft-num-prt       to   rf-bfr-num-prt         .
           move      zero                 to   rf-bfr-num-prg         .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                          *-------------------------------------*
      *                          * Test su esito operazione            *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to agg-mag-bfo-500.
       agg-mag-bfo-320.
      *                      *-----------------------------------------*
      *                      * Lettura sequenziale record [bfr]        *
      *                      *-----------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                          *-------------------------------------*
      *                          * Test se 'At End'                    *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to agg-mag-bfo-500.
      *                      *-----------------------------------------*
      *                      * Test sul massimo                        *
      *                      *-----------------------------------------*
           if        rf-bfr-num-prt       not  = rf-bft-num-prt
                     go to agg-mag-bfo-500.
      *                      *-----------------------------------------*
      *                      * Selezioni sul record                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Selezione su tipo riga              *
      *                          *-------------------------------------*
           move      rf-bfr-tip-rig       to   w-agg-mag-bfo-tri      .
           if        w-agg-mag-bfo-tpr    not  = "P" and
                     w-agg-mag-bfo-tpr    not  = "M" and
                     w-agg-mag-bfo-tpr    not  = "V"
                     go to agg-mag-bfo-320.
           if        w-agg-mag-bfo-tfu    not  = spaces
                     go to agg-mag-bfo-320.
      *                          *-------------------------------------*
      *                          * Selezione su tipo prodotto          *
      *                          *-------------------------------------*
           if        rf-bfr-tip-pro       not  = 01
                     go to agg-mag-bfo-320.
      *                          *-------------------------------------*
      *                          * Selezione su flag di scrittura mo-  *
      *                          * vimenti di magazzino                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Test se da effettuare           *
      *                              *---------------------------------*
           if        rf-bfr-tip-mag       not  = 04
                     go to agg-mag-bfo-340.
      *                              *---------------------------------*
      *                              * Lettura record [mtv]            *
      *                              *---------------------------------*
           move      rf-bfr-num-mag       to   w-let-arc-mtv-cod      .
           perform   let-arc-mtv-000      thru let-arc-mtv-999        .
      *                              *---------------------------------*
      *                              * Test di selezione               *
      *                              *---------------------------------*
           if        w-let-arc-mtv-snm    not  = "S"
                     go to agg-mag-bfo-320.
       agg-mag-bfo-340.
      *                      *-----------------------------------------*
      *                      * Incremento contatore righe scritte      *
      *                      *-----------------------------------------*
           add       1                    to   w-agg-mag-bfo-ctr      .
      *                      *-----------------------------------------*
      *                      * Normalizzazione costo unitario          *
      *                      *-----------------------------------------*
           move      zero                 to   w-agg-mag-bfo-cun      .
      *                      *-----------------------------------------*
      *                      * Normalizzazione valore movimento        *
      *                      *-----------------------------------------*
           move      zero                 to   w-agg-mag-bfo-vlm      .
      *                      *-----------------------------------------*
      *                      * Normalizzazione totali sconti           *
      *                      *-----------------------------------------*
           move      zero                 to   w-agg-mag-bfo-tsc      .
      *                      *-----------------------------------------*
      *                      * Normalizzazione totale lordo            *
      *                      *-----------------------------------------*
           move      zero                 to   w-agg-mag-bfo-tlo      .
      *                      *-----------------------------------------*
      *                      * Determinazione valore movimento         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione in base al valore in *
      *                          * fattura                             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Start su file [ffr]             *
      *                              *---------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "RIFBFO    "         to   f-key                  .
           move      rf-bfr-cod-dpz       to   rf-ffr-cod-dpz         .
           move      rf-bfr-num-prt       to   rf-ffr-bfo-prt         .
           move      rf-bfr-num-prg       to   rf-ffr-bfo-prg         .
           move      zero                 to   rf-ffr-num-prt         .
           move      zero                 to   rf-ffr-num-prg         .
           move      "pgm/ffo/fls/ioc/obj/iofffr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ffr                 .
      *                              *---------------------------------*
      *                              * Test su esito operazione        *
      *                              *---------------------------------*
           if        f-sts                not  = e-not-err
                     go to agg-mag-bfo-360.
      *                              *---------------------------------*
      *                              * Lettura primo record [ffr]      *
      *                              *---------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/ffo/fls/ioc/obj/iofffr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ffr                 .
      *                              *---------------------------------*
      *                              * Test se 'At End'                *
      *                              *---------------------------------*
           if        f-sts                not  = e-not-err
                     go to agg-mag-bfo-360.
      *                              *---------------------------------*
      *                              * Test sul massimo                *
      *                              *---------------------------------*
           if        rf-ffr-cod-dpz       not  = rf-bfr-cod-dpz or
                     rf-ffr-bfo-prt       not  = rf-bfr-num-prt or
                     rf-ffr-bfo-prg       not  = rf-bfr-num-prg
                     go to agg-mag-bfo-360.
      *                              *---------------------------------*
      *                              * Determinazione costo unitario   *
      *                              * fatturato                       *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Spostamento in work di co-  *
      *                                  * modo                        *
      *                                  *-----------------------------*
           move      rf-ffr-imp-rig       to   w-agg-mag-bfo-vlm      .
      *                                  *-----------------------------*
      *                                  * Eventuale abbattimento con  *
      *                                  * sconto in chiusura e sconto *
      *                                  * pagamento in fattura        *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Lettura record [fft]    *
      *                                      *-------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      rf-ffr-num-prt       to   rf-fft-num-prt         .
           move      "pgm/ffo/fls/ioc/obj/ioffft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fft                 .
      *                                      *-------------------------*
      *                                      * Test su esito lettura   *
      *                                      *-------------------------*
           if        f-sts                not  = e-not-err
                     go to agg-mag-bfo-350.
      *                                      *-------------------------*
      *                                      * Se contropartita sconto *
      *                                      * in chiusura a zero :    *
      *                                      * bufferizzazione importo *
      *                                      * sconto in chiusura      *
      *                                      *-------------------------*
           if        rf-fft-ccp-scc       =    zero
                     add   rf-fft-tot-scc to   w-agg-mag-bfo-tsc      .
      *                                      *-------------------------*
      *                                      * Se contropartita sconto *
      *                                      * pagamento a zero : buf- *
      *                                      * ferizzazione importo    *
      *                                      * sconto pagamento        *
      *                                      *-------------------------*
           if        rf-fft-ccp-scp       =    zero
                     add   rf-fft-tot-scp to   w-agg-mag-bfo-tsc      .
      *                                      *-------------------------*
      *                                      * Se totale sconti a zero *
      *                                      * oltre                   *
      *                                      *-------------------------*
           if        w-agg-mag-bfo-tsc    =    zero
                     go to agg-mag-bfo-350.
      *                                      *-------------------------*
      *                                      * Determinazione totale   *
      *                                      * lordo                   *
      *                                      *-------------------------*
           move      zero                 to   w-agg-mag-bfo-tlo      .
           add       rf-fft-tot-rig (1)   to   w-agg-mag-bfo-tlo      .
           add       rf-fft-tot-rig (2)   to   w-agg-mag-bfo-tlo      .
           add       rf-fft-tot-rig (3)   to   w-agg-mag-bfo-tlo      .
           add       rf-fft-tot-rig (4)   to   w-agg-mag-bfo-tlo      .
           add       rf-fft-tot-rig (5)   to   w-agg-mag-bfo-tlo      .
           add       rf-fft-tot-rig (6)   to   w-agg-mag-bfo-tlo      .
           add       rf-fft-tot-rig (7)   to   w-agg-mag-bfo-tlo      .
           add       rf-fft-tot-rig (8)   to   w-agg-mag-bfo-tlo      .
           add       rf-fft-tot-rig (9)   to   w-agg-mag-bfo-tlo      .
      *                                      *-------------------------*
      *                                      * Abbattimento importo in *
      *                                      * riga                    *
      *                                      *-------------------------*
           multiply  w-agg-mag-bfo-tsc    by   w-agg-mag-bfo-vlm
                                        giving w-agg-mag-bfo-s17      .
           divide    w-agg-mag-bfo-tlo    into w-agg-mag-bfo-s17
                                        giving w-agg-mag-bfo-s11
                                               rounded                .
           subtract  w-agg-mag-bfo-s11    from w-agg-mag-bfo-vlm      .
       agg-mag-bfo-350.
      *                                  *-----------------------------*
      *                                  * Conversione in valuta base  *
      *                                  *-----------------------------*
           move      rf-ffr-sgl-vpf       to   w-cvs-vlt-sgl          .
           move      rf-ffr-dec-vpf       to   w-cvs-vlt-dec          .
           move      rf-ffr-tdc-vpf       to   w-cvs-vlt-tdc          .
           move      rf-ffr-cdc-vpf       to   w-cvs-vlt-cdc          .
           move      w-agg-mag-bfo-vlm    to   w-cvs-vlt-aav          .
           perform   cvs-alt-vlb-000      thru cvs-alt-vlb-999        .
           move      w-cvs-vlt-avb        to   w-agg-mag-bfo-vlm      .
      *                                  *-----------------------------*
      *                                  * Test su personalizzazione   *
      *                                  * relativa all'espressione    *
      *                                  * dei costi unitari in unita' *
      *                                  * di misura diversa           *
      *                                  *-----------------------------*
           if        w-prs-arg-mag-ecu    =    "N"
                     go to agg-mag-bfo-353.
      *                                  *-----------------------------*
      *                                  * Questo punto andrebbe per-  *
      *                                  * fezionato per confronto tra *
      *                                  * il tipo di trasformazione   *
      *                                  * unita' di misura e i coef.  *
      *                                  * ___ MIGLIORARE !!! ___      *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Test solo per 1000      *
      *                                      *-------------------------*
           if        w-prs-arg-mag-ecu    not  = "K"
                     go to agg-mag-bfo-353.
      *                                      *-------------------------*
      *                                      * Determinazione costo    *
      *                                      * unitario                *
      *                                      *-------------------------*
           divide    rf-ffr-qta-fda       into w-agg-mag-bfo-vlm
                                        giving w-agg-mag-bfo-cun
                                               rounded                .
      *                                      *-------------------------*
      *                                      * Determinazione valore   *
      *                                      * movimento               *
      *                                      *-------------------------*
           divide    rf-ffr-qta-acq       into w-agg-mag-bfo-vlm
                                        giving w-agg-mag-bfo-cuw
                                               rounded                .
      *
           multiply  rf-ffr-qta-acq       by   w-agg-mag-bfo-cuw
                                        giving w-agg-mag-bfo-vlm      .
      *                                      *-------------------------*
      *                                      * Oltre                   *
      *                                      *-------------------------*
           go to     agg-mag-bfo-355.
       agg-mag-bfo-353.
      *                                  *-----------------------------*
      *                                  * Costo unitario              *
      *                                  *-----------------------------*
           divide    rf-ffr-qta-acq       into w-agg-mag-bfo-vlm
                                        giving w-agg-mag-bfo-cun
                                               rounded                .
      *                                  *-----------------------------*
      *                                  * Valore movimento            *
      *                                  *-----------------------------*
           multiply  rf-ffr-qta-acq       by   w-agg-mag-bfo-cun
                                        giving w-agg-mag-bfo-vlm      .
       agg-mag-bfo-355.
      *                                  *-----------------------------*
      *                                  * Applicazione % maggioraz.   *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Test se da applicare    *
      *                                      *-------------------------*
           if        w-prs-snx-mpa        not  = "S"
                     go to agg-mag-bfo-359.
           if        w-agg-mag-bfo-cun    =    zero
                     go to agg-mag-bfo-359.
      *                                      *-------------------------*
      *                                      * Lettura % di maggioraz. *
      *                                      *-------------------------*
           move      rf-ffr-tip-mag       to   w-let-arc-aaf-tpm      .
           move      rf-ffr-num-mag       to   w-let-arc-aaf-cdm      .
           move      rf-ffr-cod-arc       to   w-let-arc-aaf-fnt      .
           move      rf-ffr-fda-pif       to   w-let-arc-aaf-fda      .
           perform   let-arc-aaf-000      thru let-arc-aaf-999        .
           if        w-let-arc-aaf-mpa    =    zero
                     go to agg-mag-bfo-359.
      *                                      *-------------------------*
      *                                      * Calcolo                 *
      *                                      *-------------------------*
           move      zero                 to   w-agg-mag-bfo-mpa      .
           multiply  w-let-arc-aaf-mpa    by   w-agg-mag-bfo-cun
                                        giving w-agg-mag-bfo-mpa      .
           divide    100                  into w-agg-mag-bfo-mpa
                                       rounded                        .
           add       w-agg-mag-bfo-mpa    to   w-agg-mag-bfo-cun      .
      *                                      *-------------------------*
      *                                      * Aggiornamento valore    *
      *                                      *-------------------------*
           multiply  rf-ffr-qta-acq       by   w-agg-mag-bfo-cun
                                        giving w-agg-mag-bfo-vlm      .
       agg-mag-bfo-359.
      *                                  *-----------------------------*
      *                                  * A scrittura riga movimento  *
      *                                  * di magazzino                *
      *                                  *-----------------------------*
           go to     agg-mag-bfo-400.
       agg-mag-bfo-360.
      *                          *-------------------------------------*
      *                          * Determinazione in base al valore in *
      *                          * bolla                               *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Determinazione costo unitario   *
      *                              * in bolla                        *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Spostamento in work di co-  *
      *                                  * modo                        *
      *                                  *-----------------------------*
           move      rf-bfr-imp-rig       to   w-agg-mag-bfo-vlm      .
      *                                  *-----------------------------*
      *                                  * Eventuale abbattimento con  *
      *                                  * sconto in chiusura e sconto *
      *                                  * pagamento in bolla          *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Normalizzazione totali  *
      *                                      * sconti                  *
      *                                      *-------------------------*
           move      zero                 to   w-agg-mag-bfo-tsc      .
      *                                      *-------------------------*
      *                                      * Se contropartita sconto *
      *                                      * in chiusura a zero :    *
      *                                      * bufferizzazione importo *
      *                                      * sconto in chiusura      *
      *                                      *-------------------------*
           if        rf-bft-ccp-scc       =    zero
                     move  rf-bft-tot-scc to   w-agg-mag-bfo-tsc      .
      *                                      *-------------------------*
      *                                      * Se contropartita sconto *
      *                                      * pagamento a zero : buf- *
      *                                      * ferizzazione importo    *
      *                                      * sconto pagamento        *
      *                                      *-------------------------*
           if        rf-bft-ccp-scp       =    zero
                     move  rf-bft-tot-scp to   w-agg-mag-bfo-tsc      .
      *                                      *-------------------------*
      *                                      * Se totale sconti a zero *
      *                                      * oltre                   *
      *                                      *-------------------------*
           if        w-agg-mag-bfo-tsc    =    zero
                     go to agg-mag-bfo-370.
      *                                      *-------------------------*
      *                                      * Determinazione totale   *
      *                                      * lordo                   *
      *                                      *-------------------------*
           move      zero                 to   w-agg-mag-bfo-tlo      .
           add       rf-bft-tot-rig (1)   to   w-agg-mag-bfo-tlo      .
           add       rf-bft-tot-rig (2)   to   w-agg-mag-bfo-tlo      .
           add       rf-bft-tot-rig (3)   to   w-agg-mag-bfo-tlo      .
           add       rf-bft-tot-rig (4)   to   w-agg-mag-bfo-tlo      .
           add       rf-bft-tot-rig (5)   to   w-agg-mag-bfo-tlo      .
           add       rf-bft-tot-rig (6)   to   w-agg-mag-bfo-tlo      .
           add       rf-bft-tot-rig (7)   to   w-agg-mag-bfo-tlo      .
           add       rf-bft-tot-rig (8)   to   w-agg-mag-bfo-tlo      .
           add       rf-bft-tot-rig (9)   to   w-agg-mag-bfo-tlo      .
      *                                      *-------------------------*
      *                                      * Abbattimento importo in *
      *                                      * riga                    *
      *                                      *-------------------------*
           multiply  w-agg-mag-bfo-tsc    by   w-agg-mag-bfo-vlm
                                        giving w-agg-mag-bfo-s17      .
           divide    w-agg-mag-bfo-tlo    into w-agg-mag-bfo-s17
                                        giving w-agg-mag-bfo-s11
                                               rounded                .
           subtract  w-agg-mag-bfo-s11    from w-agg-mag-bfo-vlm      .
       agg-mag-bfo-370.
      *                                  *-----------------------------*
      *                                  * Conversione in valuta base  *
      *                                  *-----------------------------*
           move      rf-bfr-sgl-vpf       to   w-cvs-vlt-sgl          .
           move      rf-bfr-dec-vpf       to   w-cvs-vlt-dec          .
           move      rf-bfr-tdc-vpf       to   w-cvs-vlt-tdc          .
           move      rf-bfr-cdc-vpf       to   w-cvs-vlt-cdc          .
           move      w-agg-mag-bfo-vlm    to   w-cvs-vlt-aav          .
           perform   cvs-alt-vlb-000      thru cvs-alt-vlb-999        .
           move      w-cvs-vlt-avb        to   w-agg-mag-bfo-vlm      .
      *                                  *-----------------------------*
      *                                  * Test su personalizzazione   *
      *                                  * relativa all'espressione    *
      *                                  * dei costi unitari in unita' *
      *                                  * di misura diversa           *
      *                                  *-----------------------------*
           if        w-prs-arg-mag-ecu    =    "N"
                     go to agg-mag-bfo-375.
      *                                  *-----------------------------*
      *                                  * Questo punto andrebbe per-  *
      *                                  * fezionato per confronto tra *
      *                                  * il tipo di trasformazione   *
      *                                  * unita' di misura e i coef.  *
      *                                  * ___ MIGLIORARE !!! ___      *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Test solo per 1000      *
      *                                      *-------------------------*
           if        w-prs-arg-mag-ecu    not  = "K"
                     go to agg-mag-bfo-375.
      *                                      *-------------------------*
      *                                      * Determinazione costo    *
      *                                      * unitario                *
      *                                      *-------------------------*
           divide    rf-bfr-qta-fda       into w-agg-mag-bfo-vlm
                                        giving w-agg-mag-bfo-cun
                                               rounded                .
      *                                      *-------------------------*
      *                                      * Oltre                   *
      *                                      *-------------------------*
           go to     agg-mag-bfo-380.
       agg-mag-bfo-375.
      *                                  *-----------------------------*
      *                                  * Determinazione              *
      *                                  *-----------------------------*
           divide    rf-bfr-qta-acq       into w-agg-mag-bfo-vlm
                                        giving w-agg-mag-bfo-cun
                                               rounded                .
      *                                      *-------------------------*
      *                                      * Oltre                   *
      *                                      *-------------------------*
           go to     agg-mag-bfo-380.
       agg-mag-bfo-380.
      *                                  *-----------------------------*
      *                                  * Applicazione % maggioraz.   *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Test se da applicare    *
      *                                      *-------------------------*
           if        w-prs-snx-mpa        not  = "S"
                     go to agg-mag-bfo-390.
           if        w-agg-mag-bfo-cun    =    zero
                     go to agg-mag-bfo-390.
      *                                      *-------------------------*
      *                                      * Lettura % di maggioraz. *
      *                                      *-------------------------*
           move      rf-bfr-tip-mag       to   w-let-arc-aaf-tpm      .
           move      rf-bfr-num-mag       to   w-let-arc-aaf-cdm      .
           move      rf-bfr-cod-arc       to   w-let-arc-aaf-fnt      .
           move      rf-bfr-fda-pif       to   w-let-arc-aaf-fda      .
           perform   let-arc-aaf-000      thru let-arc-aaf-999        .
           if        w-let-arc-aaf-mpa    =    zero
                     go to agg-mag-bfo-390.
      *                                      *-------------------------*
      *                                      * Calcolo                 *
      *                                      *-------------------------*
           move      zero                 to   w-agg-mag-bfo-mpa      .
           multiply  w-let-arc-aaf-mpa    by   w-agg-mag-bfo-cun
                                        giving w-agg-mag-bfo-mpa      .
           divide    100                  into w-agg-mag-bfo-mpa
                                       rounded                        .
           add       w-agg-mag-bfo-mpa    to   w-agg-mag-bfo-cun      .
      *                                      *-------------------------*
      *                                      * Aggiornamento valore    *
      *                                      *-------------------------*
           multiply  rf-bfr-qta-acq       by   w-agg-mag-bfo-cun
                                        giving w-agg-mag-bfo-vlm      .
       agg-mag-bfo-390.
      *                                  *-----------------------------*
      *                                  * A scrittura riga movimento  *
      *                                  * di magazzino                *
      *                                  *-----------------------------*
           go to     agg-mag-bfo-400.
       agg-mag-bfo-400.
      *                      *-----------------------------------------*
      *                      * Normalizzazione riga                    *
      *                      *-----------------------------------------*
           move      "NR"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Scrittura riga                          *
      *                      *-----------------------------------------*
           move      "WR"                 to   l-mag-300-tip-ope      .
           move      rf-bfr-tip-mag       to   l-mag-300-tip-mag      .
           move      rf-bfr-num-mag       to   l-mag-300-num-mag      .
           move      rf-bfr-alf-mag       to   l-mag-300-alf-mag      .
           move      rf-bfr-sgl-vrn       to   l-mag-300-var-mag      .
           move      rf-bfr-umi-acq       to   l-mag-300-udm-ana      .
           move      rf-bfr-umi-acq       to   l-mag-300-udm-mov      .
           move      zero                 to   l-mag-300-num-pmg      .
           move      rf-bfr-orf-dat       to   l-mag-300-ddo-rif      .
           move      rf-bfr-orf-num
                    (06 : 06)             to   l-mag-300-ndo-rif      .
           move      rf-bfr-qta-acq       to   l-mag-300-qta-mov      .
           move      w-agg-mag-bfo-cun    to   l-mag-300-cun-mov      .
           move      w-agg-mag-bfo-vlm    to   l-mag-300-val-mov      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                          *-------------------------------------*
      *                          * Test su esito operazione            *
      *                          *-------------------------------------*
           if        l-mag-300-exi-sts    not  = spaces
                     go to agg-mag-bfo-600.
      *                      *-----------------------------------------*
      *                      * Riciclo su lettura sequenziale record   *
      *                      * [bfr]                                   *
      *                      *-----------------------------------------*
           go to     agg-mag-bfo-320.
       agg-mag-bfo-500.
      *                      *-----------------------------------------*
      *                      * Su numero righe movimento scritte a ze- *
      *                      * ro a cancellazione intero movimento     *
      *                      *-----------------------------------------*
           if        w-agg-mag-bfo-ctr    =    zero
                     go to agg-mag-bfo-600.
      *                      *-----------------------------------------*
      *                      * A riciclo su prossimo numero protocollo *
      *                      * bolle fornitore trattato                *
      *                      *-----------------------------------------*
           go to     agg-mag-bfo-700.
       agg-mag-bfo-600.
      *                  *---------------------------------------------*
      *                  * Cancellazione movimento di magazzino in ca- *
      *                  * so di errori occorsi durante la scrittura   *
      *                  * del movimento stesso                        *
      *                  *---------------------------------------------*
           move      "DE"                 to   l-mag-300-tip-ope      .
           move      rf-bft-dat-reg       to   l-mag-300-dat-reg      .
           move      rf-bft-prt-mag       to   l-mag-300-num-prt      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
       agg-mag-bfo-700.
      *                  *---------------------------------------------*
      *                  * Riciclo su prossimo numero protocollo bolle *
      *                  * fornitore trattato                          *
      *                  *---------------------------------------------*
           go to     agg-mag-bfo-100.
       agg-mag-bfo-999.
           exit.

      *    *===========================================================*
      *    * Routine di decomposizione tipo riga                       *
      *    *                                                           *
      *    * Input  : rf-bfr-tip-rig                                   *
      *    *                                                           *
      *    * Output : w-rig-tip-rig (1) e relativi valori di w-rig con-*
      *    *          nessi                                            *
      *    *-----------------------------------------------------------*
       dec-tip-rig-000.
      *              *-------------------------------------------------*
      *              * Tipo riga in comodo di lavoro ridefinito        *
      *              *-------------------------------------------------*
           move      rf-bfr-tip-rig       to    w-dec-tip-rig-str     .
      *              *-------------------------------------------------*
      *              * Normalizzazione area di w-rig relativa al tipo  *
      *              * riga                                            *
      *              *-------------------------------------------------*
           move      spaces               to    w-rig-tip-rig (1)     .
           move      spaces               to    w-rig-tip-rig-tpr (1) .
           move      spaces               to    w-rig-tip-rig-tfu (1) .
           move      zero                 to    w-rig-tip-rig-cac (1) .
           move      spaces               to    w-rig-tip-rig-ast (1) .
      *              *-------------------------------------------------*
      *              * Presenza o assenza dell'asterisco               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ispezione stringa                           *
      *                  *---------------------------------------------*
           move      zero                 to   w-dec-tip-rig-inx      .
           inspect   w-dec-tip-rig-str
                                      tallying w-dec-tip-rig-inx
                                          for  all "*"                .
      *                  *---------------------------------------------*
      *                  * Se nessun asterisco trovato : oltre         *
      *                  *---------------------------------------------*
           if        w-dec-tip-rig-inx    =    zero
                     go to dec-tip-rig-100.
      *                  *---------------------------------------------*
      *                  * Segnale di presenza asterisco               *
      *                  *---------------------------------------------*
           move      "#"                  to   w-rig-tip-rig-ast (1)  .
      *                  *---------------------------------------------*
      *                  * Pulizia stringa da asterisco                *
      *                  *---------------------------------------------*
           inspect   w-dec-tip-rig-str
                                     replacing all "*" by   spaces    .
       dec-tip-rig-100.
      *              *-------------------------------------------------*
      *              * Memorizzazione tipo riga                        *
      *              *-------------------------------------------------*
           move      w-dec-tip-rig-chr (1)
                                          to   w-rig-tip-rig-tpr (1)  .
      *              *-------------------------------------------------*
      *              * Test se esiste un tipo funzionamento            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Solo per tipi riga P o L                    *
      *                  *---------------------------------------------*
           if        w-rig-tip-rig-tpr (1)
                                          not  = "P" and
                     w-rig-tip-rig-tpr (1)
                                          not  = "L"
                     go to dec-tip-rig-200.
      *                  *---------------------------------------------*
      *                  * Se secondo carattere della stringa a spazi :*
      *                  * oltre                                       *
      *                  *---------------------------------------------*
           if        w-dec-tip-rig-chr (2)
                                          =    spaces
                     go to dec-tip-rig-200.
      *                  *---------------------------------------------*
      *                  * Memorizzazione tipo funzionamento           *
      *                  *---------------------------------------------*
           move      w-dec-tip-rig-chr (2)
                                          to   w-rig-tip-rig-tfu (1)  .
       dec-tip-rig-200.
      *              *-------------------------------------------------*
      *              * Ricerca di un codice addebito o commento        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Solo se tipo riga A o C                     *
      *                  *---------------------------------------------*
           if        w-rig-tip-rig-tpr (1)
                                          not  = "A" and
                     w-rig-tip-rig-tpr (1)
                                          not  = "C"
                     go to dec-tip-rig-300.
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione stringa a ritroso        *
      *                  *---------------------------------------------*
           move      zero                 to   w-dec-tip-rig-cod      .
           move      6                    to   w-dec-tip-rig-c01      .
           move      3                    to   w-dec-tip-rig-c02      .
       dec-tip-rig-210.
           subtract  1                    from w-dec-tip-rig-c01      .
           if        w-dec-tip-rig-chr
                    (w-dec-tip-rig-c01)   =    w-rig-tip-rig-tpr (1)
                     go to dec-tip-rig-220.
           if        w-dec-tip-rig-chr
                    (w-dec-tip-rig-c01)   =    spaces or
                     w-dec-tip-rig-chr
                    (w-dec-tip-rig-c01)   <    "0"    or
                     w-dec-tip-rig-chr
                    (w-dec-tip-rig-c01)   >    "9"
                     go to dec-tip-rig-210.
           move      w-dec-tip-rig-chr
                    (w-dec-tip-rig-c01)   to   w-dec-tip-rig-num
                                              (w-dec-tip-rig-c02)     .
           subtract  1                    from w-dec-tip-rig-c02      .
           go to     dec-tip-rig-210.
       dec-tip-rig-220.
           move      w-dec-tip-rig-cod    to   w-rig-tip-rig-cac (1)  .
       dec-tip-rig-300.
      *              *-------------------------------------------------*
      *              * Preparazione stringa tipo riga per accettazione *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione puntatore per string       *
      *                  *---------------------------------------------*
           move      01                   to   w-dec-tip-rig-pnt      .
      *                  *---------------------------------------------*
      *                  * Tipo riga                                   *
      *                  *---------------------------------------------*
           move      w-rig-tip-rig-tpr (1)
                                          to   w-rig-tip-rig (1)      .
      *                  *---------------------------------------------*
      *                  * Tipo funzionamento                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se a spazi : oltre                      *
      *                      *-----------------------------------------*
           if        w-rig-tip-rig-tfu (1)
                                          =    spaces
                     go to dec-tip-rig-320.
      *                      *-----------------------------------------*
      *                      * String del tipo funzionamento           *
      *                      *-----------------------------------------*
           add       1                    to   w-dec-tip-rig-pnt      .
           string    w-rig-tip-rig-tfu (1)
                                delimited by   spaces
                                          into w-rig-tip-rig (1) 
                                  with pointer w-dec-tip-rig-pnt      .
       dec-tip-rig-320.
      *                  *---------------------------------------------*
      *                  * Asterisco                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se non presente : oltre                 *
      *                      *-----------------------------------------*
           if        w-rig-tip-rig-ast (1)
                                          =    spaces
                     go to dec-tip-rig-400.
      *                      *-----------------------------------------*
      *                      * String asterisco                        *
      *                      *-----------------------------------------*
           add       1                    to   w-dec-tip-rig-pnt      .
           string    "*"        delimited by   size
                                          into w-rig-tip-rig (1) 
                                  with pointer w-dec-tip-rig-pnt      .
       dec-tip-rig-400.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     dec-tip-rig-999.
       dec-tip-rig-999.
           exit.

      *    *===========================================================*
      *    * Find su archivio [bft]                                    *
      *    *-----------------------------------------------------------*
       fnd-arc-bft-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-fnd-arc-bft-sel      .
      *              *-------------------------------------------------*
      *              * Test se programma di interrogazione gia' attivo *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pbfo3010"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     move  "#"            to   w-fnd-arc-bft-sel
                     go to  fnd-arc-bft-999.
       fnd-arc-bft-050.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'snx-slc' per il  *
      *              * livello successivo per l'ammissibilita' del ta- *
      *              * sto Slct                                        *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "snx-slc"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      01                   to   s-car                  .
           move      "S"                  to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-bft-100.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'tip-int' per il  *
      *              * livello successivo per il tipo di interrogazio- *
      *              * ne                                              *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "tip-int"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      10                   to   s-car                  .
           move      "INTDAF    "         to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-bft-150.
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per codice di- *
      *              * pendenza                                        *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "cod-dpz"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      02                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      w-fnd-arc-bft-dpz    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-bft-200.
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per codice     *
      *              * fornitore                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da eseguire                         *
      *                  *---------------------------------------------*
           if        w-fnd-arc-bft-fnt    =    zero
                     go to fnd-arc-bft-250.
      *                  *---------------------------------------------*
      *                  * Esecuzione                                  *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "cod-fnt"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      w-fnd-arc-bft-fnt    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-bft-250.
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per dipendenza *
      *              * fornitore                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da eseguire                         *
      *                  *---------------------------------------------*
           if        w-fnd-arc-bft-fnt    =    zero
                     go to fnd-arc-bft-300.
      *                  *---------------------------------------------*
      *                  * Esecuzione                                  *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "dpz-fnt"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      04                   to   s-car                  .
           move      w-fnd-arc-bft-dpf    to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-bft-300.
      *              *-------------------------------------------------*
      *              * Richiamo programma di interrogazione            *
      *              *-------------------------------------------------*
           move      "pgm/bfo/prg/obj/pbfo3010"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * Estrazione di eventuali variabili di i.p.c. de- *
      *              * terminate da function-key "SLCT" durante l'in-  *
      *              * terrogazione                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo movimento                              *
      *                  *---------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "cod-tmb"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                not  = spaces
                     move  "#"            to   w-fnd-arc-bft-sel
                     go to fnd-arc-bft-999.
           move      s-alf                to   w-fnd-arc-bft-tmb      .
      *                  *---------------------------------------------*
      *                  * Data registrazione                          *
      *                  *---------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "dat-reg"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                not  = spaces
                     move  "#"            to   w-fnd-arc-bft-sel
                     go to fnd-arc-bft-999.
           move      s-dat                to   w-fnd-arc-bft-dat      .
      *                  *---------------------------------------------*
      *                  * Numero protocollo                           *
      *                  *---------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "num-prt"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                not  = spaces
                     move  "#"            to   w-fnd-arc-bft-sel
                     go to fnd-arc-bft-999.
           move      s-num                to   w-fnd-arc-bft-prt      .
      *              *-------------------------------------------------*
      *              * Salvataggio valori chiave                       *
      *              *-------------------------------------------------*
           move      w-acc                to   w-sav-val-acc          .
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori estratti                 *
      *              *-------------------------------------------------*
           move      w-fnd-arc-bft-prt    to   w-acc-num-prt          .
       fnd-arc-bft-400.
      *              *-------------------------------------------------*
      *              * Determinazione campi derivati e effettuazione   *
      *              * controlli come se fossero stati impostati       *
      *              *-------------------------------------------------*
       fnd-arc-bft-600.
      *              *-------------------------------------------------*
      *              * Completamento visualizzazione campi di accet-   *
      *              * tazione                                         *
      *              *-------------------------------------------------*
           perform   vis-num-prt-000      thru vis-num-prt-999        .
      *              *-------------------------------------------------*
      *              * Uscita con successo                             *
      *              *-------------------------------------------------*
           go to     fnd-arc-bft-999.
       fnd-arc-bft-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ripristino valori chiave salvati            *
      *                  *---------------------------------------------*
           move      w-sav-val-acc        to   w-acc                  .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-fnd-arc-bft-sel      .
       fnd-arc-bft-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [fnt]                         *
      *    *-----------------------------------------------------------*
       let-arc-fnt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-fnt-cod    =    zero
                     go to let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT"             to   f-key                  .
           move      w-let-arc-fnt-cod    to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-fnt-400.
       let-arc-fnt-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-fnt-rag-soc       to   w-let-arc-fnt-rag      .
           move      rf-fnt-via-fnt       to   w-let-arc-fnt-via      .
           move      rf-fnt-loc-fnt       to   w-let-arc-fnt-loc      .
           move      rf-fnt-prt-iva       to   w-let-arc-fnt-piv      .
           move      rf-fnt-cod-cge       to   w-let-arc-fnt-cge      .
           move      rf-fnt-cod-iva       to   w-let-arc-fnt-ass      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-fnt-999.
       let-arc-fnt-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-fnt-flg      .
           move      all   "."            to   w-let-arc-fnt-rag      .
           go to     let-arc-fnt-520.
       let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-rag      .
       let-arc-fnt-520.
           move      spaces               to   w-let-arc-fnt-via      .
           move      spaces               to   w-let-arc-fnt-loc      .
           move      zero                 to   w-let-arc-fnt-piv      .
           move      zero                 to   w-let-arc-fnt-cge      .
           move      zero                 to   w-let-arc-fnt-ass      .
       let-arc-fnt-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [zci]                         *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/larczci0.lts"                   .

      *    *===========================================================*
      *    * Routine lettura archivio dipendenza fornitore in [dcf]    *
      *    *-----------------------------------------------------------*
       let-arc-dcf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcf-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice fornitore a zero                 *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-cod    =    zero
                     go to let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a spaces, solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-dpz    =    spaces and
                     w-let-arc-dcf-tle    =    "D"
                     go to let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a "*   ", solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-dpz    =    "*   " and
                     w-let-arc-dcf-tle    =    "D"
                     go to let-arc-dcf-450.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      w-let-arc-dcf-cod    to   rf-dcf-cod-fnt         .
           move      w-let-arc-dcf-dpz    to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcf-400.
       let-arc-dcf-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcf-rag-soc       to   w-let-arc-dcf-rag      .
           move      rf-dcf-via-dcf       to   w-let-arc-dcf-via      .
           move      rf-dcf-loc-dcf       to   w-let-arc-dcf-loc      .
           move      rf-dcf-cod-abi       to   w-let-arc-dcf-abi      .
           move      rf-dcf-cod-cab       to   w-let-arc-dcf-cab      .
           move      rf-dcf-ccc-app       to   w-let-arc-dcf-ccc      .
           move      rf-dcf-ccp-app       to   w-let-arc-dcf-ccp      .
           if        w-let-arc-dcf-tle    =    "D"
                     move  spaces         to   w-let-arc-dcf-ban
           else      move  rf-dcf-nos-ban to   w-let-arc-dcf-ban
           move      rf-dcf-cod-vlt       to   w-let-arc-dcf-vlt      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcf-999.
       let-arc-dcf-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcf-flg      .
           move      all   "."            to   w-let-arc-dcf-rag      .
           go to     let-arc-dcf-600.
       let-arc-dcf-450.
      *              *-------------------------------------------------*
      *              * Normalizzazione per codice dipendenza "*   "    *
      *              *-------------------------------------------------*
           move      "Sia la sede che tutte le dipendenze     "
                                          to   w-let-arc-dcf-rag      .
           go to     let-arc-dcf-600.
       let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcf-rag      .
       let-arc-dcf-600.
           move      spaces               to   w-let-arc-dcf-via      .
           move      spaces               to   w-let-arc-dcf-loc      .
           move      zero                 to   w-let-arc-dcf-abi      .
           move      zero                 to   w-let-arc-dcf-cab      .
           move      zero                 to   w-let-arc-dcf-ccc      .
           move      spaces               to   w-let-arc-dcf-ccp      .
           move      spaces               to   w-let-arc-dcf-ban      .
           move      spaces               to   w-let-arc-dcf-vlt      .
       let-arc-dcf-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zvl]                             *
      *    *-----------------------------------------------------------*
       let-arc-zvl-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zvl-flg      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del valore della sigla va- *
      *              * luta                                            *
      *              *-------------------------------------------------*
           if        w-let-arc-zvl-cod    =    c-sgl
                     go to let-arc-zvl-200
           else if   w-let-arc-zvl-cod    =    spaces
                     go to let-arc-zvl-400
           else      go to let-arc-zvl-600.
       let-arc-zvl-200.
      *              *-------------------------------------------------*
      *              * Se sigla valuta pari alla valuta base           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Descrizione valuta in lingua italiana       *
      *                  *---------------------------------------------*
           move      c-des                to   w-let-arc-zvl-des      .
      *                  *---------------------------------------------*
      *                  * Descrizione valuta internazionale           *
      *                  *---------------------------------------------*
           move      c-din                to   w-let-arc-zvl-din      .
      *                  *---------------------------------------------*
      *                  * Numero decimali valuta                      *
      *                  *---------------------------------------------*
           move      c-dec                to   w-let-arc-zvl-dec      .
      *                  *---------------------------------------------*
      *                  * Tipo di coefficiente per cambio valuta      *
      *                  *---------------------------------------------*
           move      c-tdc                to   w-let-arc-zvl-tdc      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-zvl-999.
       let-arc-zvl-400.
      *              *-------------------------------------------------*
      *              * Se sigla valuta a Spaces                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Descrizione valuta in lingua italiana       *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-zvl-des      .
      *                  *---------------------------------------------*
      *                  * Descrizione valuta internazionale           *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-zvl-din      .
      *                  *---------------------------------------------*
      *                  * Numero decimali valuta                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-let-arc-zvl-dec      .
      *                  *---------------------------------------------*
      *                  * Tipo di coefficiente per cambio valuta      *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-zvl-tdc      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-zvl-999.
       let-arc-zvl-600.
      *              *-------------------------------------------------*
      *              * Se sigla valuta diversa dalla valuta base ed    *
      *              * anche diversa da Spaces                         *
      *              *-------------------------------------------------*
       let-arc-zvl-650.
      *                  *---------------------------------------------*
      *                  * Lettura per sigla valuta                    *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODVLT    "         to   f-key                  .
           move      w-let-arc-zvl-cod    to   rf-zvl-sgl-vlt         .
           move      "pgm/dcc/fls/ioc/obj/iofzvl"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zvl                 .
      *                  *---------------------------------------------*
      *                  * Deviazione secondo l'esito della lettura    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-zvl-750.
       let-arc-zvl-700.
      *                  *---------------------------------------------*
      *                  * Se record esistente                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione valuta in lingua italiana   *
      *                      *-----------------------------------------*
           move      rf-zvl-des-ita       to   w-let-arc-zvl-des      .
      *                      *-----------------------------------------*
      *                      * Descrizione valuta internazionale       *
      *                      *-----------------------------------------*
           move      rf-zvl-des-int       to   w-let-arc-zvl-din      .
      *                      *-----------------------------------------*
      *                      * Numero decimali valuta                  *
      *                      *-----------------------------------------*
           move      rf-zvl-num-dec       to   w-let-arc-zvl-dec      .
      *                      *-----------------------------------------*
      *                      * Tipo di coefficiente per cambio valuta  *
      *                      *-----------------------------------------*
           move      rf-zvl-def-tdc       to   w-let-arc-zvl-tdc      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-zvl-999.
       let-arc-zvl-750.
      *                  *---------------------------------------------*
      *                  * Se record non esistente                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di uscita ad errore                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-let-arc-zvl-flg      .
      *                      *-----------------------------------------*
      *                      * Descrizione valuta in lingua italiana   *
      *                      *-----------------------------------------*
           move      all   "."            to   w-let-arc-zvl-des      .
      *                      *-----------------------------------------*
      *                      * Descrizione valuta internazionale       *
      *                      *-----------------------------------------*
           move      all   "."            to   w-let-arc-zvl-din      .
      *                      *-----------------------------------------*
      *                      * Numero decimali valuta                  *
      *                      *-----------------------------------------*
           move      zero                 to   w-let-arc-zvl-dec      .
      *                      *-----------------------------------------*
      *                      * Tipo di coefficiente per cambio valuta  *
      *                      *-----------------------------------------*
           move      spaces               to   w-let-arc-zvl-tdc      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-zvl-999.
       let-arc-zvl-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [pdc]                         *
      *    *-----------------------------------------------------------*
       let-arc-pdc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-pdc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice sottoconto a zero                *
      *              *-------------------------------------------------*
           if        w-let-arc-pdc-cod    =    zero
                     go to let-arc-pdc-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODPDC"             to   f-key                  .
           move      w-let-arc-pdc-cod    to   rf-pdc-cod-pdc         .
           move      "pgm/cge/fls/ioc/obj/iofpdc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-pdc-400.
       let-arc-pdc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-pdc-des-pdc       to   w-let-arc-pdc-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-pdc-999.
       let-arc-pdc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-pdc-flg      .
           move      all   "."            to   w-let-arc-pdc-des      .
           go to     let-arc-pdc-999.
       let-arc-pdc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-pdc-des      .
       let-arc-pdc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [yfp]                         *
      *    *-----------------------------------------------------------*
       let-arc-yfp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-yfp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice istituto a zero                  *
      *              *-------------------------------------------------*
           if        w-let-arc-yfp-cod    =    zero
                     go to let-arc-yfp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFOP"             to   f-key                  .
           move      w-let-arc-yfp-cod    to   rf-yfp-cod-fop         .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-yfp-400.
       let-arc-yfp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-yfp-des-fop       to   w-let-arc-yfp-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-yfp-999.
       let-arc-yfp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-yfp-flg      .
           move      all   "."            to   w-let-arc-yfp-des      .
           go to     let-arc-yfp-999.
       let-arc-yfp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-yfp-des      .
       let-arc-yfp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [cbp]                         *
      *    *-----------------------------------------------------------*
       let-arc-cbp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cbp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spaces                         *
      *              *-------------------------------------------------*
           if        w-let-arc-cbp-cod    =    spaces
                     go to let-arc-cbp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCBP    "         to   f-key                  .
           move      w-let-arc-cbp-tip    to   rf-cbp-tip-cbp         .
           move      w-let-arc-cbp-cod    to   rf-cbp-cod-cbp         .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-cbp-400.
       let-arc-cbp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-cbp-des-cbp       to   w-let-arc-cbp-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-cbp-999.
       let-arc-cbp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-cbp-flg      .
           move      all   "."            to   w-let-arc-cbp-des      .
           go to     let-arc-cbp-999.
       let-arc-cbp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cbp-des      .
       let-arc-cbp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [axi]                         *
      *    *-----------------------------------------------------------*
       let-arc-axi-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axi-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice istituto a zero                  *
      *              *-------------------------------------------------*
           if        w-let-arc-axi-cod    =    zero
                     go to let-arc-axi-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODABI"             to   f-key                  .
           move      w-let-arc-axi-cod    to   rf-axi-cod-abi         .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-axi-400.
       let-arc-axi-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-axi-den-abi       to   w-let-arc-axi-den      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-axi-999.
       let-arc-axi-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-axi-flg      .
           move      all   "."            to   w-let-arc-axi-den      .
           go to     let-arc-axi-999.
       let-arc-axi-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axi-den      .
       let-arc-axi-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [axs]                         *
      *    *-----------------------------------------------------------*
       let-arc-axs-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axs-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice banca a zero                     *
      *              *-------------------------------------------------*
           if        w-let-arc-axs-abi    =    zero
                     go to let-arc-axs-500.
      *              *-------------------------------------------------*
      *              * Test se codice agenzia a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-axs-cab    =    zero
                     go to let-arc-axs-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "ABICAB    "         to   f-key                  .
           move      w-let-arc-axs-abi    to   rf-axs-cod-abi         .
           move      w-let-arc-axs-cab    to   rf-axs-cod-cab         .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-axs-400.
       let-arc-axs-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-axs-den-spt       to   w-let-arc-axs-den      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-axs-999.
       let-arc-axs-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-axs-flg      .
           move      all   "."            to   w-let-arc-axs-den      .
           go to     let-arc-axs-999.
       let-arc-axs-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axs-den      .
       let-arc-axs-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [yin]                         *
      *    *-----------------------------------------------------------*
       let-arc-yin-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-yin-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spazi                          *
      *              *-------------------------------------------------*
           if        w-let-arc-yin-cod    =    spaces
                     go to let-arc-yin-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODSPI    "         to   f-key                  .
           move      w-let-arc-yin-cod    to   rf-yin-cod-spi         .
           move      w-let-arc-yin-tpg    to   rf-yin-tip-pag         .
           move      "pgm/dcf/fls/ioc/obj/iofyin"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yin                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-yin-400.
       let-arc-yin-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-yin-des-spi       to   w-let-arc-yin-des      .
           move      rf-yin-civ-spi       to   w-let-arc-yin-coi      .
           move      rf-yin-ccp-spi       to   w-let-arc-yin-ccp      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-yin-999.
       let-arc-yin-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-yin-flg      .
           move      all   "."            to   w-let-arc-yin-des      .
           go to     let-arc-yin-520.
       let-arc-yin-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-yin-des      .
       let-arc-yin-520.
           move      zero                 to   w-let-arc-yin-coi      .
           move      zero                 to   w-let-arc-yin-ccp      .
       let-arc-yin-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [ybo]                         *
      *    *-----------------------------------------------------------*
       let-arc-ybo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ybo-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spazi                          *
      *              *-------------------------------------------------*
           if        w-let-arc-ybo-cod    =    spaces
                     go to let-arc-ybo-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODSPB    "         to   f-key                  .
           move      w-let-arc-ybo-cod    to   rf-ybo-cod-spb         .
           move      w-let-arc-ybo-tpg    to   rf-ybo-tip-pag         .
           move      "pgm/dcf/fls/ioc/obj/iofybo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ybo                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-ybo-400.
       let-arc-ybo-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-ybo-des-spb       to   w-let-arc-ybo-des      .
           move      rf-ybo-civ-spb       to   w-let-arc-ybo-coi      .
           move      rf-ybo-ccp-spb       to   w-let-arc-ybo-ccp      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-ybo-999.
       let-arc-ybo-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-ybo-flg      .
           move      all   "."            to   w-let-arc-ybo-des      .
           go to     let-arc-ybo-520.
       let-arc-ybo-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ybo-des      .
       let-arc-ybo-520.
           move      zero                 to   w-let-arc-ybo-coi      .
           move      zero                 to   w-let-arc-ybo-ccp      .
       let-arc-ybo-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dcp]                         *
      *    *-----------------------------------------------------------*
       let-arc-dcp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcp-cod    =    zero  
                     go to let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      w-let-arc-dcp-cod    to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcp-400.
       let-arc-dcp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcp-des-pro       to   w-let-arc-dcp-dui      .
           move      rf-dcp-tip-pro       to   w-let-arc-dcp-tpr      .
           move      rf-dcp-cod-iva       to   w-let-arc-dcp-civ      .
           move      rf-dcp-umi-ven       to   w-let-arc-dcp-umi      .
           move      rf-dcp-dec-qta       to   w-let-arc-dcp-deq      .
       let-arc-dcp-210.
      *                  *---------------------------------------------*
      *                  * Trattamento descrizione                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Bufferizzazione della descrizione       *
      *                      *-----------------------------------------*
           move      rf-dcp-des-pro       to   w-let-arc-dcp-des      .
      *                      *-----------------------------------------*
      *                      * Test se codice lingua diverso da "I  "  *
      *                      *-----------------------------------------*
           if        w-let-arc-dcp-lng    not  = "I  "
                     go to let-arc-dcp-350.
       let-arc-dcp-215.
      *                      *-----------------------------------------*
      *                      * Descrizione contenuta nel record        *
      *                      *-----------------------------------------*
           if        rf-dcp-des-pdx       =    0
                     go to let-arc-dcp-300.
      *                      *-----------------------------------------*
      *                      * Descrizione in file di estensione       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione descrizione         *
      *                          *-------------------------------------*
           move      spaces               to   w-let-arc-dcp-des      .
      *                          *-------------------------------------*
      *                          * Normalizzazione contatore           *
      *                          *-------------------------------------*
           move      zero                 to   w-let-arc-dcp-ctr      .
       let-arc-dcp-220.
           add       1                    to   w-let-arc-dcp-ctr      .
           if        w-let-arc-dcp-ctr    >    10
                     go to let-arc-dcp-300.
      *                          *-------------------------------------*
      *                          * Lettura archivio [pdx]              *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "TRCLNG"             to   f-key                  .
           move      01                   to   rf-pdx-tip-rec         .
           move      zero                 to   rf-pdx-cod-arc         .
           move      "I  "                to   rf-pdx-cod-lng         .
           move      w-let-arc-dcp-cod    to   rf-pdx-cod-num         .
           move      spaces               to   rf-pdx-for-mat         .
           move      w-let-arc-dcp-ctr    to   rf-pdx-num-prg         .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *                              *---------------------------------*
      *                              * Se record [pdx] non trovato :   *
      *                              * ad uscita                       *
      *                              *---------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-dcp-300.
      *                          *-------------------------------------*
      *                          * Bufferizzazione riga letta          *
      *                          *-------------------------------------*
           move      rf-pdx-des-pro       to   w-let-arc-dcp-drg
                                              (w-let-arc-dcp-ctr)     .
      *                          *-------------------------------------*
      *                          * Riciclo                             *
      *                          *-------------------------------------*
           go to     let-arc-dcp-220.
       let-arc-dcp-300.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-dcp-999.
       let-arc-dcp-350.
      *                  *---------------------------------------------*
      *                  * Se lingua diversa da "I  "                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione in lingua                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione descrizione         *
      *                          *-------------------------------------*
           move      spaces               to   w-let-arc-dcp-des      .
      *                          *-------------------------------------*
      *                          * Normalizzazione contatore           *
      *                          *-------------------------------------*
           move      zero                 to   w-let-arc-dcp-ctr      .
       let-arc-dcp-370.
           add       1                    to   w-let-arc-dcp-ctr      .
           if        w-let-arc-dcp-ctr    >    10
                     go to let-arc-dcp-380.
      *                          *-------------------------------------*
      *                          * Lettura archivio [pdx]              *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "TRCLNG"             to   f-key                  .
           move      02                   to   rf-pdx-tip-rec         .
           move      zero                 to   rf-pdx-cod-arc         .
           move      w-let-arc-dcp-lng    to   rf-pdx-cod-lng         .
           move      w-let-arc-dcp-cod    to   rf-pdx-cod-num         .
           move      spaces               to   rf-pdx-for-mat         .
           move      w-let-arc-dcp-ctr    to   rf-pdx-num-prg         .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *                              *---------------------------------*
      *                              * Se record [pdx] non trovato :   *
      *                              * ad uscita                       *
      *                              *---------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-dcp-380.
      *                          *-------------------------------------*
      *                          * Bufferizzazione riga letta          *
      *                          *-------------------------------------*
           move      rf-pdx-des-pro       to   w-let-arc-dcp-drg
                                              (w-let-arc-dcp-ctr)     .
      *                          *-------------------------------------*
      *                          * Riciclo                             *
      *                          *-------------------------------------*
           go to     let-arc-dcp-370.
       let-arc-dcp-380.
      *                      *-----------------------------------------*
      *                      * Test in uscita                          *
      *                      *-----------------------------------------*
           if        w-let-arc-dcp-des    =    spaces
                     move  rf-dcp-des-pro to   w-let-arc-dcp-des      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-dcp-999.
       let-arc-dcp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcp-flg      .
           move      spaces               to   w-let-arc-dcp-des      .
           move      all   "."            to   w-let-arc-dcp-drg (1)  .
           move      all   "."            to   w-let-arc-dcp-dui      .
           go to     let-arc-dcp-520.
       let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-des      .
           move      spaces               to   w-let-arc-dcp-dui      .
       let-arc-dcp-520.
           move      zero                 to   w-let-arc-dcp-tpr      .
           move      zero                 to   w-let-arc-dcp-civ      .
           move      spaces               to   w-let-arc-dcp-umi      .
           move      zero                 to   w-let-arc-dcp-deq      .
       let-arc-dcp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [mtv]                         *
      *    *-----------------------------------------------------------*
       let-arc-mtv-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-mtv-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-mtv-cod    =    zero  
                     go to let-arc-mtv-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMMTV"             to   f-key                  .
           move      w-let-arc-mtv-cod    to   rf-mtv-num-mtv         .
           move      "pgm/mtv/fls/ioc/obj/iofmtv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mtv                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-mtv-400.
       let-arc-mtv-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-mtv-des-mtv       to   w-let-arc-mtv-des      .
           move      rf-mtv-umi-gst       to   w-let-arc-mtv-umi      .
           move      rf-mtv-dec-qta       to   w-let-arc-mtv-deq      .
           move      rf-mtv-snx-mag       to   w-let-arc-mtv-snm      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-mtv-999.
       let-arc-mtv-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-mtv-flg      .
           move      all   "."            to   w-let-arc-mtv-des      .
           go to     let-arc-mtv-600.
       let-arc-mtv-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-mtv-des      .
       let-arc-mtv-600.
           move      spaces               to   w-let-arc-mtv-umi      .
           move      zero                 to   w-let-arc-mtv-deq      .
           move      spaces               to   w-let-arc-mtv-snm      .
       let-arc-mtv-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [aaf]                         *
      *    *-----------------------------------------------------------*
       let-arc-aaf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-aaf-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione record [aaf]                    *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaf                 .
      *              *-------------------------------------------------*
      *              * Lettura record [aaf]                            *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "PRFNFM"             to   f-key                  .
           move      w-let-arc-aaf-tpm    to   rf-aaf-tip-mag         .
           move      w-let-arc-aaf-cdm    to   rf-aaf-num-pro         .
           move      w-let-arc-aaf-fnt    to   rf-aaf-cod-dcf         .
           move      w-let-arc-aaf-fda    to   rf-aaf-fda-pif         .
           move      "pgm/dcf/fls/ioc/obj/iofaaf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaf                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-aaf-400.
       let-arc-aaf-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-aaf-cop-sfn       to   w-let-arc-aaf-csf      .
           move      rf-aaf-snx-tum       to   w-let-arc-aaf-snu      .
           move      rf-aaf-umf-tum       to   w-let-arc-aaf-umf      .
           move      rf-aaf-nde-tum       to   w-let-arc-aaf-ndu      .
           move      rf-aaf-cmo-tum       to   w-let-arc-aaf-cmu      .
           move      rf-aaf-cdi-tum       to   w-let-arc-aaf-cdu      .
           move      rf-aaf-tip-pza       to   w-let-arc-aaf-tpa      .
           move      rf-aaf-sgl-vlt       to   w-let-arc-aaf-vlt      .
           move      rf-aaf-dec-vlt       to   w-let-arc-aaf-dcv      .
           move      rf-aaf-dec-prz       to   w-let-arc-aaf-ndp      .
           move      rf-aaf-lot-acq       to   w-let-arc-aaf-lda      .
           move      rf-aaf-tap-pes       to   w-let-arc-aaf-tap      .
           move      rf-aaf-lgv-vlt       to   w-let-arc-aaf-lvv      .
           move      rf-aaf-lgv-dcv       to   w-let-arc-aaf-lvd      .
           move      rf-aaf-lgv-tdc       to   w-let-arc-aaf-lvt      .
           move      rf-aaf-lgv-cdc       to   w-let-arc-aaf-lvc      .
           move      rf-aaf-lgv-pdt       to   w-let-arc-aaf-lvp      .
           move      rf-aaf-per-mpa       to   w-let-arc-aaf-mpa      .
           move      zero                 to   w-let-arc-aaf-ctr      .
       let-arc-aaf-202.
           add       1                    to   w-let-arc-aaf-ctr      .
           if        w-let-arc-aaf-ctr    >    6
                     go to let-arc-aaf-204.
           move      rf-aaf-qta-pes
                    (w-let-arc-aaf-ctr)   to   w-let-arc-aaf-qtp
                                              (w-let-arc-aaf-ctr)     .
           move      rf-aaf-prz-pes
                    (w-let-arc-aaf-ctr)   to   w-let-arc-aaf-pzp
                                              (w-let-arc-aaf-ctr)     .
           move      rf-aaf-csr-pes
                    (w-let-arc-aaf-ctr)   to   w-let-arc-aaf-csp
                                              (w-let-arc-aaf-ctr)     .
           move      rf-aaf-psr-pes
                    (w-let-arc-aaf-ctr, 1)
                                          to   w-let-arc-aaf-psp
                                              (w-let-arc-aaf-ctr, 1)  .
           move      rf-aaf-psr-pes
                    (w-let-arc-aaf-ctr, 2)
                                          to   w-let-arc-aaf-psp
                                              (w-let-arc-aaf-ctr, 2)  .
           move      rf-aaf-psr-pes
                    (w-let-arc-aaf-ctr, 3)
                                          to   w-let-arc-aaf-psp
                                              (w-let-arc-aaf-ctr, 3)  .
           move      rf-aaf-psr-pes
                    (w-let-arc-aaf-ctr, 4)
                                          to   w-let-arc-aaf-psp
                                              (w-let-arc-aaf-ctr, 4)  .
           move      rf-aaf-psr-pes
                    (w-let-arc-aaf-ctr, 5)
                                          to   w-let-arc-aaf-psp
                                              (w-let-arc-aaf-ctr, 5)  .
           go to     let-arc-aaf-202.
       let-arc-aaf-204.
      *                  *---------------------------------------------*
      *                  * Trattamento descrizione                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione contenuta nel record        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di estensione          *
      *                          *-------------------------------------*
           if        rf-aaf-xdp-sfn       not  = 0
                     go to let-arc-aaf-210.
      *                          *-------------------------------------*
      *                          * Test se a spaces                    *
      *                          *-------------------------------------*
           if        rf-aaf-dep-sfn       not  = spaces
                     go to let-arc-aaf-208.
           if        w-let-arc-aaf-dmg    =    spaces
                     go to let-arc-aaf-208.
      *                          *-------------------------------------*
      *                          * Se la descrizione e' a spaces si    *
      *                          * utilizza quella letta dalla scheda  *
      *                          * anagrafica del codice magazzino     *
      *                          *-------------------------------------*
           move      w-let-arc-aaf-dmg    to   w-let-arc-aaf-des      .
      *                          *-------------------------------------*
      *                          * Ad uscita                           *
      *                          *-------------------------------------*
           go to     let-arc-aaf-300.
       let-arc-aaf-208.
      *                          *-------------------------------------*
      *                          * Descrizione per il fornitore        *
      *                          *-------------------------------------*
           move      rf-aaf-dep-sfn       to   w-let-arc-aaf-des      .
      *                          *-------------------------------------*
      *                          * Ad uscita                           *
      *                          *-------------------------------------*
           go to     let-arc-aaf-300.
       let-arc-aaf-210.
      *                      *-----------------------------------------*
      *                      * Descrizione in file di estensione       *
      *                      *-----------------------------------------*
           move      zero                 to   w-let-arc-aaf-ctr      .
       let-arc-aaf-220.
           add       1                    to   w-let-arc-aaf-ctr      .
           if        w-let-arc-aaf-ctr    >    10
                     go to let-arc-aaf-300.
      *                          *-------------------------------------*
      *                          * Lettura archivio [pdx]              *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "TRCLNG"             to   f-key                  .
           if        w-let-arc-aaf-tpm    =    01
                     move  13             to   rf-pdx-tip-rec
           else if   w-let-arc-aaf-tpm    =    03
                     move  33             to   rf-pdx-tip-rec
           else if   w-let-arc-aaf-tpm    =    04
                     move  43             to   rf-pdx-tip-rec         .
           move      w-let-arc-aaf-fnt    to   rf-pdx-cod-arc         .
           move      spaces               to   rf-pdx-cod-lng         .
           move      w-let-arc-aaf-cdm    to   rf-pdx-cod-num         .
           move      w-let-arc-aaf-fda    to   rf-pdx-for-mat         .
           move      w-let-arc-aaf-ctr    to   rf-pdx-num-prg         .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-aaf-300.
           move      rf-pdx-des-pro       to   w-let-arc-aaf-drg
                                              (w-let-arc-aaf-ctr)     .
           go to     let-arc-aaf-220.
       let-arc-aaf-300.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-aaf-999.
       let-arc-aaf-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-aaf-flg      .
           move      spaces               to   w-let-arc-aaf-des      .
           move      all   "."            to   w-let-arc-aaf-drg (1)  .
           go to     let-arc-aaf-520.
       let-arc-aaf-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-aaf-des      .
       let-arc-aaf-520.
           move      spaces               to   w-let-arc-aaf-dmg      .
           move      spaces               to   w-let-arc-aaf-csf      .
           move      spaces               to   w-let-arc-aaf-snu      .
           move      spaces               to   w-let-arc-aaf-umf      .
           move      zero                 to   w-let-arc-aaf-ndu      .
           move      zero                 to   w-let-arc-aaf-cmu      .
           move      zero                 to   w-let-arc-aaf-cdu      .
           move      zero                 to   w-let-arc-aaf-tpa      .
           move      spaces               to   w-let-arc-aaf-vlt      .
           move      zero                 to   w-let-arc-aaf-dcv      .
           move      zero                 to   w-let-arc-aaf-ndp      .
           move      zero                 to   w-let-arc-aaf-lda      .
           move      zero                 to   w-let-arc-aaf-tap      .
           move      spaces               to   w-let-arc-aaf-lvv      .
           move      zero                 to   w-let-arc-aaf-lvd      .
           move      zero                 to   w-let-arc-aaf-lvt      .
           move      zero                 to   w-let-arc-aaf-lvc      .
           move      zero                 to   w-let-arc-aaf-lvp      .
           move      zero                 to   w-let-arc-aaf-mpa      .
      *
           move      zero                 to   w-let-arc-aaf-ctr      .
       let-arc-aaf-522.
           add       1                    to   w-let-arc-aaf-ctr      .
           if        w-let-arc-aaf-ctr    >    6
                     go to let-arc-aaf-524.
           move      zero                 to   w-let-arc-aaf-qtp
                                              (w-let-arc-aaf-ctr)     .
           move      zero                 to   w-let-arc-aaf-pzp
                                              (w-let-arc-aaf-ctr)     .
           move      zero                 to   w-let-arc-aaf-csp
                                              (w-let-arc-aaf-ctr)     .
           move      zero                 to   w-let-arc-aaf-psp
                                              (w-let-arc-aaf-ctr, 1)  .
           move      zero                 to   w-let-arc-aaf-psp
                                              (w-let-arc-aaf-ctr, 2)  .
           move      zero                 to   w-let-arc-aaf-psp
                                              (w-let-arc-aaf-ctr, 3)  .
           move      zero                 to   w-let-arc-aaf-psp
                                              (w-let-arc-aaf-ctr, 4)  .
           move      zero                 to   w-let-arc-aaf-psp
                                              (w-let-arc-aaf-ctr, 5)  .
           go to     let-arc-aaf-522.
       let-arc-aaf-524.
       let-arc-aaf-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [bfx]                         *
      *    *-----------------------------------------------------------*
       let-arc-bfx-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-bfx-flg      .
      *              *-------------------------------------------------*
      *              * Test se codici nulli                            *
      *              *-------------------------------------------------*
           if        w-let-arc-bfx-prt    =    zero   or
                     w-let-arc-bfx-prg    =    zero   or
                     w-let-arc-bfx-trc    =    zero
                     go to let-arc-bfx-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-let-arc-bfx-prt    to   rf-bfx-num-prt         .
           move      w-let-arc-bfx-prg    to   rf-bfx-num-prg         .
           move      w-let-arc-bfx-trc    to   rf-bfx-tip-rec         .
           move      "pgm/bfo/fls/ioc/obj/iofbfx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfx                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-bfx-400.
       let-arc-bfx-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-bfx-des-400       to   w-let-arc-bfx-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-bfx-999.
       let-arc-bfx-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-bfx-flg      .
           move      spaces               to   w-let-arc-bfx-des      .
           move      all   "."            to   w-let-arc-bfx-drg (1)  .
           go to     let-arc-bfx-999.
       let-arc-bfx-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-bfx-des      .
       let-arc-bfx-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [zmc]                            *
      *    *-----------------------------------------------------------*
       let-arc-zmc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zmc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice causale a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-zmc-cod    =    zero
                     go to let-arc-zmc-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCAU    "         to   f-key                  .
           move      w-let-arc-zmc-cod    to   rf-zmc-cod-cau         .
           move      "pgm/mag/fls/ioc/obj/iofzmc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zmc-400.
       let-arc-zmc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zmc-trt-val       to   w-let-arc-zmc-trv      .
           move      rf-zmc-tip-mdm       to   w-let-arc-zmc-tip      .
           move      rf-zmc-trt-mic       to   w-let-arc-zmc-tmc      .
           move      rf-zmc-tip-mic       to   w-let-arc-zmc-tcm      .
           move      rf-zmc-cod-mic       to   w-let-arc-zmc-cmc      .
           move      rf-zmc-snv-mic       to   w-let-arc-zmc-vmc      .
           move      rf-zmc-def-tar       to   w-let-arc-zmc-dta      .
           move      rf-zmc-snv-tar       to   w-let-arc-zmc-vta      .
           move      rf-zmc-lst-tar       to   w-let-arc-zmc-lta      .
           move      rf-zmc-def-tco       to   w-let-arc-zmc-dtm      .
           move      rf-zmc-snv-tco       to   w-let-arc-zmc-vtm      .
           move      rf-zmc-lst-tco       to   w-let-arc-zmc-ltm      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zmc-999.
       let-arc-zmc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zmc-flg      .
           go to     let-arc-zmc-500.
       let-arc-zmc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zmc-trv      .
           move      zero                 to   w-let-arc-zmc-tip      .
           move      zero                 to   w-let-arc-zmc-tmc      .
           move      spaces               to   w-let-arc-zmc-tcm      .
           move      spaces               to   w-let-arc-zmc-cmc      .
           move      spaces               to   w-let-arc-zmc-vmc      .
           move      spaces               to   w-let-arc-zmc-dta      .
           move      spaces               to   w-let-arc-zmc-vta      .
           move      spaces               to   w-let-arc-zmc-lta      .
           move      spaces               to   w-let-arc-zmc-dtm      .
           move      spaces               to   w-let-arc-zmc-vtm      .
           move      spaces               to   w-let-arc-zmc-ltm      .
       let-arc-zmc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [ybf]                         *
      *    *-----------------------------------------------------------*
       let-arc-ybf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ybf-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spazi                          *
      *              *-------------------------------------------------*
           if        w-let-arc-ybf-cod    =    spaces
                     go to let-arc-ybf-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODTMB"             to   f-key                  .
           move      w-let-arc-ybf-cod    to   rf-ybf-cod-tmb         .
           move      w-let-arc-ybf-dpz    to   rf-ybf-cod-dpz         .
           move      "pgm/bfo/fls/ioc/obj/iofybf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ybf                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-ybf-400.
       let-arc-ybf-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-ybf-des-tmb       to   w-let-arc-ybf-des      .
           move      rf-ybf-int-ftr       to   w-let-arc-ybf-mif      .
           move      rf-ybf-tmo-ftr       to   w-let-arc-ybf-tmf      .
           move      rf-ybf-cau-mag       to   w-let-arc-ybf-cam      .
           move      rf-ybf-cod-mic       to   w-let-arc-ybf-ctm      .
           move      rf-ybf-def-tar       to   w-let-arc-ybf-dfa      .
           move      rf-ybf-snv-tar       to   w-let-arc-ybf-vaa      .
           move      rf-ybf-lst-tar       to   w-let-arc-ybf-lsa      .
           move      rf-ybf-org-doc       to   w-let-arc-ybf-ord      .
           move      rf-ybf-prv-doc       to   w-let-arc-ybf-prd      .
           move      rf-ybf-mov-afd       to   w-let-arc-ybf-maf      .
           move      rf-ybf-def-tmf       to   w-let-arc-ybf-dmf      .
           move      rf-ybf-vld-dpz       to   w-let-arc-ybf-tvd      .
           move      rf-ybf-cod-dsl       to   w-let-arc-ybf-dsl      .
           move      rf-ybf-def-tpr       to   w-let-arc-ybf-dtr      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-ybf-999.
       let-arc-ybf-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-ybf-flg      .
           move      all   "."            to   w-let-arc-ybf-des      .
           go to     let-arc-ybf-600.
       let-arc-ybf-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ybf-des      .
       let-arc-ybf-600.
           move      zero                 to   w-let-arc-ybf-mif      .
           move      spaces               to   w-let-arc-ybf-tmf      .
           move      spaces               to   w-let-arc-ybf-acm      .
           move      spaces               to   w-let-arc-ybf-dtc      .
           move      spaces               to   w-let-arc-ybf-dct      .
           move      zero                 to   w-let-arc-ybf-cam      .
           move      spaces               to   w-let-arc-ybf-ctm      .
           move      spaces               to   w-let-arc-ybf-dfa      .
           move      spaces               to   w-let-arc-ybf-vaa      .
           move      spaces               to   w-let-arc-ybf-lsa      .
           move      zero                 to   w-let-arc-ybf-ord      .
           move      zero                 to   w-let-arc-ybf-prd      .
           move      spaces               to   w-let-arc-ybf-sgl      .
           move      zero                 to   w-let-arc-ybf-maf      .
           move      spaces               to   w-let-arc-ybf-dmf      .
           move      spaces               to   w-let-arc-ybf-tvd      .
           move      spaces               to   w-let-arc-ybf-dsl      .
           move      spaces               to   w-let-arc-ybf-dtr      .
       let-arc-ybf-999.
           exit.

      *    *===========================================================*
      *    * Determinazione valori testata indotti da record [dcf]     *
      *    * principale                                                *
      *    *-----------------------------------------------------------*
       det-vlt-dcf-000.
      *                  *---------------------------------------------*
      *                  * Codice e descrizione nostra banca di appog- *
      *                  * gio associati al fornitore                  *
      *                  *---------------------------------------------*
           move      rf-dcf-nos-ban       to   w-tes-nsb-aaf (1)      .
      *                  *---------------------------------------------*
      *                  * Codice e descrizione nostra banca di appog- *
      *                  * gio per il documento                        *
      *                  *---------------------------------------------*
           move      w-tes-nsb-aaf (1)    to   w-tes-nos-ban (1)      .
           move      02                   to   w-let-arc-cbp-tip      .
           move      w-tes-nos-ban (1)    to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
           move      w-let-arc-cbp-des    to   w-tes-nos-ban-des (1)  .
      *                  *---------------------------------------------*
      *                  * Codice e descrizione ABI del fornitore      *
      *                  *---------------------------------------------*
           move      rf-dcf-cod-abi       to   w-tes-abi-fnt (1)      .
           move      w-tes-abi-fnt (1)    to   w-let-arc-axi-cod      .
           perform   let-arc-axi-000      thru let-arc-axi-999        .
           move      w-let-arc-axi-den    to   w-tes-abi-fnt-den (1)  .
      *                  *---------------------------------------------*
      *                  * Codice e descrizione CAB del fornitore      *
      *                  *---------------------------------------------*
           move      rf-dcf-cod-cab       to   w-tes-cab-fnt (1)      .
           move      w-tes-abi-fnt (1)    to   w-let-arc-axs-abi      .
           move      w-tes-cab-fnt (1)    to   w-let-arc-axs-cab      .
           perform   let-arc-axs-000      thru let-arc-axs-999        .
           move      w-let-arc-axs-den    to   w-tes-cab-fnt-den (1)  .
      *                  *---------------------------------------------*
      *                  * C/c appoggio del fornitore                  *
      *                  *---------------------------------------------*
           move      rf-dcf-ccc-app       to   w-tes-cca-fnt (1)      .
      *                  *---------------------------------------------*
      *                  * C/c postale del fornitore                   *
      *                  *---------------------------------------------*
           move      rf-dcf-ccp-app       to   w-tes-ccp-fnt (1)      .
      *                  *---------------------------------------------*
      *                  * Modalita' di calcolo importo                *
      *                  *---------------------------------------------*
           move      rf-dcf-tip-mci       to   w-tes-tip-mci (1)      .
      *                  *---------------------------------------------*
      *                  * Inoltro pagamenti                           *
      *                  *---------------------------------------------*
           move      rf-dcf-inl-pgt       to   w-tes-inl-pgt (1)      .
      *                  *---------------------------------------------*
      *                  * Sigla valuta                                *
      *                  *---------------------------------------------*
           move      rf-dcf-cod-vlt       to   w-tes-sgl-vpf (1)      .
           move      w-tes-sgl-vpf (1)    to   w-let-arc-zvl-cod      .
           perform   let-arc-zvl-000      thru let-arc-zvl-999        .
           move      w-let-arc-zvl-des    to   w-tes-sgl-vpf-des (1)  .
       det-vlt-dcf-999.
           exit.

      *    *===========================================================*
      *    * Determinazione valori testata indotti da record [dcf]     *
      *    * relativo alla dipendenza del fornitore                    *
      *    *-----------------------------------------------------------*
       det-vlt-dcd-000.
      *              *-------------------------------------------------*
      *              * Se codice dipendenza a spazi : uscita           *
      *              *-------------------------------------------------*
           if        w-tes-dpz-arc (1)    =    spaces
                     go to det-vlt-dcd-999.
      *              *-------------------------------------------------*
      *              * Codice e descrizione ABI dipendenza             *
      *              *-------------------------------------------------*
           move      rf-dcf-cod-abi       to   w-tes-abi-dpz (1)      .
           move      w-tes-abi-dpz (1)    to   w-let-arc-axi-cod      .
           perform   let-arc-axi-000      thru let-arc-axi-999        .
           move      w-let-arc-axi-den    to   w-tes-abi-dpz-den (1)  .
      *              *-------------------------------------------------*
      *              * Codice e descrizione CAB dipendenza             *
      *              *-------------------------------------------------*
           move      rf-dcf-cod-cab       to   w-tes-cab-dpz (1)      .
           move      w-tes-abi-dpz (1)    to   w-let-arc-axs-abi      .
           move      w-tes-cab-dpz (1)    to   w-let-arc-axs-cab      .
           perform   let-arc-axs-000      thru let-arc-axs-999        .
           move      w-let-arc-axs-den    to   w-tes-cab-dpz-den (1)  .
      *              *-------------------------------------------------*
      *              * C/c bancario della dipendenza                   *
      *              *-------------------------------------------------*
           move      rf-dcf-ccc-app       to   w-tes-cca-dpz (1)      .
      *              *-------------------------------------------------*
      *              * C/c postale della dipendenza                    *
      *              *-------------------------------------------------*
           move      rf-dcf-ccp-app       to   w-tes-ccp-dpz (1)      .
       det-vlt-dcd-999.
           exit.

      *    *===========================================================*
      *    * Determinazione funzionamento spese in fattura             *
      *    *-----------------------------------------------------------*
       det-fun-spe-000.
      *              *-------------------------------------------------*
      *              * Ciclo di scansione su tabella personalizzazioni *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-fun-spe-ctr      .
       det-fun-spe-100.
           add       1                    to   w-det-fun-spe-ctr      .
           if        w-det-fun-spe-ctr    >    w-prs-spe-fat-nst
                     go to det-fun-spe-999.
      *              *-------------------------------------------------*
      *              * Preparazione indice per tabella                 *
      *              *-------------------------------------------------*
           move      w-prs-spe-fat-npt
                    (w-det-fun-spe-ctr)   to   w-det-fun-spe-inx      .
      *              *-------------------------------------------------*
      *              * Si/No addebito                                  *
      *              *-------------------------------------------------*
           if        rf-dcf-snm-spe
                    (w-det-fun-spe-inx)   =    zero or
                     rf-dcf-snm-spe
                    (w-det-fun-spe-inx)   =    01
                     move  0              to   w-te2-spe-snx
                                              (1, w-det-fun-spe-inx)
           else      move  1              to   w-te2-spe-snx
                                              (1, w-det-fun-spe-inx)  .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo funzionamento   *
      *              * derivato dalle personalizzazioni                *
      *              *-------------------------------------------------*
           if        w-prs-spe-fat-tfs
                    (w-det-fun-spe-ctr)   =    01
                     go to det-fun-spe-110
           else if   w-prs-spe-fat-tfs
                    (w-det-fun-spe-ctr)   =    02
                     go to det-fun-spe-120
           else if   w-prs-spe-fat-tfs
                    (w-det-fun-spe-ctr)   =    03
                     go to det-fun-spe-130
           else if   w-prs-spe-fat-tfs
                    (w-det-fun-spe-ctr)   =    04
                     go to det-fun-spe-140
           else if   w-prs-spe-fat-tfs
                    (w-det-fun-spe-ctr)   =    05
                     go to det-fun-spe-150.
       det-fun-spe-110.
      *              *-------------------------------------------------*
      *              * Tipo funzionamento : % fissa                    *
      *              *-------------------------------------------------*
           move      1                    to   w-te2-spe-mad
                                              (1, w-det-fun-spe-inx)  .
           move      w-prs-spe-fat-per
                    (w-det-fun-spe-ctr)   to   w-te2-spe-per
                                              (1, w-det-fun-spe-inx)  .
           move      w-prs-spe-fat-ibl
                    (w-det-fun-spe-ctr)   to   w-te2-spe-ibl
                                              (1, w-det-fun-spe-inx)  .
           move      w-prs-spe-fat-ibt
                    (w-det-fun-spe-ctr)   to   w-te2-spe-ibt
                                              (1, w-det-fun-spe-inx)  .
           move      zero                 to   w-te2-spe-imp
                                              (1, w-det-fun-spe-inx)  .
           go to     det-fun-spe-200.
       det-fun-spe-120.
      *              *-------------------------------------------------*
      *              * Tipo funzionamento : % variabile                *
      *              *-------------------------------------------------*
           move      2                    to   w-te2-spe-mad
                                              (1, w-det-fun-spe-inx)  .
           move      rf-dcf-per-spe
                    (w-det-fun-spe-inx)   to   w-te2-spe-per
                                              (1, w-det-fun-spe-inx)  .
           move      w-prs-spe-fat-ibl
                    (w-det-fun-spe-ctr)   to   w-te2-spe-ibl
                                              (1, w-det-fun-spe-inx)  .
           move      w-prs-spe-fat-ibt
                    (w-det-fun-spe-ctr)   to   w-te2-spe-ibt
                                              (1, w-det-fun-spe-inx)  .
           move      zero                 to   w-te2-spe-imp
                                              (1, w-det-fun-spe-inx)  .
           go to     det-fun-spe-200.
       det-fun-spe-130.
      *              *-------------------------------------------------*
      *              * Tipo funzionamento : importo fisso              *
      *              *-------------------------------------------------*
           move      3                    to   w-te2-spe-mad
                                              (1, w-det-fun-spe-inx)  .
           move      zero                 to   w-te2-spe-per
                                              (1, w-det-fun-spe-inx)  .
           move      zero                 to   w-te2-spe-ibl
                                              (1, w-det-fun-spe-inx)  .
           move      spaces               to   w-te2-spe-ibt
                                              (1, w-det-fun-spe-inx)  .
           move      zero                 to   w-te2-spe-imp
                                              (1, w-det-fun-spe-inx)  .
           move      w-prs-spe-fat-imp
                    (w-det-fun-spe-ctr)   to   w-te2-spe-imp
                                              (1, w-det-fun-spe-inx)  .
           go to     det-fun-spe-200.
       det-fun-spe-140.
      *              *-------------------------------------------------*
      *              * Tipo funzionamento : importo variabile          *
      *              *-------------------------------------------------*
           move      4                    to   w-te2-spe-mad
                                              (1, w-det-fun-spe-inx)  .
           move      zero                 to   w-te2-spe-per
                                              (1, w-det-fun-spe-inx)  .
           move      zero                 to   w-te2-spe-ibl
                                              (1, w-det-fun-spe-inx)  .
           move      spaces               to   w-te2-spe-ibt
                                              (1, w-det-fun-spe-inx)  .
           move      zero                 to   w-te2-spe-imp
                                              (1, w-det-fun-spe-inx)  .
           move      rf-dcf-imp-spe
                    (w-det-fun-spe-inx)   to   w-te2-spe-imp
                                              (1, w-det-fun-spe-inx)  .
           go to     det-fun-spe-200.
       det-fun-spe-150.
      *              *-------------------------------------------------*
      *              * Tipo funzionamento : secondo [dcf]              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo funziona-   *
      *                  * mento espresso in [dcf]                     *
      *                  *---------------------------------------------*
           if        rf-dcf-snm-spe
                    (w-det-fun-spe-inx)   =    03
                     go to det-fun-spe-151
           else if   rf-dcf-snm-spe
                    (w-det-fun-spe-inx)   =    04
                     go to det-fun-spe-152.
       det-fun-spe-151.
      *                  *---------------------------------------------*
      *                  * Tipo funzionamento espresso in [dcf] : a %  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Come per tipo funzionamento espresso in *
      *                      * personalizzazioni : % variabile         *
      *                      *-----------------------------------------*
           go to     det-fun-spe-120.
       det-fun-spe-152.
      *                  *---------------------------------------------*
      *                  * Tipo funzionamento espresso in [dcf] : ad   *
      *                  * importo                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Come per tipo funzionamento espresso in *
      *                      * personalizzazioni : importo variabile   *
      *                      *-----------------------------------------*
           go to     det-fun-spe-140.
       det-fun-spe-200.
      *              *-------------------------------------------------*
      *              * Codice iva della spesa                          *
      *              *-------------------------------------------------*
           move      w-prs-spe-fat-civ
                    (w-det-fun-spe-ctr)   to   w-te2-spe-civ
                                              (1, w-det-fun-spe-inx)  .
      *              *-------------------------------------------------*
      *              * Contropartita della spesa                       *
      *              *-------------------------------------------------*
           move      w-prs-spe-fat-ccp
                    (w-det-fun-spe-ctr)   to   w-te2-spe-ccp
                                              (1, w-det-fun-spe-inx)  .
       det-fun-spe-300.
      *              *-------------------------------------------------*
      *              * Riciclo su scansione tabella personalizzazioni  *
      *              *-------------------------------------------------*
           go to     det-fun-spe-100.
       det-fun-spe-999.
           exit.

      *    *===========================================================*
      *    * Determinazione valori testata dipendenti dalla forma di   *
      *    * pagamento                                                 *
      *    *-----------------------------------------------------------*
       det-vlt-yfp-000.
      *              *-------------------------------------------------*
      *              * Valori da estrarre con qualsiasi tipo funziona- *
      *              * mento                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione sconto pagamento associato  *
      *                  * alla forma di pagamento                     *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-scp-aap (1)      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione valori testata di appoggio  *
      *                  * alle impostazioni dei campi relativi ai pa- *
      *                  * pagamenti                                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-app-pgf (1)      .
           move      spaces               to   w-tes-snx-spm (1)      .
           move      spaces               to   w-tes-snx-qaf (1)      .
           move      spaces               to   w-tes-snx-act (1)      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione valori testata associati al-*
      *                  * la forma pagamento                          *
      *                  *---------------------------------------------*
           perform   nor-cpg-ass-000      thru nor-cpg-ass-999        .
      *                  *---------------------------------------------*
      *                  * Se forma di pagamento a zero : uscita       *
      *                  *---------------------------------------------*
           if        w-tes-cod-fop (1)    =    zero
                     go to det-vlt-yfp-999.
      *                  *---------------------------------------------*
      *                  * Sconto pagamento associato alla forma di    *
      *                  * pagamento                                   *
      *                  *---------------------------------------------*
           move      rf-yfp-sco-fat       to   w-tes-scp-aap (1)      .
      *                  *---------------------------------------------*
      *                  * Sconto pagamento per piede                  *
      *                  *---------------------------------------------*
           if        rf-yfp-sco-fat       not  = zero
                     move  rf-yfp-sco-fat to   w-te2-per-scp (1)      .
      *                  *---------------------------------------------*
      *                  * Ciclo per tre codici pagamento possibili    *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-vlt-yfp-ctr      .
       det-vlt-yfp-100.
           add       1                    to   w-det-vlt-yfp-ctr      .
           if        w-det-vlt-yfp-ctr    >    3
                     go to det-vlt-yfp-999.
           if        rf-yfp-cod-pag
                    (w-det-vlt-yfp-ctr)   =    zero
                     go to det-vlt-yfp-100.
      *                      *-----------------------------------------*
      *                      * Campi testata derivati da record [yfp]  *
      *                      *-----------------------------------------*
           move      rf-yfp-cod-pag
                    (w-det-vlt-yfp-ctr)   to   w-tes-cod-pag
                                              (1, w-det-vlt-yfp-ctr)  .
           move      rf-yfp-tip-amm
                    (w-det-vlt-yfp-ctr)   to   w-tes-tip-amm
                                              (1, w-det-vlt-yfp-ctr)  .
           move      rf-yfp-per-toi
                    (w-det-vlt-yfp-ctr)   to   w-tes-per-toi
                                              (1, w-det-vlt-yfp-ctr)  .
           move      rf-yfp-dim-act
                    (w-det-vlt-yfp-ctr)   to   w-tes-dim-act
                                              (1, w-det-vlt-yfp-ctr)  .
      *                      *-----------------------------------------*
      *                      * Campi testata derivati da record [zpg]  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione record [zpg]        *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofzpg"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpg                 .
      *                          *-------------------------------------*
      *                          * Lettura record [zpg]                *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODPAG"             to   f-key                  .
           move      w-tes-cod-pag
                    (1, w-det-vlt-yfp-ctr)
                                          to   rf-zpg-cod-pag         .
           move      "pgm/gep/fls/ioc/obj/iofzpg"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpg                 .
           move      rf-zpg-tip-pag       to   w-tes-tip-pag
                                              (1, w-det-vlt-yfp-ctr)  .
           move      rf-zpg-num-sca       to   w-tes-num-sca
                                              (1, w-det-vlt-yfp-ctr)  .
           move      rf-zpg-dec-prs       to   w-tes-dec-prs
                                              (1, w-det-vlt-yfp-ctr)  .
           move      rf-zpg-dap-mes       to   w-tes-dap-mes
                                              (1, w-det-vlt-yfp-ctr)  .
           move      rf-zpg-dap-gio       to   w-tes-dap-gio
                                              (1, w-det-vlt-yfp-ctr)  .
           move      rf-zpg-ggg-int       to   w-tes-ggg-int
                                              (1, w-det-vlt-yfp-ctr)  .
           move      rf-zpg-tip-scm       to   w-tes-tip-scm
                                              (1, w-det-vlt-yfp-ctr)  .
           move      rf-zpg-gio-scm       to   w-tes-gio-scm
                                              (1, w-det-vlt-yfp-ctr)  .
       det-vlt-yfp-200.
      *                  *---------------------------------------------*
      *                  * Valori testata di appoggio alle successive  *
      *                  * impostazioni                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo appoggio per pagamento             *
      *                      *-----------------------------------------*
           if        w-tes-app-pgf (1)    not  = zero
                     go to det-vlt-yfp-220.
           if        rf-zpg-tip-pag       =    02 or
                     rf-zpg-tip-pag       =    03 or
                     rf-zpg-tip-pag       =    04 or
                     rf-zpg-tip-pag       =    05 or
                     rf-zpg-tip-pag       =    06 or
                     rf-zpg-tip-pag       =    09 or
                     rf-zpg-tip-pag       =    10 or
                     rf-zpg-tip-pag       =    11
                     move  01             to   w-tes-app-pgf (1)
           else if  (rf-zpg-tip-pag       =    07  ) and
                    (w-tes-cod-tmf-tpv    =    01 or
                     w-tes-cod-tmf-tpv    =    04  )
                     move  02             to   w-tes-app-pgf (1)
           else if   rf-zpg-tip-pag       =    08
                     move  03             to   w-tes-app-pgf (1)
           else if  (rf-zpg-tip-pag       =    07  ) and
                    (w-tes-cod-tmf-tpv    =    02 or
                     w-tes-cod-tmf-tpv    =    03  )
                     move  04             to   w-tes-app-pgf (1)      .
       det-vlt-yfp-220.
      *                      *-----------------------------------------*
      *                      * Si/no data scadenza pagamento manuale   *
      *                      *-----------------------------------------*
           if        rf-zpg-dec-prs       =    01
                     move  "S"            to   w-tes-snx-spm (1)      .
      *                      *-----------------------------------------*
      *                      * Si/no impostazione quota a forfait      *
      *                      *-----------------------------------------*
           if        rf-yfp-tip-amm
                    (w-det-vlt-yfp-ctr)   =    06 or
                     rf-yfp-tip-amm
                    (w-det-vlt-yfp-ctr)   =    07 or
                     rf-yfp-tip-amm
                    (w-det-vlt-yfp-ctr)   =    08 or
                     rf-yfp-tip-amm
                    (w-det-vlt-yfp-ctr)   =    09
                     move  "S"            to   w-tes-snx-qaf (1)      .
      *                      *-----------------------------------------*
      *                      * Si/no impostazione acconto              *
      *                      *-----------------------------------------*
           if        rf-yfp-dim-act
                    (w-det-vlt-yfp-ctr)   =    02
                     move  "S"            to   w-tes-snx-act (1)      .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     det-vlt-yfp-100.
       det-vlt-yfp-999.
           exit.

      *    *===========================================================*
      *    * Determinazione quantita' secondaria per l'acquisto        *
      *    *-----------------------------------------------------------*
           copy      "pgm/ffo/prg/cpy/wdetqts0.wks"                   .

      *    *===========================================================*
      *    * Calcolo prezzo netto                                      *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wcalprz0.cps"                   .

      *    *===========================================================*
      *    * Determinazione prezzo sottoposto a legame valutario       *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wlvlprz0.cps"                   .

      *    *===========================================================*
      *    * Editing di una quantita' da incolonnare                   *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wedtqta0.wks"                   .

      *    *===========================================================*
      *    * Subroutines per editing del codice iva                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/wedtzci0.wks"                   .

      *    *===========================================================*
      *    * Determinazione importo in riga                            *
      *    *-----------------------------------------------------------*
       det-imp-rig-000.
      *              *-------------------------------------------------*
      *              * Test se per il fornitore e' prevista la modifi- *
      *              * manuale dell'importo                            *
      *              *-------------------------------------------------*
           if        w-tes-tip-mci (1)    =    "M"
                     go to det-imp-rig-999.
       det-imp-rig-100.
      *              *-------------------------------------------------*
      *              * Preparazione parametri per la determinazione    *
      *              *-------------------------------------------------*
           move      "IR"                 to   d-imp-acq-tip-ope      .
           move      w-rig-qta-fda (1)    to   d-imp-acq-qta-acq      .
           move      w-rig-prz-acq (1)    to   d-imp-acq-prz-uni      .
           move      w-rig-dec-prz (1)    to   d-imp-acq-dec-prz      .
           move      w-rig-per-scr (1, 1) to   d-imp-acq-per-scr (1)  .
           move      w-rig-per-scr (1, 2) to   d-imp-acq-per-scr (2)  .
           move      w-rig-per-scr (1, 3) to   d-imp-acq-per-scr (3)  .
           move      w-rig-per-scr (1, 4) to   d-imp-acq-per-scr (4)  .
           move      w-rig-per-scr (1, 5) to   d-imp-acq-per-scr (5)  .
           move      w-tes-tip-mci (1)    to   d-imp-acq-tip-clc      .
      *              *-------------------------------------------------*
      *              * Determinazione                                  *
      *              *-------------------------------------------------*
           perform   det-imp-acq-cll-000  thru det-imp-acq-cll-999    .
      *              *-------------------------------------------------*
      *              * In campo di uscita                              *
      *              *-------------------------------------------------*
           move      d-imp-acq-imp-rig    to   w-rig-imp-rig (1)      .
       det-imp-rig-999.
           exit.

      *    *===========================================================*
      *    * Routine di conversione da altra valuta a valuta base      *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wcvsvlt0.cps"                   .

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      16                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      18                   to   v-lto                  .
           move      78                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      74                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      17                   to   v-lin                  .
           move      75                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      16                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      19                   to   v-lto                  .
           move      78                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      74                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      18                   to   v-lin                  .
           move      75                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per l'accettazione del coefficiente di cambio *
      *    * valuta                                                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoecmb0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per modulo di aggiornamento del magazzino     *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/pmag300z.pgs"                   .

      *    *===========================================================*
      *    * Subroutines per determinazione importo in riga acquisti   *
      *    *-----------------------------------------------------------*
           copy      "pgm/ffo/prg/cpy/dimpacq0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

