       Identification Division.
       Program-Id.                                 pgeo9500           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    geo                 *
      *                                Settore:    uti                 *
      *                                   Fase:    geo950              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 08/08/02    *
      *                       Ultima revisione:    NdK del 06/11/06    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Aggiornamento CAP anagrafiche archivi       *
      *                                                                *
      * -------------------------------------------------------------- *
      *                                                                *
      *                    Anagrafiche trattate                        *
      *                    --------------------                        *
      *                                                                *
      * {cge}   [cli]      Clienti                                     *
      * {dcc}   [dcc]      Clienti commerciali                         *
      * {dcc}   [dcm]      Clienti marketing                           *
      *                                                                *
      * {cge}   [fnt]      Fornitori                                   *
      * {dcf}   [dcf]      Fornitori commerciali                       *
      *                                                                *
      * {age}   [age]      Agenti                                      *
      *                                                                *
      * {bol}   [vet]      Vettori                                     *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "geo"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "uti"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "geo950"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pgeo9500"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     " AGGIORNAMENTO CAP ANAGRAFICHE ARCHIVI  "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * File area generica                                        *
      *    *-----------------------------------------------------------*
       01  f-xxx.
           05  f-xxx-nam                  pic  x(04)                  .
           05  f-xxx-pat                  pic  x(40)                  .
           05  f-xxx-des                  pic  x(46)                  .
           05  f-xxx-sts                  pic  x(02)                  .
           05  f-xxx-obj                  pic  x(40)                  .
           05  f-xxx-nrl                  pic  9(09)                  .
           05  f-xxx-nrs                  pic  9(09)                  .
           05  f-xxx-nrc                  pic  9(02)                  .
           05  f-xxx-nrd                  pic  9(01)                  .
           05  f-xxx-opf                  pic  x(02)                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine qry-rou-pri-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-qry-rou-pri      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su modalita' di funzionamento      *
      *        *-------------------------------------------------------*
           05  w-cnt-mfu.
      *            *---------------------------------------------------*
      *            * Visualizzazione forzata da segreteria             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-vis-sgr      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste pre esecuzione interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico interrogazione        *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento automatico interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-aut      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di Si/No primo giro di esecuzione            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-prm-gir      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento qry-routine       *
      *        *-------------------------------------------------------*
           05  w-cnt-qry.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-qry-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-liv.
                   15  w-cnt-qry-sav-l05  pic  x(64)                  .
                   15  w-cnt-qry-sav-l04  pic  x(64)                  .
                   15  w-cnt-qry-sav-l03  pic  x(64)                  .
                   15  w-cnt-qry-sav-l02  pic  x(64)                  .
                   15  w-cnt-qry-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Literals                                              *
      *        *-------------------------------------------------------*
           05  w-cnt-lit.
               10  w-cnt-lit-t80          pic  x(80) value all "="    .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [dcm]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcm"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [age]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/age/fls/rec/rfage"                          .
      *        *-------------------------------------------------------*
      *        * [vet]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bol/fls/rec/rfvet"                          .
      *        *-------------------------------------------------------*
      *        * [gxc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/geo/fls/rec/rfgxc"                          .

      *    *===========================================================*
      *    * Work-area richieste per interrogazione                    *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Conversione automatica o manuale                      *
      *        *  - A  : Automatica                                    *
      *        *  - M  : Manuale                                       *
      *        *-------------------------------------------------------*
           05  rr-aut-man                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Tipo esecuzione                                       *
      *        *  - P  : Prova                                         *
      *        *  - D  : Definitiva                                    *
      *        *-------------------------------------------------------*
           05  rr-tip-exe                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per presa visione                              *
      *        *-------------------------------------------------------*
           05  rr-pre-vis                 pic  x(02)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo conversione                           *
      *        *-------------------------------------------------------*
           05  w-exp-aut-man.
               10  w-exp-aut-man-num      pic  9(02)       value 02   .
               10  w-exp-aut-man-lun      pic  9(02)       value 40   .
               10  w-exp-aut-man-tbl.
                   15  filler             pic  x(40) value
                          "Automatica, per tutti gli archivi       "  .
                   15  filler             pic  x(40) value
                          "Manuale, un archivio alla volta         "  .
      *        *-------------------------------------------------------*
      *        * Work per : Tipo esecuzione                            *
      *        *-------------------------------------------------------*
           05  w-exp-tip-exe.
               10  w-exp-tip-exe-num      pic  9(02)       value 02   .
               10  w-exp-tip-exe-lun      pic  9(02)       value 40   .
               10  w-exp-tip-exe-tbl.
                   15  filler             pic  x(40) value
                          "aggiornamento di Prova                  "  .
                   15  filler             pic  x(40) value
                          "aggiornamento Definitivo                "  .
      *        *-------------------------------------------------------*
      *        * Work per : Risposta Si/No                             *
      *        *-------------------------------------------------------*
           05  w-exp-ris-snx.
               10  w-exp-ris-snx-num      pic  9(02)       value 02   .
               10  w-exp-ris-snx-lun      pic  9(02)       value 02   .
               10  w-exp-ris-snx-tbl.
                   15  filler             pic  x(02) value "Si"       .
                   15  filler             pic  x(02) value "No"       .

      *    *===========================================================*
      *    * Work-area specifica del modulo di i-o                     *
      *    *-----------------------------------------------------------*
       01  w.
      *        *-------------------------------------------------------*
      *        * Indici di comodo                                      *
      *        *-------------------------------------------------------*
           05  w-inx                      pic  9(03)                  .
           05  w-c01                      pic  9(03)                  .
           05  w-c02                      pic  9(03)                  .
           05  w-cdc                      pic  9(06)v9(05)            .
      *        *-------------------------------------------------------*
      *        * Work per messaggi errore                              *
      *        *-------------------------------------------------------*
           05  w-ide-dat                  pic  x(08)                  .
           05  w-ide-saa                  pic  x(03)                  .
           05  w-ide-mes                  pic  x(02)                  .
           05  w-ide-num                  pic  9(07)                  .
           05  w-ide-tip                  pic  x(03)                  .
           05  w-ide-lc1                  pic  x(40)                  .
           05  w-ide-lc2                  pic  x(40)                  .
           05  w-ide-prt                  pic  x(11)                  .
           05  w-ide-prg                  pic  x(09)                  .

      *    *===========================================================*
      *    * Work area di comodo                                       *
      *    *-----------------------------------------------------------*
       01  w-wrk.
      *        *-------------------------------------------------------*
      *        * Contatori generici                                    *
      *        *-------------------------------------------------------*
           05  w-wrk-ctr-001              pic  9(06)v9(03)            .
           05  w-wrk-ctr-002              pic  9(03)v9(05)            .
           05  w-wrk-ctr-003              pic  9(06)                  .
           05  w-wrk-ctr-004              pic  9(06)                  .
           05  w-wrk-ctr-005              pic  9(06)                  .
           05  w-wrk-cmd-prz              pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per ridefinizione CAP                          *
      *        *-------------------------------------------------------*
           05  w-wrk-cap-str              pic  x(05)                  .
           05  w-wrk-cap-str-r redefines
               w-wrk-cap-str.
               10  w-wrk-cap-num          pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per salvataggio localita'                      *
      *        *-------------------------------------------------------*
           05  w-wrk-sav-loc              pic  x(40)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per determinazione comune corrispondente in base *
      *        * a Cap e descrizione                                   *
      *        *-------------------------------------------------------*
           05  w-det-cap-cfl.
               10  w-det-cap-cfl-flg      pic  x(01)                  .
               10  w-det-cap-cfl-ctr      pic  9(05)                  .
               10  w-det-cap-cfl-cap      pic  x(05)                  .
               10  w-det-cap-cfl-cfl      pic  x(30)                  .
               10  w-det-cap-cfl-cmn      pic  9(05)                  .
               10  w-det-cap-cfl-fzn      pic  9(03)                  .
               10  w-det-cap-cfl-lct      pic  9(03)                  .
               10  w-det-cap-cfl-prv      pic  x(03)                  .
               10  w-det-cap-cfl-ele      pic  x(01)                  .
               10  w-det-cap-cfl-cmp      pic  x(30)                  .
               10  w-det-cap-cfl-cmd      pic  x(30)                  .
               10  w-det-cap-cfl-wds      pic  x(40)                  .
               10  w-det-cap-cfl-wcp      pic  x(05)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale                         *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Segnale primo giro di esecuzione                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-prm-gir      .
      *              *-------------------------------------------------*
      *              * Se no richieste : a esecuzione conversione      *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-500.
       main-250.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-500.
      *              *-------------------------------------------------*
      *              * Esecuzione conversione file                     *
      *              *-------------------------------------------------*
           perform   exe-cnv-fil-000      thru exe-cnv-fil-999        .
      *              *-------------------------------------------------*
      *              * Se no richieste : a fine programma              *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Test se fine esecuzione da operatore            *
      *              *-------------------------------------------------*
           if        w-cnt-qry-rou-pri    not  = spaces
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Segnale non piu' primo giro di esecuzione       *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-prm-gir      .
      *              *-------------------------------------------------*
      *              * Test se tipo esecuzione ciclico                 *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S" or
                     w-cnt-fun-snx-cic    not  = "S"
                     go to main-750
           else      go to main-250.
       main-750.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Flag di eventuale visualizzazione forzata       *
      *              *-------------------------------------------------*
           move      s-sts                to   w-cnt-mfu-vis-sgr      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
       pre-exe-pgm-010.
      *              *-------------------------------------------------*
      *              * Test se programma eseguibile                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su flag di eventuale visualizzazione   *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-vis-sgr    not  = "V"
                     go to pre-exe-pgm-020.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Programma non eseguibile dall'utente !            
      -              "               "    to   w-err-box-err-msg      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione messaggio di errore         *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-exe-pgm      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-exe-pgm-999.
       pre-exe-pgm-020.
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No richieste ad utente                       *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No funzionamento ciclico                     *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-cic      .
      *              *-------------------------------------------------*
      *              * Si/No funzionamento automatico                  *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-aut      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * [gxc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [gxc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Abilitazione tasto Do                       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *                  *---------------------------------------------*
      *                  * Tipo conversione                            *
      *                  *---------------------------------------------*
           perform   acc-aut-man-000      thru acc-aut-man-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-200.
      *                  *---------------------------------------------*
      *                  * Tipo esecuzione                             *
      *                  *---------------------------------------------*
           perform   acc-tip-exe-000      thru acc-tip-exe-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-100.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "Conferma esecuzione del programma (S/E) ?"
                                          to   v-not                  .
           move      " "                  to   v-alf                  .
           move      "SE"                 to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Tipo conversione                                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo conversione           :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Tipo esecuzione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo esecuzione            :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Preparazione linea di separazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Tipo conversione           *
      *    *-----------------------------------------------------------*
       acc-aut-man-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-aut-man-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-aut-man-lun    to   v-car                  .
           move      w-exp-aut-man-num    to   v-ldt                  .
           move      "AM#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-aut-man-tbl    to   v-txt                  .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      04                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        rr-aut-man           =    "A"
                     move  01             to   v-num
           else if   rr-aut-man           =    "M"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-aut-man-999.
       acc-aut-man-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  "A"            to   rr-aut-man
           else if   v-num                =    02
                     move  "M"            to   rr-aut-man
           else      move  spaces         to   rr-aut-man             .
       acc-aut-man-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        rr-aut-man           =    spaces
                     go to acc-aut-man-100.
       acc-aut-man-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-aut-man-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-aut-man-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-aut-man-100.
       acc-aut-man-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Tipo esecuzione            *
      *    *-----------------------------------------------------------*
       acc-tip-exe-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-tip-exe-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-exe-lun    to   v-car                  .
           move      w-exp-tip-exe-num    to   v-ldt                  .
           move      "PD#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-tip-exe-tbl    to   v-txt                  .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      05                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        rr-tip-exe           =    "P"
                     move  01             to   v-num
           else if   rr-tip-exe           =    "D"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-tip-exe-999.
       acc-tip-exe-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  "P"            to   rr-tip-exe
           else if   v-num                =    02
                     move  "D"            to   rr-tip-exe
           else      move  spaces         to   rr-tip-exe             .
       acc-tip-exe-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        rr-tip-exe           =    spaces
                     go to acc-tip-exe-100.
       acc-tip-exe-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-tip-exe-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-tip-exe-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-tip-exe-100.
       acc-tip-exe-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Controllo su tipo conversione                   *
      *              *-------------------------------------------------*
           if        rr-aut-man           =    "A" or
                     rr-aut-man           =    "M"
                     go to tdo-ric-sel-200.
           move      "ME"                 to   v-ope                  .
           move      "Tipo conversione errato !"
                                          to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "#"                  to   w-cnt-tdo-ric-flg      .
           go to     tdo-ric-sel-999.
       tdo-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Tipo esecuzione                                 *
      *              *-------------------------------------------------*
           if        rr-tip-exe           not  = "D"
                     move  "P"            to   rr-tip-exe             .
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
           move      spaces               to   rr-aut-man             .
           move      spaces               to   rr-tip-exe             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione routine di conversione                         *
      *    *-----------------------------------------------------------*
       exe-cnv-fil-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione rullino messaggi di foreground *
      *              *-------------------------------------------------*
           move      "OF"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       exe-cnv-fil-100.
      *              *-------------------------------------------------*
      *              * Record letti                                    *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Record letti               :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Record scritti                                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Record scritti             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Aggiornamento archivio [cli]                    *
      *              *-------------------------------------------------*
           perform   exe-agg-cli-000      thru exe-agg-cli-999        .
      *              *-------------------------------------------------*
      *              * Aggiornamento archivio [dcc]                    *
      *              *-------------------------------------------------*
           perform   exe-agg-dcc-000      thru exe-agg-dcc-999        .
      *              *-------------------------------------------------*
      *              * Aggiornamento archivio [dcm]                    *
      *              *-------------------------------------------------*
           perform   exe-agg-dcm-000      thru exe-agg-dcm-999        .
      *              *-------------------------------------------------*
      *              * Aggiornamento archivio [fnt]                    *
      *              *-------------------------------------------------*
           perform   exe-agg-fnt-000      thru exe-agg-fnt-999        .
      *              *-------------------------------------------------*
      *              * Aggiornamento archivio [dcf]                    *
      *              *-------------------------------------------------*
           perform   exe-agg-dcf-000      thru exe-agg-dcf-999        .
      *              *-------------------------------------------------*
      *              * Aggiornamento archivio [age]                    *
      *              *-------------------------------------------------*
           perform   exe-agg-age-000      thru exe-agg-age-999        .
      *              *-------------------------------------------------*
      *              * Aggiornamento archivio [vet]                    *
      *              *-------------------------------------------------*
           perform   exe-agg-vet-000      thru exe-agg-vet-999        .
       exe-cnv-fil-800.
      *              *-------------------------------------------------*
      *              * Visualizzazione rullino messaggi                *
      *              *-------------------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "F"                  to   b-tfe                  .
           move      i-ide-des            to   b-chr                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
           cancel    "swd/mod/prg/obj/mbckgv"                         .
       exe-cnv-fil-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione routine di conversione                         *
      *    *                                                           *
      *    * Messaggio di aggiornamento                                *
      *    *-----------------------------------------------------------*
       exe-cnv-fil-msg-000.
      *              *-------------------------------------------------*
      *              * Preparazione                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing codice archivio                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-ide-num            to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Messaggio 1                                 *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      "NEW :"              to   w-all-str-cat (1)      .
           move      w-ide-lc1            to   w-all-str-cat (2)      .
      *
           if        w-ide-tip            =    "cli"
                     move  "- Cliente contabile :"  
                                          to   w-all-str-cat (3)
           else if   w-ide-tip            =    "dcc"
                     move  "- Cliente commerciale :"
                                          to   w-all-str-cat (3)
           else if   w-ide-tip            =    "dcm"
                     move  "- Cliente Marketing :"
                                          to   w-all-str-cat (3)
           else if   w-ide-tip            =    "fnt"
                     move  "- Fornitore contabile :"
                                          to   w-all-str-cat (3)
           else if   w-ide-tip            =    "dcf"
                     move  "- Fornitore commerciale :"
                                          to   w-all-str-cat (3)
           else if   w-ide-tip            =    "age"
                     move  "- Agente :"
                                          to   w-all-str-cat (3)
           else if   w-ide-tip            =    "vet"
                     move  "- Vettore :"
                                          to   w-all-str-cat (3)
           else      move  "- ??? :"      to   w-all-str-cat (3)      .
      *
           move      v-edt                to   w-all-str-cat (4)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   m-msg                  .
      *
           move      "WR"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Messaggio 2                                 *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "old :"              to   w-all-str-cat (1)      .
           move      w-ide-lc2            to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   m-msg                  .
      *
           move      "WR"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Messaggio 3                                 *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      all "-"              to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       exe-cnv-fil-msg-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione routine di conversione                         *
      *    *                                                           *
      *    * Messaggio di errore stradario                             *
      *    *-----------------------------------------------------------*
       exe-err-str-msg-000.
      *              *-------------------------------------------------*
      *              * Preparazione                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing codice archivio                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-ide-num            to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Messaggio 1                                 *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      "Stradario da verificare :"
                                          to   w-all-str-cat (1)      .
           move      w-ide-lc1            to   w-all-str-cat (2)      .
      *
           if        w-ide-tip            =    "cli"
                     move  "- Cliente contabile :"  
                                          to   w-all-str-cat (3)
           else if   w-ide-tip            =    "dcc"
                     move  "- Cliente commerciale :"
                                          to   w-all-str-cat (3)
           else if   w-ide-tip            =    "dcm"
                     move  "- Cliente Marketing :"
                                          to   w-all-str-cat (3)
           else if   w-ide-tip            =    "fnt"
                     move  "- Fornitore contabile :"
                                          to   w-all-str-cat (3)
           else if   w-ide-tip            =    "dcf"
                     move  "- Fornitore commerciale :"
                                          to   w-all-str-cat (3)
           else if   w-ide-tip            =    "age"
                     move  "- Agente :"
                                          to   w-all-str-cat (3)
           else if   w-ide-tip            =    "vet"
                     move  "- Vettore :"
                                          to   w-all-str-cat (3)
           else      move  "- ??? :"      to   w-all-str-cat (3)      .
      *
           move      v-edt                to   w-all-str-cat (4)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   m-msg                  .
      *
           move      "WR"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Messaggio 3                                 *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      all "-"              to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       exe-err-str-msg-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [cli]                              *
      *    *-----------------------------------------------------------*
       exe-agg-cli-000.
      *              *-------------------------------------------------*
      *              * Preparazione file area generica                 *
      *              *-------------------------------------------------*
           move      "cli "               to   f-xxx-nam              .
      *              *-------------------------------------------------*
      *              * Richiesta di conferma, se manuale               *
      *              *-------------------------------------------------*
           perform   ric-cnf-man-000      thru ric-cnf-man-999        .
      *              *-------------------------------------------------*
      *              * Se non confermato : ad uscita                   *
      *              *-------------------------------------------------*
           if        f-xxx-sts            not  = "S"
                     go to exe-agg-cli-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Numero records letti e scritti a zero           *
      *              *-------------------------------------------------*
           move      zero                 to   f-xxx-nrl              .
           move      zero                 to   f-xxx-nrs              .
       exe-agg-cli-050.
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-xxx-opf              .
           perform   exe-agg-cli-opf-000  thru exe-agg-cli-opf-999    .
       exe-agg-cli-100.
      *              *-------------------------------------------------*
      *              * Start su [cli]                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-xxx-opf              .
           move      "NL"                 to   f-cfr                  .
           move      "CODCLI    "         to   f-key                  .
           move      zero                 to   rf-cli-cod-cli         .
           perform   exe-agg-cli-opf-000  thru exe-agg-cli-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a close file              *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-cli-800.
       exe-agg-cli-200.
      *              *-------------------------------------------------*
      *              * Get next su [cli]                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "GN"                 to   f-xxx-opf              .
           perform   exe-agg-cli-opf-000  thru exe-agg-cli-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : a close file                  *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to exe-agg-cli-300.
      *                  *---------------------------------------------*
      *                  * Rilascio del record                         *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-cli-opf-000  thru exe-agg-cli-opf-999    .
      *                  *---------------------------------------------*
      *                  * A close                                     *
      *                  *---------------------------------------------*
           go to     exe-agg-cli-800.
       exe-agg-cli-300.
      *              *-------------------------------------------------*
      *              * Max su [cli], se non superato : a close file    *
      *              *-------------------------------------------------*
       exe-agg-cli-400.
      *              *-------------------------------------------------*
      *              * Sel su [cli]                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se Italia                              *
      *                  *---------------------------------------------*
           if        rf-cli-cod-naz       =    "IT "
                     go to exe-agg-cli-420.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-cli-690.
       exe-agg-cli-420.
      *                  *---------------------------------------------*
      *                  * Test se CAP nella stringa localita'         *
      *                  *---------------------------------------------*
           move      rf-cli-loc-cli       to   w-wrk-cap-str          .
           if        w-wrk-cap-num        numeric
                     go to exe-agg-cli-500.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-cli-690.
       exe-agg-cli-500.
      *              *-------------------------------------------------*
      *              * Incremento numero records letti                 *
      *              *-------------------------------------------------*
           perform   inc-rec-let-000      thru inc-rec-let-999        .
       exe-agg-cli-510.
      *              *-------------------------------------------------*
      *              * Trattamento localita'                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se presenti coordinate 'geo'           *
      *                  *---------------------------------------------*
           if        rf-cli-cod-cmn       =   zero and
                     rf-cli-cod-fzn       =   zero and
                     rf-cli-cod-lct       =   zero
                     go to exe-agg-cli-600.
      *                  *---------------------------------------------*
      *                  * Lettura [gxc]                               *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      rf-cli-cod-cmn       to   rf-gxc-cod-cmn         .
           move      rf-cli-cod-fzn       to   rf-gxc-cod-fzn         .
           move      rf-cli-cod-lct       to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                      *-----------------------------------------*
      *                      * Test su esito lettura                   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-cli-600.
       exe-agg-cli-520.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi con stradario           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su sigla stradario                 *
      *                      *-----------------------------------------*
           if        rf-gxc-sgl-std       =    spaces
                     go to exe-agg-cli-540.
      *                      *-----------------------------------------*
      *                      * Test su CAP                             *
      *                      *-----------------------------------------*
           if        rf-cli-loc-cli
                    (04 : 02)             not = "00"
                     go to exe-agg-cli-690.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore stradario           *
      *                      *-----------------------------------------*
           move      "cli"                to   w-ide-tip              .
           move      rf-cli-cod-cli       to   w-ide-num              .
           move      rf-cli-loc-cli       to   w-ide-lc1              .
           perform   exe-err-str-msg-000  thru exe-err-str-msg-999    .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     exe-agg-cli-690.
       exe-agg-cli-540.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi senza CAP               *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    spaces
                     go to exe-agg-cli-690.
      *                  *---------------------------------------------*
      *                  * Confronto del CAP                           *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    w-wrk-cap-str
                     go to exe-agg-cli-690.
      *                  *---------------------------------------------*
      *                  * Aggiornamento CAP                           *
      *                  *---------------------------------------------*
           move      rf-cli-loc-cli       to   w-wrk-sav-loc          .
           move      rf-gxc-cap-avp       to   rf-cli-loc-cli
                                              (01 : 05)               .
      *                  *---------------------------------------------*
      *                  * A update                                    *
      *                  *---------------------------------------------*
           go to     exe-agg-cli-680.
       exe-agg-cli-600.
      *                  *---------------------------------------------*
      *                  * Se non presenti coordinate 'geo'            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tentativo di lettura delle coordinate   *
      *                      * geografiche in base alla descrizione    *
      *                      * del comune pulita con controllo sul     *
      *                      * codice provincia                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione codice provincia     *
      *                          *-------------------------------------*
           move      spaces               to   w-det-cap-cfl-prv      .
           move      40                   to   w-wrk-ctr-004          .
           move      zero                 to   w-wrk-ctr-003          .
           inspect   rf-cli-loc-cli   tallying w-wrk-ctr-003
                                  for trailing spaces                 .
           subtract  w-wrk-ctr-003        from w-wrk-ctr-004          .
           subtract  2                    from w-wrk-ctr-004
                                        giving w-wrk-ctr-005          .
           if        rf-cli-loc-cli
                    (w-wrk-ctr-005 : 01)  not  = spaces
                     go to exe-agg-cli-690.
           add       1                    to   w-wrk-ctr-005          .
           move      rf-cli-loc-cli
                    (w-wrk-ctr-005 : 02)  to   w-det-cap-cfl-prv      .
           if        w-det-cap-cfl-prv    =    spaces
                     go to exe-agg-cli-690.
      *                          *-------------------------------------*
      *                          * Determinazione CAP                  *
      *                          *-------------------------------------*
           move      rf-cli-loc-cli       to   w-det-cap-cfl-wcp      .
      *                          *-------------------------------------*
      *                          * Determinazione localita'            *
      *                          *-------------------------------------*
           move      rf-cli-loc-cli       to   w-det-cap-cfl-wds      .
           move      spaces               to   w-det-cap-cfl-wds
                                              (w-wrk-ctr-005 : 02)    .
           move      w-det-cap-cfl-wds
                    (07 : 34)             to   w-det-cap-cfl-wds      .
           move      w-det-cap-cfl-wds    to   w-det-cap-cfl-cfl      .
      *                          *-------------------------------------*
      *                          * Determinazione                      *
      *                          *-------------------------------------*
           perform   det-cap-cfl-000      thru det-cap-cfl-999        .
      *                          *-------------------------------------*
      *                          * Test su esito della lettura         *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-flg    not  = spaces
                     go to exe-agg-cli-690.
      *                          *-------------------------------------*
      *                          * Esclusione elementi senza CAP       *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-wcp    =    spaces or
                     w-det-cap-cfl-cap    =    spaces
                     go to exe-agg-cli-690.
      *                          *-------------------------------------*
      *                          * Confronto del CAP                   *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-cap    =    w-det-cap-cfl-wcp
                     go to exe-agg-cli-690.
      *                          *-------------------------------------*
      *                          * Aggiornamento CAP                   *
      *                          *-------------------------------------*
           move      rf-cli-loc-cli       to   w-wrk-sav-loc          .
           move      w-det-cap-cfl-cap    to   rf-cli-loc-cli
                                              (01 : 05)               .
      *                          *-------------------------------------*
      *                          * A update                            *
      *                          *-------------------------------------*
           go to     exe-agg-cli-680.
       exe-agg-cli-680.
      *              *-------------------------------------------------*
      *              * Update record [cli]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo esecuzione                     *
      *                  *---------------------------------------------*
           if        rr-tip-exe           not  = "D"
                     go to exe-agg-cli-685.
      *                  *---------------------------------------------*
      *                  * Update                                      *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-xxx-opf              .
           perform   exe-agg-cli-opf-000  thru exe-agg-cli-opf-999    .
       exe-agg-cli-685.
      *              *-------------------------------------------------*
      *              * Incremento numero records scritti               *
      *              *-------------------------------------------------*
           perform   inc-rec-scr-000      thru inc-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Messaggio                                       *
      *              *-------------------------------------------------*
           move      "cli"                to   w-ide-tip              .
           move      rf-cli-cod-cli       to   w-ide-num              .
           move      rf-cli-loc-cli       to   w-ide-lc1              .
           move      w-wrk-sav-loc        to   w-ide-lc2              .
           perform   exe-cnv-fil-msg-000  thru exe-cnv-fil-msg-999    .
       exe-agg-cli-690.
      *              *-------------------------------------------------*
      *              * Rilascio del record                             *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-cli-opf-000  thru exe-agg-cli-opf-999    .
       exe-agg-cli-700.
      *              *-------------------------------------------------*
      *              * Riciclo su [cli]                                *
      *              *-------------------------------------------------*
           go to     exe-agg-cli-200.
       exe-agg-cli-800.
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-xxx-opf              .
           perform   exe-agg-cli-opf-000  thru exe-agg-cli-opf-999    .
       exe-agg-cli-850.
      *              *-------------------------------------------------*
      *              * Visualizzazione nr records letti e scritti      *
      *              *-------------------------------------------------*
           perform   vis-rec-let-000      thru vis-rec-let-999        .
           perform   vis-rec-scr-000      thru vis-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Accettazione presa visione                      *
      *              *-------------------------------------------------*
           perform   acc-pre-vis-000      thru acc-pre-vis-999        .
       exe-agg-cli-900.
      *              *-------------------------------------------------*
      *              * Scrittura rullino messaggi                      *
      *              *-------------------------------------------------*
           perform   wrt-rou-msg-000      thru wrt-rou-msg-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-agg-cli-999.
       exe-agg-cli-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [cli]                              *
      *    *                                                           *
      *    * Operazioni su file                                        *
      *    *-----------------------------------------------------------*
       exe-agg-cli-opf-000.
      *              *-------------------------------------------------*
      *              * Tipo operazione                                 *
      *              *-------------------------------------------------*
           move      f-xxx-opf            to   f-ope                  .
      *              *-------------------------------------------------*
      *              * Esecuzione                                      *
      *              *-------------------------------------------------*
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
       exe-agg-cli-opf-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [dcc]                              *
      *    *-----------------------------------------------------------*
       exe-agg-dcc-000.
      *              *-------------------------------------------------*
      *              * Preparazione file area generica                 *
      *              *-------------------------------------------------*
           move      "dcc "               to   f-xxx-nam              .
      *              *-------------------------------------------------*
      *              * Richiesta di conferma, se manuale               *
      *              *-------------------------------------------------*
           perform   ric-cnf-man-000      thru ric-cnf-man-999        .
      *              *-------------------------------------------------*
      *              * Se non confermato : ad uscita                   *
      *              *-------------------------------------------------*
           if        f-xxx-sts            not  = "S"
                     go to exe-agg-dcc-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Numero records letti e scritti a zero           *
      *              *-------------------------------------------------*
           move      zero                 to   f-xxx-nrl              .
           move      zero                 to   f-xxx-nrs              .
       exe-agg-dcc-050.
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-xxx-opf              .
           perform   exe-agg-dcc-opf-000  thru exe-agg-dcc-opf-999    .
       exe-agg-dcc-100.
      *              *-------------------------------------------------*
      *              * Start su [dcc]                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-xxx-opf              .
           move      "NL"                 to   f-cfr                  .
           move      "CODCLI    "         to   f-key                  .
           move      zero                 to   rf-dcc-cod-cli         .
           move      spaces               to   rf-dcc-dpz-cli         .
           perform   exe-agg-dcc-opf-000  thru exe-agg-dcc-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a close file              *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-dcc-800.
       exe-agg-dcc-200.
      *              *-------------------------------------------------*
      *              * Get next su [dcc]                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "GN"                 to   f-xxx-opf              .
           perform   exe-agg-dcc-opf-000  thru exe-agg-dcc-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : a close file                  *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to exe-agg-dcc-300.
      *                  *---------------------------------------------*
      *                  * Rilascio del record                         *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-dcc-opf-000  thru exe-agg-dcc-opf-999    .
      *                  *---------------------------------------------*
      *                  * A close                                     *
      *                  *---------------------------------------------*
           go to     exe-agg-dcc-800.
       exe-agg-dcc-300.
      *              *-------------------------------------------------*
      *              * Max su [dcc], se non superato : a close file    *
      *              *-------------------------------------------------*
       exe-agg-dcc-400.
      *              *-------------------------------------------------*
      *              * Sel su [dcc]                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se Italia                              *
      *                  *---------------------------------------------*
           if        rf-dcc-cod-naz       =    "IT "
                     go to exe-agg-dcc-420.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-dcc-690.
       exe-agg-dcc-420.
      *                  *---------------------------------------------*
      *                  * Test se CAP nella stringa localita'         *
      *                  *---------------------------------------------*
           move      rf-dcc-loc-dcc       to   w-wrk-cap-str          .
           if        w-wrk-cap-num        numeric
                     go to exe-agg-dcc-500.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-dcc-690.
       exe-agg-dcc-500.
      *              *-------------------------------------------------*
      *              * Incremento numero records letti                 *
      *              *-------------------------------------------------*
           perform   inc-rec-let-000      thru inc-rec-let-999        .
       exe-agg-dcc-510.
      *              *-------------------------------------------------*
      *              * Trattamento localita'                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se presenti coordinate 'geo'           *
      *                  *---------------------------------------------*
           if        rf-dcc-cod-cmn       =   zero and
                     rf-dcc-cod-fzn       =   zero and
                     rf-dcc-cod-lct       =   zero
                     go to exe-agg-dcc-600.
      *                  *---------------------------------------------*
      *                  * Lettura [gxc]                               *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      rf-dcc-cod-cmn       to   rf-gxc-cod-cmn         .
           move      rf-dcc-cod-fzn       to   rf-gxc-cod-fzn         .
           move      rf-dcc-cod-lct       to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                      *-----------------------------------------*
      *                      * Test su esito lettura                   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-dcc-600.
       exe-agg-dcc-520.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi con stradario           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su sigla stradario                 *
      *                      *-----------------------------------------*
           if        rf-gxc-sgl-std       =    spaces
                     go to exe-agg-dcc-540.
      *                      *-----------------------------------------*
      *                      * Test su CAP                             *
      *                      *-----------------------------------------*
           if        rf-dcc-loc-dcc
                    (04 : 02)             not = "00"
                     go to exe-agg-dcc-690.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore stradario           *
      *                      *-----------------------------------------*
           move      "dcc"                to   w-ide-tip              .
           move      rf-dcc-cod-cli       to   w-ide-num              .
           move      rf-dcc-loc-dcc       to   w-ide-lc1              .
           perform   exe-err-str-msg-000  thru exe-err-str-msg-999    .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     exe-agg-dcc-690.
       exe-agg-dcc-540.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi senza CAP               *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    spaces
                     go to exe-agg-dcc-690.
      *                  *---------------------------------------------*
      *                  * Confronto del CAP                           *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    w-wrk-cap-str
                     go to exe-agg-dcc-690.
      *                  *---------------------------------------------*
      *                  * Aggiornamento CAP                           *
      *                  *---------------------------------------------*
           move      rf-dcc-loc-dcc       to   w-wrk-sav-loc          .
           move      rf-gxc-cap-avp       to   rf-dcc-loc-dcc
                                              (01 : 05)               .
      *                  *---------------------------------------------*
      *                  * A update                                    *
      *                  *---------------------------------------------*
           go to     exe-agg-dcc-680.
       exe-agg-dcc-600.
      *                  *---------------------------------------------*
      *                  * Se non presenti coordinate 'geo'            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tentativo di lettura delle coordinate   *
      *                      * geografiche in base alla descrizione    *
      *                      * del comune pulita con controllo sul     *
      *                      * codice provincia                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione codice provincia     *
      *                          *-------------------------------------*
           move      spaces               to   w-det-cap-cfl-prv      .
           move      40                   to   w-wrk-ctr-004          .
           move      zero                 to   w-wrk-ctr-003          .
           inspect   rf-dcc-loc-dcc   tallying w-wrk-ctr-003
                                  for trailing spaces                 .
           subtract  w-wrk-ctr-003        from w-wrk-ctr-004          .
           subtract  2                    from w-wrk-ctr-004
                                        giving w-wrk-ctr-005          .
           if        rf-dcc-loc-dcc
                    (w-wrk-ctr-005 : 01)  not  = spaces
                     go to exe-agg-dcc-690.
           add       1                    to   w-wrk-ctr-005          .
           move      rf-dcc-loc-dcc
                    (w-wrk-ctr-005 : 02)  to   w-det-cap-cfl-prv      .
           if        w-det-cap-cfl-prv    =    spaces
                     go to exe-agg-dcc-690.
      *                          *-------------------------------------*
      *                          * Determinazione CAP                  *
      *                          *-------------------------------------*
           move      rf-dcc-loc-dcc       to   w-det-cap-cfl-wcp      .
      *                          *-------------------------------------*
      *                          * Determinazione localita'            *
      *                          *-------------------------------------*
           move      rf-dcc-loc-dcc       to   w-det-cap-cfl-wds      .
           move      spaces               to   w-det-cap-cfl-wds
                                              (w-wrk-ctr-005 : 02)    .
           move      w-det-cap-cfl-wds
                    (07 : 34)             to   w-det-cap-cfl-wds      .
           move      w-det-cap-cfl-wds    to   w-det-cap-cfl-cfl      .
      *                          *-------------------------------------*
      *                          * Determinazione                      *
      *                          *-------------------------------------*
           perform   det-cap-cfl-000      thru det-cap-cfl-999        .
      *                          *-------------------------------------*
      *                          * Test su esito della lettura         *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-flg    not  = spaces
                     go to exe-agg-dcc-690.
      *                          *-------------------------------------*
      *                          * Esclusione elementi senza CAP       *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-wcp    =    spaces or
                     w-det-cap-cfl-cap    =    spaces
                     go to exe-agg-dcc-690.
      *                          *-------------------------------------*
      *                          * Confronto del CAP                   *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-cap    =    w-det-cap-cfl-wcp
                     go to exe-agg-dcc-690.
      *                          *-------------------------------------*
      *                          * Aggiornamento CAP                   *
      *                          *-------------------------------------*
           move      rf-dcc-loc-dcc       to   w-wrk-sav-loc          .
           move      w-det-cap-cfl-cap    to   rf-dcc-loc-dcc
                                              (01 : 05)               .
      *                          *-------------------------------------*
      *                          * A update                            *
      *                          *-------------------------------------*
           go to     exe-agg-dcc-680.
       exe-agg-dcc-680.
      *              *-------------------------------------------------*
      *              * Update record [dcc]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo esecuzione                     *
      *                  *---------------------------------------------*
           if        rr-tip-exe           not  = "D"
                     go to exe-agg-dcc-685.
      *                  *---------------------------------------------*
      *                  * Update                                      *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-xxx-opf              .
           perform   exe-agg-dcc-opf-000  thru exe-agg-dcc-opf-999    .
       exe-agg-dcc-685.
      *              *-------------------------------------------------*
      *              * Incremento numero records scritti               *
      *              *-------------------------------------------------*
           perform   inc-rec-scr-000      thru inc-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Messaggio                                       *
      *              *-------------------------------------------------*
           move      "dcc"                to   w-ide-tip              .
           move      rf-dcc-cod-cli       to   w-ide-num              .
           move      rf-dcc-loc-dcc       to   w-ide-lc1              .
           move      w-wrk-sav-loc        to   w-ide-lc2              .
           perform   exe-cnv-fil-msg-000  thru exe-cnv-fil-msg-999    .
       exe-agg-dcc-690.
      *              *-------------------------------------------------*
      *              * Rilascio del record                             *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-dcc-opf-000  thru exe-agg-dcc-opf-999    .
       exe-agg-dcc-700.
      *              *-------------------------------------------------*
      *              * Riciclo su [dcc]                                *
      *              *-------------------------------------------------*
           go to     exe-agg-dcc-200.
       exe-agg-dcc-800.
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-xxx-opf              .
           perform   exe-agg-dcc-opf-000  thru exe-agg-dcc-opf-999    .
       exe-agg-dcc-850.
      *              *-------------------------------------------------*
      *              * Visualizzazione nr records letti e scritti      *
      *              *-------------------------------------------------*
           perform   vis-rec-let-000      thru vis-rec-let-999        .
           perform   vis-rec-scr-000      thru vis-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Accettazione presa visione                      *
      *              *-------------------------------------------------*
           perform   acc-pre-vis-000      thru acc-pre-vis-999        .
       exe-agg-dcc-900.
      *              *-------------------------------------------------*
      *              * Scrittura rullino messaggi                      *
      *              *-------------------------------------------------*
           perform   wrt-rou-msg-000      thru wrt-rou-msg-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-agg-dcc-999.
       exe-agg-dcc-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [dcc]                              *
      *    *                                                           *
      *    * Operazioni su file                                        *
      *    *-----------------------------------------------------------*
       exe-agg-dcc-opf-000.
      *              *-------------------------------------------------*
      *              * Tipo operazione                                 *
      *              *-------------------------------------------------*
           move      f-xxx-opf            to   f-ope                  .
      *              *-------------------------------------------------*
      *              * Esecuzione                                      *
      *              *-------------------------------------------------*
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
       exe-agg-dcc-opf-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [dcm]                              *
      *    *-----------------------------------------------------------*
       exe-agg-dcm-000.
      *              *-------------------------------------------------*
      *              * Preparazione file area generica                 *
      *              *-------------------------------------------------*
           move      "dcm "               to   f-xxx-nam              .
      *              *-------------------------------------------------*
      *              * Richiesta di conferma, se manuale               *
      *              *-------------------------------------------------*
           perform   ric-cnf-man-000      thru ric-cnf-man-999        .
      *              *-------------------------------------------------*
      *              * Se non confermato : ad uscita                   *
      *              *-------------------------------------------------*
           if        f-xxx-sts            not  = "S"
                     go to exe-agg-dcm-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Numero records letti e scritti a zero           *
      *              *-------------------------------------------------*
           move      zero                 to   f-xxx-nrl              .
           move      zero                 to   f-xxx-nrs              .
       exe-agg-dcm-050.
      *              *-------------------------------------------------*
      *              * [dcm]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-xxx-opf              .
           perform   exe-agg-dcm-opf-000  thru exe-agg-dcm-opf-999    .
       exe-agg-dcm-100.
      *              *-------------------------------------------------*
      *              * Start su [dcm]                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-xxx-opf              .
           move      "NL"                 to   f-cfr                  .
           move      "CODCLI    "         to   f-key                  .
           move      zero                 to   rf-dcm-cod-cli         .
           perform   exe-agg-dcm-opf-000  thru exe-agg-dcm-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a close file              *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-dcm-800.
       exe-agg-dcm-200.
      *              *-------------------------------------------------*
      *              * Get next su [dcm]                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "GN"                 to   f-xxx-opf              .
           perform   exe-agg-dcm-opf-000  thru exe-agg-dcm-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : a close file                  *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to exe-agg-dcm-300.
      *                  *---------------------------------------------*
      *                  * Rilascio del record                         *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-dcm-opf-000  thru exe-agg-dcm-opf-999    .
      *                  *---------------------------------------------*
      *                  * A close                                     *
      *                  *---------------------------------------------*
           go to     exe-agg-dcm-800.
       exe-agg-dcm-300.
      *              *-------------------------------------------------*
      *              * Max su [dcm], se non superato : a close file    *
      *              *-------------------------------------------------*
       exe-agg-dcm-400.
      *              *-------------------------------------------------*
      *              * Sel su [dcm]                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se Italia                              *
      *                  *---------------------------------------------*
           if        rf-dcm-cod-naz       =    "IT "
                     go to exe-agg-dcm-420.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-dcm-690.
       exe-agg-dcm-420.
      *                  *---------------------------------------------*
      *                  * Test se CAP nella stringa localita'         *
      *                  *---------------------------------------------*
           move      rf-dcm-loc-cli       to   w-wrk-cap-str          .
           if        w-wrk-cap-num        numeric
                     go to exe-agg-dcm-500.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-dcm-690.
       exe-agg-dcm-500.
      *              *-------------------------------------------------*
      *              * Incremento numero records letti                 *
      *              *-------------------------------------------------*
           perform   inc-rec-let-000      thru inc-rec-let-999        .
       exe-agg-dcm-510.
      *              *-------------------------------------------------*
      *              * Trattamento localita'                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se presenti coordinate 'geo'           *
      *                  *---------------------------------------------*
           if        rf-dcm-cod-cmn       =   zero and
                     rf-dcm-cod-fzn       =   zero and
                     rf-dcm-cod-lct       =   zero
                     go to exe-agg-dcm-600.
      *                  *---------------------------------------------*
      *                  * Lettura [gxc]                               *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      rf-dcm-cod-cmn       to   rf-gxc-cod-cmn         .
           move      rf-dcm-cod-fzn       to   rf-gxc-cod-fzn         .
           move      rf-dcm-cod-lct       to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                      *-----------------------------------------*
      *                      * Test su esito lettura                   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-dcm-600.
       exe-agg-dcm-520.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi con stradario           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su sigla stradario                 *
      *                      *-----------------------------------------*
           if        rf-gxc-sgl-std       =    spaces
                     go to exe-agg-dcm-540.
      *                      *-----------------------------------------*
      *                      * Test su CAP                             *
      *                      *-----------------------------------------*
           if        rf-dcm-loc-cli
                    (04 : 02)             not = "00"
                     go to exe-agg-dcm-690.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore stradario           *
      *                      *-----------------------------------------*
           move      "dcm"                to   w-ide-tip              .
           move      rf-dcm-cod-cli       to   w-ide-num              .
           move      rf-dcm-loc-cli       to   w-ide-lc1              .
           perform   exe-err-str-msg-000  thru exe-err-str-msg-999    .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     exe-agg-dcm-690.
       exe-agg-dcm-540.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi senza CAP               *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    spaces
                     go to exe-agg-dcm-690.
      *                  *---------------------------------------------*
      *                  * Confronto del CAP                           *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    w-wrk-cap-str
                     go to exe-agg-dcm-690.
      *                  *---------------------------------------------*
      *                  * Aggiornamento CAP                           *
      *                  *---------------------------------------------*
           move      rf-dcm-loc-cli       to   w-wrk-sav-loc          .
           move      rf-gxc-cap-avp       to   rf-dcm-loc-cli
                                              (01 : 05)               .
      *                  *---------------------------------------------*
      *                  * A update                                    *
      *                  *---------------------------------------------*
           go to     exe-agg-dcm-680.
       exe-agg-dcm-600.
      *                  *---------------------------------------------*
      *                  * Se non presenti coordinate 'geo'            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tentativo di lettura delle coordinate   *
      *                      * geografiche in base alla descrizione    *
      *                      * del comune pulita con controllo sul     *
      *                      * codice provincia                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione codice provincia     *
      *                          *-------------------------------------*
           move      spaces               to   w-det-cap-cfl-prv      .
           move      40                   to   w-wrk-ctr-004          .
           move      zero                 to   w-wrk-ctr-003          .
           inspect   rf-dcm-loc-cli   tallying w-wrk-ctr-003
                                  for trailing spaces                 .
           subtract  w-wrk-ctr-003        from w-wrk-ctr-004          .
           subtract  2                    from w-wrk-ctr-004
                                        giving w-wrk-ctr-005          .
           if        rf-dcm-loc-cli
                    (w-wrk-ctr-005 : 01)  not  = spaces
                     go to exe-agg-dcm-690.
           add       1                    to   w-wrk-ctr-005          .
           move      rf-dcm-loc-cli
                    (w-wrk-ctr-005 : 02)  to   w-det-cap-cfl-prv      .
           if        w-det-cap-cfl-prv    =    spaces
                     go to exe-agg-dcm-690.
      *                          *-------------------------------------*
      *                          * Determinazione CAP                  *
      *                          *-------------------------------------*
           move      rf-dcm-loc-cli       to   w-det-cap-cfl-wcp      .
      *                          *-------------------------------------*
      *                          * Determinazione localita'            *
      *                          *-------------------------------------*
           move      rf-dcm-loc-cli       to   w-det-cap-cfl-wds      .
           move      spaces               to   w-det-cap-cfl-wds
                                              (w-wrk-ctr-005 : 02)    .
           move      w-det-cap-cfl-wds
                    (07 : 34)             to   w-det-cap-cfl-wds      .
           move      w-det-cap-cfl-wds    to   w-det-cap-cfl-cfl      .
      *                          *-------------------------------------*
      *                          * Determinazione                      *
      *                          *-------------------------------------*
           perform   det-cap-cfl-000      thru det-cap-cfl-999        .
      *                          *-------------------------------------*
      *                          * Test su esito della lettura         *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-flg    not  = spaces
                     go to exe-agg-dcm-690.
      *                          *-------------------------------------*
      *                          * Esclusione elementi senza CAP       *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-wcp    =    spaces or
                     w-det-cap-cfl-cap    =    spaces
                     go to exe-agg-dcm-690.
      *                          *-------------------------------------*
      *                          * Confronto del CAP                   *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-cap    =    w-det-cap-cfl-wcp
                     go to exe-agg-dcm-690.
      *                          *-------------------------------------*
      *                          * Aggiornamento CAP                   *
      *                          *-------------------------------------*
           move      rf-dcm-loc-cli       to   w-wrk-sav-loc          .
           move      w-det-cap-cfl-cap    to   rf-dcm-loc-cli
                                              (01 : 05)               .
      *                          *-------------------------------------*
      *                          * A update                            *
      *                          *-------------------------------------*
           go to     exe-agg-dcm-680.
       exe-agg-dcm-680.
      *              *-------------------------------------------------*
      *              * Update record [dcm]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo esecuzione                     *
      *                  *---------------------------------------------*
           if        rr-tip-exe           not  = "D"
                     go to exe-agg-dcm-685.
      *                  *---------------------------------------------*
      *                  * Update                                      *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-xxx-opf              .
           perform   exe-agg-dcm-opf-000  thru exe-agg-dcm-opf-999    .
       exe-agg-dcm-685.
      *              *-------------------------------------------------*
      *              * Incremento numero records scritti               *
      *              *-------------------------------------------------*
           perform   inc-rec-scr-000      thru inc-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Messaggio                                       *
      *              *-------------------------------------------------*
           move      "dcm"                to   w-ide-tip              .
           move      rf-dcm-cod-cli       to   w-ide-num              .
           move      rf-dcm-loc-cli       to   w-ide-lc1              .
           move      w-wrk-sav-loc        to   w-ide-lc2              .
           perform   exe-cnv-fil-msg-000  thru exe-cnv-fil-msg-999    .
       exe-agg-dcm-690.
      *              *-------------------------------------------------*
      *              * Rilascio del record                             *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-dcm-opf-000  thru exe-agg-dcm-opf-999    .
       exe-agg-dcm-700.
      *              *-------------------------------------------------*
      *              * Riciclo su [dcm]                                *
      *              *-------------------------------------------------*
           go to     exe-agg-dcm-200.
       exe-agg-dcm-800.
      *              *-------------------------------------------------*
      *              * [dcm]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-xxx-opf              .
           perform   exe-agg-dcm-opf-000  thru exe-agg-dcm-opf-999    .
       exe-agg-dcm-850.
      *              *-------------------------------------------------*
      *              * Visualizzazione nr records letti e scritti      *
      *              *-------------------------------------------------*
           perform   vis-rec-let-000      thru vis-rec-let-999        .
           perform   vis-rec-scr-000      thru vis-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Accettazione presa visione                      *
      *              *-------------------------------------------------*
           perform   acc-pre-vis-000      thru acc-pre-vis-999        .
       exe-agg-dcm-900.
      *              *-------------------------------------------------*
      *              * Scrittura rullino messaggi                      *
      *              *-------------------------------------------------*
           perform   wrt-rou-msg-000      thru wrt-rou-msg-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-agg-dcm-999.
       exe-agg-dcm-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [dcm]                              *
      *    *                                                           *
      *    * Operazioni su file                                        *
      *    *-----------------------------------------------------------*
       exe-agg-dcm-opf-000.
      *              *-------------------------------------------------*
      *              * Tipo operazione                                 *
      *              *-------------------------------------------------*
           move      f-xxx-opf            to   f-ope                  .
      *              *-------------------------------------------------*
      *              * Esecuzione                                      *
      *              *-------------------------------------------------*
           move      "pgm/dcc/fls/ioc/obj/iofdcm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcm                 .
       exe-agg-dcm-opf-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [fnt]                              *
      *    *-----------------------------------------------------------*
       exe-agg-fnt-000.
      *              *-------------------------------------------------*
      *              * Preparazione file area generica                 *
      *              *-------------------------------------------------*
           move      "fnt "               to   f-xxx-nam              .
      *              *-------------------------------------------------*
      *              * Richiesta di conferma, se manuale               *
      *              *-------------------------------------------------*
           perform   ric-cnf-man-000      thru ric-cnf-man-999        .
      *              *-------------------------------------------------*
      *              * Se non confermato : ad uscita                   *
      *              *-------------------------------------------------*
           if        f-xxx-sts            not  = "S"
                     go to exe-agg-fnt-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Numero records letti e scritti a zero           *
      *              *-------------------------------------------------*
           move      zero                 to   f-xxx-nrl              .
           move      zero                 to   f-xxx-nrs              .
       exe-agg-fnt-050.
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-xxx-opf              .
           perform   exe-agg-fnt-opf-000  thru exe-agg-fnt-opf-999    .
       exe-agg-fnt-100.
      *              *-------------------------------------------------*
      *              * Start su [fnt]                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-xxx-opf              .
           move      "NL"                 to   f-cfr                  .
           move      "CODFNT    "         to   f-key                  .
           move      zero                 to   rf-fnt-cod-fnt         .
           perform   exe-agg-fnt-opf-000  thru exe-agg-fnt-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a close file              *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-fnt-800.
       exe-agg-fnt-200.
      *              *-------------------------------------------------*
      *              * Get next su [fnt]                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "GN"                 to   f-xxx-opf              .
           perform   exe-agg-fnt-opf-000  thru exe-agg-fnt-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : a close file                  *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to exe-agg-fnt-300.
      *                  *---------------------------------------------*
      *                  * Rilascio del record                         *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-fnt-opf-000  thru exe-agg-fnt-opf-999    .
      *                  *---------------------------------------------*
      *                  * A close                                     *
      *                  *---------------------------------------------*
           go to     exe-agg-fnt-800.
       exe-agg-fnt-300.
      *              *-------------------------------------------------*
      *              * Max su [fnt], se non superato : a close file    *
      *              *-------------------------------------------------*
       exe-agg-fnt-400.
      *              *-------------------------------------------------*
      *              * Sel su [fnt]                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se Italia                              *
      *                  *---------------------------------------------*
           if        rf-fnt-cod-naz       =    "IT "
                     go to exe-agg-fnt-420.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-fnt-690.
       exe-agg-fnt-420.
      *                  *---------------------------------------------*
      *                  * Test se CAP nella stringa localita'         *
      *                  *---------------------------------------------*
           move      rf-fnt-loc-fnt       to   w-wrk-cap-str          .
           if        w-wrk-cap-num        numeric
                     go to exe-agg-fnt-500.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-fnt-690.
       exe-agg-fnt-500.
      *              *-------------------------------------------------*
      *              * Incremento numero records letti                 *
      *              *-------------------------------------------------*
           perform   inc-rec-let-000      thru inc-rec-let-999        .
       exe-agg-fnt-510.
      *              *-------------------------------------------------*
      *              * Trattamento localita'                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se presenti coordinate 'geo'           *
      *                  *---------------------------------------------*
           if        rf-fnt-cod-cmn       =   zero and
                     rf-fnt-cod-fzn       =   zero and
                     rf-fnt-cod-lct       =   zero
                     go to exe-agg-fnt-600.
      *                  *---------------------------------------------*
      *                  * Lettura [gxc]                               *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      rf-fnt-cod-cmn       to   rf-gxc-cod-cmn         .
           move      rf-fnt-cod-fzn       to   rf-gxc-cod-fzn         .
           move      rf-fnt-cod-lct       to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                      *-----------------------------------------*
      *                      * Test su esito lettura                   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-fnt-600.
       exe-agg-fnt-520.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi con stradario           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su sigla stradario                 *
      *                      *-----------------------------------------*
           if        rf-gxc-sgl-std       =    spaces
                     go to exe-agg-fnt-540.
      *                      *-----------------------------------------*
      *                      * Test su CAP                             *
      *                      *-----------------------------------------*
           if        rf-fnt-loc-fnt
                    (04 : 02)             not = "00"
                     go to exe-agg-fnt-690.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore stradario           *
      *                      *-----------------------------------------*
           move      "fnt"                to   w-ide-tip              .
           move      rf-fnt-cod-fnt       to   w-ide-num              .
           move      rf-fnt-loc-fnt       to   w-ide-lc1              .
           perform   exe-err-str-msg-000  thru exe-err-str-msg-999    .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     exe-agg-fnt-690.
       exe-agg-fnt-540.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi senza CAP               *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    spaces
                     go to exe-agg-fnt-690.
      *                  *---------------------------------------------*
      *                  * Confronto del CAP                           *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    w-wrk-cap-str
                     go to exe-agg-fnt-690.
      *                  *---------------------------------------------*
      *                  * Aggiornamento CAP                           *
      *                  *---------------------------------------------*
           move      rf-fnt-loc-fnt       to   w-wrk-sav-loc          .
           move      rf-gxc-cap-avp       to   rf-fnt-loc-fnt
                                              (01 : 05)               .
      *                  *---------------------------------------------*
      *                  * A update                                    *
      *                  *---------------------------------------------*
           go to     exe-agg-fnt-680.
       exe-agg-fnt-600.
      *                  *---------------------------------------------*
      *                  * Se non presenti coordinate 'geo'            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tentativo di lettura delle coordinate   *
      *                      * geografiche in base alla descrizione    *
      *                      * del comune pulita con controllo sul     *
      *                      * codice provincia                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione codice provincia     *
      *                          *-------------------------------------*
           move      spaces               to   w-det-cap-cfl-prv      .
           move      40                   to   w-wrk-ctr-004          .
           move      zero                 to   w-wrk-ctr-003          .
           inspect   rf-fnt-loc-fnt   tallying w-wrk-ctr-003
                                  for trailing spaces                 .
           subtract  w-wrk-ctr-003        from w-wrk-ctr-004          .
           subtract  2                    from w-wrk-ctr-004
                                        giving w-wrk-ctr-005          .
           if        rf-fnt-loc-fnt
                    (w-wrk-ctr-005 : 01)  not  = spaces
                     go to exe-agg-fnt-690.
           add       1                    to   w-wrk-ctr-005          .
           move      rf-fnt-loc-fnt
                    (w-wrk-ctr-005 : 02)  to   w-det-cap-cfl-prv      .
           if        w-det-cap-cfl-prv    =    spaces
                     go to exe-agg-fnt-690.
      *                          *-------------------------------------*
      *                          * Determinazione CAP                  *
      *                          *-------------------------------------*
           move      rf-fnt-loc-fnt       to   w-det-cap-cfl-wcp      .
      *                          *-------------------------------------*
      *                          * Determinazione localita'            *
      *                          *-------------------------------------*
           move      rf-fnt-loc-fnt       to   w-det-cap-cfl-wds      .
           move      spaces               to   w-det-cap-cfl-wds
                                              (w-wrk-ctr-005 : 02)    .
           move      w-det-cap-cfl-wds
                    (07 : 34)             to   w-det-cap-cfl-wds      .
           move      w-det-cap-cfl-wds    to   w-det-cap-cfl-cfl      .
      *                          *-------------------------------------*
      *                          * Determinazione                      *
      *                          *-------------------------------------*
           perform   det-cap-cfl-000      thru det-cap-cfl-999        .
      *                          *-------------------------------------*
      *                          * Test su esito della lettura         *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-flg    not  = spaces
                     go to exe-agg-fnt-690.
      *                          *-------------------------------------*
      *                          * Esclusione elementi senza CAP       *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-wcp    =    spaces or
                     w-det-cap-cfl-cap    =    spaces
                     go to exe-agg-fnt-690.
      *                          *-------------------------------------*
      *                          * Confronto del CAP                   *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-cap    =    w-det-cap-cfl-wcp
                     go to exe-agg-fnt-690.
      *                          *-------------------------------------*
      *                          * Aggiornamento CAP                   *
      *                          *-------------------------------------*
           move      rf-fnt-loc-fnt       to   w-wrk-sav-loc          .
           move      w-det-cap-cfl-cap    to   rf-fnt-loc-fnt
                                              (01 : 05)               .
      *                          *-------------------------------------*
      *                          * A update                            *
      *                          *-------------------------------------*
           go to     exe-agg-fnt-680.
       exe-agg-fnt-680.
      *              *-------------------------------------------------*
      *              * Update record [fnt]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo esecuzione                     *
      *                  *---------------------------------------------*
           if        rr-tip-exe           not  = "D"
                     go to exe-agg-fnt-685.
      *                  *---------------------------------------------*
      *                  * Update                                      *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-xxx-opf              .
           perform   exe-agg-fnt-opf-000  thru exe-agg-fnt-opf-999    .
       exe-agg-fnt-685.
      *              *-------------------------------------------------*
      *              * Incremento numero records scritti               *
      *              *-------------------------------------------------*
           perform   inc-rec-scr-000      thru inc-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Messaggio                                       *
      *              *-------------------------------------------------*
           move      "dcm"                to   w-ide-tip              .
           move      rf-fnt-cod-fnt       to   w-ide-num              .
           move      rf-fnt-loc-fnt       to   w-ide-lc1              .
           move      w-wrk-sav-loc        to   w-ide-lc2              .
           perform   exe-cnv-fil-msg-000  thru exe-cnv-fil-msg-999    .
       exe-agg-fnt-690.
      *              *-------------------------------------------------*
      *              * Rilascio del record                             *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-fnt-opf-000  thru exe-agg-fnt-opf-999    .
       exe-agg-fnt-700.
      *              *-------------------------------------------------*
      *              * Riciclo su [fnt]                                *
      *              *-------------------------------------------------*
           go to     exe-agg-fnt-200.
       exe-agg-fnt-800.
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-xxx-opf              .
           perform   exe-agg-fnt-opf-000  thru exe-agg-fnt-opf-999    .
       exe-agg-fnt-850.
      *              *-------------------------------------------------*
      *              * Visualizzazione nr records letti e scritti      *
      *              *-------------------------------------------------*
           perform   vis-rec-let-000      thru vis-rec-let-999        .
           perform   vis-rec-scr-000      thru vis-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Accettazione presa visione                      *
      *              *-------------------------------------------------*
           perform   acc-pre-vis-000      thru acc-pre-vis-999        .
       exe-agg-fnt-900.
      *              *-------------------------------------------------*
      *              * Scrittura rullino messaggi                      *
      *              *-------------------------------------------------*
           perform   wrt-rou-msg-000      thru wrt-rou-msg-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-agg-fnt-999.
       exe-agg-fnt-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [fnt]                              *
      *    *                                                           *
      *    * Operazioni su file                                        *
      *    *-----------------------------------------------------------*
       exe-agg-fnt-opf-000.
      *              *-------------------------------------------------*
      *              * Tipo operazione                                 *
      *              *-------------------------------------------------*
           move      f-xxx-opf            to   f-ope                  .
      *              *-------------------------------------------------*
      *              * Esecuzione                                      *
      *              *-------------------------------------------------*
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
       exe-agg-fnt-opf-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [dcf]                              *
      *    *-----------------------------------------------------------*
       exe-agg-dcf-000.
      *              *-------------------------------------------------*
      *              * Preparazione file area generica                 *
      *              *-------------------------------------------------*
           move      "dcf "               to   f-xxx-nam              .
      *              *-------------------------------------------------*
      *              * Richiesta di conferma, se manuale               *
      *              *-------------------------------------------------*
           perform   ric-cnf-man-000      thru ric-cnf-man-999        .
      *              *-------------------------------------------------*
      *              * Se non confermato : ad uscita                   *
      *              *-------------------------------------------------*
           if        f-xxx-sts            not  = "S"
                     go to exe-agg-dcf-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Numero records letti e scritti a zero           *
      *              *-------------------------------------------------*
           move      zero                 to   f-xxx-nrl              .
           move      zero                 to   f-xxx-nrs              .
       exe-agg-dcf-050.
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-xxx-opf              .
           perform   exe-agg-dcf-opf-000  thru exe-agg-dcf-opf-999    .
       exe-agg-dcf-100.
      *              *-------------------------------------------------*
      *              * Start su [dcf]                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-xxx-opf              .
           move      "NL"                 to   f-cfr                  .
           move      "CODFNT    "         to   f-key                  .
           move      zero                 to   rf-dcf-cod-fnt         .
           move      spaces               to   rf-dcf-dpz-fnt         .
           perform   exe-agg-dcf-opf-000  thru exe-agg-dcf-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a close file              *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-dcf-800.
       exe-agg-dcf-200.
      *              *-------------------------------------------------*
      *              * Get next su [dcf]                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "GN"                 to   f-xxx-opf              .
           perform   exe-agg-dcf-opf-000  thru exe-agg-dcf-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : a close file                  *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to exe-agg-dcf-300.
      *                  *---------------------------------------------*
      *                  * Rilascio del record                         *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-dcf-opf-000  thru exe-agg-dcf-opf-999    .
      *                  *---------------------------------------------*
      *                  * A close                                     *
      *                  *---------------------------------------------*
           go to     exe-agg-dcf-800.
       exe-agg-dcf-300.
      *              *-------------------------------------------------*
      *              * Max su [dcf], se non superato : a close file    *
      *              *-------------------------------------------------*
       exe-agg-dcf-400.
      *              *-------------------------------------------------*
      *              * Sel su [dcf]                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se Italia                              *
      *                  *---------------------------------------------*
           if        rf-dcf-cod-naz       =    "IT "
                     go to exe-agg-dcf-420.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-dcf-690.
       exe-agg-dcf-420.
      *                  *---------------------------------------------*
      *                  * Test se CAP nella stringa localita'         *
      *                  *---------------------------------------------*
           move      rf-dcf-loc-dcf       to   w-wrk-cap-str          .
           if        w-wrk-cap-num        numeric
                     go to exe-agg-dcf-500.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-dcf-690.
       exe-agg-dcf-500.
      *              *-------------------------------------------------*
      *              * Incremento numero records letti                 *
      *              *-------------------------------------------------*
           perform   inc-rec-let-000      thru inc-rec-let-999        .
       exe-agg-dcf-510.
      *              *-------------------------------------------------*
      *              * Trattamento localita'                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se presenti coordinate 'geo'           *
      *                  *---------------------------------------------*
           if        rf-dcf-cod-cmn       =   zero and
                     rf-dcf-cod-fzn       =   zero and
                     rf-dcf-cod-lct       =   zero
                     go to exe-agg-dcf-600.
      *                  *---------------------------------------------*
      *                  * Lettura [gxc]                               *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      rf-dcf-cod-cmn       to   rf-gxc-cod-cmn         .
           move      rf-dcf-cod-fzn       to   rf-gxc-cod-fzn         .
           move      rf-dcf-cod-lct       to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                      *-----------------------------------------*
      *                      * Test su esito lettura                   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-dcf-600.
       exe-agg-dcf-520.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi con stradario           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su sigla stradario                 *
      *                      *-----------------------------------------*
           if        rf-gxc-sgl-std       =    spaces
                     go to exe-agg-dcf-540.
      *                      *-----------------------------------------*
      *                      * Test su CAP                             *
      *                      *-----------------------------------------*
           if        rf-dcf-loc-dcf
                    (04 : 02)             not = "00"
                     go to exe-agg-dcf-690.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore stradario           *
      *                      *-----------------------------------------*
           move      "dcf"                to   w-ide-tip              .
           move      rf-dcf-cod-fnt       to   w-ide-num              .
           move      rf-dcf-loc-dcf       to   w-ide-lc1              .
           perform   exe-err-str-msg-000  thru exe-err-str-msg-999    .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     exe-agg-dcf-690.
       exe-agg-dcf-540.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi senza CAP               *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    spaces
                     go to exe-agg-dcf-690.
      *                  *---------------------------------------------*
      *                  * Confronto del CAP                           *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    w-wrk-cap-str
                     go to exe-agg-dcf-690.
      *                  *---------------------------------------------*
      *                  * Aggiornamento CAP                           *
      *                  *---------------------------------------------*
           move      rf-dcf-loc-dcf       to   w-wrk-sav-loc          .
           move      rf-gxc-cap-avp       to   rf-dcf-loc-dcf
                                              (01 : 05)               .
      *                  *---------------------------------------------*
      *                  * A update                                    *
      *                  *---------------------------------------------*
           go to     exe-agg-dcf-680.
       exe-agg-dcf-600.
      *                  *---------------------------------------------*
      *                  * Se non presenti coordinate 'geo'            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tentativo di lettura delle coordinate   *
      *                      * geografiche in base alla descrizione    *
      *                      * del comune pulita con controllo sul     *
      *                      * codice provincia                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione codice provincia     *
      *                          *-------------------------------------*
           move      spaces               to   w-det-cap-cfl-prv      .
           move      40                   to   w-wrk-ctr-004          .
           move      zero                 to   w-wrk-ctr-003          .
           inspect   rf-dcf-loc-dcf   tallying w-wrk-ctr-003
                                  for trailing spaces                 .
           subtract  w-wrk-ctr-003        from w-wrk-ctr-004          .
           subtract  2                    from w-wrk-ctr-004
                                        giving w-wrk-ctr-005          .
           if        rf-dcf-loc-dcf
                    (w-wrk-ctr-005 : 01)  not  = spaces
                     go to exe-agg-dcf-690.
           add       1                    to   w-wrk-ctr-005          .
           move      rf-dcf-loc-dcf
                    (w-wrk-ctr-005 : 02)  to   w-det-cap-cfl-prv      .
           if        w-det-cap-cfl-prv    =    spaces
                     go to exe-agg-dcf-690.
      *                          *-------------------------------------*
      *                          * Determinazione CAP                  *
      *                          *-------------------------------------*
           move      rf-dcf-loc-dcf       to   w-det-cap-cfl-wcp      .
      *                          *-------------------------------------*
      *                          * Determinazione localita'            *
      *                          *-------------------------------------*
           move      rf-dcf-loc-dcf       to   w-det-cap-cfl-wds      .
           move      spaces               to   w-det-cap-cfl-wds
                                              (w-wrk-ctr-005 : 02)    .
           move      w-det-cap-cfl-wds
                    (07 : 34)             to   w-det-cap-cfl-wds      .
           move      w-det-cap-cfl-wds    to   w-det-cap-cfl-cfl      .
      *                          *-------------------------------------*
      *                          * Determinazione                      *
      *                          *-------------------------------------*
           perform   det-cap-cfl-000      thru det-cap-cfl-999        .
      *                          *-------------------------------------*
      *                          * Test su esito della lettura         *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-flg    not  = spaces
                     go to exe-agg-dcf-690.
      *                          *-------------------------------------*
      *                          * Esclusione elementi senza CAP       *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-wcp    =    spaces or
                     w-det-cap-cfl-cap    =    spaces
                     go to exe-agg-dcf-690.
      *                          *-------------------------------------*
      *                          * Confronto del CAP                   *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-cap    =    w-det-cap-cfl-wcp
                     go to exe-agg-dcf-690.
      *                          *-------------------------------------*
      *                          * Aggiornamento CAP                   *
      *                          *-------------------------------------*
           move      rf-dcf-loc-dcf       to   w-wrk-sav-loc          .
           move      w-det-cap-cfl-cap    to   rf-dcf-loc-dcf
                                              (01 : 05)               .
      *                          *-------------------------------------*
      *                          * A update                            *
      *                          *-------------------------------------*
           go to     exe-agg-dcf-680.
       exe-agg-dcf-680.
      *              *-------------------------------------------------*
      *              * Update record [dcf]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo esecuzione                     *
      *                  *---------------------------------------------*
           if        rr-tip-exe           not  = "D"
                     go to exe-agg-dcf-685.
      *                  *---------------------------------------------*
      *                  * Update                                      *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-xxx-opf              .
           perform   exe-agg-dcf-opf-000  thru exe-agg-dcf-opf-999    .
       exe-agg-dcf-685.
      *              *-------------------------------------------------*
      *              * Incremento numero records scritti               *
      *              *-------------------------------------------------*
           perform   inc-rec-scr-000      thru inc-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Messaggio                                       *
      *              *-------------------------------------------------*
           move      "dcf"                to   w-ide-tip              .
           move      rf-dcf-cod-fnt       to   w-ide-num              .
           move      rf-dcf-loc-dcf       to   w-ide-lc1              .
           move      w-wrk-sav-loc        to   w-ide-lc2              .
           perform   exe-cnv-fil-msg-000  thru exe-cnv-fil-msg-999    .
       exe-agg-dcf-690.
      *              *-------------------------------------------------*
      *              * Rilascio del record                             *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-dcf-opf-000  thru exe-agg-dcf-opf-999    .
       exe-agg-dcf-700.
      *              *-------------------------------------------------*
      *              * Riciclo su [dcf]                                *
      *              *-------------------------------------------------*
           go to     exe-agg-dcf-200.
       exe-agg-dcf-800.
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-xxx-opf              .
           perform   exe-agg-dcf-opf-000  thru exe-agg-dcf-opf-999    .
       exe-agg-dcf-850.
      *              *-------------------------------------------------*
      *              * Visualizzazione nr records letti e scritti      *
      *              *-------------------------------------------------*
           perform   vis-rec-let-000      thru vis-rec-let-999        .
           perform   vis-rec-scr-000      thru vis-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Accettazione presa visione                      *
      *              *-------------------------------------------------*
           perform   acc-pre-vis-000      thru acc-pre-vis-999        .
       exe-agg-dcf-900.
      *              *-------------------------------------------------*
      *              * Scrittura rullino messaggi                      *
      *              *-------------------------------------------------*
           perform   wrt-rou-msg-000      thru wrt-rou-msg-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-agg-dcf-999.
       exe-agg-dcf-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [dcf]                              *
      *    *                                                           *
      *    * Operazioni su file                                        *
      *    *-----------------------------------------------------------*
       exe-agg-dcf-opf-000.
      *              *-------------------------------------------------*
      *              * Tipo operazione                                 *
      *              *-------------------------------------------------*
           move      f-xxx-opf            to   f-ope                  .
      *              *-------------------------------------------------*
      *              * Esecuzione                                      *
      *              *-------------------------------------------------*
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
       exe-agg-dcf-opf-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [age]                              *
      *    *-----------------------------------------------------------*
       exe-agg-age-000.
      *              *-------------------------------------------------*
      *              * Preparazione file area generica                 *
      *              *-------------------------------------------------*
           move      "age "               to   f-xxx-nam              .
      *              *-------------------------------------------------*
      *              * Richiesta di conferma, se manuale               *
      *              *-------------------------------------------------*
           perform   ric-cnf-man-000      thru ric-cnf-man-999        .
      *              *-------------------------------------------------*
      *              * Se non confermato : ad uscita                   *
      *              *-------------------------------------------------*
           if        f-xxx-sts            not  = "S"
                     go to exe-agg-age-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Numero records letti e scritti a zero           *
      *              *-------------------------------------------------*
           move      zero                 to   f-xxx-nrl              .
           move      zero                 to   f-xxx-nrs              .
       exe-agg-age-050.
      *              *-------------------------------------------------*
      *              * [age]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-xxx-opf              .
           perform   exe-agg-age-opf-000  thru exe-agg-age-opf-999    .
       exe-agg-age-100.
      *              *-------------------------------------------------*
      *              * Start su [age]                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-xxx-opf              .
           move      "NL"                 to   f-cfr                  .
           move      "CODAGE    "         to   f-key                  .
           move      zero                 to   rf-age-cod-age         .
           perform   exe-agg-age-opf-000  thru exe-agg-age-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a close file              *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-age-800.
       exe-agg-age-200.
      *              *-------------------------------------------------*
      *              * Get next su [age]                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "GN"                 to   f-xxx-opf              .
           perform   exe-agg-age-opf-000  thru exe-agg-age-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : a close file                  *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to exe-agg-age-300.
      *                  *---------------------------------------------*
      *                  * Rilascio del record                         *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-age-opf-000  thru exe-agg-age-opf-999    .
      *                  *---------------------------------------------*
      *                  * A close                                     *
      *                  *---------------------------------------------*
           go to     exe-agg-age-800.
       exe-agg-age-300.
      *              *-------------------------------------------------*
      *              * Max su [age], se non superato : a close file    *
      *              *-------------------------------------------------*
       exe-agg-age-400.
      *              *-------------------------------------------------*
      *              * Sel su [age]                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se Italia                              *
      *                  *---------------------------------------------*
           if        rf-age-cod-naz       =    "IT "
                     go to exe-agg-age-420.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-age-690.
       exe-agg-age-420.
      *                  *---------------------------------------------*
      *                  * Test se CAP nella stringa localita'         *
      *                  *---------------------------------------------*
           move      rf-age-loc-age       to   w-wrk-cap-str          .
           if        w-wrk-cap-num        numeric
                     go to exe-agg-age-500.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-age-690.
       exe-agg-age-500.
      *              *-------------------------------------------------*
      *              * Incremento numero records letti                 *
      *              *-------------------------------------------------*
           perform   inc-rec-let-000      thru inc-rec-let-999        .
       exe-agg-age-510.
      *              *-------------------------------------------------*
      *              * Trattamento localita'                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se presenti coordinate 'geo'           *
      *                  *---------------------------------------------*
           if        rf-age-cod-cmn       =   zero and
                     rf-age-cod-fzn       =   zero and
                     rf-age-cod-lct       =   zero
                     go to exe-agg-age-600.
      *                  *---------------------------------------------*
      *                  * Lettura [gxc]                               *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      rf-age-cod-cmn       to   rf-gxc-cod-cmn         .
           move      rf-age-cod-fzn       to   rf-gxc-cod-fzn         .
           move      rf-age-cod-lct       to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                      *-----------------------------------------*
      *                      * Test su esito lettura                   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-age-600.
       exe-agg-age-520.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi con stradario           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su sigla stradario                 *
      *                      *-----------------------------------------*
           if        rf-gxc-sgl-std       =    spaces
                     go to exe-agg-age-540.
      *                      *-----------------------------------------*
      *                      * Test su CAP                             *
      *                      *-----------------------------------------*
           if        rf-age-loc-age
                    (04 : 02)             not = "00"
                     go to exe-agg-age-690.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore stradario           *
      *                      *-----------------------------------------*
           move      "age"                to   w-ide-tip              .
           move      rf-age-cod-age       to   w-ide-num              .
           move      rf-age-loc-age       to   w-ide-lc1              .
           perform   exe-err-str-msg-000  thru exe-err-str-msg-999    .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     exe-agg-age-690.
       exe-agg-age-540.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi senza CAP               *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    spaces
                     go to exe-agg-age-690.
      *                  *---------------------------------------------*
      *                  * Confronto del CAP                           *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    w-wrk-cap-str
                     go to exe-agg-age-690.
      *                  *---------------------------------------------*
      *                  * Aggiornamento CAP                           *
      *                  *---------------------------------------------*
           move      rf-age-loc-age       to   w-wrk-sav-loc          .
           move      rf-gxc-cap-avp       to   rf-age-loc-age
                                              (01 : 05)               .
      *                  *---------------------------------------------*
      *                  * A update                                    *
      *                  *---------------------------------------------*
           go to     exe-agg-age-680.
       exe-agg-age-600.
      *                  *---------------------------------------------*
      *                  * Se non presenti coordinate 'geo'            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tentativo di lettura delle coordinate   *
      *                      * geografiche in base alla descrizione    *
      *                      * del comune pulita con controllo sul     *
      *                      * codice provincia                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione codice provincia     *
      *                          *-------------------------------------*
           move      spaces               to   w-det-cap-cfl-prv      .
           move      40                   to   w-wrk-ctr-004          .
           move      zero                 to   w-wrk-ctr-003          .
           inspect   rf-age-loc-age   tallying w-wrk-ctr-003
                                  for trailing spaces                 .
           subtract  w-wrk-ctr-003        from w-wrk-ctr-004          .
           subtract  2                    from w-wrk-ctr-004
                                        giving w-wrk-ctr-005          .
           if        rf-age-loc-age
                    (w-wrk-ctr-005 : 01)  not  = spaces
                     go to exe-agg-age-690.
           add       1                    to   w-wrk-ctr-005          .
           move      rf-age-loc-age
                    (w-wrk-ctr-005 : 02)  to   w-det-cap-cfl-prv      .
           if        w-det-cap-cfl-prv    =    spaces
                     go to exe-agg-age-690.
      *                          *-------------------------------------*
      *                          * Determinazione CAP                  *
      *                          *-------------------------------------*
           move      rf-age-loc-age       to   w-det-cap-cfl-wcp      .
      *                          *-------------------------------------*
      *                          * Determinazione localita'            *
      *                          *-------------------------------------*
           move      rf-age-loc-age       to   w-det-cap-cfl-wds      .
           move      spaces               to   w-det-cap-cfl-wds
                                              (w-wrk-ctr-005 : 02)    .
           move      w-det-cap-cfl-wds
                    (07 : 34)             to   w-det-cap-cfl-wds      .
           move      w-det-cap-cfl-wds    to   w-det-cap-cfl-cfl      .
      *                          *-------------------------------------*
      *                          * Determinazione                      *
      *                          *-------------------------------------*
           perform   det-cap-cfl-000      thru det-cap-cfl-999        .
      *                          *-------------------------------------*
      *                          * Test su esito della lettura         *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-flg    not  = spaces
                     go to exe-agg-age-690.
      *                          *-------------------------------------*
      *                          * Esclusione elementi senza CAP       *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-wcp    =    spaces or
                     w-det-cap-cfl-cap    =    spaces
                     go to exe-agg-age-690.
      *                          *-------------------------------------*
      *                          * Confronto del CAP                   *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-cap    =    w-det-cap-cfl-wcp
                     go to exe-agg-age-690.
      *                          *-------------------------------------*
      *                          * Aggiornamento CAP                   *
      *                          *-------------------------------------*
           move      rf-age-loc-age       to   w-wrk-sav-loc          .
           move      w-det-cap-cfl-cap    to   rf-age-loc-age
                                              (01 : 05)               .
      *                          *-------------------------------------*
      *                          * A update                            *
      *                          *-------------------------------------*
           go to     exe-agg-age-680.
       exe-agg-age-680.
      *              *-------------------------------------------------*
      *              * Update record [age]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo esecuzione                     *
      *                  *---------------------------------------------*
           if        rr-tip-exe           not  = "D"
                     go to exe-agg-age-685.
      *                  *---------------------------------------------*
      *                  * Update                                      *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-xxx-opf              .
           perform   exe-agg-age-opf-000  thru exe-agg-age-opf-999    .
       exe-agg-age-685.
      *              *-------------------------------------------------*
      *              * Incremento numero records scritti               *
      *              *-------------------------------------------------*
           perform   inc-rec-scr-000      thru inc-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Messaggio                                       *
      *              *-------------------------------------------------*
           move      "age"                to   w-ide-tip              .
           move      rf-age-cod-age       to   w-ide-num              .
           move      rf-age-loc-age       to   w-ide-lc1              .
           move      w-wrk-sav-loc        to   w-ide-lc2              .
           perform   exe-cnv-fil-msg-000  thru exe-cnv-fil-msg-999    .
       exe-agg-age-690.
      *              *-------------------------------------------------*
      *              * Rilascio del record                             *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-age-opf-000  thru exe-agg-age-opf-999    .
       exe-agg-age-700.
      *              *-------------------------------------------------*
      *              * Riciclo su [age]                                *
      *              *-------------------------------------------------*
           go to     exe-agg-age-200.
       exe-agg-age-800.
      *              *-------------------------------------------------*
      *              * [age]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-xxx-opf              .
           perform   exe-agg-age-opf-000  thru exe-agg-age-opf-999    .
       exe-agg-age-850.
      *              *-------------------------------------------------*
      *              * Visualizzazione nr records letti e scritti      *
      *              *-------------------------------------------------*
           perform   vis-rec-let-000      thru vis-rec-let-999        .
           perform   vis-rec-scr-000      thru vis-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Accettazione presa visione                      *
      *              *-------------------------------------------------*
           perform   acc-pre-vis-000      thru acc-pre-vis-999        .
       exe-agg-age-900.
      *              *-------------------------------------------------*
      *              * Scrittura rullino messaggi                      *
      *              *-------------------------------------------------*
           perform   wrt-rou-msg-000      thru wrt-rou-msg-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-agg-age-999.
       exe-agg-age-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [age]                              *
      *    *                                                           *
      *    * Operazioni su file                                        *
      *    *-----------------------------------------------------------*
       exe-agg-age-opf-000.
      *              *-------------------------------------------------*
      *              * Tipo operazione                                 *
      *              *-------------------------------------------------*
           move      f-xxx-opf            to   f-ope                  .
      *              *-------------------------------------------------*
      *              * Esecuzione                                      *
      *              *-------------------------------------------------*
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
       exe-agg-age-opf-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [vet]                              *
      *    *-----------------------------------------------------------*
       exe-agg-vet-000.
      *              *-------------------------------------------------*
      *              * Preparazione file area generica                 *
      *              *-------------------------------------------------*
           move      "vet "               to   f-xxx-nam              .
      *              *-------------------------------------------------*
      *              * Richiesta di conferma, se manuale               *
      *              *-------------------------------------------------*
           perform   ric-cnf-man-000      thru ric-cnf-man-999        .
      *              *-------------------------------------------------*
      *              * Se non confermato : ad uscita                   *
      *              *-------------------------------------------------*
           if        f-xxx-sts            not  = "S"
                     go to exe-agg-vet-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Numero records letti e scritti a zero           *
      *              *-------------------------------------------------*
           move      zero                 to   f-xxx-nrl              .
           move      zero                 to   f-xxx-nrs              .
       exe-agg-vet-050.
      *              *-------------------------------------------------*
      *              * [vet]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-xxx-opf              .
           perform   exe-agg-vet-opf-000  thru exe-agg-vet-opf-999    .
       exe-agg-vet-100.
      *              *-------------------------------------------------*
      *              * Start su [vet]                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-xxx-opf              .
           move      "NL"                 to   f-cfr                  .
           move      "CODVET    "         to   f-key                  .
           move      zero                 to   rf-vet-cod-vet         .
           perform   exe-agg-vet-opf-000  thru exe-agg-vet-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a close file              *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-vet-800.
       exe-agg-vet-200.
      *              *-------------------------------------------------*
      *              * Get next su [vet]                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazione                                  *
      *                  *---------------------------------------------*
           move      "GN"                 to   f-xxx-opf              .
           perform   exe-agg-vet-opf-000  thru exe-agg-vet-opf-999    .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : a close file                  *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to exe-agg-vet-300.
      *                  *---------------------------------------------*
      *                  * Rilascio del record                         *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-vet-opf-000  thru exe-agg-vet-opf-999    .
      *                  *---------------------------------------------*
      *                  * A close                                     *
      *                  *---------------------------------------------*
           go to     exe-agg-vet-800.
       exe-agg-vet-300.
      *              *-------------------------------------------------*
      *              * Max su [vet], se non superato : a close file    *
      *              *-------------------------------------------------*
       exe-agg-vet-400.
      *              *-------------------------------------------------*
      *              * Sel su [vet]                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se Italia                              *
      *                  *---------------------------------------------*
           if        rf-vet-cod-naz       =    "IT "
                     go to exe-agg-vet-420.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-vet-690.
       exe-agg-vet-420.
      *                  *---------------------------------------------*
      *                  * Test se CAP nella stringa localita'         *
      *                  *---------------------------------------------*
           move      rf-vet-loc-vet       to   w-wrk-cap-str          .
           if        w-wrk-cap-num        numeric
                     go to exe-agg-vet-500.
      *                  *---------------------------------------------*
      *                  * A riciclo con release                       *
      *                  *---------------------------------------------*
           go to     exe-agg-vet-690.
       exe-agg-vet-500.
      *              *-------------------------------------------------*
      *              * Incremento numero records letti                 *
      *              *-------------------------------------------------*
           perform   inc-rec-let-000      thru inc-rec-let-999        .
       exe-agg-vet-510.
      *              *-------------------------------------------------*
      *              * Trattamento localita'                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se presenti coordinate 'geo'           *
      *                  *---------------------------------------------*
           if        rf-vet-cod-cmn       =   zero and
                     rf-vet-cod-fzn       =   zero and
                     rf-vet-cod-lct       =   zero
                     go to exe-agg-vet-600.
      *                  *---------------------------------------------*
      *                  * Lettura [gxc]                               *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      rf-vet-cod-cmn       to   rf-gxc-cod-cmn         .
           move      rf-vet-cod-fzn       to   rf-gxc-cod-fzn         .
           move      rf-vet-cod-lct       to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                      *-----------------------------------------*
      *                      * Test su esito lettura                   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-agg-vet-600.
       exe-agg-vet-520.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi con stradario           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su sigla stradario                 *
      *                      *-----------------------------------------*
           if        rf-gxc-sgl-std       =    spaces
                     go to exe-agg-vet-540.
      *                      *-----------------------------------------*
      *                      * Test su CAP                             *
      *                      *-----------------------------------------*
           if        rf-vet-loc-vet
                    (04 : 02)             not = "00"
                     go to exe-agg-vet-690.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore stradario           *
      *                      *-----------------------------------------*
           move      "vet"                to   w-ide-tip              .
           move      rf-vet-cod-vet       to   w-ide-num              .
           move      rf-vet-loc-vet       to   w-ide-lc1              .
           perform   exe-err-str-msg-000  thru exe-err-str-msg-999    .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     exe-agg-vet-690.
       exe-agg-vet-540.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi senza CAP               *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    spaces
                     go to exe-agg-vet-690.
      *                  *---------------------------------------------*
      *                  * Confronto del CAP                           *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    w-wrk-cap-str
                     go to exe-agg-vet-690.
      *                  *---------------------------------------------*
      *                  * Aggiornamento CAP                           *
      *                  *---------------------------------------------*
           move      rf-vet-loc-vet       to   w-wrk-sav-loc          .
           move      rf-gxc-cap-avp       to   rf-vet-loc-vet
                                              (01 : 05)               .
      *                  *---------------------------------------------*
      *                  * A update                                    *
      *                  *---------------------------------------------*
           go to     exe-agg-vet-680.
       exe-agg-vet-600.
      *                  *---------------------------------------------*
      *                  * Se non presenti coordinate 'geo'            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tentativo di lettura delle coordinate   *
      *                      * geografiche in base alla descrizione    *
      *                      * del comune pulita con controllo sul     *
      *                      * codice provincia                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione codice provincia     *
      *                          *-------------------------------------*
           move      spaces               to   w-det-cap-cfl-prv      .
           move      40                   to   w-wrk-ctr-004          .
           move      zero                 to   w-wrk-ctr-003          .
           inspect   rf-vet-loc-vet   tallying w-wrk-ctr-003
                                  for trailing spaces                 .
           subtract  w-wrk-ctr-003        from w-wrk-ctr-004          .
           subtract  2                    from w-wrk-ctr-004
                                        giving w-wrk-ctr-005          .
           if        rf-vet-loc-vet
                    (w-wrk-ctr-005 : 01)  not  = spaces
                     go to exe-agg-vet-690.
           add       1                    to   w-wrk-ctr-005          .
           move      rf-vet-loc-vet
                    (w-wrk-ctr-005 : 02)  to   w-det-cap-cfl-prv      .
           if        w-det-cap-cfl-prv    =    spaces
                     go to exe-agg-vet-690.
      *                          *-------------------------------------*
      *                          * Determinazione CAP                  *
      *                          *-------------------------------------*
           move      rf-vet-loc-vet       to   w-det-cap-cfl-wcp      .
      *                          *-------------------------------------*
      *                          * Determinazione localita'            *
      *                          *-------------------------------------*
           move      rf-vet-loc-vet       to   w-det-cap-cfl-wds      .
           move      spaces               to   w-det-cap-cfl-wds
                                              (w-wrk-ctr-005 : 02)    .
           move      w-det-cap-cfl-wds
                    (07 : 34)             to   w-det-cap-cfl-wds      .
           move      w-det-cap-cfl-wds    to   w-det-cap-cfl-cfl      .
      *                          *-------------------------------------*
      *                          * Determinazione                      *
      *                          *-------------------------------------*
           perform   det-cap-cfl-000      thru det-cap-cfl-999        .
      *                          *-------------------------------------*
      *                          * Test su esito della lettura         *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-flg    not  = spaces
                     go to exe-agg-vet-690.
      *                          *-------------------------------------*
      *                          * Esclusione elementi senza CAP       *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-wcp    =    spaces or
                     w-det-cap-cfl-cap    =    spaces
                     go to exe-agg-vet-690.
      *                          *-------------------------------------*
      *                          * Confronto del CAP                   *
      *                          *-------------------------------------*
           if        w-det-cap-cfl-cap    =    w-det-cap-cfl-wcp
                     go to exe-agg-vet-690.
      *                          *-------------------------------------*
      *                          * Aggiornamento CAP                   *
      *                          *-------------------------------------*
           move      rf-vet-loc-vet       to   w-wrk-sav-loc          .
           move      w-det-cap-cfl-cap    to   rf-vet-loc-vet
                                              (01 : 05)               .
      *                          *-------------------------------------*
      *                          * A update                            *
      *                          *-------------------------------------*
           go to     exe-agg-vet-680.
       exe-agg-vet-680.
      *              *-------------------------------------------------*
      *              * Update record [vet]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo esecuzione                     *
      *                  *---------------------------------------------*
           if        rr-tip-exe           not  = "D"
                     go to exe-agg-vet-685.
      *                  *---------------------------------------------*
      *                  * Update                                      *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-xxx-opf              .
           perform   exe-agg-vet-opf-000  thru exe-agg-vet-opf-999    .
       exe-agg-vet-685.
      *              *-------------------------------------------------*
      *              * Incremento numero records scritti               *
      *              *-------------------------------------------------*
           perform   inc-rec-scr-000      thru inc-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Messaggio                                       *
      *              *-------------------------------------------------*
           move      "vet"                to   w-ide-tip              .
           move      rf-vet-cod-vet       to   w-ide-num              .
           move      rf-vet-loc-vet       to   w-ide-lc1              .
           move      w-wrk-sav-loc        to   w-ide-lc2              .
           perform   exe-cnv-fil-msg-000  thru exe-cnv-fil-msg-999    .
       exe-agg-vet-690.
      *              *-------------------------------------------------*
      *              * Rilascio del record                             *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-xxx-opf              .
           perform   exe-agg-vet-opf-000  thru exe-agg-vet-opf-999    .
       exe-agg-vet-700.
      *              *-------------------------------------------------*
      *              * Riciclo su [vet]                                *
      *              *-------------------------------------------------*
           go to     exe-agg-vet-200.
       exe-agg-vet-800.
      *              *-------------------------------------------------*
      *              * [vet]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-xxx-opf              .
           perform   exe-agg-vet-opf-000  thru exe-agg-vet-opf-999    .
       exe-agg-vet-850.
      *              *-------------------------------------------------*
      *              * Visualizzazione nr records letti e scritti      *
      *              *-------------------------------------------------*
           perform   vis-rec-let-000      thru vis-rec-let-999        .
           perform   vis-rec-scr-000      thru vis-rec-scr-999        .
      *              *-------------------------------------------------*
      *              * Accettazione presa visione                      *
      *              *-------------------------------------------------*
           perform   acc-pre-vis-000      thru acc-pre-vis-999        .
       exe-agg-vet-900.
      *              *-------------------------------------------------*
      *              * Scrittura rullino messaggi                      *
      *              *-------------------------------------------------*
           perform   wrt-rou-msg-000      thru wrt-rou-msg-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-agg-vet-999.
       exe-agg-vet-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento archivio [vet]                              *
      *    *                                                           *
      *    * Operazioni su file                                        *
      *    *-----------------------------------------------------------*
       exe-agg-vet-opf-000.
      *              *-------------------------------------------------*
      *              * Tipo operazione                                 *
      *              *-------------------------------------------------*
           move      f-xxx-opf            to   f-ope                  .
      *              *-------------------------------------------------*
      *              * Esecuzione                                      *
      *              *-------------------------------------------------*
           move      "pgm/bol/fls/ioc/obj/iofvet"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-vet                 .
       exe-agg-vet-opf-999.
           exit.

      *    *===========================================================*
      *    * Richiesta di conferma, se manuale                         *
      *    *-----------------------------------------------------------*
       ric-cnf-man-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione conversione in corso            *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf
           string    "Conversione relativa all'archivio ["
                                delimited by   size
                     f-xxx-nam  delimited by   spaces
                     "]"        delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     ric-cnf-man-120.
       ric-cnf-man-120.
      *              *-------------------------------------------------*
      *              * Visualizzazione a spaces area per conferma      *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se funzionamento automatico : uscita con Ok     *
      *              *-------------------------------------------------*
           if        rr-aut-man (1 : 1)   not  = "M"
                     move  "S"            to   f-xxx-sts
                     go to ric-cnf-man-999.
      *              *-------------------------------------------------*
      *              * Visualizzazione prompt per conferma             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Conferma conversione       :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Normalizzazione risposta                        *
      *              *-------------------------------------------------*
           move      spaces               to   f-xxx-sts              .
       ric-cnf-man-200.
      *              *-------------------------------------------------*
      *              * Accettazione risposta Si/No                     *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-ris-snx-lun    to   v-car                  .
           move      w-exp-ris-snx-num    to   v-ldt                  .
           move      "SN#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-ris-snx-tbl    to   v-txt                  .
           move      12                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        f-xxx-sts             =    "S"
                     move  01             to   v-num
           else if   f-xxx-sts            =    "N"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       ric-cnf-man-300.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  "S"            to   f-xxx-sts
           else if   v-num                =    02
                     move  "N"            to   f-xxx-sts
           else      move  spaces         to   f-xxx-sts              .
       ric-cnf-man-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        f-xxx-sts            not  = "S" and
                     f-xxx-sts            not  = "N"
                     go to ric-cnf-man-200.
       ric-cnf-man-999.
           exit.

      *    *===========================================================*
      *    * Scrittura rullino messaggi                                *
      *    *-----------------------------------------------------------*
       wrt-rou-msg-000.
      *              *-------------------------------------------------*
      *              * Rullino messaggi                                *
      *              *-------------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
           string    "Conversione archivio ["
                                delimited by   size
                     f-xxx-nam  delimited by   spaces
                     "]"        delimited by   size
                                          into m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      f-xxx-nrl            to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
           string    "  - Numero records letti   : "
                                delimited by   size
                     v-edt      delimited by   spaces
                                          into m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      f-xxx-nrs            to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
           string    "  - Numero records scritti : "
                                delimited by   size
                     v-edt      delimited by   spaces
                                          into m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *
           move      "WR"                 to   m-ope                  .
           move      all "="              to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       wrt-rou-msg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione presa visione                                *
      *    *-----------------------------------------------------------*
       acc-pre-vis-000.
      *              *-------------------------------------------------*
      *              * Messaggio di fine conversione archivio          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf
           string    "Fine conversione relativa all'archivio ["
                                delimited by   size
                     f-xxx-nam  delimited by   spaces
                     "]"                  delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     acc-pre-vis-300.
       acc-pre-vis-300.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se funzionamento automa-   *
      *              * tico o manuale                                  *
      *              *-------------------------------------------------*
           if        rr-aut-man           =    "M"
                     go to acc-pre-vis-600
           else      go to acc-pre-vis-400.
       acc-pre-vis-400.
      *              *-------------------------------------------------*
      *              * Se funzionamento automatico                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Attesa di 1 secondo                         *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mwait0"                         .
      *                  *---------------------------------------------*
      *                  * Pulizia linea 20                            *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Cancellazione messaggio di programma in     *
      *                  * esecuzione                                  *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     acc-pre-vis-999.
       acc-pre-vis-600.
      *              *-------------------------------------------------*
      *              * Se funzionamento manuale                        *
      *              *-------------------------------------------------*
       acc-pre-vis-610.
      *                  *---------------------------------------------*
      *                  * Cancellazione messaggio di programma in     *
      *                  * esecuzione                                  *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione presa visione               *
      *                  *---------------------------------------------*
           move      spaces               to   rr-pre-vis             .
      *                  *---------------------------------------------*
      *                  * Prompt per presa visione                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      35                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      46                   to   v-pos                  .
           move      " - Digitare OK : [  ]              "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-pre-vis-620.
      *                  *---------------------------------------------*
      *                  * Accettazione presa visione                  *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      64                   to   v-pos                  .
           move      rr-pre-vis           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-alf                to   rr-pre-vis             .
           if        rr-pre-vis           not  = "OK"
                     go to acc-pre-vis-620.
       acc-pre-vis-630.
      *                  *---------------------------------------------*
      *                  * Pulizia linea 20                            *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     acc-pre-vis-999.
       acc-pre-vis-999.
           exit.

      *    *===========================================================*
      *    * Incremento numero records letti                           *
      *    *-----------------------------------------------------------*
       inc-rec-let-000.
      *              *-------------------------------------------------*
      *              * Incremento                                      *
      *              *-------------------------------------------------*
           add       1                    to   f-xxx-nrl              .
      *              *-------------------------------------------------*
      *              * Deviazione                                      *
      *              *-------------------------------------------------*
           if        f-xxx-nrl            >    100
                     go to inc-rec-let-100
           else if   f-xxx-nrl            >    10
                     go to inc-rec-let-200
           else      go to inc-rec-let-500.
       inc-rec-let-100.
      *              *-------------------------------------------------*
      *              * Se maggiore di 100                              *
      *              *-------------------------------------------------*
           move      f-xxx-nrl            to   f-xxx-nrc              .
           if        f-xxx-nrc            =    zero
                     go to inc-rec-let-500
           else      go to inc-rec-let-999.
       inc-rec-let-200.
      *              *-------------------------------------------------*
      *              * Se maggiore di 10                               *
      *              *-------------------------------------------------*
           move      f-xxx-nrl            to   f-xxx-nrd              .
           if        f-xxx-nrd            =    zero
                     go to inc-rec-let-500
           else      go to inc-rec-let-999.
       inc-rec-let-500.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           perform   vis-rec-let-000      thru vis-rec-let-999        .
       inc-rec-let-999.
           exit.

      *    *===========================================================*
      *    * Incremento numero records scritti                         *
      *    *-----------------------------------------------------------*
       inc-rec-scr-000.
      *              *-------------------------------------------------*
      *              * Incremento                                      *
      *              *-------------------------------------------------*
           add       1                    to   f-xxx-nrs              .
      *              *-------------------------------------------------*
      *              * Deviazione                                      *
      *              *-------------------------------------------------*
           if        f-xxx-nrs            >    100
                     go to inc-rec-scr-100
           else if   f-xxx-nrs            >    10
                     go to inc-rec-scr-200
           else      go to inc-rec-scr-500.
       inc-rec-scr-100.
      *              *-------------------------------------------------*
      *              * Se maggiore di 100                              *
      *              *-------------------------------------------------*
           move      f-xxx-nrs            to   f-xxx-nrc              .
           if        f-xxx-nrc            =    zero
                     go to inc-rec-scr-500
           else      go to inc-rec-scr-999.
       inc-rec-scr-200.
      *              *-------------------------------------------------*
      *              * Se maggiore di 10                               *
      *              *-------------------------------------------------*
           move      f-xxx-nrs            to   f-xxx-nrd              .
           if        f-xxx-nrd            =    zero
                     go to inc-rec-scr-500
           else      go to inc-rec-scr-999.
       inc-rec-scr-500.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           perform   vis-rec-scr-000      thru vis-rec-scr-999        .
       inc-rec-scr-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione numero records letti                      *
      *    *-----------------------------------------------------------*
       vis-rec-let-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      16                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      f-xxx-nrl            to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rec-let-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione numero records scritti                    *
      *    *-----------------------------------------------------------*
       vis-rec-scr-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      18                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      f-xxx-nrs            to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rec-scr-999.
           exit.

      *    *===========================================================*
      *    * Determinazione comune corrispondente in base a Cap e      *
      *    * descrizione                                               *
      *    *-----------------------------------------------------------*
       det-cap-cfl-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-cap-cfl-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore elementi letti        *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-cap-cfl-ctr      .
      *              *-------------------------------------------------*
      *              * Normalizzazione valori di uscita                *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-cap-cfl-cmn      .
           move      zero                 to   w-det-cap-cfl-fzn      .
           move      zero                 to   w-det-cap-cfl-lct      .
           move      spaces               to   w-det-cap-cfl-ele      .
           move      spaces               to   w-det-cap-cfl-cap      .
       det-cap-cfl-100.
      *              *-------------------------------------------------*
      *              * Start su file [gxc]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "DESORD    "         to   f-key                  .
           move      w-det-cap-cfl-cfl    to   rf-gxc-des-ord         .
           move      zero                 to   rf-gxc-cod-cmn         .
           move      zero                 to   rf-gxc-cod-fzn         .
           move      zero                 to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : ad uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-cap-cfl-900.
       det-cap-cfl-200.
      *              *-------------------------------------------------*
      *              * Next su [gxc]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : ad uscita                     *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-cap-cfl-900.
       det-cap-cfl-300.
      *              *-------------------------------------------------*
      *              * Max su [gxc], se non superato : ad uscita       *
      *              *-------------------------------------------------*
           if        rf-gxc-des-ord       not  = w-det-cap-cfl-cfl
                     go to det-cap-cfl-900.
       det-cap-cfl-400.
      *              *-------------------------------------------------*
      *              * Selezioni su [gxc]                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Selezione su Provincia                      *
      *                  *---------------------------------------------*
           if        rf-gxc-cod-prv       not  = w-det-cap-cfl-prv
                     go to det-cap-cfl-200.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi con stradario           *
      *                  *---------------------------------------------*
           if        rf-gxc-sgl-std       not  = spaces
                     go to det-cap-cfl-200.
      *                  *---------------------------------------------*
      *                  * Esclusione capoluoghi di provincia          *
      *                  *---------------------------------------------*
           if        rf-gxc-snx-cpp       not  = "N"
                     go to det-cap-cfl-200.
      *                  *---------------------------------------------*
      *                  * Esclusione elementi senza CAP               *
      *                  *---------------------------------------------*
           if        rf-gxc-cap-avp       =    spaces
                     go to det-cap-cfl-200.
       det-cap-cfl-600.
      *              *-------------------------------------------------*
      *              * Incremento contatore elementi letti             *
      *              *-------------------------------------------------*
           add       1                    to   w-det-cap-cfl-ctr      .
       det-cap-cfl-620.
      *              *-------------------------------------------------*
      *              * Bufferizzazione dell'elemento letto             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Memorizzazione codici comune, frazione e    *
      *                  * localita'                                   *
      *                  *---------------------------------------------*
           move      rf-gxc-cod-cmn       to   w-det-cap-cfl-cmn      .
           move      rf-gxc-cod-fzn       to   w-det-cap-cfl-fzn      .
           move      rf-gxc-cod-lct       to   w-det-cap-cfl-lct      .
           move      rf-gxc-cod-prv       to   w-det-cap-cfl-prv      .
           move      rf-gxc-cap-avp       to   w-det-cap-cfl-cap      .
           if        rf-gxc-cod-cmn       not  = zero
                     move  "C"            to   w-det-cap-cfl-ele      .
           if        rf-gxc-cod-fzn       not  = zero
                     move  "F"            to   w-det-cap-cfl-ele      .
           if        rf-gxc-cod-lct       not  = zero
                     move  "L"            to   w-det-cap-cfl-ele      .
       det-cap-cfl-800.
      *              *-------------------------------------------------*
      *              * Riciclo a record [gxc] successivo               *
      *              *-------------------------------------------------*
           go to     det-cap-cfl-200.
       det-cap-cfl-900.
      *              *-------------------------------------------------*
      *              * Test in uscita                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su contatore elementi letti            *
      *                  *---------------------------------------------*
           if        w-det-cap-cfl-ctr    =    zero
                     move  "#"            to   w-det-cap-cfl-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-cap-cfl-999.
       det-cap-cfl-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

