       Identification Division.
       Program-Id.                                 pgep8000           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    gep                 *
      *                                Settore:    slc                 *
      *                                   Fase:    gep800              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 30/05/94    *
      *                       Ultima revisione:    NdK del 07/05/16    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Apertura ciclo per solleciti clienti        *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      *    *===========================================================*
      *    * File Control [kk0]                                        *
      *    *-----------------------------------------------------------*
           select  optional  kk0   assign to disk           f-kk0-pat
                             organization is indexed
                             access mode  is dynamic
                             record key   is kk0-key
                             file status  is                f-kk0-sts .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Chiave nr. 1 : per cliente                        *
      *            *---------------------------------------------------*
               10  srt-key-001.
      *                *-----------------------------------------------*
      *                * Codice cliente                                *
      *                *-----------------------------------------------*
                   15  srt-cod-cli        pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Inoltro scadenza                              *
      *                *-----------------------------------------------*
                   15  srt-inl-sdb        pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Codice dipendenza del cliente per rottura     *
      *                * sollecito                                     *
      *                *-----------------------------------------------*
                   15  srt-dpc-key        pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Chiave nr. 2 : per scadenza                       *
      *            *---------------------------------------------------*
               10  srt-key-002.
      *                *-----------------------------------------------*
      *                * Data documento di riferimento                 *
      *                *-----------------------------------------------*
                   15  srt-dat-ddr        pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Data documento di riferimento                 *
      *                *-----------------------------------------------*
                   15  srt-num-ddr        pic  x(10)                  .
      *                *-----------------------------------------------*
      *                * Tipo documento di riferimento                 *
      *                *-----------------------------------------------*
                   15  srt-tip-ddr        pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Data scadenza                                 *
      *                *-----------------------------------------------*
                   15  srt-dts-sdb        pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Codice agente                                     *
      *            *---------------------------------------------------*
               10  srt-cod-age            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Dipendenza del cliente                            *
      *            *---------------------------------------------------*
               10  srt-dpz-cli            pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Emissione di sollecito al cliente                 *
      *            *---------------------------------------------------*
               10  srt-emi-slc            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo di testo di sollecito per il cliente         *
      *            *---------------------------------------------------*
               10  srt-tdt-slc            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice tipo sollecito di 1. livello               *
      *            *---------------------------------------------------*
               10  srt-tso-l01            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice tipo sollecito di 2. livello               *
      *            *---------------------------------------------------*
               10  srt-tso-l02            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice tipo sollecito di 3. livello               *
      *            *---------------------------------------------------*
               10  srt-tso-l03            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero scadenza                                   *
      *            *---------------------------------------------------*
               10  srt-num-sdb            pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Livello di sollecito relativo alla scadenza       *
      *            *---------------------------------------------------*
               10  srt-liv-slc            pic  9(01)                  .

      *    *===========================================================*
      *    * File Description [kk0]                                    *
      *    *-----------------------------------------------------------*
       fd  kk0       label record standard                            .

      *    *===========================================================*
      *    * Record file di appoggio [kk0]                             *
      *    *-----------------------------------------------------------*
       01  kk0-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  kk0-key.
      *            *---------------------------------------------------*
      *            * Codice cliente                                    *
      *            *---------------------------------------------------*
               10  kk0-cod-cli            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza cliente                         *
      *            *---------------------------------------------------*
               10  kk0-dpz-cli            pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  kk0-dat.
      *            *---------------------------------------------------*
      *            * Flag di cliente da stampare                       *
      *            *---------------------------------------------------*
               10  kk0-flg-stp            pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * File area per [kk0]                                       *
      *    *-----------------------------------------------------------*
       01  f-kk0.
           05  f-kk0-nam                  pic  x(04)                  .
           05  f-kk0-pat                  pic  x(40)                  .
           05  f-kk0-sts                  pic  x(02)                  .

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "gep"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "slc"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "gep800"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pgep8000"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     " APERTURA CICLO PER SOLLECITI A CLIENTI "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "msegrt" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mopsys" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su modalita' di funzionamento      *
      *        *-------------------------------------------------------*
           05  w-cnt-mfu.
      *            *---------------------------------------------------*
      *            * Visualizzazione forzata da segreteria             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-vis-sgr      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste per programma di esecuzione       *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .

      *    *===========================================================*
      *    * Records files                                             *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [sct]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfsct"                          .
      *        *-------------------------------------------------------*
      *        * [scr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfscr"                          .
      *        *-------------------------------------------------------*
      *        * [ccc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfccc"                          .
      *        *-------------------------------------------------------*
      *        * [sdb]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfsdb"                          .
      *        *-------------------------------------------------------*
      *        * [ddp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfddp"                          .
      *        *-------------------------------------------------------*
      *        * [zso]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfzso"                          .
      *        *-------------------------------------------------------*
      *        * [age]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/age/fls/rec/rfage"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [lotslc]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/num/rec/rnlotslc"                       .

      *    *===========================================================*
      *    * Work-area richieste per programma                         *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Data riferimento per solleciti                        *
      *        *-------------------------------------------------------*
           05  rr-dat-rif                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Tipo selezione                                        *
      *        * - 01 : Per Agente/Cliente                             *
      *        * - 02 : Per Cliente                                    *
      *        *-------------------------------------------------------*
           05  rr-tip-sel                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Si/no aggiornamento livelli                           *
      *        * - 'S' : Si                                            *
      *        * - 'N' : No                                            *
      *        *-------------------------------------------------------*
           05  rr-snx-alv                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Codice agente                                         *
      *        *                                                       *
      *        * N.B. : Solo se tipo selezione Per Agente/Cliente      *
      *        *-------------------------------------------------------*
           05  rr-cod-age                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice agente, nominativo                             *
      *        *                                                       *
      *        * N.B. : Solo se tipo selezione Per Agente/Cliente      *
      *        *-------------------------------------------------------*
           05  rr-cod-age-nom             pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente                                        *
      *        *                                                       *
      *        * N.B. : Solo se tipo selezione Per Cliente             *
      *        *-------------------------------------------------------*
           05  rr-cod-cli                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente, ragione sociale                       *
      *        *                                                       *
      *        * N.B. : Solo se tipo selezione Per Cliente             *
      *        *-------------------------------------------------------*
           05  rr-cod-cli-rag             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente, indirizzo                             *
      *        *                                                       *
      *        * N.B. : Solo se tipo selezione Per Cliente             *
      *        *-------------------------------------------------------*
           05  rr-cod-cli-via             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente, localita'                             *
      *        *                                                       *
      *        * N.B. : Solo se tipo selezione Per Cliente             *
      *        *-------------------------------------------------------*
           05  rr-cod-cli-loc             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza del cliente                         *
      *        *                                                       *
      *        * N.B. : Solo se tipo selezione Per Cliente e richiesto *
      *        *        un solo cliente                                *
      *        *-------------------------------------------------------*
           05  rr-dpz-cli                 pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza cliente, ragione sociale            *
      *        *                                                       *
      *        * N.B. : Solo se tipo selezione Per Cliente e richiesto *
      *        *        un solo cliente                                *
      *        *-------------------------------------------------------*
           05  rr-dpz-cli-rag             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza cliente, indirizzo                  *
      *        *                                                       *
      *        * N.B. : Solo se tipo selezione Per Cliente e richiesto *
      *        *        un solo cliente                                *
      *        *-------------------------------------------------------*
           05  rr-dpz-cli-via             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza cliente, localita'                  *
      *        *                                                       *
      *        * N.B. : Solo se tipo selezione Per Cliente e richiesto *
      *        *        un solo cliente                                *
      *        *-------------------------------------------------------*
           05  rr-dpz-cli-loc             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Si/no situazioni debitorie                            *
      *        * - 01 : Si                                             *
      *        * - 02 : No                                             *
      *        *-------------------------------------------------------*
           05  rr-snx-deb                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Data scadenza minima da selezionare                   *
      *        *-------------------------------------------------------*
           05  rr-dts-min                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Data scadenza massima da selezionare                  *
      *        *-------------------------------------------------------*
           05  rr-dts-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Esclusione clienti con solo insoluti                  *
      *        * - 01 : Nessuna esclusione                             *
      *        * - 02 : Esclusione clienti con soli insoluti           *
      *        * - 03 : Solo clienti con insoluti                      *
      *        *-------------------------------------------------------*
           05  rr-esc-csi                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Data registrazione insoluto minima da selezionare     *
      *        *-------------------------------------------------------*
           05  rr-dri-min                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Data registrazione insoluto massima da selezionare    *
      *        *-------------------------------------------------------*
           05  rr-dri-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Si/no esecuzione batch                                *
      *        *-------------------------------------------------------*
           05  rr-snx-btc                 pic  x(01)                  .

      *    *===========================================================*
      *    * Work area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Si/No gestione agenti attiva                          *
      *        *-------------------------------------------------------*
           05  w-prs-age-snx              pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Numero massimo di livelli di sollecito                *
      *        *-------------------------------------------------------*
           05  w-prs-max-liv              pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Numero giorni di ritardo per stampa solleciti         *
      *        *-------------------------------------------------------*
           05  w-prs-ngg-scd.
               10  w-prs-ngg-scd-str      pic  x(08)                  .
               10  w-prs-ngg-scd-str-r redefines
                   w-prs-ngg-scd-str.
                   15  w-prs-ngg-scd-rim  pic  9(02)                  .
                   15  filler             pic  x(01)                  .
                   15  w-prs-ngg-scd-bon  pic  9(02)                  .
                   15  filler             pic  x(01)                  .
                   15  w-prs-ngg-scd-ccp  pic  9(02)                  .

      *    *===========================================================*
      *    * Work area referenze                                       *
      *    *-----------------------------------------------------------*
       01  w-ref.
      *        *-------------------------------------------------------*
      *        * Codici tipi sollecito standard                        *
      *        *-------------------------------------------------------*
           05  w-ref-tso-std.
               10  w-ref-tso-std-str      pic  x(17)                  .
               10  w-ref-tso-std-str-r redefines
                   w-ref-tso-std-str.
                   15  w-ref-tso-std-l01  pic  9(05)                  .
                   15  filler             pic  x(01)                  .
                   15  w-ref-tso-std-l02  pic  9(05)                  .
                   15  filler             pic  x(01)                  .
                   15  w-ref-tso-std-l03  pic  9(05)                  .

      *    *===========================================================*
      *    * Work-area per numerazioni                                 *
      *    *-----------------------------------------------------------*
       01  w-num.
      *        *-------------------------------------------------------*
      *        * Data inizio ciclo solleciti                           *
      *        *-------------------------------------------------------*
           05  w-num-dic-slc              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Data fine ciclo solleciti                             *
      *        *-------------------------------------------------------*
           05  w-num-dfc-slc              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Data di riferimento ciclo solleciti                   *
      *        *-------------------------------------------------------*
           05  w-num-dat-rif              pic  9(07)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [age]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-age.
               10  w-let-arc-age-flg      pic  x(01)                  .
               10  w-let-arc-age-cod      pic  9(07)                  .
               10  w-let-arc-age-nom      pic  x(20)                  .
               10  w-let-arc-age-sup      pic  9(07)                  .
               10  w-let-arc-age-cat      pic  9(05)                  .
               10  w-let-arc-age-per occurs 03 
                                          pic  9(02)v9(01)            .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [cli]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-cli.
               10  w-let-arc-cli-flg      pic  x(01)                  .
               10  w-let-arc-cli-cod      pic  9(07)                  .
               10  w-let-arc-cli-rag      pic  x(40)                  .
               10  w-let-arc-cli-via      pic  x(40)                  .
               10  w-let-arc-cli-loc      pic  x(40)                  .
               10  w-let-arc-cli-cge      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcc.
               10  w-let-arc-dcc-flg      pic  x(01)                  .
               10  w-let-arc-dcc-tle      pic  x(01)                  .
               10  w-let-arc-dcc-cod      pic  9(07)                  .
               10  w-let-arc-dcc-dpz      pic  x(04)                  .
               10  w-let-arc-dcc-rag      pic  x(40)                  .
               10  w-let-arc-dcc-via      pic  x(40)                  .
               10  w-let-arc-dcc-loc      pic  x(40)                  .
               10  w-let-arc-dcc-abi      pic  9(05)                  .
               10  w-let-arc-dcc-cab      pic  9(05)                  .
               10  w-let-arc-dcc-age      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [ccc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-ccc.
               10  w-let-arc-ccc-flg      pic  x(01)                  .
               10  w-let-arc-ccc-cod      pic  9(07)                  .
               10  w-let-arc-ccc-ems      pic  9(02)                  .
               10  w-let-arc-ccc-tts      pic  9(02)                  .
               10  w-let-arc-ccc-ts1      pic  9(05)                  .
               10  w-let-arc-ccc-ts2      pic  9(05)                  .
               10  w-let-arc-ccc-ts3      pic  9(05)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per determinazione status scadenza con riferi-   *
      *        * mento ad una certa data                               *
      *        *-------------------------------------------------------*
           05  w-det-srd-sdb.
      *            *---------------------------------------------------*
      *            * Data di riferimento per la determinazione         *
      *            *---------------------------------------------------*
               10  w-det-srd-sdb-drd      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Status determinato                                *
      *            * - Spaces : Status non determinabile               *
      *            * - A      : Scadenza ancora aperta                 *
      *            * - C      : Scadenza ormai chiusa                  *
      *            * - N      : Scadenza non ancora inserita alla data *
      *            *            di riferimento per la determinazione   *
      *            *---------------------------------------------------*
               10  w-det-srd-sdb-sts      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Sigla ultima operazione eseguita sulla scadenza   *
      *            * - Spaces : Nessuna                                *
      *            * - EMI    : Emissione                              *
      *            * - SSC    : Storno                                 *
      *            * - RIS    : Riscossione                            *
      *            * - PAG    : Pagamento                              *
      *            * - CMP    : Compensazione                          *
      *            * - COM    : Composizione distinta                  *
      *            * - PRE    : Presentazione distinta                 *
      *            * - ACT    : Accettazione distinta                  *
      *            * - ACD    : Accredito distinta                     *
      *            * - RSP    : Richiamo della scadenza presentata     *
      *            * - ACS    : Accredito scadenza al dopo incasso     *
      *            * - NBE    : Notizia di buon esito sulla scadenza   *
      *            * - PBE    : Presunto buon esito sulla scadenza     *
      *            * - ISP    : Insoluto sulla scadenza presentata     *
      *            *---------------------------------------------------*
               10  w-det-srd-sdb-suo      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Data di registrazione opzionale                   *
      *            *---------------------------------------------------*
               10  w-det-srd-sdb-dro      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per determinazione di una data maggiorata fino   *
      *        * ad un massimo di 99 giorni                            *
      *        *-------------------------------------------------------*
           05  w-det-dat-mng.
      *            *---------------------------------------------------*
      *            * Data in input                                     *
      *            *---------------------------------------------------*
               10  w-det-dat-mng-dti      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero giorni di incremento : 01...99             *
      *            *---------------------------------------------------*
               10  w-det-dat-mng-ngi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Data in output                                    *
      *            *---------------------------------------------------*
               10  w-det-dat-mng-dto      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Comodo per una data con ridefinizioni necessarie  *
      *            *---------------------------------------------------*
               10  w-det-dat-mng-wdt      pic  9(07)                  .
               10  w-det-dat-mng-wdr redefines
                   w-det-dat-mng-wdt.
                   15  w-det-dat-mng-wds  pic  9(03)                  .
                   15  w-det-dat-mng-wdm  pic  9(02)                  .
                   15  w-det-dat-mng-wdg  pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tabella giorni nei mesi e relativi comodi per il  *
      *            * calcolo del numero giorni di febbraio             *
      *            *---------------------------------------------------*
               10  w-det-dat-mng-wt0.
                   15  filler             pic  9(02)       value 31   .
                   15  filler             pic  9(02)       value 28   .
                   15  filler             pic  9(02)       value 31   .
                   15  filler             pic  9(02)       value 30   .
                   15  filler             pic  9(02)       value 31   .
                   15  filler             pic  9(02)       value 30   .
                   15  filler             pic  9(02)       value 31   .
                   15  filler             pic  9(02)       value 31   .
                   15  filler             pic  9(02)       value 30   .
                   15  filler             pic  9(02)       value 31   .
                   15  filler             pic  9(02)       value 30   .
                   15  filler             pic  9(02)       value 31   .
               10  w-det-dat-mng-wt1 redefines
                   w-det-dat-mng-wt0.
                   15  w-det-dat-mng-wt2
                               occurs 12  pic  9(02)                  .
               10  w-det-dat-mng-wt5      pic  9(04)                  .
               10  w-det-dat-mng-wt6      pic  9(04)                  .
               10  w-det-dat-mng-wt7      pic  9(04)                  .
      *            *---------------------------------------------------*
      *            * Comodo per determinazione resto                   *
      *            *---------------------------------------------------*
               10  w-det-dat-mng-wpr      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Comodo per numero mesi di incremento              *
      *            *---------------------------------------------------*
               10  w-det-dat-mng-wmi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Contatore di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-dat-mng-ctr      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det saldo portafoglio cliente alla data      *
      *        *-------------------------------------------------------*
           05  w-det-sdo-gep.
      *            *---------------------------------------------------*
      *            * Codice cliente                                    *
      *            *---------------------------------------------------*
               10  w-det-sdo-gep-cli      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza del cliente                     *
      *            *---------------------------------------------------*
               10  w-det-sdo-gep-dpz      pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Saldo cliente                                     *
      *            *---------------------------------------------------*
               10  w-det-sdo-gep-sdo      pic s9(13)                  .

      *    *===========================================================*
      *    * Work-area per salvataggi                                  *
      *    *-----------------------------------------------------------*
       01  w-sav.
      *        *-------------------------------------------------------*
      *        * Tipo selezione                                        *
      *        *-------------------------------------------------------*
           05  w-sav-tip-sel              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice agente                                         *
      *        *-------------------------------------------------------*
           05  w-sav-cod-age              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente                                        *
      *        *-------------------------------------------------------*
           05  w-sav-cod-cli              pic  9(07)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo selezione                             *
      *        *-------------------------------------------------------*
           05  w-exp-tip-sel.
               10  w-exp-tip-sel-num      pic  9(02)       value 02   .
               10  w-exp-tip-sel-lun      pic  9(02)       value 20   .
               10  w-exp-tip-sel-tbl.
                   15  filler             pic  x(20) value
                            "per Agente/cliente  "                    .
                   15  filler             pic  x(20) value
                            "per Cliente         "                    .
      *        *-------------------------------------------------------*
      *        * Work per : Si/no aggiornamento livelli                *
      *        *-------------------------------------------------------*
           05  w-exp-snx-alv.
               10  w-exp-snx-alv-num      pic  9(02)       value 02   .
               10  w-exp-snx-alv-lun      pic  9(02)       value 02   .
               10  w-exp-snx-alv-tbl.
                   15  filler             pic  x(02) value "Si"       .
                   15  filler             pic  x(02) value "No"       .
      *        *-------------------------------------------------------*
      *        * Work per : Si/no situazioni debitorie                 *
      *        *-------------------------------------------------------*
           05  w-exp-snx-deb.
               10  w-exp-snx-deb-num      pic  9(02)       value 02   .
               10  w-exp-snx-deb-lun      pic  9(02)       value 50   .
               10  w-exp-snx-deb-tbl.
                   15  filler             pic  x(50) value
                  "Si, tutti i clienti anche con saldo negativo      ".
                   15  filler             pic  x(50) value
                  "No, si escludono i clienti con saldo negativo     ".
      *        *-------------------------------------------------------*
      *        * Work per : Esclusione clienti con solo insoluti       *
      *        *-------------------------------------------------------*
           05  w-exp-esc-csi.
               10  w-exp-esc-csi-num      pic  9(02)       value 03   .
               10  w-exp-esc-csi-lun      pic  9(02)       value 50   .
               10  w-exp-esc-csi-tbl.
                   15  filler             pic  x(50) value
                  "Nessuna selezione, tutte le scadenze              ".
                   15  filler             pic  x(50) value
                  "Esclusione di clienti che hanno solo insoluti     ".
                   15  filler             pic  x(50) value
                  "Solo clienti che hanno insoluti                   ".

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale                         *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .
               10  w-err-box-err-m03      pic  x(65)                  .

      *    *===========================================================*
      *    * Buffer clienti da stampare                                *
      *    *-----------------------------------------------------------*
       01  w-bcs.
      *        *-------------------------------------------------------*
      *        * Contatore elementi nel buffer                         *
      *        *-------------------------------------------------------*
           05  w-bcs-num-ele              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Numero massimo elementi nel buffer                    *
      *        *-------------------------------------------------------*
           05  w-bcs-max-ele              pic  9(07) value 16300      .
      *        *-------------------------------------------------------*
      *        * Buffer elementi                                       *
      *        *-------------------------------------------------------*
           05  w-bcs-buf-ele.
               10  w-bcs-sng-ele occurs 16300.
                   15  w-bcs-cod-cli      pic  9(07)       comp-3     .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-bcs-ctr-001              pic  9(07)                  .

      *    *===========================================================*
      *    * Work area per routine sel-rec-sdb-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-sel-rec-sdb.
      *        *-------------------------------------------------------*
      *        * Flag di uscita                                        *
      *        *-------------------------------------------------------*
           05  w-sel-rec-sdb-flg          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Numero giorni di ritardo ammessi per il tipo scadenza *
      *        *-------------------------------------------------------*
           05  w-sel-rec-sdb-ngr          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per scadenze a vista                           *
      *        *-------------------------------------------------------*
           05  w-sel-rec-dts-sdb          pic  9(07)                  .

      *    *===========================================================*
      *    * Work area per ciclo di report-program                     *
      *    *-----------------------------------------------------------*
       01  w-prn.
      *        *-------------------------------------------------------*
      *        * Numero sollecito del cliente                          *
      *        *-------------------------------------------------------*
           05  w-prn-num-slc              pic  9(03)                  .
           05  w-prn-tot-slc              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Numero progressivo riga                               *
      *        *-------------------------------------------------------*
           05  w-prn-num-prg              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Livello sollecito                                     *
      *        *-------------------------------------------------------*
           05  w-prn-liv-slc              pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di rottura codice cliente                        *
      *        *-------------------------------------------------------*
           05  w-prn-rot-cli              pic  9(07)                  .
           05  w-prn-num-cli              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Flag di cliente da stampare                           *
      *        *-------------------------------------------------------*
           05  w-prn-flg-cds              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per report log se batch                        *
      *        *-------------------------------------------------------*
           05  w-prn-msg-bt1              pic  x(80)                  .
           05  w-prn-msg-bt2              pic  x(80)                  .

      *    *===========================================================*
      *    * Work area per bufferizzazione record [ccc]                *
      *    *-----------------------------------------------------------*
       01  w-ccc.
           05  w-ccc-emi-slc              pic  9(02)                  .
           05  w-ccc-tdt-slc              pic  9(02)                  .
           05  w-ccc-tso-l01              pic  9(05)                  .
           05  w-ccc-tso-l02              pic  9(05)                  .
           05  w-ccc-tso-l03              pic  9(05)                  .

      *    *===========================================================*
      *    * Work area per routine prn-liv-det-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-prn-liv-det.
      *        *-------------------------------------------------------*
      *        * Comodo per livello di sollecito                       *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-lvs          pic  9(01)                  .

      *    *===========================================================*
      *    * Work area per routine prn-fin-lr1-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-prn-fin-lr1.
      *        *-------------------------------------------------------*
      *        * Comodo per codice tipo sollecito                      *
      *        *-------------------------------------------------------*
           05  w-prn-fin-lr1-cts          pic  9(05)                  .

      *    *===========================================================*
      *    * Link-area per accettazione codice agente                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/age/prg/cpy/acmnage0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice cliente commerciale     *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmndcc0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice dipendenza del cliente  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoddcc0.acl"                   .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  w-rot-l02-cod-cli      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  w-rot-l01-inl-sdb      pic  9(02)                  .
               10  w-rot-l01-dpc-key      pic  x(04)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento programma       *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Se no richieste : a selezione stampante         *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-350.
       main-250.
      *              *-------------------------------------------------*
      *              * Open files per richieste                        *
      *              *-------------------------------------------------*
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Close files  per richieste                      *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-350.
      *              *-------------------------------------------------*
      *              * Esecuzione in foreground                        *
      *              *-------------------------------------------------*
           perform   exe-pgm-frg-000      thru exe-pgm-frg-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Flag di eventuale visualizzazione forzata       *
      *              *-------------------------------------------------*
           move      s-sts                to   w-cnt-mfu-vis-sgr      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Programma di esecuzione in foreground                     *
      *    *-----------------------------------------------------------*
       exe-pgm-frg-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione rullino messaggi di foreground *
      *              *-------------------------------------------------*
           move      "OF"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Se errore : uscita                          *
      *                  *---------------------------------------------*
            if       m-rsc                not  = spaces
                     go to exe-pgm-frg-999.
      *              *-------------------------------------------------*
      *              * Test se esecuzione batch                        *
      *              *-------------------------------------------------*
           if        rr-snx-btc           =    "S"
                     go to exe-pgm-frg-200.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-pgm-frg-200.
      *              *-------------------------------------------------*
      *              * Open files per ciclo di report-program          *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to exe-pgm-frg-400
           else      go to exe-pgm-frg-500.
       exe-pgm-frg-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     exe-pgm-frg-600.
       exe-pgm-frg-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     exe-pgm-frg-600.
       exe-pgm-frg-600.
      *              *-------------------------------------------------*
      *              * Close files per ciclo di report-program         *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Test se esecuzione batch                        *
      *              *-------------------------------------------------*
           if        rr-snx-btc           =    "S"
                     go to exe-pgm-frg-999.
      *              *-------------------------------------------------*
      *              * Visualizzazione eventuali errori di esecuzione  *
      *              *-------------------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "F"                  to   b-tfe                  .
           move      i-ide-des            to   b-chr                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
           cancel    "swd/mod/prg/obj/mbckgv"                         .
       exe-pgm-frg-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Lettura della variabile di environment          *
      *              *-------------------------------------------------*
           move      "I2"                 to   o-ope                  .
           move      "POST"               to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           if        o-pat                not  = spaces
                     move  "S"            to   rr-snx-btc
           else      move  "N"            to   rr-snx-btc             .
       pre-exe-pgm-010.
      *              *-------------------------------------------------*
      *              * Test se programma eseguibile                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su flag di eventuale visualizzazione   *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-vis-sgr    not  = "V"
                     go to pre-exe-pgm-050.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Programma non eseguibile dall'utente !            
      -              "               "    to   w-err-box-err-msg      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione messaggio di errore         *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-exe-pgm      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-exe-pgm-999.
       pre-exe-pgm-050.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Si/No gestione agenti attiva                *
      *                  *---------------------------------------------*
           perform   prs-age-snx-000      thru prs-age-snx-999        .
      *                  *---------------------------------------------*
      *                  * Numero livello massimo di sollecito         *
      *                  *---------------------------------------------*
           perform   prs-max-liv-000      thru prs-max-liv-999        .
      *                  *---------------------------------------------*
      *                  * Numero giorni di ritardo per stampa solle-  *
      *                  * citi                                        *
      *                  *---------------------------------------------*
           perform   prs-ngg-scd-000      thru prs-ngg-scd-999        .
      *              *-------------------------------------------------*
      *              * Lettura referenze                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codici tipi sollecito standard              *
      *                  *---------------------------------------------*
           perform   ref-tso-std-000      thru ref-tso-std-999        .
      *              *-------------------------------------------------*
      *              * Lettura numerazioni                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numerazione per lotto di solleciti          *
      *                  *---------------------------------------------*
           perform   num-lot-slc-000      thru num-lot-slc-999        .
       pre-exe-pgm-100.
      *              *-------------------------------------------------*
      *              * Controllo che il programma sia eseguibile       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su data finale ciclo solleciti         *
      *                  *---------------------------------------------*
           if        w-num-dic-slc        =    zero
                     go to pre-exe-pgm-200.
           if        w-num-dfc-slc        not  = zero
                     go to pre-exe-pgm-200.
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Salvataggio immagine video              *
      *                      *-----------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Video in Off                            *
      *                      *-----------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Box                                     *
      *                      *-----------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      17                   to   v-lto                  .
           move      78                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Messaggi nel box                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Titolo                              *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "                           A T T E N Z I O N E    
      -              "                      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Prima riga                          *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "Programma non eseguibile !                        
      -              "                      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Seconda riga                        *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing data riferimento solle- *
      *                              * citi attuale                    *
      *                              *---------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      w-num-dat-rif        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Stampa                          *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "Deve essere ancora concluso il ciclo di solleciti 
      -              "riferito al "
                                delimited by   size
                     v-edt
                                delimited by   spaces
                     "."
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Parentesi quadre di delimitazione       *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      74                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Video in On                             *
      *                      *-----------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Accettazione carattere di presa visione *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      75                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Ripristino immagine video               *
      *                      *-----------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita con errore                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-exe-pgm      .
           go to     pre-exe-pgm-999.
       pre-exe-pgm-200.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     pre-exe-pgm-999.
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Si/No gestione agenti attiva  *
      *    *-----------------------------------------------------------*
       prs-age-snx-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/age[snx]"       to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-age-snx
           else      move  spaces         to   w-prs-age-snx          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-age-snx        =    "S" or
                     w-prs-age-snx        =    "N"
                     go to prs-age-snx-999.
           move      "N"                  to   w-prs-age-snx          .
       prs-age-snx-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione :  Numero livello massimo di    *
      *    *                              sollecito                    *
      *    *-----------------------------------------------------------*
       prs-max-liv-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/gep/slc[max-liv]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-num          to   w-prs-max-liv
           else      move  3              to   w-prs-max-liv          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-max-liv        <    1 or
                     w-prs-max-liv        >    3
                     move  3              to   w-prs-max-liv          .
       prs-max-liv-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione :  Numero giorni di ritardo per *
      *    *                              stampa solleciti             *
      *    *-----------------------------------------------------------*
       prs-ngg-scd-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/gep/slc[ngg-scd]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-ngg-scd-str
           else      move  spaces         to   w-prs-ngg-scd-str      .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-ngg-scd-rim    not  numeric
                     move  zero           to   w-prs-ngg-scd-rim      .
           if        w-prs-ngg-scd-bon    not  numeric
                     move  zero           to   w-prs-ngg-scd-bon      .
           if        w-prs-ngg-scd-ccp    not  numeric
                     move  zero           to   w-prs-ngg-scd-ccp      .
       prs-ngg-scd-999.
           exit.

      *    *===========================================================*
      *    * Lettura referenza : Codici tipi sollecito standard        *
      *    *-----------------------------------------------------------*
       ref-tso-std-000.
      *              *-------------------------------------------------*
      *              * Lettura referenza                               *
      *              *-------------------------------------------------*
           move      "R:"                 to   s-ope                  .
           move      "pgm/gep/slc[tso-std]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-ref-tso-std-str
           else      move  spaces         to   w-ref-tso-std-str      .
      *              *-------------------------------------------------*
      *              * Normalizzazione referenza                       *
      *              *-------------------------------------------------*
           if        w-ref-tso-std-l01    not  numeric
                     move  zero           to   w-ref-tso-std-l01      .
           if        w-ref-tso-std-l02    not  numeric
                     move  zero           to   w-ref-tso-std-l02      .
           if        w-ref-tso-std-l03    not  numeric
                     move  zero           to   w-ref-tso-std-l03      .
       ref-tso-std-999.
           exit.

      *    *===========================================================*
      *    * Lettura numerazione : Numerazione per ciclo solleciti     *
      *    *-----------------------------------------------------------*
       num-lot-slc-000.
      *              *-------------------------------------------------*
      *              * Open numerazione [lotslc]                       *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/num/ioc/obj/inlotslc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-lot-slc             .
      *              *-------------------------------------------------*
      *              * Normalizzazione record [lotslc]                 *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/gep/num/ioc/obj/inlotslc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-lot-slc             .
      *              *-------------------------------------------------*
      *              * Lettura record [lotslc]                         *
      *              *-------------------------------------------------*
           move      "RD"                 to   f-ope                  .
           move      "pgm/gep/num/ioc/obj/inlotslc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-lot-slc             .
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rn-lot-slc-dic-slc   to   w-num-dic-slc          .
           move      rn-lot-slc-dfc-slc   to   w-num-dfc-slc          .
           move      rn-lot-slc-dat-rif   to   w-num-dat-rif          .
      *              *-------------------------------------------------*
      *              * Close numerazione [lotslc]                      *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/num/ioc/obj/inlotslc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-lot-slc             .
       num-lot-slc-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Test se esecuzione batch                        *
      *              *-------------------------------------------------*
           if        rr-snx-btc           =    "S"
                     move  "N"            to   w-cnt-fun-snx-ric
                     go to pre-tip-fun-999.
       pre-tip-fun-100.
      *              *-------------------------------------------------*
      *              * Si/No richieste ad utente                       *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice agente          *
      *              *-------------------------------------------------*
           perform   cod-mne-age-opn-000  thru cod-mne-age-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice cliente commer- *
      *              * ciale                                           *
      *              *-------------------------------------------------*
           perform   cod-mne-dcc-opn-000  thru cod-mne-dcc-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice dipendenza del  *
      *              * cliente                                         *
      *              *-------------------------------------------------*
           perform   cod-cod-dcc-opn-000  thru cod-cod-dcc-opn-999    .
      *              *-------------------------------------------------*
      *              * [age]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice agente         *
      *              *-------------------------------------------------*
           perform   cod-mne-age-cls-000  thru cod-mne-age-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice cliente com-   *
      *              * merciale                                        *
      *              *-------------------------------------------------*
           perform   cod-mne-dcc-cls-000  thru cod-mne-dcc-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice dipendenza del *
      *              * cliente                                         *
      *              *-------------------------------------------------*
           perform   cod-cod-dcc-cls-000  thru cod-cod-dcc-cls-999    .
      *              *-------------------------------------------------*
      *              * [age]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Data riferimento                            *
      *                  *---------------------------------------------*
           perform   acc-dat-rif-000      thru acc-dat-rif-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-150.
      *                  *---------------------------------------------*
      *                  * Tipo selezione                              *
      *                  *---------------------------------------------*
           perform   acc-tip-sel-000      thru acc-tip-sel-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-100.
       acc-ric-sel-175.
      *                  *---------------------------------------------*
      *                  * Si/no aggiornameno livelli                  *
      *                  *---------------------------------------------*
           perform   acc-snx-alv-000      thru acc-snx-alv-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-100.
       acc-ric-sel-200.
      *                  *---------------------------------------------*
      *                  * Codice agente                               *
      *                  *---------------------------------------------*
           perform   acc-cod-age-000      thru acc-cod-age-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-175.
       acc-ric-sel-250.
      *                  *---------------------------------------------*
      *                  * Codice cliente                              *
      *                  *---------------------------------------------*
           perform   acc-cod-cli-000      thru acc-cod-cli-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-200.
       acc-ric-sel-300.
      *                  *---------------------------------------------*
      *                  * Dipendenza cliente                          *
      *                  *---------------------------------------------*
           perform   acc-dpz-cli-000      thru acc-dpz-cli-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-250.
       acc-ric-sel-350.
      *                  *---------------------------------------------*
      *                  * Si/no situazioni debitorie                  *
      *                  *---------------------------------------------*
           perform   acc-snx-deb-000      thru acc-snx-deb-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-300.
       acc-ric-sel-400.
      *                  *---------------------------------------------*
      *                  * Data scadenza minima da selezionare         *
      *                  *---------------------------------------------*
           perform   acc-dts-min-000      thru acc-dts-min-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-350.
       acc-ric-sel-450.
      *                  *---------------------------------------------*
      *                  * Data scadenza massima da selezionare        *
      *                  *---------------------------------------------*
           perform   acc-dts-max-000      thru acc-dts-max-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-400.
       acc-ric-sel-500.
      *                  *---------------------------------------------*
      *                  * Esclusione clienti con solo insoluti        *
      *                  *---------------------------------------------*
           perform   acc-esc-csi-000      thru acc-esc-csi-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-450.
       acc-ric-sel-550.
      *                  *---------------------------------------------*
      *                  * Data registrazione insoluto minima          *
      *                  *---------------------------------------------*
           perform   acc-dri-min-000      thru acc-dri-min-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-500.
       acc-ric-sel-600.
      *                  *---------------------------------------------*
      *                  * Data registrazione insoluto massima         *
      *                  *---------------------------------------------*
           perform   acc-dri-max-000      thru acc-dri-max-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-550.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "Conferma esecuzione (S/N/E) ?"
                                          to   v-not                  .
           move      " "                  to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Data riferimento                                *
      *              *-------------------------------------------------*
           perform   pmt-dat-rif-000      thru pmt-dat-rif-999        .
      *              *-------------------------------------------------*
      *              * Tipo selezione                                  *
      *              *-------------------------------------------------*
           perform   pmt-tip-sel-000      thru pmt-tip-sel-999        .
      *              *-------------------------------------------------*
      *              * Si/no aggiornameno livelli                      *
      *              *-------------------------------------------------*
           perform   pmt-snx-alv-000      thru pmt-snx-alv-999        .
      *              *-------------------------------------------------*
      *              * Codice agente                                   *
      *              *-------------------------------------------------*
           perform   pmt-cod-age-000      thru pmt-cod-age-999        .
      *              *-------------------------------------------------*
      *              * Codice cliente                                  *
      *              *-------------------------------------------------*
           perform   pmt-cod-cli-000      thru pmt-cod-cli-999        .
      *              *-------------------------------------------------*
      *              * Dipendenza cliente                              *
      *              *-------------------------------------------------*
           perform   pmt-dpz-cli-000      thru pmt-dpz-cli-999        .
      *              *-------------------------------------------------*
      *              * Si/no situazioni debitorie                      *
      *              *-------------------------------------------------*
           perform   pmt-snx-deb-000      thru pmt-snx-deb-999        .
      *              *-------------------------------------------------*
      *              * Data scadenza minima da selezionare             *
      *              *-------------------------------------------------*
           perform   pmt-dts-min-000      thru pmt-dts-min-999        .
      *              *-------------------------------------------------*
      *              * Data scadenza massima da selezionare            *
      *              *-------------------------------------------------*
           perform   pmt-dts-max-000      thru pmt-dts-max-999        .
      *              *-------------------------------------------------*
      *              * Esclusione clienti con solo insoluti            *
      *              *-------------------------------------------------*
           perform   pmt-esc-csi-000      thru pmt-esc-csi-999        .
      *              *-------------------------------------------------*
      *              * Data registrazione insoluto minima              *
      *              *-------------------------------------------------*
           perform   pmt-dri-min-000      thru pmt-dri-min-999        .
      *              *-------------------------------------------------*
      *              * Data registrazione insoluto massima             *
      *              *-------------------------------------------------*
           perform   pmt-dri-max-000      thru pmt-dri-max-999        .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Prompts per : Data riferimento                            *
      *    *-----------------------------------------------------------*
       pmt-dat-rif-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data riferimento           :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dat-rif-999.
           exit.

      *    *===========================================================*
      *    * Prompts per : Tipo selezione                              *
      *    *-----------------------------------------------------------*
       pmt-tip-sel-000.
      *              *-------------------------------------------------*
      *              * Test se da visualizzare                         *
      *              *-------------------------------------------------*
           if        w-prs-age-snx        not  = "S"
                     go to pmt-tip-sel-999.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo selezione             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-tip-sel-999.
           exit.

      *    *===========================================================*
      *    * Prompts per : Si/no aggiornamento livelli                 *
      *    *-----------------------------------------------------------*
       pmt-snx-alv-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Aggiornamento livelli      :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-snx-alv-999.
           exit.

      *    *===========================================================*
      *    * Prompts per : Codice agente                               *
      *    *-----------------------------------------------------------*
       pmt-cod-age-000.
      *              *-------------------------------------------------*
      *              * Test se da visualizzare                         *
      *              *-------------------------------------------------*
           if        w-prs-age-snx        not  = "S"
                     go to pmt-cod-age-999.
           if        rr-tip-sel           =    02
                     go to pmt-cod-age-999.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice agente              :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cod-age-999.
           exit.

      *    *===========================================================*
      *    * Prompts per : Codice cliente                              *
      *    *-----------------------------------------------------------*
       pmt-cod-cli-000.
      *              *-------------------------------------------------*
      *              * Test se da visualizzare                         *
      *              *-------------------------------------------------*
           if        w-prs-age-snx        not  = "S"
                     go to pmt-cod-cli-100.
           if        rr-tip-sel           not  = 02
                     go to pmt-cod-cli-999.
       pmt-cod-cli-100.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice cliente             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cod-cli-999.
           exit.

      *    *===========================================================*
      *    * Prompts per : Dipendenza cliente                          *
      *    *-----------------------------------------------------------*
       pmt-dpz-cli-000.
      *              *-------------------------------------------------*
      *              * Test se da visualizzare                         *
      *              *-------------------------------------------------*
           if        w-prs-age-snx        not  = "S"
                     go to pmt-dpz-cli-100.
           if        rr-tip-sel           not  = 02
                     go to pmt-dpz-cli-200.
       pmt-dpz-cli-100.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Dipendenza del cliente     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     pmt-dpz-cli-999.
       pmt-dpz-cli-200.
      *              *-------------------------------------------------*
      *              * Visualizzazione a spaces                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     pmt-dpz-cli-999.
       pmt-dpz-cli-999.
           exit.

      *    *===========================================================*
      *    * Prompts per : Si/no situazioni debitorie                  *
      *    *-----------------------------------------------------------*
       pmt-snx-deb-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      31                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Selezioni su situazioni clienti"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      " - ns. situazioni debitorie:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-snx-deb-999.
           exit.

      *    *===========================================================*
      *    * Prompts per : Data scadenza minima da selezionare         *
      *    *-----------------------------------------------------------*
       pmt-dts-min-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      " - in scadenza         dal :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dts-min-999.
           exit.

      *    *===========================================================*
      *    * Prompts per : Data scadenza massima da selezionare        *
      *    *-----------------------------------------------------------*
       pmt-dts-max-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "al :"               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dts-max-999.
           exit.

      *    *===========================================================*
      *    * Prompts per : Esclusione clienti con solo insoluti        *
      *    *-----------------------------------------------------------*
       pmt-esc-csi-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      " - con selezione insoluti  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-esc-csi-999.
           exit.

      *    *===========================================================*
      *    * Prompts per : Data registrazione insoluti minima          *
      *    *-----------------------------------------------------------*
       pmt-dri-min-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      " - insoluti registrati dal :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dri-min-999.
           exit.

      *    *===========================================================*
      *    * Prompts per : Data registrazione insoluti massima         *
      *    *-----------------------------------------------------------*
       pmt-dri-max-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "al :"               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dri-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Data di riferimento                        *
      *    *-----------------------------------------------------------*
       acc-dat-rif-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione eventuale default              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se data gia' presente : no preparazione *
      *                      *-----------------------------------------*
           if        rr-dat-rif           not  = zero
                     go to acc-dat-rif-100.
      *                      *-----------------------------------------*
      *                      * Estrazione system date and time attuale *
      *                      * da modulo di segreteria                 *
      *                      *-----------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Preparazione data di default            *
      *                      *-----------------------------------------*
           move      s-dat                to   rr-dat-rif             .
       acc-dat-rif-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      spaces               to   v-edm                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      05                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-dat-rif           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-dat-rif-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dat-rif-999.
       acc-dat-rif-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dat-rif             .
       acc-dat-rif-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test che il valore non manchi               *
      *                  *---------------------------------------------*
           if        rr-dat-rif           =    zero
                     go to acc-dat-rif-100.
       acc-dat-rif-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-rif-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dat-rif-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dat-rif-100.
       acc-dat-rif-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Tipo selezione                       *
      *    *-----------------------------------------------------------*
       acc-tip-sel-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-prs-age-snx        not  = "S"
                     move  02             to   rr-tip-sel
                     go to acc-tip-sel-999.
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      rr-tip-sel           to   w-sav-tip-sel          .
       acc-tip-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-sel-lun    to   v-car                  .
           move      w-exp-tip-sel-num    to   v-ldt                  .
           move      "AC#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-tip-sel-tbl    to   v-txt                  .
           move      06                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-tip-sel           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-tip-sel-999.
       acc-tip-sel-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-tip-sel             .
       acc-tip-sel-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore a zero : reimpostazione, a meno   *
      *                  * che non si sia in Up                        *
      *                  *---------------------------------------------*
           if        rr-tip-sel           not  = zero
                     go to acc-tip-sel-600.
           if        v-key                =    "UP  "
                     go to acc-tip-sel-600
           else      go to acc-tip-sel-100.
       acc-tip-sel-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore attuale come precedente : oltre   *
      *                  *---------------------------------------------*
           if        rr-tip-sel           =    w-sav-tip-sel
                     go to acc-tip-sel-800.
      *                  *---------------------------------------------*
      *                  * Se tipo selezione : Per Agente/Cliente      *
      *                  *---------------------------------------------*
           if        rr-tip-sel           =    02
                     go to acc-tip-sel-700.
      *                      *-----------------------------------------*
      *                      * Trattamento cliente                     *
      *                      *-----------------------------------------*
           perform   pmt-cod-cli-000      thru pmt-cod-cli-999        .
           move      zero                 to   rr-cod-cli             .
           move      spaces               to   rr-cod-cli-rag         .
           move      spaces               to   rr-cod-cli-via         .
           move      spaces               to   rr-cod-cli-loc         .
           perform   vis-cod-cli-000      thru vis-cod-cli-999        .
           perform   vis-cod-cli-rag-000  thru vis-cod-cli-rag-999    .
           perform   vis-cod-cli-via-000  thru vis-cod-cli-via-999    .
           perform   vis-cod-cli-loc-000  thru vis-cod-cli-loc-999    .
      *                      *-----------------------------------------*
      *                      * Trattamento dipendenza cliente          *
      *                      *-----------------------------------------*
           perform   pmt-dpz-cli-000      thru pmt-dpz-cli-999        .
           move      spaces               to   rr-dpz-cli             .
           move      spaces               to   rr-dpz-cli-rag         .
           move      spaces               to   rr-dpz-cli-via         .
           move      spaces               to   rr-dpz-cli-loc         .
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *                      *-----------------------------------------*
      *                      * Trattamento agente                      *
      *                      *-----------------------------------------*
           perform   pmt-cod-age-000      thru pmt-cod-age-999        .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     acc-tip-sel-800.
       acc-tip-sel-700.
      *                  *---------------------------------------------*
      *                  * Se tipo selezione : Per Cliente             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Trattamento agente                      *
      *                      *-----------------------------------------*
           perform   pmt-cod-age-000      thru pmt-cod-age-999        .
           move      zero                 to   rr-cod-age             .
           move      spaces               to   rr-cod-age-nom         .
           perform   vis-cod-age-000      thru vis-cod-age-999        .
           perform   vis-cod-age-nom-000  thru vis-cod-age-nom-999    .
      *                      *-----------------------------------------*
      *                      * Trattamento cliente                     *
      *                      *-----------------------------------------*
           perform   pmt-cod-cli-000      thru pmt-cod-cli-999        .
      *                      *-----------------------------------------*
      *                      * Trattamento dipendenza cliente          *
      *                      *-----------------------------------------*
           perform   pmt-dpz-cli-000      thru pmt-dpz-cli-999        .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     acc-tip-sel-800.
       acc-tip-sel-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-tip-sel-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-tip-sel-100.
       acc-tip-sel-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Si/no aggiornamento livelli          *
      *    *-----------------------------------------------------------*
       acc-snx-alv-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione eventuale default              *
      *                  *---------------------------------------------*
           if        rr-snx-alv           =    spaces
                     move  "N"            to   rr-snx-alv             .
       acc-snx-alv-100.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      "Se indicato 'No', non verranno aggiornati i livell
      -              "i di sollecito"     to   v-nt1                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-alv-lun    to   v-car                  .
           move      w-exp-snx-alv-num    to   v-ldt                  .
           move      "SN#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-snx-alv-tbl    to   v-txt                  .
           move      07                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
      *
           if        rr-snx-alv           =    "S"
                     move  01             to   v-num
           else if   rr-snx-alv           =    "N"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
      *
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative                    *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-snx-alv-999.
       acc-snx-alv-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  "S"            to   rr-snx-alv
           else if   v-num                =    02
                     move  "N"            to   rr-snx-alv
           else      move  spaces         to   rr-snx-alv             .
       acc-snx-alv-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-snx-alv-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-snx-alv-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-snx-alv-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-snx-alv-100.
       acc-snx-alv-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice agente                        *
      *    *-----------------------------------------------------------*
       acc-cod-age-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        rr-tip-sel           not  = 01
                     go to acc-cod-age-999.
       acc-cod-age-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-age-ope      .
           move      rr-cod-age           to   w-cod-mne-age-cod      .
           move      09                   to   w-cod-mne-age-lin      .
           move      30                   to   w-cod-mne-age-pos      .
           move      09                   to   w-cod-mne-age-nln      .
           move      41                   to   w-cod-mne-age-nps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   cod-mne-age-cll-000  thru cod-mne-age-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-age-foi-000  thru cod-mne-age-foi-999    .
       acc-cod-age-110.
           perform   cod-mne-age-cll-000  thru cod-mne-age-cll-999    .
           if        w-cod-mne-age-ope    =    "F+"
                     go to acc-cod-age-115.
           if        w-cod-mne-age-ope    =    "AC"
                     go to acc-cod-age-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-age-115.
           perform   cod-mne-age-foi-000  thru cod-mne-age-foi-999    .
           go to     acc-cod-age-110.
       acc-cod-age-120.
           move      w-cod-mne-age-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-cod-age-999.
       acc-cod-age-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-cod-age             .
       acc-cod-age-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [age]                      *
      *                  *---------------------------------------------*
           move      rr-cod-age           to   w-let-arc-age-cod      .
           perform   let-arc-age-000      thru let-arc-age-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione dati agente                  *
      *                  *---------------------------------------------*
           if        rr-cod-age           =    zero
                     move  "Tutti"        to   rr-cod-age-nom
           else      move  w-let-arc-age-nom
                                          to   rr-cod-age-nom         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati agente                 *
      *                  *---------------------------------------------*
           perform   vis-cod-age-nom-000  thru vis-cod-age-nom-999    .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-age-flg    not  = spaces
                     go to acc-cod-age-100.
       acc-cod-age-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-age-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-cod-age-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-cod-age-100.
       acc-cod-age-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice agente                           *
      *    *-----------------------------------------------------------*
       vis-cod-age-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "B"                  to   v-edm                  .
           move      09                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-cod-age           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-age-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice agente, nominativo               *
      *    *-----------------------------------------------------------*
       vis-cod-age-nom-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-cod-age-nom       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-age-nom-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice cliente                       *
      *    *-----------------------------------------------------------*
       acc-cod-cli-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        rr-tip-sel           not  = 02
                     go to acc-cod-cli-999.
       acc-cod-cli-100.
      *              *-------------------------------------------------*
      *              * Salvataggio valore precedente                   *
      *              *-------------------------------------------------*
           move      rr-cod-cli           to   w-sav-cod-cli          .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-dcc-ope      .
           move      rr-cod-cli           to   w-cod-mne-dcc-cod      .
           move      09                   to   w-cod-mne-dcc-lin      .
           move      30                   to   w-cod-mne-dcc-pos      .
           move      09                   to   w-cod-mne-dcc-rln      .
           move      41                   to   w-cod-mne-dcc-rps      .
           move      10                   to   w-cod-mne-dcc-vln      .
           move      41                   to   w-cod-mne-dcc-vps      .
           move      11                   to   w-cod-mne-dcc-lln      .
           move      41                   to   w-cod-mne-dcc-lps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
       acc-cod-cli-110.
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           if        w-cod-mne-dcc-ope    =    "F+"
                     go to acc-cod-cli-115.
           if        w-cod-mne-dcc-ope    =    "AC"
                     go to acc-cod-cli-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-cli-115.
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
           go to     acc-cod-cli-110.
       acc-cod-cli-120.
           move      w-cod-mne-dcc-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-cod-cli-999.
       acc-cod-cli-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-cod-cli             .
       acc-cod-cli-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-cli-410.
      *                  *---------------------------------------------*
      *                  * Lettura file [cli]                          *
      *                  *---------------------------------------------*
           move      rr-cod-cli           to   w-let-arc-cli-cod      .
           perform   let-arc-cli-000      thru let-arc-cli-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione ragione sociale, indirizzo,  *
      *                  * localita', e sottoconto associato da ana-   *
      *                  * grafica contabile                           *
      *                  *---------------------------------------------*
           move      w-let-arc-cli-rag    to   rr-cod-cli-rag         .
           move      w-let-arc-cli-via    to   rr-cod-cli-via         .
           move      w-let-arc-cli-loc    to   rr-cod-cli-loc         .
       acc-cod-cli-420.
      *                  *---------------------------------------------*
      *                  * Visualizzazione ragione sociale da anagra-  *
      *                  * fica contabile                              *
      *                  *---------------------------------------------*
           perform   vis-cod-cli-rag-000  thru vis-cod-cli-rag-999    .
           perform   vis-cod-cli-via-000  thru vis-cod-cli-via-999    .
           perform   vis-cod-cli-loc-000  thru vis-cod-cli-loc-999    .
       acc-cod-cli-430.
      *                  *---------------------------------------------*
      *                  * Se cliente non esistente                    *
      *                  *---------------------------------------------*
           if        w-let-arc-cli-flg    =    spaces
                     go to acc-cod-cli-440.
       acc-cod-cli-432.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione di-   *
      *                      * pendenza del cliente                    *
      *                      *-----------------------------------------*
           if        rr-dpz-cli           =    spaces and
                     rr-dpz-cli-rag       =    spaces and
                     rr-dpz-cli-via       =    spaces and
                     rr-dpz-cli-loc       =    spaces
                     go to acc-cod-cli-434.
           move      spaces               to   rr-dpz-cli             .
           move      spaces               to   rr-dpz-cli-rag         .
           move      spaces               to   rr-dpz-cli-via         .
           move      spaces               to   rr-dpz-cli-loc         .
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
       acc-cod-cli-434.
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-cod-cli-100.
       acc-cod-cli-440.
      *                  *---------------------------------------------*
      *                  * Se codice a zero                            *
      *                  *---------------------------------------------*
           if        rr-cod-cli           not  = zero
                     go to acc-cod-cli-450.
       acc-cod-cli-442.
      *                      *-----------------------------------------*
      *                      * Forzatura valore 'Tutti' nella ragione  *
      *                      * sociale del cliente                     *
      *                      *-----------------------------------------*
           move      "Tutti"              to   rr-cod-cli-rag         .
           move      spaces               to   rr-cod-cli-via         .
           move      spaces               to   rr-cod-cli-loc         .
           perform   vis-cod-cli-rag-000  thru vis-cod-cli-rag-999    .
           perform   vis-cod-cli-via-000  thru vis-cod-cli-via-999    .
           perform   vis-cod-cli-loc-000  thru vis-cod-cli-loc-999    .
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione di-   *
      *                      * pendenza del cliente                    *
      *                      *-----------------------------------------*
           if        rr-dpz-cli           =    spaces and
                     rr-dpz-cli-rag       =    spaces and
                     rr-dpz-cli-via       =    spaces and
                     rr-dpz-cli-loc       =    spaces
                     go to acc-cod-cli-444.
           move      spaces               to   rr-dpz-cli             .
           move      spaces               to   rr-dpz-cli-rag         .
           move      spaces               to   rr-dpz-cli-via         .
           move      spaces               to   rr-dpz-cli-loc         .
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
       acc-cod-cli-444.
      *                      *-----------------------------------------*
      *                      * A dipendenze dall'impostazione          *
      *                      *-----------------------------------------*
           go to     acc-cod-cli-600.
       acc-cod-cli-450.
      *                  *---------------------------------------------*
      *                  * Se codice diverso da zero                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del confronto con  *
      *                      * il valore precedente                    *
      *                      *-----------------------------------------*
           if        rr-cod-cli           =    w-sav-cod-cli
                     go to acc-cod-cli-455
           else      go to acc-cod-cli-480.
       acc-cod-cli-455.
      *                      *-----------------------------------------*
      *                      * Se valore impostato pari al valore pre- *
      *                      * cedente                                 *
      *                      *-----------------------------------------*
       acc-cod-cli-457.
      *                          *-------------------------------------*
      *                          * Lettura anagrafica commerciale del  *
      *                          * cliente principale                  *
      *                          *-------------------------------------*
           move      "C"                  to   w-let-arc-dcc-tle      .
           move      rr-cod-cli           to   w-let-arc-dcc-cod      .
           move      spaces               to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                          *-------------------------------------*
      *                          * Deviazione a seconda dell'esito     *
      *                          * della lettura                       *
      *                          *-------------------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-cod-cli-467.
       acc-cod-cli-459.
      *                          *-------------------------------------*
      *                          * Se anagrafica commerciale del cli-  *
      *                          * ente principale non esistente       *
      *                          *-------------------------------------*
       acc-cod-cli-461.
      *                              *---------------------------------*
      *                              * Normalizzazione e visualizza-   *
      *                              * zione dei dati relativi alla    *
      *                              * dipendenza                      *
      *                              *---------------------------------*
           if        rr-dpz-cli           =    spaces and
                     rr-dpz-cli-rag       =    spaces and
                     rr-dpz-cli-via       =    spaces and
                     rr-dpz-cli-loc       =    spaces
                     go to acc-cod-cli-463.
           move      spaces               to   rr-dpz-cli             .
           move      spaces               to   rr-dpz-cli-rag         .
           move      spaces               to   rr-dpz-cli-via         .
           move      spaces               to   rr-dpz-cli-loc         .
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
       acc-cod-cli-463.
      *                              *---------------------------------*
      *                              * Messaggio di errore             *
      *                              *---------------------------------*
           move      "Manca l'anagrafica commerciale per il cliente     
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
       acc-cod-cli-465.
      *                              *---------------------------------*
      *                              * A reimpostazione                *
      *                              *---------------------------------*
           go to     acc-cod-cli-100.
       acc-cod-cli-467.
      *                          *-------------------------------------*
      *                          * Se anagrafica commerciale del cli-  *
      *                          * ente principale esistente           *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Memorizzazione valori letti da  *
      *                              * anagrafica commerciale cliente  *
      *                              * principale in dati per la di-   *
      *                              * pendenza                        *
      *                              *---------------------------------*
           move      w-let-arc-dcc-rag    to   rr-dpz-cli-rag         .
           move      w-let-arc-dcc-via    to   rr-dpz-cli-via         .
           move      w-let-arc-dcc-loc    to   rr-dpz-cli-loc         .
      *                              *---------------------------------*
      *                              * Deviazione a seconda se il co-  *
      *                              * dice dipendenza e' a spaces op- *
      *                              * pure diverso da spaces          *
      *                              *---------------------------------*
           if        rr-dpz-cli           =    spaces
                     go to acc-cod-cli-469
           else      go to acc-cod-cli-471.
       acc-cod-cli-469.
      *                              *---------------------------------*
      *                              * Se codice dipendenza a spaces   *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Visualizzazione valori re-  *
      *                                  * lativi alla dipendenza      *
      *                                  *-----------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *                                  *-----------------------------*
      *                                  * A dipendenze dall'imposta-  *
      *                                  * zione                       *
      *                                  *-----------------------------*
           go to     acc-cod-cli-600.
       acc-cod-cli-471.
      *                              *---------------------------------*
      *                              * Se codice dipendenza diverso da *
      *                              * spaces                          *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Lettura anagrafica commer-  *
      *                                  * ciale della dipendenza      *
      *                                  *-----------------------------*
           move      "D"                  to   w-let-arc-dcc-tle      .
           move      rr-cod-cli           to   w-let-arc-dcc-cod      .
           move      rr-dpz-cli           to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                                  *-----------------------------*
      *                                  * Deviazione a seconda del-   *
      *                                  * l'esito della lettura       *
      *                                  *-----------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-cod-cli-473
           else      go to acc-cod-cli-475.
       acc-cod-cli-473.
      *                                  *-----------------------------*
      *                                  * Se anagrafica commerciale   *
      *                                  * della dipendenza esistente  *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Memorizzazione valori   *
      *                                      * letti da anagrafica     *
      *                                      * commerciale della di-   *
      *                                      * pendenza                *
      *                                      *-------------------------*
           move      w-let-arc-dcc-rag    to   rr-dpz-cli-rag         .
           move      w-let-arc-dcc-via    to   rr-dpz-cli-via         .
           move      w-let-arc-dcc-loc    to   rr-dpz-cli-loc         .
      *                                      *-------------------------*
      *                                      * Visualizzazione valori  *
      *                                      * relativi alla dipenden- *
      *                                      * za                      *
      *                                      *-------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *                                      *-------------------------*
      *                                      * A dipendenze dall'impo- *
      *                                      * stazione                *
      *                                      *-------------------------*
           go to     acc-cod-cli-600.
       acc-cod-cli-475.
      *                                  *-----------------------------*
      *                                  * Se anagrafica commerciale   *
      *                                  * della dipendenza non esi-   *
      *                                  * stente                      *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Memorizzazione valori   *
      *                                      * letti da anagrafica     *
      *                                      * commerciale della di-   *
      *                                      * pendenza                *
      *                                      *-------------------------*
           move      w-let-arc-dcc-rag    to   rr-dpz-cli-rag         .
           move      w-let-arc-dcc-via    to   rr-dpz-cli-via         .
           move      w-let-arc-dcc-loc    to   rr-dpz-cli-loc         .
      *                                      *-------------------------*
      *                                      * Visualizzazione valori  *
      *                                      * relativi alla dipenden- *
      *                                      * za                      *
      *                                      *-------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *                                      *-------------------------*
      *                                      * Messaggio di errore     *
      *                                      *-------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Manca l'anagrafica commerciale per la dipendenza "
                                delimited by   size
                     "'"        delimited by   size
                     rr-dpz-cli       
                                delimited by spaces
                     "'"        delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                                      *-------------------------*
      *                                      * A reimpostazione        *
      *                                      *-------------------------*
           go to     acc-cod-cli-100.
       acc-cod-cli-480.
      *                      *-----------------------------------------*
      *                      * Se valore impostato diverso dal valore  *
      *                      * precedente                              *
      *                      *-----------------------------------------*
       acc-cod-cli-482.
      *                              *---------------------------------*
      *                              * Normalizzazione e visualizza-   *
      *                              * zione dei dati relativi alla    *
      *                              * dipendenza                      *
      *                              *---------------------------------*
           if        rr-dpz-cli           =    spaces and
                     rr-dpz-cli-rag       =    spaces and
                     rr-dpz-cli-via       =    spaces and
                     rr-dpz-cli-loc       =    spaces
                     go to acc-cod-cli-484.
           move      spaces               to   rr-dpz-cli             .
           move      spaces               to   rr-dpz-cli-rag         .
           move      spaces               to   rr-dpz-cli-via         .
           move      spaces               to   rr-dpz-cli-loc         .
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
       acc-cod-cli-484.
      *                              *---------------------------------*
      *                              * Riaggancio                      *
      *                              *---------------------------------*
           go to     acc-cod-cli-457.
       acc-cod-cli-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-cli-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-cod-cli-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-cod-cli-100.
       acc-cod-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice cliente                          *
      *    *-----------------------------------------------------------*
       vis-cod-cli-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      09                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-cod-cli           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice cliente, ragione sociale         *
      *    *-----------------------------------------------------------*
       vis-cod-cli-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-cod-cli-rag       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cli-rag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice cliente, indirizzo               *
      *    *-----------------------------------------------------------*
       vis-cod-cli-via-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-cod-cli-via       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cli-via-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice cliente, localita'               *
      *    *-----------------------------------------------------------*
       vis-cod-cli-loc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-cod-cli-loc       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cli-loc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice dipendenza cliente            *
      *    *-----------------------------------------------------------*
       acc-dpz-cli-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        rr-tip-sel           not  = 02
                     go to acc-dpz-cli-999.
           if        rr-cod-cli           =    zero
                     go to acc-dpz-cli-999.
      *                  *---------------------------------------------*
      *                  * Preparazione valore di default              *
      *                  *---------------------------------------------*
           if        rr-dpz-cli           not  = spaces
                     go to acc-dpz-cli-100.
      *                      *-----------------------------------------*
      *                      * Preparazione                            *
      *                      *-----------------------------------------*
           move      "*   "               to   rr-dpz-cli             .
      *                      *-----------------------------------------*
      *                      * Lettura record [dcc] della dipendenza   *
      *                      *-----------------------------------------*
           move      "D"                  to   w-let-arc-dcc-tle      .
           move      rr-cod-cli           to   w-let-arc-dcc-cod      .
           move      rr-dpz-cli           to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori letti da anagra-  *
      *                      * fica commerciale della dipendenza in    *
      *                      * dati per la dipendenza                  *
      *                      *-----------------------------------------*
           move      w-let-arc-dcc-rag    to   rr-dpz-cli-rag         .
           move      w-let-arc-dcc-via    to   rr-dpz-cli-via         .
           move      w-let-arc-dcc-loc    to   rr-dpz-cli-loc         .
      *                      *-----------------------------------------*
      *                      * Visualizzazione valori relativi alla    *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
       acc-dpz-cli-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "A*"                 to   w-cod-cod-dcc-ope      .
           move      rr-cod-cli           to   w-cod-cod-dcc-cli      .
           move      rr-dpz-cli           to   w-cod-cod-dcc-cod      .
           move      13                   to   w-cod-cod-dcc-lin      .
           move      30                   to   w-cod-cod-dcc-pos      .
           move      13                   to   w-cod-cod-dcc-rln      .
           move      41                   to   w-cod-cod-dcc-rps      .
           move      14                   to   w-cod-cod-dcc-vln      .
           move      41                   to   w-cod-cod-dcc-vps      .
           move      15                   to   w-cod-cod-dcc-lln      .
           move      41                   to   w-cod-cod-dcc-lps      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dcc-cll-000  thru cod-cod-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcc-foi-000  thru cod-cod-dcc-foi-999    .
       acc-dpz-cli-110.
           perform   cod-cod-dcc-cll-000  thru cod-cod-dcc-cll-999    .
           if        w-cod-cod-dcc-ope    =    "F+"
                     go to acc-dpz-cli-115.
           if        w-cod-cod-dcc-ope    =    "AC"
                     go to acc-dpz-cli-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-dpz-cli-115.
           perform   cod-cod-dcc-foi-000  thru cod-cod-dcc-foi-999    .
           go to     acc-dpz-cli-110.
       acc-dpz-cli-120.
           move      w-cod-cod-dcc-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dpz-cli-999.
       acc-dpz-cli-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-dpz-cli             .
       acc-dpz-cli-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dpz-cli-410.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se codice sipendenza   *
      *                  * a spaces oppure no                          *
      *                  *---------------------------------------------*
           if        rr-dpz-cli           =    spaces
                     go to acc-dpz-cli-420
           else      go to acc-dpz-cli-440.
       acc-dpz-cli-420.
      *                  *---------------------------------------------*
      *                  * Se codice dipendenza a spaces               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica commerciale del cli- *
      *                      * ente principale                         *
      *                      *-----------------------------------------*
           move      "C"                  to   w-let-arc-dcc-tle      .
           move      rr-cod-cli           to   w-let-arc-dcc-cod      .
           move      spaces               to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori letti da anagra-  *
      *                      * fica commerciale cliente principale in  *
      *                      * dati per la dipendenza                  *
      *                      *-----------------------------------------*
           move      w-let-arc-dcc-rag    to   rr-dpz-cli-rag         .
           move      w-let-arc-dcc-via    to   rr-dpz-cli-via         .
           move      w-let-arc-dcc-loc    to   rr-dpz-cli-loc         .
      *                      *-----------------------------------------*
      *                      * Visualizzazione valori relativi alla    *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda dell'esito della   *
      *                      * lettura                                 *
      *                      *-----------------------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-dpz-cli-425
           else      go to acc-dpz-cli-430.
       acc-dpz-cli-425.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale del cliente   *
      *                      * principale esistente                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * A dipendenze dall'impostazione      *
      *                          *-------------------------------------*
           go to     acc-dpz-cli-600.
       acc-dpz-cli-430.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale del cliente   *
      *                      * principale non esistente                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "Manca l'anagrafica commerciale per il cliente     
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                          *-------------------------------------*
      *                          * A reimpostazione                    *
      *                          *-------------------------------------*
           go to     acc-dpz-cli-100.
       acc-dpz-cli-440.
      *                  *---------------------------------------------*
      *                  * Se codice dipendenza diverso da spaces      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica commerciale per la   *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           move      "D"                  to   w-let-arc-dcc-tle      .
           move      rr-cod-cli           to   w-let-arc-dcc-cod      .
           move      rr-dpz-cli           to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori letti da anagra-  *
      *                      * fica commerciale della dipendenza in    *
      *                      * dati per la dipendenza                  *
      *                      *-----------------------------------------*
           move      w-let-arc-dcc-rag    to   rr-dpz-cli-rag         .
           move      w-let-arc-dcc-via    to   rr-dpz-cli-via         .
           move      w-let-arc-dcc-loc    to   rr-dpz-cli-loc         .
      *                      *-----------------------------------------*
      *                      * Visualizzazione valori relativi alla    *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda dell'esito della   *
      *                      * lettura                                 *
      *                      *-----------------------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-dpz-cli-445
           else      go to acc-dpz-cli-450.
       acc-dpz-cli-445.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale della dipen-  *
      *                      * denza esistente                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * A dipendenze dall'impostazione      *
      *                          *-------------------------------------*
           go to     acc-dpz-cli-600.
       acc-dpz-cli-450.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale della dipen-  *
      *                      * denza non esistente                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Manca l'anagrafica commerciale per la dipendenza "
                                delimited by   size
                     "'"        delimited by   size
                     rr-dpz-cli       
                                delimited by spaces
                     "'"        delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                          *-------------------------------------*
      *                          * A reimpostazione                    *
      *                          *-------------------------------------*
           go to     acc-dpz-cli-100.
       acc-dpz-cli-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dpz-cli-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dpz-cli-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dpz-cli-100.
       acc-dpz-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza del cliente           *
      *    *-----------------------------------------------------------*
       vis-dpz-cli-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-dpz-cli           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza cliente, ragione so-  *
      *    *                   ciale                                   *
      *    *-----------------------------------------------------------*
       vis-dpz-cli-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-dpz-cli-rag       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-cli-rag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza cliente, indirizzo    *
      *    *-----------------------------------------------------------*
       vis-dpz-cli-via-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-dpz-cli-via       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-cli-via-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza cliente, localita'    *
      *    *-----------------------------------------------------------*
       vis-dpz-cli-loc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-dpz-cli-loc       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-cli-loc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Si/no situazioni debitorie           *
      *    *-----------------------------------------------------------*
       acc-snx-deb-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-snx-deb-100.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      "Selezione su situazioni di clienti con saldo di po
      -              "rtafoglio negativo" to   v-nt1                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-deb-lun    to   v-car                  .
           move      w-exp-snx-deb-num    to   v-ldt                  .
           move      "SN#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-snx-deb-tbl    to   v-txt                  .
           move      17                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-snx-deb           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative                    *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-snx-deb-999.
       acc-snx-deb-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-snx-deb             .
       acc-snx-deb-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore a spaces : reimpostazione, a meno *
      *                  * che non si sia in Up                        *
      *                  *---------------------------------------------*
           if        rr-snx-deb           not  = zero
                     go to acc-snx-deb-600.
           if        v-key                =    "UP  "
                     go to acc-snx-deb-600
           else      go to acc-snx-deb-100.
       acc-snx-deb-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-snx-deb-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-snx-deb-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-snx-deb-100.
       acc-snx-deb-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Data scadenza minima da selezionare        *
      *    *-----------------------------------------------------------*
       acc-dts-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dts-min-100.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      "Selezione su clienti con scadenze nel periodo even
      -              "tualmente scelto"   to   v-nt1                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      ">"                  to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      18                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-dts-min           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative                    *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-dts-min-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dts-min-999.
       acc-dts-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dts-min             .
       acc-dts-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dts-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dts-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dts-min-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dts-min-100.
       acc-dts-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Data scadenza massima da selezionare       *
      *    *-----------------------------------------------------------*
       acc-dts-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dts-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      ">"                  to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      18                   to   v-lin                  .
           move      46                   to   v-pos                  .
           move      rr-dts-max           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-dts-max-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dts-max-999.
       acc-dts-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dts-max             .
       acc-dts-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dts-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dts-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dts-max-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dts-max-100.
       acc-dts-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Esclusione clienti con solo insoluti *
      *    *-----------------------------------------------------------*
       acc-esc-csi-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-esc-csi-100.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      "Selezione su clienti con insoluti"
                                          to   v-nt1                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-esc-csi-lun    to   v-car                  .
           move      w-exp-esc-csi-num    to   v-ldt                  .
           move      "NES#"               to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-esc-csi-tbl    to   v-txt                  .
           move      19                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-esc-csi           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative                    *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-esc-csi-999.
       acc-esc-csi-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-esc-csi             .
       acc-esc-csi-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore a spaces : reimpostazione, a meno *
      *                  * che non si sia in Up                        *
      *                  *---------------------------------------------*
           if        rr-esc-csi           not  = zero
                     go to acc-esc-csi-600.
           if        v-key                =    "UP  "
                     go to acc-esc-csi-600
           else      go to acc-esc-csi-100.
       acc-esc-csi-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-esc-csi-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-esc-csi-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-esc-csi-100.
       acc-esc-csi-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Data registrazione insoluto minima         *
      *    *-----------------------------------------------------------*
       acc-dri-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dri-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      20                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-dri-min           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-dri-min-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dri-min-999.
       acc-dri-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dri-min             .
       acc-dri-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dri-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dri-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dri-min-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dri-min-100.
       acc-dri-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Data registrazione insoluto massima        *
      *    *-----------------------------------------------------------*
       acc-dri-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dri-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      20                   to   v-lin                  .
           move      46                   to   v-pos                  .
           move      rr-dri-max           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-dri-max-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dri-max-999.
       acc-dri-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dri-max             .
       acc-dri-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dri-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dri-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dri-max-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dri-max-100.
       acc-dri-max-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
           move      zero                 to   rr-dat-rif             .
           move      zero                 to   rr-tip-sel             .
           move      spaces               to   rr-snx-alv             .
           move      zero                 to   rr-cod-age             .
           move      spaces               to   rr-cod-age-nom         .
           move      zero                 to   rr-cod-cli             .
           move      spaces               to   rr-cod-cli-rag         .
           move      spaces               to   rr-cod-cli-via         .
           move      spaces               to   rr-cod-cli-loc         .
           move      spaces               to   rr-dpz-cli             .
           move      spaces               to   rr-dpz-cli-rag         .
           move      spaces               to   rr-dpz-cli-via         .
           move      spaces               to   rr-dpz-cli-loc         .
           move      zero                 to   rr-snx-deb             .
           move      zero                 to   rr-dts-min             .
           move      zero                 to   rr-dts-max             .
           move      zero                 to   rr-esc-csi             .
           move      zero                 to   rr-dri-min             .
           move      zero                 to   rr-dri-max             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Controllo su data scadenza min e max            *
      *              *-------------------------------------------------*
           if        rr-dts-min           =    zero or
                     rr-dts-max           =    zero
                     go to tdo-ric-sel-200.
           if        rr-dts-max           not  < rr-dts-min
                     go to tdo-ric-sel-200.
           move      "Data scadenza massima inferiore a quella minima ! 
      -              "               "    to   w-err-box-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Controllo su registrazione insoluti min e max   *
      *              *-------------------------------------------------*
           if        rr-dri-min           =    zero or
                     rr-dri-max           =    zero
                     go to tdo-ric-sel-800.
           if        rr-dri-max           not  < rr-dri-min
                     go to tdo-ric-sel-800.
           move      "Data registrazione insoluti massima inferiore a qu
      -              "ella minima !  "    to   w-err-box-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-800.
      *              *-------------------------------------------------*
      *              * Fine controlli                                  *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Uscita per controlli non superati               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di errore                              *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Si/no aggiornamento livelli                     *
      *              *-------------------------------------------------*
           if        rr-snx-alv           not  = "N"
                     move  "S"            to   rr-snx-alv             .
      *              *-------------------------------------------------*
      *              * Si/no situazioni debitorie                      *
      *              *-------------------------------------------------*
           if        rr-snx-deb           not  = 02
                     move  01             to   rr-snx-deb             .
      *              *-------------------------------------------------*
      *              * Esclusione clienti con solo insoluti            *
      *              *-------------------------------------------------*
           if        rr-esc-csi           not  = 02 and
                     rr-esc-csi           not  = 03
                     move  01             to   rr-esc-csi             .
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su tre righe          *
      *    *-----------------------------------------------------------*
       box-msg-e03-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      10                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 03                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m03    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e03-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Cancellazione preventiva files di appoggio      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione preventiva file [sct]         *
      *                  *---------------------------------------------*
           move      "DF"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sct                 .
      *                  *---------------------------------------------*
      *                  * Cancellazione preventiva file [scr]         *
      *                  *---------------------------------------------*
           move      "DF"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofscr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-scr                 .
       prn-opn-fls-100.
      *              *-------------------------------------------------*
      *              * [sct]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sct                 .
      *              *-------------------------------------------------*
      *              * [scr]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofscr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-scr                 .
      *              *-------------------------------------------------*
      *              * [sdb]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *              *-------------------------------------------------*
      *              * [ddp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofddp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ddp                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [ccc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofccc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ccc                 .
      *              *-------------------------------------------------*
      *              * [age]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *              *-------------------------------------------------*
      *              * [lotslc]                                        *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/num/ioc/obj/inlotslc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-lot-slc             .
      *              *-------------------------------------------------*
      *              * [kk0]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiesta di un pathname unico alla segre-  *
      *                  * teria                                       *
      *                  *---------------------------------------------*
           move      "UP"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-pat                to   f-kk0-pat              .
      *                  *---------------------------------------------*
      *                  * Open file                                   *
      *                  *---------------------------------------------*
           open      i-o    kk0                                       .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [sct]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sct                 .
      *              *-------------------------------------------------*
      *              * [scr]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofscr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-scr                 .
      *              *-------------------------------------------------*
      *              * [sdb]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *              *-------------------------------------------------*
      *              * [ddp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofddp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ddp                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [ccc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofccc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ccc                 .
      *              *-------------------------------------------------*
      *              * [age]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *              *-------------------------------------------------*
      *              * [lotslc]                                        *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/num/ioc/obj/inlotslc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-lot-slc             .
      *              *-------------------------------------------------*
      *              * [kk0]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close file                                  *
      *                  *---------------------------------------------*
           close     kk0                                              .
      *                  *---------------------------------------------*
      *                  * Richiesta di delete di un pathname alla se- *
      *                  * greteria                                    *
      *                  *---------------------------------------------*
           move      "PD"                 to   s-ope                  .
           move      f-kk0-pat            to   s-pat                  .
           move      "K"                  to   s-sts                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : Si'                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort                                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   prn-rou-pri-000
                                          thru prn-rou-pri-999        .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Test se esecuzione batch                        *
      *              *-------------------------------------------------*
           if        rr-snx-btc           not  = "S"
                     go to stp-srt-inp-010.
      *              *-------------------------------------------------*
      *              * Forzature                                       *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   rr-dat-rif             .
           move      02                   to   rr-tip-sel             .
           move      "N"                  to   rr-snx-alv             .
           move      zero                 to   rr-cod-age             .
           move      spaces               to   rr-cod-age-nom         .
           move      zero                 to   rr-cod-cli             .
           move      spaces               to   rr-cod-cli-rag         .
           move      spaces               to   rr-cod-cli-via         .
           move      spaces               to   rr-cod-cli-loc         .
           move      spaces               to   rr-dpz-cli             .
           move      spaces               to   rr-dpz-cli-rag         .
           move      spaces               to   rr-dpz-cli-via         .
           move      spaces               to   rr-dpz-cli-loc         .
           move      zero                 to   rr-snx-deb             .
           move      zero                 to   rr-dts-min             .
           move      zero                 to   rr-dts-max             .
           move      01                   to   rr-esc-csi             .
           move      zero                 to   rr-dri-min             .
           move      zero                 to   rr-dri-max             .
       stp-srt-inp-010.
      *              *-------------------------------------------------*
      *              * Inizializzazione contatore elementi nel buffer  *
      *              * clienti da stampare                             *
      *              *-------------------------------------------------*
           move      zero                 to   w-bcs-num-ele          .
      *              *-------------------------------------------------*
      *              * Start su file [sdb]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo selezione   *
      *                  *---------------------------------------------*
           if        rr-tip-sel           =    01
                     go to stp-srt-inp-020
           else if   rr-tip-sel           =    02
                     go to stp-srt-inp-040.
       stp-srt-inp-020.
      *                  *---------------------------------------------*
      *                  * Tipo selezione : Per Agente/Cliente         *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "GT"                 to   f-cfr                  .
           move      "DATCHS    "         to   f-key                  .
           move      rr-dat-rif           to   rf-sdb-dat-chs         .
           move      zero                 to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
           go to     stp-srt-inp-080.
       stp-srt-inp-040.
      *                  *---------------------------------------------*
      *                  * Tipo selezione : Per Cliente                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda che sia stato ri-  *
      *                      * chiesto un cliente o tutti              *
      *                      *-----------------------------------------*
           if        rr-cod-cli           not  = zero
                     go to stp-srt-inp-042
           else      go to stp-srt-inp-044.
       stp-srt-inp-042.
      *                      *-----------------------------------------*
      *                      * Se richiesto un solo cliente            *
      *                      *-----------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "DBTDTS    "         to   f-key                  .
           move      01                   to   rf-sdb-tip-dbt         .
           move      rr-cod-cli           to   rf-sdb-cod-dbt         .
           move      zero                 to   rf-sdb-dts-sdb         .
           move      zero                 to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
           go to     stp-srt-inp-080.
       stp-srt-inp-044.
      *                      *-----------------------------------------*
      *                      * Se richiesto per tutti i clienti        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Stessa Start che per agente         *
      *                          *-------------------------------------*
           go to     stp-srt-inp-020.
       stp-srt-inp-080.
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-800.
       stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale record [sdb]                *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-800.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo selezione   *
      *                  *---------------------------------------------*
           if        rr-tip-sel           =    01
                     go to stp-srt-inp-120
           else if   rr-tip-sel           =    02
                     go to stp-srt-inp-140.
       stp-srt-inp-120.
      *                  *---------------------------------------------*
      *                  * Tipo selezione : Per Agente/Cliente         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nessun test                             *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-200.
       stp-srt-inp-140.
      *                  *---------------------------------------------*
      *                  * Tipo selezione : Per Cliente                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda che sia stato ri-  *
      *                      * chiesto un cliente o tutti              *
      *                      *-----------------------------------------*
           if        rr-cod-cli           not  = zero
                     go to stp-srt-inp-142
           else      go to stp-srt-inp-144.
       stp-srt-inp-142.
      *                      *-----------------------------------------*
      *                      * Se richiesto un solo cliente            *
      *                      *-----------------------------------------*
           if        rf-sdb-tip-dbt       not  = 01 or
                     rf-sdb-cod-dbt       not  = rr-cod-cli
                     go to stp-srt-inp-800.
       stp-srt-inp-144.
      *                      *-----------------------------------------*
      *                      * Se richiesto per tutti i clienti        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Nessun test                         *
      *                          *-------------------------------------*
           go to     stp-srt-inp-200.
       stp-srt-inp-200.
      *              *-------------------------------------------------*
      *              * Selezioni sul record                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcc]                      *
      *                  *---------------------------------------------*
           if        rf-sdb-dpz-dbt       =    spaces
                     move  "C"            to   w-let-arc-dcc-tle
           else      move  "D"            to   w-let-arc-dcc-tle      .
           move      rf-sdb-cod-dbt       to   w-let-arc-dcc-cod      .
           move      rf-sdb-dpz-dbt       to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo selezione   *
      *                  *---------------------------------------------*
           if        rr-tip-sel           =    01
                     go to stp-srt-inp-220
           else if   rr-tip-sel           =    02
                     go to stp-srt-inp-240.
       stp-srt-inp-220.
      *                  *---------------------------------------------*
      *                  * Tipo selezione : Per Agente/Cliente         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se da effettuare                   *
      *                      *-----------------------------------------*
           if        rr-cod-age           =    zero
                     go to stp-srt-inp-300.
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        w-let-arc-dcc-age    not  = rr-cod-age
                     go to stp-srt-inp-100.
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-300.
       stp-srt-inp-240.
      *                  *---------------------------------------------*
      *                  * Tipo selezione : Per Cliente                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se da effettuare                   *
      *                      *-----------------------------------------*
           if        rr-cod-cli           =    zero
                     go to stp-srt-inp-300.
      *                      *-----------------------------------------*
      *                      * Test su codice cliente                  *
      *                      *-----------------------------------------*
           if        rf-sdb-cod-dbt       not  = rr-cod-cli
                     go to stp-srt-inp-100.
      *                      *-----------------------------------------*
      *                      * Test su dipendenza del cliente          *
      *                      *-----------------------------------------*
           if        rr-dpz-cli           =    "*   "
                     go to stp-srt-inp-300.
           if        rf-sdb-dpz-dbt       not  = rr-dpz-cli
                     go to stp-srt-inp-100.
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-300.
       stp-srt-inp-300.
      *                  *---------------------------------------------*
      *                  * Selezioni su anagrafica controllo crediti   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura record [ccc]                    *
      *                      *-----------------------------------------*
           move      rf-sdb-cod-dbt       to   w-let-arc-ccc-cod      .
           perform   let-arc-ccc-000      thru let-arc-ccc-999        .
      *                      *-----------------------------------------*
      *                      * Test se cliente con sollecito           *
      *                      *-----------------------------------------*
           if        w-let-arc-ccc-ems    =    99
                     go to stp-srt-inp-100.
       stp-srt-inp-350.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [age]                      *
      *                  *---------------------------------------------*
           move      w-let-arc-dcc-age    to   w-let-arc-age-cod      .
           perform   let-arc-age-000      thru let-arc-age-999        .
      *                  *---------------------------------------------*
      *                  * Selezioni su record [sdb]                   *
      *                  *---------------------------------------------*
           perform   sel-rec-sdb-000      thru sel-rec-sdb-999        .
           if        w-sel-rec-sdb-flg    not  = spaces
                     go to stp-srt-inp-100.
       stp-srt-inp-400.
      *              *-------------------------------------------------*
      *              * Aggiornamento buffer clienti da stampare        *
      *              *-------------------------------------------------*
           perform   stp-srt-inp-bcs-000  thru stp-srt-inp-bcs-999    .
       stp-srt-inp-500.
      *              *-------------------------------------------------*
      *              * Composizione record di sort                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiave nr. 1                                *
      *                  *---------------------------------------------*
           move      rf-sdb-cod-dbt       to   srt-cod-cli            .
           move      rf-sdb-inl-sdb       to   srt-inl-sdb            .
           if        rf-sdb-inl-sdb       =    03
                     move  rf-sdb-dpz-dbt to   srt-dpc-key
           else      move  spaces         to   srt-dpc-key            .
      *                  *---------------------------------------------*
      *                  * Chiave nr. 2                                *
      *                  *---------------------------------------------*
           move      w-let-arc-dcc-age    to   srt-cod-age            .
           move      rf-sdb-dat-ddr       to   srt-dat-ddr            .
           move      rf-sdb-num-ddr       to   srt-num-ddr            .
           move      rf-sdb-tip-ddr       to   srt-tip-ddr            .
           move      rf-sdb-dts-sdb       to   srt-dts-sdb            .
      *                  *---------------------------------------------*
      *                  * Dati                                        *
      *                  *---------------------------------------------*
           move      rf-sdb-dpz-dbt       to   srt-dpz-cli            .
           move      w-let-arc-ccc-ems    to   srt-emi-slc            .
           move      w-let-arc-ccc-tts    to   srt-tdt-slc            .
           move      w-let-arc-ccc-ts1    to   srt-tso-l01            .
           move      w-let-arc-ccc-ts2    to   srt-tso-l02            .
           move      w-let-arc-ccc-ts3    to   srt-tso-l03            .
           move      rf-sdb-num-sdb       to   srt-num-sdb            .
           move      rf-sdb-liv-slc       to   srt-liv-slc            .
      *              *-------------------------------------------------*
      *              * Rilascio del record al Sort                     *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
       stp-srt-inp-600.
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale record [sdb]     *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-100.
       stp-srt-inp-800.
      *              *-------------------------------------------------*
      *              * Eventuale ciclo di scansione su saldo cliente   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rr-snx-deb           not  = 02
                     go to stp-srt-inp-900.
      *                  *---------------------------------------------*
      *                  * Scansione saldi cliente                     *
      *                  *---------------------------------------------*
           perform   stp-srt-inp-css-000  thru stp-srt-inp-css-999    .
       stp-srt-inp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-999.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *                                                           *
      *    * Trattamento buffer clienti da stampare                    *
      *    *-----------------------------------------------------------*
       stp-srt-inp-bcs-000.
      *              *-------------------------------------------------*
      *              * Test su data scadenza min e max                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Comodo per selezione                        *
      *                  *---------------------------------------------*
           move      rf-sdb-dts-sdb       to   w-sel-rec-dts-sdb      .
      *                  *---------------------------------------------*
      *                  * Eventuali scadenze a vista                  *
      *                  *---------------------------------------------*
           if        rf-sdb-dts-sdb       =    zero
                     move  rf-sdb-dat-ddr to   w-sel-rec-dts-sdb      .
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rr-dts-min           not  = zero and
                     w-sel-rec-dts-sdb    not  = zero and
                     w-sel-rec-dts-sdb    <    rr-dts-min
                     go to stp-srt-inp-bcs-900.
           if        rr-dts-max           not  = zero and
                     w-sel-rec-dts-sdb    not  = zero and
                     w-sel-rec-dts-sdb    >    rr-dts-max
                     go to stp-srt-inp-bcs-900.
       stp-srt-inp-bcs-100.
      *              *-------------------------------------------------*
      *              * Test su registrazione insoluto min e max        *
      *              *-------------------------------------------------*
           if        rf-sdb-tip-sdb       =    01 or
                     rf-sdb-tip-sdb       =    07 or
                     rf-sdb-tip-sdb       =    08
                     go to stp-srt-inp-bcs-200.
           if        rr-dri-min           not  = zero and
                     w-det-srd-sdb-dro    not  = zero and
                     w-det-srd-sdb-dro    <    rr-dri-min
                     go to stp-srt-inp-bcs-900.
           if        rr-dri-max           not  = zero and
                     w-det-srd-sdb-dro    not  = zero and
                     w-det-srd-sdb-dro    >    rr-dri-max
                     go to stp-srt-inp-bcs-900.
       stp-srt-inp-bcs-200.
      *              *-------------------------------------------------*
      *              * Test su segnale di esclusione                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se nessuna esclusione scadenze              *
      *                  *---------------------------------------------*
           if        rr-esc-csi           =    01
                     go to stp-srt-inp-bcs-600.
      *                  *---------------------------------------------*
      *                  * Se esclusione clienti con solo insoluti     *
      *                  *---------------------------------------------*
           if        rr-esc-csi           not  = 02
                     go to stp-srt-inp-bcs-300.
           if        w-det-srd-sdb-suo    =    "ISP"
                     go to stp-srt-inp-bcs-900
           else      go to stp-srt-inp-bcs-600.
       stp-srt-inp-bcs-300.
      *                  *---------------------------------------------*
      *                  * Se solo clienti con insoluti                *
      *                  *---------------------------------------------*
           if        w-det-srd-sdb-suo    =    "ISP"
                     go to stp-srt-inp-bcs-600
           else      go to stp-srt-inp-bcs-900.
       stp-srt-inp-bcs-600.
      *              *-------------------------------------------------*
      *              * Aggiornamento file di appoggio                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura file di appoggio [kk0]              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Composizione chiave                     *
      *                      *-----------------------------------------*
           move      rf-sdb-cod-dbt       to   kk0-cod-cli            .
           move      rf-sdb-dpz-dbt       to   kk0-dpz-cli            .
      *                      *-----------------------------------------*
      *                      * Lettura                                 *
      *                      *-----------------------------------------*
           read      kk0    key is  kk0-key
                            invalid key
                            go to stp-srt-inp-bcs-800.
       stp-srt-inp-bcs-700.
      *                  *---------------------------------------------*
      *                  * Se record trovato                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-bcs-900.
       stp-srt-inp-bcs-800.
      *                  *---------------------------------------------*
      *                  * Se record non trovato                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione record [kk0]               *
      *                      *-----------------------------------------*
           move      rf-sdb-cod-dbt       to   kk0-cod-cli            .
           move      rf-sdb-dpz-dbt       to   kk0-dpz-cli            .
           move      spaces               to   kk0-flg-stp            .
      *                      *-----------------------------------------*
      *                      * Scrittura file [kk0]                    *
      *                      *-----------------------------------------*
           write     kk0-rec                                          .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-bcs-900.
       stp-srt-inp-bcs-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-bcs-999.
       stp-srt-inp-bcs-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *                                                           *
      *    * Ciclo di scansione saldi cliente                          *
      *    *-----------------------------------------------------------*
       stp-srt-inp-css-000.
      *              *-------------------------------------------------*
      *              * Start su file [kk0]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione chiave                         *
      *                  *---------------------------------------------*
           move      zero                 to   kk0-cod-cli            .
           move      spaces               to   kk0-dpz-cli            .
      *                  *---------------------------------------------*
      *                  * Operazione di Start                         *
      *                  *---------------------------------------------*
           start     kk0    key not less
                            kk0-key
                            invalid key
                            go to stp-srt-inp-css-900.
       stp-srt-inp-css-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file di appoggio [kk0]      *
      *              *-------------------------------------------------*
           read      kk0    next
                            with no lock
                            at end
                            go to stp-srt-inp-css-900.
       stp-srt-inp-css-300.
      *              *-------------------------------------------------*
      *              * Test-max su record [kk0]                        *
      *              *-------------------------------------------------*
       stp-srt-inp-css-400.
      *              *-------------------------------------------------*
      *              * Selezione su record [kk0]                       *
      *              *-------------------------------------------------*
       stp-srt-inp-css-500.
      *              *-------------------------------------------------*
      *              * Determinazione saldo cliente                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione                              *
      *                  *---------------------------------------------*
           move      kk0-cod-cli          to   w-det-sdo-gep-cli      .
           move      kk0-dpz-cli          to   w-det-sdo-gep-dpz      .
           perform   det-sdo-gep-000      thru det-sdo-gep-999        .
      *                  *---------------------------------------------*
      *                  * Test su saldo determinato                   *
      *                  *---------------------------------------------*
           if        w-det-sdo-gep-sdo    >    zero
                     go to stp-srt-inp-css-800.
      *                  *---------------------------------------------*
      *                  * Aggiornamento flag di stampa                *
      *                  *---------------------------------------------*
           move      "#"                  to   kk0-flg-stp            .
      *                  *---------------------------------------------*
      *                  * Scrittura dati aggiornati                   *
      *                  *---------------------------------------------*
           rewrite   kk0-rec                                          .
       stp-srt-inp-css-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-css-200.
       stp-srt-inp-css-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-css-999.
       stp-srt-inp-css-999.
           exit.

      *    *===========================================================*
      *    * Selezioni su record [sdb]                                 *
      *    *-----------------------------------------------------------*
       sel-rec-sdb-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-sel-rec-sdb-flg      .
      *              *-------------------------------------------------*
      *              * Se dilazione concordata: selezione non superata *
      *              *-------------------------------------------------*
           if        rf-sdb-tip-sdb       =    01 and
                     rf-sdb-snx-dlc       =    "S"
                     go to sel-rec-sdb-900.
       sel-rec-sdb-010.
      *              *-------------------------------------------------*
      *              * Eventuale selezione su date scadenza            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Comodo per selezione                        *
      *                  *---------------------------------------------*
           move      rf-sdb-dts-sdb       to   w-sel-rec-dts-sdb      .
      *                  *---------------------------------------------*
      *                  * Eventuali scadenze a vista                  *
      *                  *---------------------------------------------*
           if        rf-sdb-dts-sdb       =    zero
                     move  rf-sdb-dat-ddr to   w-sel-rec-dts-sdb      .
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rr-dts-min           not  = zero and
                     w-sel-rec-dts-sdb    not  = zero and
                     w-sel-rec-dts-sdb    <    rr-dts-min
                     go to sel-rec-sdb-900.
           if        rr-dts-max           not  = zero and
                     w-sel-rec-dts-sdb    not  = zero and
                     w-sel-rec-dts-sdb    >    rr-dts-max
                     go to sel-rec-sdb-900.
       sel-rec-sdb-020.
      *              *-------------------------------------------------*
      *              * Determinazione status scadenza                  *
      *              *-------------------------------------------------*
           move      rr-dat-rif           to   w-det-srd-sdb-drd      .
           perform   det-srd-sdb-000      thru det-srd-sdb-999        .
      *              *-------------------------------------------------*
      *              * Test se scadenza ancora aperta                  *
      *              *-------------------------------------------------*
           if        w-det-srd-sdb-sts    not  = "A"
                     go to sel-rec-sdb-900.
       sel-rec-sdb-030.
       sel-rec-sdb-080.
      *              *-------------------------------------------------*
      *              * Test se sigla ultima operazione eseguita e' a   *
      *              * spazi                                           *
      *              *-------------------------------------------------*
           if        w-det-srd-sdb-suo    =    spaces
                     go to sel-rec-sdb-900.
       sel-rec-sdb-100.
      *              *-------------------------------------------------*
      *              * Test su ultima operazione effettuata sulla sca- *
      *              * denza                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo scadenza    *
      *                  *---------------------------------------------*
           go to     sel-rec-sdb-101
                     sel-rec-sdb-102
                     sel-rec-sdb-103
                     sel-rec-sdb-104
                     sel-rec-sdb-105
                     sel-rec-sdb-106
                     sel-rec-sdb-107
                     sel-rec-sdb-108
                     sel-rec-sdb-109
                     sel-rec-sdb-110
                     sel-rec-sdb-111
                     depending            on rf-sdb-tip-sdb           .
           go to     sel-rec-sdb-900.
       sel-rec-sdb-101.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Rimessa diretta             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deve essere solo emessa                 *
      *                      *-----------------------------------------*
           if        w-det-srd-sdb-suo    not  = "EMI"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-102.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Incasso elettronico         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Puo' essere solo insoluto               *
      *                      *-----------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-103.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Ri.Ba.                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Puo' essere solo insoluto               *
      *                      *-----------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-104.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : C.d.O.                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Puo' essere solo insoluto               *
      *                      *-----------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-105.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : M.Av.                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Puo' essere solo insoluto               *
      *                      *-----------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-106.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : R.I.D.                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Puo' essere solo insoluto               *
      *                      *-----------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-107.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Bonifico bancario           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deve essere solo emessa                 *
      *                      *-----------------------------------------*
           if        w-det-srd-sdb-suo    not  = "EMI"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-108.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : C/C postale                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deve essere solo emessa                 *
      *                      *-----------------------------------------*
           if        w-det-srd-sdb-suo    not  = "EMI"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-109.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Ricevuta bancaria           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Puo' essere solo insoluto               *
      *                      *-----------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-110.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Tratta                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Puo' essere solo insoluto               *
      *                      *-----------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-111.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Paghero' cambiario          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Puo' essere solo insoluto               *
      *                      *-----------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-200.
      *              *-------------------------------------------------*
      *              * Se scadenza insoluta : a selezione superata     *
      *              *-------------------------------------------------*
           if        w-det-srd-sdb-suo    =    "ISP"
                     go to sel-rec-sdb-800.
      *              *-------------------------------------------------*
      *              * Determinazione numero giorni di ritardo ammessi *
      *              *-------------------------------------------------*
           if        rf-sdb-tip-sdb       =    01
                     move  w-prs-ngg-scd-rim
                                          to   w-sel-rec-sdb-ngr
           else if   rf-sdb-tip-sdb       =    07
                     move  w-prs-ngg-scd-bon
                                          to   w-sel-rec-sdb-ngr
           else if   rf-sdb-tip-sdb       =    08
                     move  w-prs-ngg-scd-ccp
                                          to   w-sel-rec-sdb-ngr      .
      *              *-------------------------------------------------*
      *              * Se numero giorni di ritardo ammessi pari a 99,  *
      *              * selezione non superata                          *
      *              *-------------------------------------------------*
           if        w-sel-rec-sdb-ngr    =    99
                     go to sel-rec-sdb-900.
      *              *-------------------------------------------------*
      *              * Determinazione data scadenza comprensiva del    *
      *              * numero giorni di ritardo ammessi                *
      *              *-------------------------------------------------*
           if        rf-sdb-dts-sdb       =    zero
                     move  rf-sdb-dtr-emi to   w-det-dat-mng-dti
           else      move  rf-sdb-dts-sdb to   w-det-dat-mng-dti      .
           move      w-sel-rec-sdb-ngr    to   w-det-dat-mng-ngi      .
           perform   det-dat-mng-000      thru det-dat-mng-999        .
      *              *-------------------------------------------------*
      *              * Se la data cosi' determinata non e' inferiore   *
      *              * alla data di riferimento : selezione non supe-  *
      *              * rata                                            *
      *              *-------------------------------------------------*
           if        w-det-dat-mng-dto    not  < rr-dat-rif
                     go to sel-rec-sdb-900.
       sel-rec-sdb-800.
      *              *-------------------------------------------------*
      *              * Uscita per selezione superata                   *
      *              *-------------------------------------------------*
           go to     sel-rec-sdb-999.
       sel-rec-sdb-900.
      *              *-------------------------------------------------*
      *              * Uscita per selezione non superata               *
      *              *-------------------------------------------------*
           move      "#"                  to   w-sel-rec-sdb-flg      .
       sel-rec-sdb-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Normalizzazioni                                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-prn-rot-cli          .
           move      zero                 to   w-prn-num-cli          .
           move      zero                 to   w-prn-tot-slc          .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessun sollecito da trattare entro i limiti assegn
      -              "ati!"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-prn-flg-sub
                            go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-100.
      *              *-------------------------------------------------*
      *              * Test se cliente da stampare                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se rottura cliente                          *
      *                  *---------------------------------------------*
           if        srt-cod-cli          =    w-prn-rot-cli
                     go to prn-sel-rec-200.
      *                      *-----------------------------------------*
      *                      * Aggiornamento area rottura cliente      *
      *                      *-----------------------------------------*
           move      srt-cod-cli          to   w-prn-rot-cli          .
      *                      *-----------------------------------------*
      *                      * Chiave [kk0]                           *
      *                      *-----------------------------------------*
           move      srt-cod-cli          to   kk0-cod-cli            .
           move      srt-dpz-cli          to   kk0-dpz-cli            .
      *                      *-----------------------------------------*
      *                      * Lettura [kk0]                           *
      *                      *-----------------------------------------*
           read      kk0    key is  kk0-key
                            invalid key
                            go to prn-sel-rec-140.
       prn-sel-rec-120.
      *                  *---------------------------------------------*
      *                  * Se record trovato                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test del flag di cliente da stampare    *
      *                      * contenuto nel record [kk0]              *
      *                      *                                         *
      *                      * Se il flag e' non spaces, ci si compor- *
      *                      * ta come per cliente da non stampare     *
      *                      *-----------------------------------------*
           if        kk0-flg-stp          =    "#"
                     go to prn-sel-rec-140.
      *                      *-----------------------------------------*
      *                      * Set del flag di cliente da stampare     *
      *                      *-----------------------------------------*
           move      "#"                  to   w-prn-flg-cds          .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     prn-sel-rec-200.
       prn-sel-rec-140.
      *                  *---------------------------------------------*
      *                  * Se record non trovato                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione flag di cliente da      *
      *                      * stampare                                *
      *                      *-----------------------------------------*
           move      spaces               to   w-prn-flg-cds          .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     prn-sel-rec-200.
       prn-sel-rec-200.
      *                  *---------------------------------------------*
      *                  * Se non rottura cliente                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su flag di cliente da stampare     *
      *                      *-----------------------------------------*
           if        w-prn-flg-cds        =    spaces
                     move  "#"            to   w-cnt-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
           move      srt-cod-cli          to   w-rot-l02-cod-cli      .
           move      srt-inl-sdb          to   w-rot-l01-inl-sdb      .
           move      srt-dpc-key          to   w-rot-l01-dpc-key      .
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Aggiornamento numerazione [lotslc]              *
      *              *-------------------------------------------------*
           perform   agg-lot-slc-000      thru agg-lot-slc-999        .
      *              *-------------------------------------------------*
      *              * Editing contatore clienti                       *
      *              *-------------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-prn-num-cli        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Messaggio di fine esecuzione                    *
      *              *-------------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
           string    "Selezionati "
                                delimited by   size
                     v-edt      delimited by   spaces
                     " clienti"
                                delimited by   size
                                          into m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
           move      m-msg                to   w-prn-msg-bt1          .
      *              *-------------------------------------------------*
      *              * Editing totale solleciti                        *
      *              *-------------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-prn-tot-slc        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Messaggio di fine esecuzione                    *
      *              *-------------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
           string    "per "
                                delimited by   size
                     v-edt      delimited by   spaces
                     " solleciti"
                                delimited by   size
                                          into m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
           move      m-msg                to   w-prn-msg-bt2          .
       prn-fin-cic-300.
      *              *-------------------------------------------------*
      *              * Eventuali forzature per batch                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su flag                                *
      *                  *---------------------------------------------*
           if        rr-snx-btc           not  = "S"
                     go to prn-fin-cic-999.
      *                  *---------------------------------------------*
      *                  * Messaggi di fine esecuzione                 *
      *                  *---------------------------------------------*
           display   w-prn-msg-bt1                                    .
           display   w-prn-msg-bt2                                    .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Routine di aggiornamento numerazione [lotslc]             *
      *    *-----------------------------------------------------------*
       agg-lot-slc-000.
      *              *-------------------------------------------------*
      *              * Ottenimento record [lotslc]                     *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/gep/num/ioc/obj/inlotslc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-lot-slc             .
      *              *-------------------------------------------------*
      *              * Se record non esistente                         *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to agg-lot-slc-100.
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [lotslc]             *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/gep/num/ioc/obj/inlotslc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-lot-slc             .
      *                  *---------------------------------------------*
      *                  * Scrittura record [lotslc]                   *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/gep/num/ioc/obj/inlotslc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-lot-slc             .
      *                  *---------------------------------------------*
      *                  * Riciclo a inizio operazione                 *
      *                  *---------------------------------------------*
           go to     agg-lot-slc-000.
       agg-lot-slc-100.
      *              *-------------------------------------------------*
      *              * Composizione record [lotslc]                    *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   rn-lot-slc-dic-slc     .
           move      zero                 to   rn-lot-slc-dfc-slc     .
           move      rr-dat-rif           to   rn-lot-slc-dat-rif     .
           move      rr-snx-alv           to   rn-lot-slc-snx-alv     .
      *              *-------------------------------------------------*
      *              * Update record [lotslc]                          *
      *              *-------------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/gep/num/ioc/obj/inlotslc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-lot-slc             .
      *              *-------------------------------------------------*
      *              * Release record [lotslc]                         *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/gep/num/ioc/obj/inlotslc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-lot-slc             .
       agg-lot-slc-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero sollecito per cliente   *
      *              *-------------------------------------------------*
           move      zero                 to   w-prn-num-slc          .
      *              *-------------------------------------------------*
      *              * Incremento numero clienti selezionati           *
      *              *-------------------------------------------------*
           add       1                    to   w-prn-num-cli          .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Incremento numero sollecito del cliente         *
      *              *-------------------------------------------------*
           add       1                    to   w-prn-num-slc          .
      *              *-------------------------------------------------*
      *              * Incremento numero totale solleciti              *
      *              *-------------------------------------------------*
           add       1                    to   w-prn-tot-slc          .
       prn-ini-lr1-100.
      *              *-------------------------------------------------*
      *              * Composizione parziale record [sct]              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [sct]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sct                 .
      *                  *---------------------------------------------*
      *                  * Composizione record [sct]                   *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   rf-sct-ide-dat         .
           move      s-ute                to   rf-sct-ide-ute         .
           move      s-fas                to   rf-sct-ide-fas         .
           move      srt-cod-cli          to   rf-sct-cod-cli         .
           move      w-prn-num-slc        to   rf-sct-num-slc         .
           move      srt-dpz-cli          to   rf-sct-dpz-cli         .
           move      srt-inl-sdb          to   rf-sct-inl-slc         .
           move      srt-cod-age          to   rf-sct-cod-age         .
           move      srt-dpc-key          to   rf-sct-dpc-key         .
           move      zero                 to   rf-sct-liv-slc         .
           move      zero                 to   rf-sct-cod-tso         .
           move      spaces               to   rf-sct-flg-stp         .
           move      spaces               to   rf-sct-flg-itm         .
           move      spaces               to   rf-sct-ind-eml         .
           move      zero                 to   rf-sct-dat-itm         .
           move      spaces               to   rf-sct-alx-exp         .
       prn-ini-lr1-120.
      *              *-------------------------------------------------*
      *              * Memorizzazione valori record [ccc]              *
      *              *-------------------------------------------------*
           move      srt-emi-slc          to   w-ccc-emi-slc          .
           move      srt-tdt-slc          to   w-ccc-tdt-slc          .
           move      srt-tso-l01          to   w-ccc-tso-l01          .
           move      srt-tso-l02          to   w-ccc-tso-l02          .
           move      srt-tso-l03          to   w-ccc-tso-l03          .
      *              *-------------------------------------------------*
      *              * Inizializzazione progressivo righe              *
      *              *-------------------------------------------------*
           move      zero                 to   w-prn-num-prg          .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero livello di sollecito    *
      *              *-------------------------------------------------*
           move      1                    to   w-prn-liv-slc          .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Determinazione livello di sollecito da inviare  *
      *              * al cliente                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su livello massimo personalizzato      *
      *                  *---------------------------------------------*
           if        w-prn-liv-slc        >    w-prs-max-liv
                     move  w-prs-max-liv  to   w-prn-liv-slc          .
      *                  *---------------------------------------------*
      *                  * Test su livello massimo per il cliente : se *
      *                  * il livello di sollecito calcolato e' supe-  *
      *                  * riore a quello massimo ammesso per il cli-  *
      *                  * ente non si scrive la testata [sct]         *
      *                  *---------------------------------------------*
           if        w-ccc-emi-slc        =    zero
                     go to prn-fin-lr1-100.
           if        w-prn-liv-slc        >    w-ccc-emi-slc
                     go to prn-fin-lr1-999.
       prn-fin-lr1-100.
      *              *-------------------------------------------------*
      *              * Determinazione tipo di sollecito da inviare al  *
      *              * cliente                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo di testo con- *
      *                  * tenuto in anagrafica cliente                *
      *                  *---------------------------------------------*
           if        w-ccc-tdt-slc        =    zero
                     go to prn-fin-lr1-110
           else if   w-ccc-tdt-slc        =    01
                     go to prn-fin-lr1-120
           else if   w-ccc-tdt-slc        =    02
                     go to prn-fin-lr1-130
           else if   w-ccc-tdt-slc        =    03
                     go to prn-fin-lr1-140
           else if   w-ccc-tdt-slc        =    99
                     go to prn-fin-lr1-150.
       prn-fin-lr1-110.
      *                  *---------------------------------------------*
      *                  * Tipo di testo : Standard                    *
      *                  *---------------------------------------------*
           if        w-prn-liv-slc        =    01
                     move  w-ref-tso-std-l01
                                          to   w-prn-fin-lr1-cts
           else if   w-prn-liv-slc        =    02
                     move  w-ref-tso-std-l02
                                          to   w-prn-fin-lr1-cts
           else if   w-prn-liv-slc        =    03
                     move  w-ref-tso-std-l03
                                          to   w-prn-fin-lr1-cts      .
           go to     prn-fin-lr1-200.
       prn-fin-lr1-120.
      *                  *---------------------------------------------*
      *                  * Tipo di testo : Sempre testo di livello 1   *
      *                  *---------------------------------------------*
           move      w-ref-tso-std-l01    to   w-prn-fin-lr1-cts      .
           go to     prn-fin-lr1-200.
       prn-fin-lr1-130.
      *                  *---------------------------------------------*
      *                  * Tipo di testo : Sempre testo di livello 2   *
      *                  *---------------------------------------------*
           move      w-ref-tso-std-l02    to   w-prn-fin-lr1-cts      .
           go to     prn-fin-lr1-200.
       prn-fin-lr1-140.
      *                  *---------------------------------------------*
      *                  * Tipo di testo : Sempre testo di livello 3   *
      *                  *---------------------------------------------*
           move      w-ref-tso-std-l03    to   w-prn-fin-lr1-cts      .
           go to     prn-fin-lr1-200.
       prn-fin-lr1-150.
      *                  *---------------------------------------------*
      *                  * Tipo di testo : Personalizzato              *
      *                  *---------------------------------------------*
           if        w-prn-liv-slc        =    01
                     move  w-ccc-tso-l01  to   w-prn-fin-lr1-cts
           else if   w-prn-liv-slc        =    02
                     move  w-ccc-tso-l02  to   w-prn-fin-lr1-cts
           else if   w-prn-liv-slc        =    03
                     move  w-ccc-tso-l03  to   w-prn-fin-lr1-cts      .
           go to     prn-fin-lr1-200.
       prn-fin-lr1-200.
      *              *-------------------------------------------------*
      *              * Completamento record [sct]                      *
      *              *-------------------------------------------------*
           move      w-prn-liv-slc        to   rf-sct-liv-slc         .
           move      w-prn-fin-lr1-cts    to   rf-sct-cod-tso         .
      *              *-------------------------------------------------*
      *              * Scrittura record [sct]                          *
      *              *-------------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sct                 .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Se raggiunto il progressivo riga massimo : u-   *
      *              * scita                                           *
      *              *-------------------------------------------------*
           if        w-prn-num-prg        =    99900
                     go to prn-liv-det-999.
      *              *-------------------------------------------------*
      *              * Aggiornamento livello di sollecito              *
      *              *-------------------------------------------------*
           move      srt-liv-slc          to   w-prn-liv-det-lvs      .
           add       1                    to   w-prn-liv-det-lvs      .
           if        w-prn-liv-det-lvs    >    w-prn-liv-slc
                     move  w-prn-liv-det-lvs
                                          to   w-prn-liv-slc          .
      *              *-------------------------------------------------*
      *              * Incremento progressivo riga                     *
      *              *-------------------------------------------------*
           add       100                  to   w-prn-num-prg          .
      *              *-------------------------------------------------*
      *              * Scrittura record [scr]                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [scr]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofscr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-scr                 .
      *                  *---------------------------------------------*
      *                  * Composizione record [scr]                   *
      *                  *---------------------------------------------*
           move      srt-cod-cli          to   rf-scr-cod-cli         .
           move      w-prn-num-slc        to   rf-scr-num-slc         .
           move      w-prn-num-prg        to   rf-scr-num-prg         .
           move      srt-num-sdb          to   rf-scr-num-sdb         .
           move      01                   to   rf-scr-sel-sdb         .
      *                  *---------------------------------------------*
      *                  * Scrittura record [scr]                      *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofscr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-scr                 .
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [age]                         *
      *    *-----------------------------------------------------------*
       let-arc-age-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-age-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-age-cod    =    zero
                     go to let-arc-age-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODAGE"             to   f-key                  .
           move      w-let-arc-age-cod    to   rf-age-cod-age         .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-age-400.
       let-arc-age-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-age-nom-age       to   w-let-arc-age-nom      .
           move      rf-age-sup-age       to   w-let-arc-age-sup      .
           move      rf-age-cat-pvg       to   w-let-arc-age-cat      .
           move      rf-age-per-pvg (1)   to   w-let-arc-age-per (1)  .
           move      rf-age-per-pvg (2)   to   w-let-arc-age-per (2)  .
           move      rf-age-per-pvg (3)   to   w-let-arc-age-per (3)  .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-age-999.
       let-arc-age-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-age-flg      .
           move      all   "."            to   w-let-arc-age-nom      .
           go to     let-arc-age-600.
       let-arc-age-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-age-nom      .
       let-arc-age-600.
           move      zero                 to   w-let-arc-age-sup      .
           move      zero                 to   w-let-arc-age-cat      .
           move      zero                 to   w-let-arc-age-per (1)  .
           move      zero                 to   w-let-arc-age-per (2)  .
           move      zero                 to   w-let-arc-age-per (3)  .
       let-arc-age-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [cli]                         *
      *    *-----------------------------------------------------------*
       let-arc-cli-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cli-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice cliente a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-cli-cod    =    zero
                     go to let-arc-cli-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-let-arc-cli-cod    to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-cli-400.
       let-arc-cli-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-cli-rag-soc       to   w-let-arc-cli-rag      .
           move      rf-cli-via-cli       to   w-let-arc-cli-via      .
           move      rf-cli-loc-cli       to   w-let-arc-cli-loc      .
           move      rf-cli-cod-cge       to   w-let-arc-cli-cge      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-cli-999.
       let-arc-cli-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-cli-flg      .
           move      all   "."            to   w-let-arc-cli-rag      .
           go to     let-arc-cli-600.
       let-arc-cli-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cli-rag      .
       let-arc-cli-600.
           move      spaces               to   w-let-arc-cli-via      .
           move      spaces               to   w-let-arc-cli-loc      .
           move      zero                 to   w-let-arc-cli-cge      .
       let-arc-cli-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio dipendenza cliente in [dcc]      *
      *    *-----------------------------------------------------------*
       let-arc-dcc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice cliente a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-cod    =    zero
                     go to let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a spaces, solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-dpz    =    spaces and
                     w-let-arc-dcc-tle    =    "D"
                     go to let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a "*   ", solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-dpz    =    "*   " and
                     w-let-arc-dcc-tle    =    "D"
                     go to let-arc-dcc-450.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-let-arc-dcc-cod    to   rf-dcc-cod-cli         .
           move      w-let-arc-dcc-dpz    to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcc-400.
       let-arc-dcc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcc-rag-soc       to   w-let-arc-dcc-rag      .
           move      rf-dcc-via-dcc       to   w-let-arc-dcc-via      .
           move      rf-dcc-loc-dcc       to   w-let-arc-dcc-loc      .
           move      rf-dcc-cod-abi       to   w-let-arc-dcc-abi      .
           move      rf-dcc-cod-cab       to   w-let-arc-dcc-cab      .
           move      rf-dcc-cod-age       to   w-let-arc-dcc-age      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcc-999.
       let-arc-dcc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcc-flg      .
           move      all   "."            to   w-let-arc-dcc-rag      .
           go to     let-arc-dcc-600.
       let-arc-dcc-450.
      *              *-------------------------------------------------*
      *              * Normalizzazione per codice dipendenza "*   "    *
      *              *-------------------------------------------------*
           move      "Sia la sede che tutte le dipendenze     "
                                          to   w-let-arc-dcc-rag      .
           go to     let-arc-dcc-600.
       let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-rag      .
       let-arc-dcc-600.
           move      spaces               to   w-let-arc-dcc-via      .
           move      spaces               to   w-let-arc-dcc-loc      .
           move      zero                 to   w-let-arc-dcc-abi      .
           move      zero                 to   w-let-arc-dcc-cab      .
           move      zero                 to   w-let-arc-dcc-age      .
       let-arc-dcc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [ccc]                         *
      *    *-----------------------------------------------------------*
       let-arc-ccc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ccc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-ccc-cod    =    zero
                     go to let-arc-ccc-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-let-arc-ccc-cod    to   rf-ccc-cod-cli         .
           move      "pgm/gep/fls/ioc/obj/iofccc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ccc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-ccc-400.
       let-arc-ccc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-ccc-emi-slc       to   w-let-arc-ccc-ems      .
           move      rf-ccc-tdt-slc       to   w-let-arc-ccc-tts      .
           move      rf-ccc-tso-l01       to   w-let-arc-ccc-ts1      .
           move      rf-ccc-tso-l02       to   w-let-arc-ccc-ts2      .
           move      rf-ccc-tso-l03       to   w-let-arc-ccc-ts3      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-ccc-999.
       let-arc-ccc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-ccc-flg      .
           go to     let-arc-ccc-500.
       let-arc-ccc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-let-arc-ccc-ems      .
           move      zero                 to   w-let-arc-ccc-tts      .
           move      zero                 to   w-let-arc-ccc-ts1      .
           move      zero                 to   w-let-arc-ccc-ts2      .
           move      zero                 to   w-let-arc-ccc-ts3      .
       let-arc-ccc-999.
           exit.

      *    *===========================================================*
      *    * Determinazione status scadenza                            *
      *    *-----------------------------------------------------------*
       det-srd-sdb-000.
      *              *-------------------------------------------------*
      *              * Determinazione sigla ultima operazione eseguita *
      *              * sulla scadenza                                  *
      *              *-------------------------------------------------*
       det-srd-sdb-025.
      *                  *---------------------------------------------*
      *                  * Normalizzazioni iniziali                    *
      *                  *---------------------------------------------*
           move      spaces               to   w-det-srd-sdb-suo      .
           move      zero                 to   w-det-srd-sdb-dro      .
       det-srd-sdb-050.
      *                  *---------------------------------------------*
      *                  * Se la data di emissione scadenza e' supe-   *
      *                  * riore alla data di riferimento per la de-   *
      *                  * terminazione : uscita con status 'N'        *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-emi       >    w-det-srd-sdb-drd
                     move  "N"            to   w-det-srd-sdb-sts
                     go to det-srd-sdb-999.
       det-srd-sdb-100.
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "EMI"                to   w-det-srd-sdb-suo      .
       det-srd-sdb-125.
      *                  *---------------------------------------------*
      *                  * Storno                                      *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-sto       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-sto       not  = zero
                     move  "SSC"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-150.
      *                  *---------------------------------------------*
      *                  * Riscossione                                 *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-ris       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-ris       not  = zero
                     go to det-srd-sdb-155
           else      go to det-srd-sdb-200.
       det-srd-sdb-155.
      *                      *-----------------------------------------*
      *                      * Determinazione in funizione delle moda- *
      *                      * lita' di riscossione                    *
      *                      *-----------------------------------------*
           if        rf-sdb-mod-ris       =    01 or
                     rf-sdb-mod-ris       =    02 or
                     rf-sdb-mod-ris       =    03 or
                     rf-sdb-mod-ris       =    04
                     move  "RIS"          to   w-det-srd-sdb-suo
           else if   rf-sdb-mod-ris       =    21 or
                     rf-sdb-mod-ris       =    22 or
                     rf-sdb-mod-ris       =    23 or
                     rf-sdb-mod-ris       =    24
                     move  "PAG"          to   w-det-srd-sdb-suo
           else if   rf-sdb-mod-ris       =    50
                     move  "CMP"          to   w-det-srd-sdb-suo      .
           go to     det-srd-sdb-800.
       det-srd-sdb-200.
      *                  *---------------------------------------------*
      *                  * Richiamo della scadenza presentata          *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-rsp       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-rsp       not  = zero
                     move  "RSP"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-225.
      *                  *---------------------------------------------*
      *                  * Accredito scadenza al dopo incasso          *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-acs       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-acs       not  = zero
                     move  "ACS"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-250.
      *                  *---------------------------------------------*
      *                  * Notizia di buon esito sulla scadenza        *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-nbe       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-nbe       not  = zero
                     move  "NBE"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-275.
      *                  *---------------------------------------------*
      *                  * Presunto buon esito sulla scadenza          *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-pbe       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-pbe       not  = zero
                     move  "PBE"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-300.
      *                  *---------------------------------------------*
      *                  * Insoluto sulla scadenza presentata          *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-isp       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-isp       not  = zero
                     move  "ISP"          to   w-det-srd-sdb-suo
                     move  rf-sdb-dtr-isp to   w-det-srd-sdb-dro
                     go to det-srd-sdb-800.
       det-srd-sdb-400.
      *                  *---------------------------------------------*
      *                  * Operazioni relative alla distinta di pre-   *
      *                  * sentazione                                  *
      *                  *---------------------------------------------*
       det-srd-sdb-425.
      *                      *-----------------------------------------*
      *                      * Se la scadenza non porta un numero di-  *
      *                      * stinta si escludono tutti i controlli   *
      *                      * sulle operazioni relative alla distinta *
      *                      * di presentazione                        *
      *                      *-----------------------------------------*
           if        rf-sdb-num-ddp       =    zero
                     go to det-srd-sdb-625.
       det-srd-sdb-450.
      *                      *-----------------------------------------*
      *                      * Lettura distinta di presentazione       *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMDDP    "         to   f-key                  .
           move      rf-sdb-num-ddp       to   rf-ddp-num-ddp         .
           move      "pgm/gep/fls/ioc/obj/iofddp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ddp                 .
       det-srd-sdb-475.
      *                      *-----------------------------------------*
      *                      * Se distinta di presentazione non esi-   *
      *                      * stente in archivio distinte si escludo- *
      *                      * no tutti i controlli sulle operazioni   *
      *                      * relative alla distinta di presentazione *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-srd-sdb-625.
       det-srd-sdb-500.
      *                      *-----------------------------------------*
      *                      * Se la data di composizione distinta e'  *
      *                      * superiore alla data di riferimento per  *
      *                      * la determinazione si escludono tutti i  *
      *                      * controlli sulle operazioni relative al- *
      *                      * la distinta di presentazione            *
      *                      *-----------------------------------------*
           if        rf-ddp-dtr-com       >    w-det-srd-sdb-drd
                     go to det-srd-sdb-625.
       det-srd-sdb-525.
      *                      *-----------------------------------------*
      *                      * Composizione distinta                   *
      *                      *-----------------------------------------*
           move      "COM"                to   w-det-srd-sdb-suo      .
       det-srd-sdb-550.
      *                      *-----------------------------------------*
      *                      * Presentazione distinta                  *
      *                      *-----------------------------------------*
           if        rf-ddp-dtr-pre       not  > w-det-srd-sdb-drd and
                     rf-ddp-dtr-pre       not  = zero
                     move  "PRE"          to   w-det-srd-sdb-suo      .
       det-srd-sdb-575.
      *                      *-----------------------------------------*
      *                      * Accettazione distinta                   *
      *                      *-----------------------------------------*
           if        rf-ddp-dtr-act       not  > w-det-srd-sdb-drd and
                     rf-ddp-dtr-act       not  = zero
                     move  "ACT"          to   w-det-srd-sdb-suo      .
       det-srd-sdb-600.
      *                      *-----------------------------------------*
      *                      * Accredito distinta                      *
      *                      *-----------------------------------------*
           if        rf-ddp-dtr-acd       not  > w-det-srd-sdb-drd and
                     rf-ddp-dtr-acd       not  = zero
                     move  "ACD"          to   w-det-srd-sdb-suo      .
       det-srd-sdb-625.
      *                      *-----------------------------------------*
      *                      * Fine controlli su operazioni relative   *
      *                      * alla distinta di presentazione          *
      *                      *-----------------------------------------*
           go to     det-srd-sdb-800.
       det-srd-sdb-800.
      *              *-------------------------------------------------*
      *              * Determinazione dello status della scadenza in   *
      *              * funzione della sigla dell'ultima operazione e-  *
      *              * seguita sulla scadenza                          *
      *              *-------------------------------------------------*
           if        w-det-srd-sdb-suo    =    "EMI" or
                     w-det-srd-sdb-suo    =    "COM" or
                     w-det-srd-sdb-suo    =    "PRE" or
                     w-det-srd-sdb-suo    =    "ACT" or
                     w-det-srd-sdb-suo    =    "ACD"
                     move  "A"            to   w-det-srd-sdb-sts
           else if   w-det-srd-sdb-suo    =    "SSC" or
                     w-det-srd-sdb-suo    =    "RIS" or
                     w-det-srd-sdb-suo    =    "PAG" or
                     w-det-srd-sdb-suo    =    "CMP" or
                     w-det-srd-sdb-suo    =    "RSP" or
                     w-det-srd-sdb-suo    =    "ACS" or
                     w-det-srd-sdb-suo    =    "NBE" or
                     w-det-srd-sdb-suo    =    "PBE" or
                     w-det-srd-sdb-suo    =    "ISP"
                     move  "C"            to   w-det-srd-sdb-sts
           else      move  spaces         to   w-det-srd-sdb-sts      .
      *                  *---------------------------------------------*
      *                  * Eventuale aggiustamento in caso di insoluto *
      *                  *---------------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to det-srd-sdb-999.
      *                      *-----------------------------------------*
      *                      * Se la scadenza e' comunque stata ri-    *
      *                      * scossa : tutto inalterato               *
      *                      *-----------------------------------------*
           if        rf-sdb-dtr-ris       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-ris       not  = zero
                     go to det-srd-sdb-999.
      *                      *-----------------------------------------*
      *                      * Se a fronte dell'insoluto non e' stata  *
      *                      * emessa una nuova scadenza, essa e' da   *
      *                      * intendersi ancora aperta                *
      *                      *-----------------------------------------*
           if        rf-sdb-ens-isp       =    02   and
                     rf-sdb-nns-isp       =    zero
                     move  "A"            to   w-det-srd-sdb-sts      .
       det-srd-sdb-999.
           exit.

      *    *===========================================================*
      *    * Determinazione di una data maggiorata fino ad un massimo  *
      *    * di 99 giorni                                              *
      *    *-----------------------------------------------------------*
       det-dat-mng-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione data in output                 *
      *              *-------------------------------------------------*
           move      w-det-dat-mng-dti    to   w-det-dat-mng-dto      .
      *              *-------------------------------------------------*
      *              * Se data in input a zero : uscita                *
      *              *-------------------------------------------------*
           if        w-det-dat-mng-dti    =    zero
                     go to det-dat-mng-999.
      *              *-------------------------------------------------*
      *              * Se numero giorni d'incremento a zero : uscita   *
      *              *-------------------------------------------------*
           if        w-det-dat-mng-ngi    =    zero
                     go to det-dat-mng-999.
      *              *-------------------------------------------------*
      *              * Se numero giorni d'incremento superiore a 99 :  *
      *              * si normalizza a 99 e si procede                 *
      *              *-------------------------------------------------*
           if        w-det-dat-mng-ngi    >    99
                     move  99             to   w-det-dat-mng-ngi      .
      *              *-------------------------------------------------*
      *              * Data in input in comodo ridefinito              *
      *              *-------------------------------------------------*
           move      w-det-dat-mng-dti    to   w-det-dat-mng-wdt      .
      *              *-------------------------------------------------*
      *              * Determinazione numero giorni di febbraio se me- *
      *              * se pari a 02 della data attuale                 *
      *              *-------------------------------------------------*
           if        w-det-dat-mng-wdm    not  = 02
                     go to det-dat-mng-020.
           move      w-det-dat-mng-wds    to   w-det-dat-mng-wt5      .
           add       1900                 to   w-det-dat-mng-wt5      .
           divide    4                    into w-det-dat-mng-wt5
                                        giving w-det-dat-mng-wt6
                                     remainder w-det-dat-mng-wt7      .
           if        w-det-dat-mng-wt7    not  = zero
                     move  28             to   w-det-dat-mng-wt2 (2)
                     go to det-dat-mng-020.
           divide    400                  into w-det-dat-mng-wt5
                                        giving w-det-dat-mng-wt6
                                     remainder w-det-dat-mng-wt7      .
           if        w-det-dat-mng-wt7    =    zero
                     move  29             to   w-det-dat-mng-wt2 (2)
                     go to det-dat-mng-020.
           divide    100                  into w-det-dat-mng-wt5
                                        giving w-det-dat-mng-wt6
                                     remainder w-det-dat-mng-wt7      .
           if        w-det-dat-mng-wt7    =    zero
                     move  28             to   w-det-dat-mng-wt2 (2)
           else      move  29             to   w-det-dat-mng-wt2 (2)  .
       det-dat-mng-020.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda che il numero giorni d'in- *
      *              * cremento multiplo di 30 oppure no               *
      *              *-------------------------------------------------*
           divide    30                   into w-det-dat-mng-ngi
                                        giving w-det-dat-mng-wmi
                                     remainder w-det-dat-mng-wpr      .
           if        w-det-dat-mng-wpr    =    zero
                     go to det-dat-mng-100
           else      go to det-dat-mng-500.
       det-dat-mng-100.
      *              *-------------------------------------------------*
      *              * Se numero giorni di incremento multiplo di 30   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda che la data sia di fi- *
      *                  * ne mese o no                                *
      *                  *---------------------------------------------*
           if        w-det-dat-mng-wdg    =    w-det-dat-mng-wt2
                                              (w-det-dat-mng-wdm)
                     go to det-dat-mng-140
           else      go to det-dat-mng-160.
       det-dat-mng-140.
      *                  *---------------------------------------------*
      *                  * Se la data e' di fine mese                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Incremento numero mesi                  *
      *                      *-----------------------------------------*
           add       w-det-dat-mng-wmi    to   w-det-dat-mng-wdm      .
      *                      *-----------------------------------------*
      *                      * Aggiustamento se oltre i 12             *
      *                      *-----------------------------------------*
           if        w-det-dat-mng-wdm    >    12
                     subtract 12          from w-det-dat-mng-wdm
                     add   1              to   w-det-dat-mng-wds      .
      *                      *-----------------------------------------*
      *                      * Ricalcolo numero giorni di febbraio     *
      *                      *-----------------------------------------*
           if        w-det-dat-mng-wdm    not  = 02
                     go to det-dat-mng-150.
           move      w-det-dat-mng-wds    to   w-det-dat-mng-wt5      .
           add       1900                 to   w-det-dat-mng-wt5      .
           divide    4                    into w-det-dat-mng-wt5
                                        giving w-det-dat-mng-wt6
                                     remainder w-det-dat-mng-wt7      .
           if        w-det-dat-mng-wt7    not  = zero
                     move  28             to   w-det-dat-mng-wt2 (2)
                     go to det-dat-mng-150.
           divide    400                  into w-det-dat-mng-wt5
                                        giving w-det-dat-mng-wt6
                                     remainder w-det-dat-mng-wt7      .
           if        w-det-dat-mng-wt7    =    zero
                     move  29             to   w-det-dat-mng-wt2 (2)
                     go to det-dat-mng-150.
           divide    100                  into w-det-dat-mng-wt5
                                        giving w-det-dat-mng-wt6
                                     remainder w-det-dat-mng-wt7      .
           if        w-det-dat-mng-wt7    =    zero
                     move  28             to   w-det-dat-mng-wt2 (2)
           else      move  29             to   w-det-dat-mng-wt2 (2)  .
       det-dat-mng-150.
      *                      *-----------------------------------------*
      *                      * Forzatura del giorno di fine mese       *
      *                      *-----------------------------------------*
           move      w-det-dat-mng-wt2
                    (w-det-dat-mng-wdm)   to   w-det-dat-mng-wdg      .
      *                      *-----------------------------------------*
      *                      * Valore in output                        *
      *                      *-----------------------------------------*
           move      w-det-dat-mng-wdt    to   w-det-dat-mng-dto      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     det-dat-mng-999.
       det-dat-mng-160.
      *                  *---------------------------------------------*
      *                  * Se la data non e' di fine mese              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Incremento numero mesi                  *
      *                      *-----------------------------------------*
           add       w-det-dat-mng-wmi    to   w-det-dat-mng-wdm      .
      *                      *-----------------------------------------*
      *                      * Aggiustamento se oltre i 12             *
      *                      *-----------------------------------------*
           if        w-det-dat-mng-wdm    >    12
                     subtract 12          from w-det-dat-mng-wdm
                     add   1              to   w-det-dat-mng-wds      .
      *                      *-----------------------------------------*
      *                      * Ricalcolo numero giorni di febbraio     *
      *                      *-----------------------------------------*
           if        w-det-dat-mng-wdm    not  = 02
                     go to det-dat-mng-170.
           move      w-det-dat-mng-wds    to   w-det-dat-mng-wt5      .
           add       1900                 to   w-det-dat-mng-wt5      .
           divide    4                    into w-det-dat-mng-wt5
                                        giving w-det-dat-mng-wt6
                                     remainder w-det-dat-mng-wt7      .
           if        w-det-dat-mng-wt7    not  = zero
                     move  28             to   w-det-dat-mng-wt2 (2)
                     go to det-dat-mng-170.
           divide    400                  into w-det-dat-mng-wt5
                                        giving w-det-dat-mng-wt6
                                     remainder w-det-dat-mng-wt7      .
           if        w-det-dat-mng-wt7    =    zero
                     move  29             to   w-det-dat-mng-wt2 (2)
                     go to det-dat-mng-170.
           divide    100                  into w-det-dat-mng-wt5
                                        giving w-det-dat-mng-wt6
                                     remainder w-det-dat-mng-wt7      .
           if        w-det-dat-mng-wt7    =    zero
                     move  28             to   w-det-dat-mng-wt2 (2)
           else      move  29             to   w-det-dat-mng-wt2 (2)  .
       det-dat-mng-170.
      *                      *-----------------------------------------*
      *                      * Se il giorno calcolato supera l'ultimo  *
      *                      * giorno del mese, lo si riporta all'ul-  *
      *                      * timo giorno del mese                    *
      *                      *-----------------------------------------*
           if        w-det-dat-mng-wdg    not  > w-det-dat-mng-wt2
                                                (w-det-dat-mng-wdm)
                     go to det-dat-mng-175.
           move      w-det-dat-mng-wt2
                    (w-det-dat-mng-wdm)   to   w-det-dat-mng-wdg      .
       det-dat-mng-175.
      *                      *-----------------------------------------*
      *                      * Data in output                          *
      *                      *-----------------------------------------*
           move      w-det-dat-mng-wdt    to   w-det-dat-mng-dto      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     det-dat-mng-999.
       det-dat-mng-500.
      *              *-------------------------------------------------*
      *              * Se numero giorni di incremento non multiplo di  *
      *              * 30                                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di incremento                         *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-dat-mng-ctr      .
       det-dat-mng-520.
           add       1                    to   w-det-dat-mng-ctr      .
           if        w-det-dat-mng-ctr    >    w-det-dat-mng-ngi
                     go to det-dat-mng-600.
      *                  *---------------------------------------------*
      *                  * Incremento giorno                           *
      *                  *---------------------------------------------*
           add       1                    to   w-det-dat-mng-wdg      .
      *                  *---------------------------------------------*
      *                  * Richiamo funzione di controllo data         *
      *                  *---------------------------------------------*
           move      "CD"                 to   s-ope                  .
           move      w-det-dat-mng-wdt    to   s-dat                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Se la data e' corretta : riciclo            *
      *                  *---------------------------------------------*
           if        s-sts                =    spaces
                     go to det-dat-mng-520.
      *                  *---------------------------------------------*
      *                  * Normalizzazione del giorno ed incremento    *
      *                  * del mese                                    *
      *                  *---------------------------------------------*
           move      1                    to   w-det-dat-mng-wdg      .
           add       1                    to   w-det-dat-mng-wdm      .
      *                  *---------------------------------------------*
      *                  * Se mese corretto : riciclo                  *
      *                  *---------------------------------------------*
           if        w-det-dat-mng-wdm    not  > 12
                     go to det-dat-mng-520.
      *                  *---------------------------------------------*
      *                  * Normalizzazione del mese ed incremento      *
      *                  * dell'anno                                   *
      *                  *---------------------------------------------*
           move      1                    to   w-det-dat-mng-wdm      .
           add       1                    to   w-det-dat-mng-wds      .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     det-dat-mng-520.
       det-dat-mng-600.
      *                  *---------------------------------------------*
      *                  * Data in output                              *
      *                  *---------------------------------------------*
           move      w-det-dat-mng-wdt    to   w-det-dat-mng-dto      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-dat-mng-999.
       det-dat-mng-999.
           exit.

      *    *===========================================================*
      *    * Determinazione saldo di portafoglio cliente alla data     *
      *    *-----------------------------------------------------------*
       det-sdo-gep-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione saldo                           *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-sdo-gep-sdo      .
      *              *-------------------------------------------------*
      *              * Start su [sdb] per debitore                     *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "DBTDTS    "         to   f-key                  .
           move      01                   to   rf-sdb-tip-dbt         .
           move      w-det-sdo-gep-cli    to   rf-sdb-cod-dbt         .
           move      zero                 to   rf-sdb-dts-sdb         .
           move      zero                 to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata                             *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-sdo-gep-900.
       det-sdo-gep-200.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Next su [sdb] per data scadenza                 *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Se fine file                                *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-sdo-gep-900.
       det-sdo-gep-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo debitore                       *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-dbt       not  = 01
                     go to det-sdo-gep-900.
      *                  *---------------------------------------------*
      *                  * Test su codice cliente                      *
      *                  *---------------------------------------------*
           if        rf-sdb-cod-dbt       not  = w-det-sdo-gep-cli
                     go to det-sdo-gep-900.
       det-sdo-gep-400.
      *              *-------------------------------------------------*
      *              * Selezione su codice dipendenza del cliente      *
      *              *-------------------------------------------------*
           if        rf-sdb-dpz-dbt       not  = w-det-sdo-gep-dpz
                     go to det-sdo-gep-200.
      *              *-------------------------------------------------*
      *              * Selezione su data scadenza                      *
      *              *-------------------------------------------------*
           if        rf-sdb-dpz-dbt       not  = w-det-sdo-gep-dpz
                     go to det-sdo-gep-200.
      *
           if        rf-sdb-dts-sdb       =    zero
                     move  rf-sdb-dtr-emi to   w-det-dat-mng-dti
           else      move  rf-sdb-dts-sdb to   w-det-dat-mng-dti      .
      *
           if        w-det-dat-mng-dti    >    rr-dat-rif
                     go to det-sdo-gep-200.
       det-sdo-gep-420.
      *              *-------------------------------------------------*
      *              * Determinazione status scadenza                  *
      *              *-------------------------------------------------*
           move      rr-dat-rif           to   w-det-srd-sdb-drd      .
           perform   det-srd-sdb-000      thru det-srd-sdb-999        .
      *              *-------------------------------------------------*
      *              * Test se scadenza ancora aperta                  *
      *              *-------------------------------------------------*
           if        w-det-srd-sdb-sts    not  = "A"
                     go to det-sdo-gep-200.
      *              *-------------------------------------------------*
      *              * Test se sigla ultima operazione eseguita e' a   *
      *              * spazi                                           *
      *              *-------------------------------------------------*
           if        w-det-srd-sdb-suo    =    spaces
                     go to det-sdo-gep-200.
       det-sdo-gep-440.
      *              *-------------------------------------------------*
      *              * Selezione su status scadenza                    *
      *              *-------------------------------------------------*
       det-sdo-gep-500.
      *              *-------------------------------------------------*
      *              * Aggiornamento saldo cliente                     *
      *              *-------------------------------------------------*
      *                   *--------------------------------------------*
      *                   * Aggiornamento totale importo               *
      *                   *--------------------------------------------*
           add       rf-sdb-imp-sdb       to   w-det-sdo-gep-sdo      .
       det-sdo-gep-800.
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale record [sdb]     *
      *              *-------------------------------------------------*
           go to     det-sdo-gep-200.
       det-sdo-gep-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-sdo-gep-999.
       det-sdo-gep-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice agente          *
      *    *-----------------------------------------------------------*
           copy      "pgm/age/prg/cpy/acmnage0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione codice cliente commerciale *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmndcc0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione codice dipendenza cliente  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoddcc0.acs"                   .
