       Identification division.
       Program-Id.                                 pgep6201           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    gep                 *
      *                                Settore:    cli                 *
      *                                   Fase:    gep620              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 11/03/94    *
      *                       Ultima revisione:    NdK del 05/05/23    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione stampa per il programma gep620   *
      *                                                                *
      *                    Stampa analisi di portafoglio clienti       *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Ragione sociale cliente in uppercase              *
      *            *---------------------------------------------------*
               10  srt-rag-key            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice cliente                                    *
      *            *---------------------------------------------------*
               10  srt-cod-cli            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data scadenza per sort                            *
      *            *---------------------------------------------------*
               10  srt-dts-srt            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data scadenza effettiva contenuta nel file [sdb]  *
      *            *---------------------------------------------------*
               10  srt-dts-eff            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Dipendenza del cliente                            *
      *            *---------------------------------------------------*
               10  srt-dpz-cli            pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Numero scadenza                                   *
      *            *---------------------------------------------------*
               10  srt-num-sdb            pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Tipo scadenza                                     *
      *            *---------------------------------------------------*
               10  srt-tip-sdb            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Segnale Si/No dilazione concordata                *
      *            *---------------------------------------------------*
               10  srt-snx-dlc            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale Si/No contrassegno                        *
      *            *---------------------------------------------------*
               10  srt-snx-cts            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Sigla ultima operazione effettuata sulla scadenza *
      *            *---------------------------------------------------*
               10  srt-sgl-uop            pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Importo scadenza                                  *
      *            *---------------------------------------------------*
               10  srt-imp-sdb            pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale cliente                           *
      *            *---------------------------------------------------*
               10  srt-rag-soc            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Indirizzo cliente                                 *
      *            *---------------------------------------------------*
               10  srt-via-cli            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Localita' cliente                                 *
      *            *---------------------------------------------------*
               10  srt-loc-cli            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Numero di telefono per il cliente                 *
      *            *---------------------------------------------------*
               10  srt-tel-cli            pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Numero di cellulare per il cliente                *
      *            *---------------------------------------------------*
               10  srt-cel-cli            pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Numero di fax per il cliente                      *
      *            *---------------------------------------------------*
               10  srt-fax-cli            pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Codice agente per il cliente                      *
      *            *---------------------------------------------------*
               10  srt-age-cli            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Nominativo agente                                 *
      *            *---------------------------------------------------*
               10  srt-nag-cli            pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Tipo documento di riferimento                     *
      *            *---------------------------------------------------*
               10  srt-tip-ddr            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Numero documento di riferimento                   *
      *            *---------------------------------------------------*
               10  srt-num-ddr            pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Data documento di riferimento                     *
      *            *---------------------------------------------------*
               10  srt-dat-ddr            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Importo documento di riferimento                  *
      *            *---------------------------------------------------*
               10  srt-imp-ddr            pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Numero rata documento di riferimento              *
      *            *---------------------------------------------------*
               10  srt-nra-ddr            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Numero protocollo movimento di fatture clienti    *
      *            *---------------------------------------------------*
               10  srt-prt-fcl            pic  9(09)                  .
      *            *---------------------------------------------------*
      *            * Numero scadenza di origine                        *
      *            *---------------------------------------------------*
               10  srt-nsc-org            pic  9(11)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "gep"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "cli"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "gep620"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pgep6201"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "  STAMPA ANALISI DI PORTAFOGLIO CLIENTI "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records logici                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [sdb]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfsdb"                          .
      *        *-------------------------------------------------------*
      *        * [ddp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfddp"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [age]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/age/fls/rec/rfage"                          .
      *        *-------------------------------------------------------*
      *        * [fit]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/fat/fls/rec/rffit"                          .

      *    *===========================================================*
      *    * Record per le richieste                                   *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Data di riferimento per l'analisi                     *
      *        *-------------------------------------------------------*
           05  rr-dat-rfa                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente                                        *
      *        *-------------------------------------------------------*
           05  rr-cod-cli                 pic  9(07)                  .
           05  rr-cod-cli-rag             pic  x(40)                  .
           05  rr-cod-cli-via             pic  x(40)                  .
           05  rr-cod-cli-loc             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza del cliente                         *
      *        *-------------------------------------------------------*
           05  rr-dpz-cli                 pic  x(04)                  .
           05  rr-dpz-cli-rag             pic  x(40)                  .
           05  rr-dpz-cli-loc             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Tipo di scadenze da includere                         *
      *        *                                                       *
      *        * - 01 : Tutte                                          *
      *        * - 02 : Rim.Dir.,Bonif.,C/C Post.                      *
      *        * - 03 : Scadenze elettroniche                          *
      *        * - 04 : Ric.Banc.,Tratte,Paghero'                      *
      *        * - 05 : Solo Rimesse Dirette                           *
      *        * - 06 : Solo Dilazioni Concordate                      *
      *        * - 07 : Solo Incassi Elettronici                       *
      *        * - 08 : Solo Ri.Ba.                                    *
      *        * - 09 : Solo C.d.O.                                    *
      *        * - 10 : Solo M.Av.                                     *
      *        * - 11 : Solo R.I.D.                                    *
      *        * - 12 : Solo Bonifici Bancari                          *
      *        * - 13 : Solo C/C Postali                               *
      *        * - 14 : Solo Ricevute Bancarie                         *
      *        * - 15 : Solo Tratte                                    *
      *        * - 16 : Solo Paghero'                                  *
      *        *-------------------------------------------------------*
           05  rr-tip-scd                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Selezione su status scadenze                          *
      *        *                                                       *
      *        * - 01 : Sia a scadere che scadute                      *
      *        * - 02 : Solo quelle a scadere                          *
      *        * - 03 : Solo quelle scadute                            *
      *        *-------------------------------------------------------*
           05  rr-sts-scd                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Selezione su status effetti                           *
      *        *                                                       *
      *        * - 01 : Tutti                                          *
      *        * - 02 : Solo quelli in portafoglio                     *
      *        * - 03 : Solo quelli in circolazione                    *
      *        * - 04 : Solo quelli insoluti                           *
      *        *-------------------------------------------------------*
           05  rr-sts-eff                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Tipo evidenziazione                                   *
      *        *                                                       *
      *        * - 01 : Sia la lista che il riepilogo finale           *
      *        * - 02 : Solo la lista delle scadenze                   *
      *        * - 03 : Solo il riepilogo finale                       *
      *        *-------------------------------------------------------*
           05  rr-tip-evd                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Selezione su compensazione                            *
      *        *                                                       *
      *        * - 01 : Nessuna selezione                              *
      *        * - 02 : Solo clienti con accrediti da compensare       *
      *        * - 03 : Solo clienti con scadenze da compensare        *
      *        *-------------------------------------------------------*
           05  rr-sel-cmp                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Salto pagina da effettuare                            *
      *        *                                                       *
      *        * - 01 : No                                             *
      *        * - 02 : Ad ogni cliente                                *
      *        *-------------------------------------------------------*
           05  rr-tip-slp                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Data documento di riferimento min                     *
      *        *-------------------------------------------------------*
           05  rr-ddr-min                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Data documento di riferimento max                     *
      *        *-------------------------------------------------------*
           05  rr-ddr-max                 pic  9(07)                  .

      *    *===========================================================*
      *    * Work-area per personalizzazioni                           *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Personalizzazioni per fase 'gep620'                   *
      *        *-------------------------------------------------------*
           05  w-prs-gep-620.
      *            *---------------------------------------------------*
      *            * Tipo stampa ragione sociale cliente               *
      *            *  - R : Solo ragione sociale                       *
      *            *  - I : Indirizzo completo                         *
      *            *---------------------------------------------------*
               10  w-prs-gep-620-rsc      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Filler di separazione                             *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa numero di telefono del cliente       *
      *            *                                                   *
      *            *  - N : No                                         *
      *            *  - S : Si, telefono fisso                         *
      *            *  - C : Si, telefono cellulare                     *
      *            *  - E : Si, telefono fisso e cellulare             *
      *            *  - F : Si, fax                                    *
      *            *                                                   *
      *            * Considerato solo se il tipo di stampa della ra-   *
      *            * gione sociale e' posto a 'I'                      *
      *            *---------------------------------------------------*
               10  w-prs-gep-620-tel      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Filler di separazione                             *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa nominativo dell'agente cui il cli-   *
      *            * ente e' assegnato                                 *
      *            *  - N : No                                         *
      *            *  - S : Si                                         *
      *            * Considerato solo se il tipo di stampa della ra-   *
      *            * gione sociale e' posto a 'I'                      *
      *            *---------------------------------------------------*
               10  w-prs-gep-620-age      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Filler di separazione                             *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No scadenze a fronte insoluto evidenziate      *
      *            *  - N : No                                         *
      *            *  - S : Si                                         *
      *            *---------------------------------------------------*
               10  w-prs-gep-620-fie      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Filler di separazione                             *
      *            *---------------------------------------------------*
               10  filler                 pic  x(13)                  .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
      *            *---------------------------------------------------*
      *            * Codice cliente                                    *
      *            *---------------------------------------------------*
               10  w-rot-l01-cod-cli      pic  9(07)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcc.
               10  w-let-arc-dcc-flg      pic  x(01)                  .
               10  w-let-arc-dcc-cli      pic  9(07)                  .
               10  w-let-arc-dcc-dpz      pic  x(04)                  .
               10  w-let-arc-dcc-rsu      pic  x(40)                  .
               10  w-let-arc-dcc-rag      pic  x(40)                  .
               10  w-let-arc-dcc-via      pic  x(40)                  .
               10  w-let-arc-dcc-loc      pic  x(40)                  .
               10  w-let-arc-dcc-tel      pic  x(20)                  .
               10  w-let-arc-dcc-cel      pic  x(20)                  .
               10  w-let-arc-dcc-fax      pic  x(20)                  .
               10  w-let-arc-dcc-age      pic  9(07)                  .
               10  w-let-arc-dcc-nag      pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [age]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-age.
               10  w-let-arc-age-flg      pic  x(01)                  .
               10  w-let-arc-age-cod      pic  9(07)                  .
               10  w-let-arc-age-nom      pic  x(20)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per determinazione status scadenza con riferi-   *
      *        * mento ad una certa data                               *
      *        *-------------------------------------------------------*
           05  w-det-srd-sdb.
      *            *---------------------------------------------------*
      *            * Data di riferimento per la determinazione         *
      *            *---------------------------------------------------*
               10  w-det-srd-sdb-drd      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Status determinato                                *
      *            * - Spaces : Status non determinabile               *
      *            * - A      : Scadenza ancora aperta                 *
      *            * - C      : Scadenza ormai chiusa                  *
      *            * - N      : Scadenza non ancora inserita alla data *
      *            *            di riferimento per la determinazione   *
      *            *---------------------------------------------------*
               10  w-det-srd-sdb-sts      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Sigla ultima operazione eseguita sulla scadenza   *
      *            * - Spaces : Nessuna                                *
      *            * - EMI    : Emissione                              *
      *            * - SSC    : Storno                                 *
      *            * - RIS    : Riscossione                            *
      *            * - PAG    : Pagamento                              *
      *            * - CMP    : Compensazione                          *
      *            * - COM    : Composizione distinta                  *
      *            * - PRE    : Presentazione distinta                 *
      *            * - ACT    : Accettazione distinta                  *
      *            * - ACD    : Accredito distinta                     *
      *            * - RSP    : Richiamo della scadenza presentata     *
      *            * - ACS    : Accredito scadenza al dopo incasso     *
      *            * - NBE    : Notizia di buon esito sulla scadenza   *
      *            * - PBE    : Presunto buon esito sulla scadenza     *
      *            * - ISP    : Insoluto sulla scadenza presentata     *
      *            *---------------------------------------------------*
               10  w-det-srd-sdb-suo      pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per determinazione se cliente con accrediti      *
      *        *-------------------------------------------------------*
           05  w-det-dbt-acc.
      *            *---------------------------------------------------*
      *            * Flag di determinazione                            *
      *            *---------------------------------------------------*
               10  w-det-dbt-acc-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero scadenza                                   *
      *            *---------------------------------------------------*
               10  w-det-dbt-acc-num      pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Codice debitore                                   *
      *            *---------------------------------------------------*
               10  w-det-dbt-acc-cod      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Comodi per salvataggio                            *
      *            *---------------------------------------------------*
               10  w-det-dbt-acc-svf      pic  x(01)                  .
               10  w-det-dbt-acc-svc      pic  9(07)                  .
               10  w-det-dbt-acc-ctr      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per determinazione se scadenze da compensare     *
      *        *-------------------------------------------------------*
           05  w-det-scd-cmp.
      *            *---------------------------------------------------*
      *            * Flag di scadenza proveniente da compensazione     *
      *            *---------------------------------------------------*
               10  w-det-scd-cmp-flp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di determinazione                            *
      *            *---------------------------------------------------*
               10  w-det-scd-cmp-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero scadenza                                   *
      *            *---------------------------------------------------*
               10  w-det-scd-cmp-num      pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Data scadenza                                     *
      *            *---------------------------------------------------*
               10  w-det-scd-cmp-dat      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice debitore                                   *
      *            *---------------------------------------------------*
               10  w-det-scd-cmp-cod      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Comodi                                            *
      *            *---------------------------------------------------*
               10  w-det-scd-cmp-ctr      pic  9(07)                  .

      *    *===========================================================*
      *    * Work area per totali                                      *
      *    *-----------------------------------------------------------*
       01  w-tot.
      *        *-------------------------------------------------------*
      *        * Totali generali                                       *
      *        *-------------------------------------------------------*
           05  w-tot-gen.
               10  w-tot-gen-tsc          pic s9(11)                  .
               10  w-tot-gen-tin          pic s9(11)                  .
               10  w-tot-gen-tas          pic s9(11)                  .
               10  w-tot-gen-tci          pic s9(11)                  .
               10  w-tot-gen-teg          pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Totali per cliente                                    *
      *        *-------------------------------------------------------*
           05  w-tot-cli.
               10  w-tot-cli-ctr          pic  9(07)                  .
               10  w-tot-cli-tts occurs 12.
                   15  w-tot-cli-num      pic  9(03)                  .
                   15  w-tot-cli-sca      pic s9(11)                  .
                   15  w-tot-cli-isp      pic s9(11)                  .
                   15  w-tot-cli-asc      pic s9(11)                  .
                   15  w-tot-cli-cir      pic s9(11)                  .
               10  w-tot-cli-tsc          pic s9(11)                  .
               10  w-tot-cli-tin          pic s9(11)                  .
               10  w-tot-cli-tas          pic s9(11)                  .
               10  w-tot-cli-tci          pic s9(11)                  .
               10  w-tot-cli-teg          pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Totali per scadenza                                   *
      *        *-------------------------------------------------------*
           05  w-tot-sdb.
               10  w-tot-sdb-ctr          pic  9(07)                  .

      *    *===========================================================*
      *    * Work area per routine sel-rec-sdb-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-sel-rec-sdb.
           05  w-sel-rec-sdb-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per routine prn-ini-lr1-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-prn-ini-lr1.
           05  w-prn-ini-lr1-ctr          pic  9(03)                  .
           05  w-prn-ini-lr1-x48          pic  x(48)                  .
           05  w-prn-ini-lr1-pnt          pic  9(03)                  .

      *    *===========================================================*
      *    * Work area per routine prn-fin-lr1-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-prn-fin-lr1.
           05  w-prn-fin-lr1-ctr          pic  9(03)                  .
           05  w-prn-fin-lr1-nrn          pic  9(03)                  .

      *    *===========================================================*
      *    * Work area per routine agg-tot-cli-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-agg-tot-cli.
      *        *-------------------------------------------------------*
      *        * Tipo aggiornamento effettuato                         *
      *        * - 01 : Totali scaduto                                 *
      *        * - 02 : Totali insoluti                                *
      *        * - 03 : Totali a scadere                               *
      *        * - 04 : Totali in circolazione                         *
      *        *-------------------------------------------------------*
           05  w-agg-tot-cli-tae          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Indice per tipo scadenza                              *
      *        *-------------------------------------------------------*
           05  w-agg-tot-cli-its          pic  9(02)                  .

      *    *===========================================================*
      *    * Work area per calcolo numero linee residue necessarie     *
      *    *-----------------------------------------------------------*
       01  w-lin-res.
           05  w-lin-res-num-lin          pic  9(03)                  .

      *    *===========================================================*
      *    * Work area per stampa                                      *
      *    *-----------------------------------------------------------*
       01  w-stp.
      *        *-------------------------------------------------------*
      *        * Per stampa importi in valuta base                     *
      *        *-------------------------------------------------------*
           05  w-stp-imp-vlb.
      *            *---------------------------------------------------*
      *            * Valore da stampare                                *
      *            *---------------------------------------------------*
               10  w-stp-imp-vlb-val      pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Posizione di stampa                               *
      *            *---------------------------------------------------*
               10  w-stp-imp-vlb-pos      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per comodo scansione compensazione               *
      *        *-------------------------------------------------------*
           05  w-stp-sdb-srt-ris          pic  9(11)                  .
           05  w-stp-sdb-srt-nrs          pic  9(03)                  .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione contatti         *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/dconarc0.dtl"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-cnt-tit-des-azi      .
           move      40                   to   w-cnt-tit-ctr-azi      .
       int-pag-std-100.
           if        w-cnt-tit-chr-azi
                    (w-cnt-tit-ctr-azi)   =    spaces
                     if     w-cnt-tit-ctr-azi
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-cnt-tit-ctr-tit      .
       int-pag-std-200.
           if        w-cnt-tit-chr-tit
                    (w-cnt-tit-ctr-tit)   =    spaces
                     if     w-cnt-tit-ctr-tit
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-tit      .
           subtract  w-cnt-tit-ctr-tit    from w-cnt-tit-pos-tit      .
           divide    2                    into w-cnt-tit-pos-tit      .
           add       1                    to   w-cnt-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    =    zero
                     move  4              to   w-cnt-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-cnt-tit-ctr-wrk      .
           inspect   w-cnt-tit-num-pag
                                      tallying w-cnt-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-cnt-tit-ctr-wrk    from 27
                                        giving w-cnt-tit-ctr-dep      .
           subtract  w-cnt-tit-ctr-wrk    from 5
                                        giving w-cnt-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-dep      .
           subtract  w-cnt-tit-ctr-dep    from w-cnt-tit-pos-dep      .
           add       1                    to   w-cnt-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-cnt-tit-ctr-azi    to   w-cnt-tit-ctr-wrk      .
           add       2                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-tit
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      w-cnt-tit-pos-tit    to   w-cnt-tit-ctr-wrk      .
           add       w-cnt-tit-ctr-tit    to   w-cnt-tit-ctr-wrk      .
           add       1                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-dep
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-cnt-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-cnt-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-cnt-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-cnt-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni relative alla fase    *
      *              * 'gep620'                                        *
      *              *-------------------------------------------------*
           perform   prs-gep-620-000      thru prs-gep-620-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Caricamento iniziale della personalizzazione relativa al- *
      *    * la fase gestionale 'gep620'                               *
      *    *-----------------------------------------------------------*
       prs-gep-620-000.
      *              *-------------------------------------------------*
      *              * Lettura della personalizzazione                 *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/gep/cli/gep620[per-pgm]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       prs-gep-620-100.
      *              *-------------------------------------------------*
      *              * Memorizzazione dei valori                       *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-gep-620
           else      move  spaces         to   w-prs-gep-620          .
       prs-gep-620-200.
      *              *-------------------------------------------------*
      *              * Regolarizzazione dei valori                     *
      *              *-------------------------------------------------*
       prs-gep-620-210.
      *                  *---------------------------------------------*
      *                  * Tipo stampa ragione sociale                 *
      *                  *---------------------------------------------*
           if        w-prs-gep-620-rsc    not  =    "R" and
                     w-prs-gep-620-rsc    not  =    "I"
                     move  "R"            to   w-prs-gep-620-rsc      .
       prs-gep-620-220.
      *                  *---------------------------------------------*
      *                  * Si/No stampa numero di telefono             *
      *                  *---------------------------------------------*
           if        w-prs-gep-620-rsc    not  =    "I"
                     move  "N"            to   w-prs-gep-620-tel
                     go to prs-gep-620-230.
           if        w-prs-gep-620-tel    not  =    "S" and
                     w-prs-gep-620-tel    not  =    "N" and
                     w-prs-gep-620-tel    not  =    "C" and
                     w-prs-gep-620-tel    not  =    "E" and
                     w-prs-gep-620-tel    not  =    "F"
                     move  "N"            to   w-prs-gep-620-tel      .
       prs-gep-620-230.
      *                  *---------------------------------------------*
      *                  * Si/No stampa numero di telefono             *
      *                  *---------------------------------------------*
           if        w-prs-gep-620-rsc    not  =    "I"
                     move  "N"            to   w-prs-gep-620-age
                     go to prs-gep-620-240.
           if        w-prs-gep-620-age    not  =    "S" and
                     w-prs-gep-620-age    not  =    "N"
                     move  "N"            to   w-prs-gep-620-age      .
       prs-gep-620-240.
      *                  *---------------------------------------------*
      *                  * Si/No scadenze a f/insoluto evidenziate     *
      *                  *---------------------------------------------*
           if        w-prs-gep-620-fie    not  =    "S" and
                     w-prs-gep-620-fie    not  =    "N"
                     move  "N"            to   w-prs-gep-620-fie      .
       prs-gep-620-290.
      *                  *---------------------------------------------*
      *                  * Fine regolarizzazioni                       *
      *                  *---------------------------------------------*
           go to     prs-gep-620-900.
       prs-gep-620-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prs-gep-620-999.
       prs-gep-620-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [fit]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *              *-------------------------------------------------*
      *              * [sdb]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *              *-------------------------------------------------*
      *              * [ddp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofddp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ddp                 .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [fit]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *              *-------------------------------------------------*
      *              * [sdb]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *              *-------------------------------------------------*
      *              * [ddp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofddp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ddp                 .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : Si'                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort                                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   prn-rou-pri-000
                                          thru prn-rou-pri-999        .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [dcc]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * [age]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *                  *---------------------------------------------*
      *                  * Open modulo di determinazione contatti      *
      *                  *---------------------------------------------*
           perform   con-arc-tip-opn-000  thru con-arc-tip-opn-999    .
       stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Ciclo per lettura scadenze se richiesti tutti i *
      *              * clienti                                         *
      *              *-------------------------------------------------*
           if        rr-cod-cli           not  = zero
                     go to stp-srt-inp-500.
      *                  *---------------------------------------------*
      *                  * Start su file [sdb]                         *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "GT"                 to   f-cfr                  .
           move      "DATCHS    "         to   f-key                  .
           move      rr-dat-rfa           to   rf-sdb-dat-chs         .
           move      zero                 to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-200.
       stp-srt-inp-120.
      *                  *---------------------------------------------*
      *                  * Read Next su file [sdb]                     *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-200.
      *                  *---------------------------------------------*
      *                  * Selezioni sul record [sdb]                  *
      *                  *---------------------------------------------*
           perform   sel-rec-sdb-000      thru sel-rec-sdb-999        .
           if        w-sel-rec-sdb-flg    not  = spaces
                     go to stp-srt-inp-120.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcc]                      *
      *                  *---------------------------------------------*
           move      rf-sdb-cod-dbt       to   w-let-arc-dcc-cli      .
           move      spaces               to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                  *---------------------------------------------*
      *                  * Composizione record di Sort                 *
      *                  *---------------------------------------------*
           move      w-let-arc-dcc-rsu    to   srt-rag-key            .
           move      rf-sdb-cod-dbt       to   srt-cod-cli            .
           if        rf-sdb-dts-sdb       =    zero
                     move  rr-dat-rfa     to   srt-dts-srt
                     move  zero           to   srt-dts-eff
           else      move  rf-sdb-dts-sdb to   srt-dts-srt
                     move  rf-sdb-dts-sdb to   srt-dts-eff            .
           move      rf-sdb-dpz-dbt       to   srt-dpz-cli            .
           move      rf-sdb-num-sdb       to   srt-num-sdb            .
           move      rf-sdb-tip-sdb       to   srt-tip-sdb            .
           move      rf-sdb-snx-dlc       to   srt-snx-dlc            .
           move      rf-sdb-snx-cts       to   srt-snx-cts            .
           move      w-det-srd-sdb-suo    to   srt-sgl-uop            .
           move      rf-sdb-imp-sdb       to   srt-imp-sdb            .
           move      w-let-arc-dcc-rag    to   srt-rag-soc            .
           move      w-let-arc-dcc-via    to   srt-via-cli            .
           move      w-let-arc-dcc-loc    to   srt-loc-cli            .
           move      w-let-arc-dcc-tel    to   srt-tel-cli            .
           move      w-let-arc-dcc-cel    to   srt-cel-cli            .
           move      w-let-arc-dcc-fax    to   srt-fax-cli            .
           move      w-let-arc-dcc-age    to   srt-age-cli            .
           move      w-let-arc-dcc-nag    to   srt-nag-cli            .
           move      rf-sdb-tip-ddr       to   srt-tip-ddr            .
           move      rf-sdb-num-ddr       to   srt-num-ddr            .
           move      rf-sdb-dat-ddr       to   srt-dat-ddr            .
           move      rf-sdb-imp-ddr       to   srt-imp-ddr            .
           move      rf-sdb-nra-ddr       to   srt-nra-ddr            .
           move      rf-sdb-prt-fcl       to   srt-prt-fcl            .
           move      rf-sdb-nsc-org       to   srt-nsc-org            .
      *                      *-----------------------------------------*
      *                      * Rilascio del record al Sort             *
      *                      *-----------------------------------------*
           release   srt-rec                                          .
      *                      *-----------------------------------------*
      *                      * Riciclo su Read Next [sdb]              *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-120.
       stp-srt-inp-200.
      *                      *-----------------------------------------*
      *                      * Uscita a close files                    *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-900.
       stp-srt-inp-500.
      *              *-------------------------------------------------*
      *              * Ciclo per lettura scadenze se richiesto un solo *
      *              * cliente                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Start su file [sdb]                         *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "DBTDTS    "         to   f-key                  .
           move      01                   to   rf-sdb-tip-dbt         .
           move      rr-cod-cli           to   rf-sdb-cod-dbt         .
           move      zero                 to   rf-sdb-dts-sdb         .
           move      zero                 to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-600.
       stp-srt-inp-520.
      *                  *---------------------------------------------*
      *                  * Read Next su file [sdb]                     *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-600.
      *                  *---------------------------------------------*
      *                  * Test sul massimo                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su tipo debitore                   *
      *                      *-----------------------------------------*
           if        rf-sdb-tip-dbt       not  = 01
                     go to stp-srt-inp-600.
      *                      *-----------------------------------------*
      *                      * Test su codice debitore                 *
      *                      *-----------------------------------------*
           if        rf-sdb-cod-dbt       not  = rr-cod-cli
                     go to stp-srt-inp-600.
       stp-srt-inp-540.
      *                  *---------------------------------------------*
      *                  * Selezioni sul record [sdb]                  *
      *                  *---------------------------------------------*
           perform   sel-rec-sdb-000      thru sel-rec-sdb-999        .
           if        w-sel-rec-sdb-flg    not  = spaces
                     go to stp-srt-inp-520.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcc]                      *
      *                  *---------------------------------------------*
           move      rf-sdb-cod-dbt       to   w-let-arc-dcc-cli      .
           move      spaces               to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                  *---------------------------------------------*
      *                  * Composizione record di Sort                 *
      *                  *---------------------------------------------*
           move      w-let-arc-dcc-rsu    to   srt-rag-key            .
           move      rf-sdb-cod-dbt       to   srt-cod-cli            .
           if        rf-sdb-dts-sdb       =    zero
                     move  rr-dat-rfa     to   srt-dts-srt
                     move  zero           to   srt-dts-eff
           else      move  rf-sdb-dts-sdb to   srt-dts-srt
                     move  rf-sdb-dts-sdb to   srt-dts-eff            .
           move      rf-sdb-dpz-dbt       to   srt-dpz-cli            .
           move      rf-sdb-num-sdb       to   srt-num-sdb            .
           move      rf-sdb-tip-sdb       to   srt-tip-sdb            .
           move      rf-sdb-snx-dlc       to   srt-snx-dlc            .
           move      rf-sdb-snx-cts       to   srt-snx-cts            .
           move      w-det-srd-sdb-suo    to   srt-sgl-uop            .
           move      rf-sdb-imp-sdb       to   srt-imp-sdb            .
           move      w-let-arc-dcc-rag    to   srt-rag-soc            .
           move      w-let-arc-dcc-via    to   srt-via-cli            .
           move      w-let-arc-dcc-loc    to   srt-loc-cli            .
           move      w-let-arc-dcc-tel    to   srt-tel-cli            .
           move      w-let-arc-dcc-cel    to   srt-cel-cli            .
           move      w-let-arc-dcc-fax    to   srt-fax-cli            .
           move      w-let-arc-dcc-age    to   srt-age-cli            .
           move      w-let-arc-dcc-nag    to   srt-nag-cli            .
           move      rf-sdb-tip-ddr       to   srt-tip-ddr            .
           move      rf-sdb-num-ddr       to   srt-num-ddr            .
           move      rf-sdb-dat-ddr       to   srt-dat-ddr            .
           move      rf-sdb-imp-ddr       to   srt-imp-ddr            .
           move      rf-sdb-nra-ddr       to   srt-nra-ddr            .
           move      rf-sdb-prt-fcl       to   srt-prt-fcl            .
           move      rf-sdb-nsc-org       to   srt-nsc-org            .
      *                      *-----------------------------------------*
      *                      * Rilascio del record al Sort             *
      *                      *-----------------------------------------*
           release   srt-rec                                          .
      *                      *-----------------------------------------*
      *                      * Riciclo su Read Next [sdb]              *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-520.
       stp-srt-inp-600.
      *                      *-----------------------------------------*
      *                      * Uscita a close files                    *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-900.
       stp-srt-inp-900.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [dcc]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * [age]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *                  *---------------------------------------------*
      *                  * Close modulo di determinazione contatti     *
      *                  *---------------------------------------------*
           perform   con-arc-tip-cls-000  thru con-arc-tip-cls-999    .
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Selezioni su record [sdb]                                 *
      *    *-----------------------------------------------------------*
       sel-rec-sdb-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-sel-rec-sdb-flg      .
      *              *-------------------------------------------------*
      *              * Test su tipo debitore                           *
      *              *-------------------------------------------------*
           if        rf-sdb-tip-dbt       not  = 01
                     go to sel-rec-sdb-900.
      *              *-------------------------------------------------*
      *              * Selezione su codice dipendenza del cliente      *
      *              *-------------------------------------------------*
           if        rr-dpz-cli           =    "*   "
                     go to sel-rec-sdb-100.
           if        rf-sdb-dpz-dbt       not  = rr-dpz-cli
                     go to sel-rec-sdb-900.
       sel-rec-sdb-100.
      *              *-------------------------------------------------*
      *              * Selezione su tipo scadenza                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo scadenza    *
      *                  *---------------------------------------------*
           go to     sel-rec-sdb-101
                     sel-rec-sdb-102
                     sel-rec-sdb-103
                     sel-rec-sdb-104
                     sel-rec-sdb-105
                     sel-rec-sdb-106
                     sel-rec-sdb-107
                     sel-rec-sdb-108
                     sel-rec-sdb-109
                     sel-rec-sdb-110
                     sel-rec-sdb-111
                     sel-rec-sdb-112
                     sel-rec-sdb-113
                     sel-rec-sdb-114
                     sel-rec-sdb-115
                     sel-rec-sdb-116
                     depending            on   rr-tip-scd             .
       sel-rec-sdb-101.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Tutte                       *
      *                  *---------------------------------------------*
           go to     sel-rec-sdb-200.
       sel-rec-sdb-102.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Rim.Dir.,Bonif.,C/C Post.   *
      *                  *---------------------------------------------*
           if       (rf-sdb-tip-sdb       not  = 01 or
                     rf-sdb-snx-dlc       not  = "N" ) and
                     rf-sdb-tip-sdb       not  = 07    and
                     rf-sdb-tip-sdb       not  = 08
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-103.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Scadenze elettroniche       *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 02 and
                     rf-sdb-tip-sdb       not  = 03 and
                     rf-sdb-tip-sdb       not  = 04 and
                     rf-sdb-tip-sdb       not  = 05 and
                     rf-sdb-tip-sdb       not  = 06
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-104.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Ric.Banc.,Tratte,Paghero'   *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 09 and
                     rf-sdb-tip-sdb       not  = 10 and
                     rf-sdb-tip-sdb       not  = 11
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-105.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Solo Rimesse Dirette        *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 01  or
                     rf-sdb-snx-dlc       not  = "N"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-106.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Solo Dilazioni Concordate   *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 01  or
                     rf-sdb-snx-dlc       not  = "S"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-107.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Solo Incassi Elettronici    *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 02
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-108.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Solo Ri.Ba.                 *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 03
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-109.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Solo C.d.O.                 *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 04
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-110.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Solo M.Av.                  *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 05
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-111.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Solo R.I.D.                 *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 06
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-112.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Solo Bonifici Bancari       *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 07
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-113.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Solo C/C Postali            *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 08
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-114.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Solo Ricevute Bancarie      *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 09
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-115.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Solo Tratte                 *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 10
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-116.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza : Solo Paghero'               *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 11
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-200.
       sel-rec-sdb-200.
      *              *-------------------------------------------------*
      *              * Determinazione status scadenza                  *
      *              *-------------------------------------------------*
           move      rr-dat-rfa           to   w-det-srd-sdb-drd      .
           perform   det-srd-sdb-000      thru det-srd-sdb-999        .
      *              *-------------------------------------------------*
      *              * Test se scadenza ancora aperta                  *
      *              *-------------------------------------------------*
           if        w-det-srd-sdb-sts    not  = "A"
                     go to sel-rec-sdb-900.
      *              *-------------------------------------------------*
      *              * Test se sigla ultima operazione eseguita e' a   *
      *              * spazi                                           *
      *              *-------------------------------------------------*
           if        w-det-srd-sdb-suo    =    spaces
                     go to sel-rec-sdb-900.
       sel-rec-sdb-300.
      *              *-------------------------------------------------*
      *              * Selezione su status scadenza                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se Rimesse Dirette, Bonifici o C/C Postali  *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 01 and
                     rf-sdb-tip-sdb       not  = 07 and
                     rf-sdb-tip-sdb       not  = 08
                     go to sel-rec-sdb-350.
      *                  *---------------------------------------------*
      *                  * Test se richiesti effetti in portafoglio,   *
      *                  * in circolazione o insoluti                  *
      *                  *---------------------------------------------*
           if        rr-sts-eff           not  = 01
                     go to sel-rec-sdb-900.
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione della selezione su   *
      *                  * status scadenze                             *
      *                  *---------------------------------------------*
           go to     sel-rec-sdb-301
                     sel-rec-sdb-302
                     sel-rec-sdb-303
                     depending            on   rr-sts-scd             .
       sel-rec-sdb-301.
      *                  *---------------------------------------------*
      *                  * Scadenze sia a scadere che scadute          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nessuna selezione                       *
      *                      *-----------------------------------------*
           go to     sel-rec-sdb-400.
       sel-rec-sdb-302.
      *                  *---------------------------------------------*
      *                  * Solo quelle a scadere                       *
      *                  *---------------------------------------------*
           if        rf-sdb-dts-sdb       not  >  rr-dat-rfa
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-400.
       sel-rec-sdb-303.
      *                  *---------------------------------------------*
      *                  * Solo quelle scadute                         *
      *                  *---------------------------------------------*
           if        rf-sdb-dts-sdb       >    rr-dat-rfa
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-400.
       sel-rec-sdb-350.
      *              *-------------------------------------------------*
      *              * Selezione su status effetti                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione della selezione su   *
      *                  * status effetti                              *
      *                  *---------------------------------------------*
           go to     sel-rec-sdb-351
                     sel-rec-sdb-352
                     sel-rec-sdb-353
                     sel-rec-sdb-354
                     depending            on   rr-sts-eff             .
       sel-rec-sdb-351.
      *                  *---------------------------------------------*
      *                  * Effetti sia in portafoglio che in circola-  *
      *                  * zione                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nessuna selezione                       *
      *                      *-----------------------------------------*
           go to     sel-rec-sdb-400.
       sel-rec-sdb-352.
      *                  *---------------------------------------------*
      *                  * Solo effetti in portafoglio                 *
      *                  *---------------------------------------------*
           if        w-det-srd-sdb-suo    =    "PRE" or
                     w-det-srd-sdb-suo    =    "ACT" or
                     w-det-srd-sdb-suo    =    "ACD"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-400.
       sel-rec-sdb-353.
      *                  *---------------------------------------------*
      *                  * Solo effetti in circolazione                *
      *                  *---------------------------------------------*
           if        w-det-srd-sdb-suo    not  = "PRE" and
                     w-det-srd-sdb-suo    not  = "ACT" and
                     w-det-srd-sdb-suo    not  = "ACD"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-400.
       sel-rec-sdb-354.
      *                  *---------------------------------------------*
      *                  * Solo effetti insoluti                       *
      *                  *---------------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to sel-rec-sdb-900.
           go to     sel-rec-sdb-400.
       sel-rec-sdb-400.
      *              *-------------------------------------------------*
      *              * Selezione su data di riferimento min e max      *
      *              *-------------------------------------------------*
           if        rf-sdb-dat-ddr       =    zero
                     go to sel-rec-sdb-800.
           if        rr-ddr-min           =    zero
                     go to sel-rec-sdb-450.
           if        rf-sdb-dat-ddr       <    rr-ddr-min 
                     go to sel-rec-sdb-900.
       sel-rec-sdb-450.
           if        rr-ddr-max           =    zero
                     go to sel-rec-sdb-800.
           if        rf-sdb-dat-ddr       >    rr-ddr-max 
                     go to sel-rec-sdb-900.
       sel-rec-sdb-800.
      *              *-------------------------------------------------*
      *              * Uscita per selezione superata                   *
      *              *-------------------------------------------------*
           go to     sel-rec-sdb-999.
       sel-rec-sdb-900.
      *              *-------------------------------------------------*
      *              * Uscita per selezione non superata               *
      *              *-------------------------------------------------*
           move      "#"                  to   w-sel-rec-sdb-flg      .
       sel-rec-sdb-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Normalizzazione preliminare                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-dbt-acc-svf      .
           move      zero                 to   w-det-dbt-acc-svc      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessuna registrazione entro i limiti assegnati !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-prn-flg-sub
                            go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-100.
      *              *-------------------------------------------------*
      *              * Eventuale selezione su compensazioni            *
      *              *-------------------------------------------------*
           if        rr-sel-cmp          =     01
                     go to prn-sel-rec-800.
           if        rr-sel-cmp          =     02
                     go to prn-sel-rec-200
           else      go to prn-sel-rec-300.
       prn-sel-rec-200.
      *              *-------------------------------------------------*
      *              * Solo clienti con accrediti                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Per il cliente della scadenza in corso di   *
      *                  * trattamento, si controlla se esistono sca-  *
      *                  * denze relative a note di accredito          *
      *                  *---------------------------------------------*
           move      srt-num-sdb          to   w-det-dbt-acc-num      .
           move      srt-cod-cli          to   w-det-dbt-acc-cod      .
           perform   det-dbt-acc-000      thru det-dbt-acc-999        .
           if        w-det-dbt-acc-flg    not  = spaces
                     go to prn-sel-rec-900.
      *                  *---------------------------------------------*
      *                  * Selezione superata                          *
      *                  *---------------------------------------------*
           go to     prn-sel-rec-800.
       prn-sel-rec-300.
      *              *-------------------------------------------------*
      *              * Solo scadenze a parita' di data                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Per la scadenza in corso di trattamento si  *
      *                  * controlla se esistono scadenze con la stes- *
      *                  * sa data                                     *
      *                  *---------------------------------------------*
           move      srt-num-sdb          to   w-det-scd-cmp-num      .
           move      srt-dts-srt          to   w-det-scd-cmp-dat      .
           move      srt-cod-cli          to   w-det-scd-cmp-cod      .
           perform   det-scd-cmp-000      thru det-scd-cmp-999        .
           if        w-det-scd-cmp-flg    not  = spaces
                     go to prn-sel-rec-900.
      *                  *---------------------------------------------*
      *                  * Selezione superata                          *
      *                  *---------------------------------------------*
           go to     prn-sel-rec-800.
       prn-sel-rec-800.
      *              *-------------------------------------------------*
      *              * Uscita per selezioni superate                   *
      *              *-------------------------------------------------*
           go to     prn-sel-rec-999.
       prn-sel-rec-900.
      *              *-------------------------------------------------*
      *              * Uscita per selezioni non superate               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita                              *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-prn-flg-sub      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-sel-rec-999.
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
      *              *-------------------------------------------------*
      *              * Codice cliente                                  *
      *              *-------------------------------------------------*
           move      srt-cod-cli          to   w-rot-l01-cod-cli      .
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Azzeramento contatore clienti stampati          *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-cli-ctr          .
      *              *-------------------------------------------------*
      *              * Azzeramento totali generali                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-gen-tsc          .
           move      zero                 to   w-tot-gen-tin          .
           move      zero                 to   w-tot-gen-tas          .
           move      zero                 to   w-tot-gen-tci          .
           move      zero                 to   w-tot-gen-teg          .
      *              *-------------------------------------------------*
      *              * Intestazione foglio                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Stampa totale generale                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se totale generale da stampare         *
      *                  *---------------------------------------------*
           if        rr-tip-slp           =    02
                     go to prn-fin-cic-999.
           if        rr-tip-evd           not  = 01 and
                     rr-tip-evd           not  = 03
                     go to prn-fin-cic-999.
           if        w-tot-cli-ctr        not  > 1
                     go to prn-fin-cic-999.
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    4
                     go to prn-fin-cic-200.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-fin-cic-999.
       prn-fin-cic-200.
      *                  *---------------------------------------------*
      *                  * 1. linea per totale generale                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinee subordinate                  *
      *                      *-----------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       03
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "            ================  ============== =====
      -              "========= ============== ==============      =====
      -              "================================"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 2. linea per totale generale                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa prompt                           *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      16                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      013                  to   p-pos                  .
           move      "Totale generale "   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa totale scaduto                   *
      *                      *-----------------------------------------*
           move      w-tot-gen-tsc        to   w-stp-imp-vlb-val      .
           move      030                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                      *-----------------------------------------*
      *                      * Stampa totale insoluto                  *
      *                      *-----------------------------------------*
           move      w-tot-gen-tin        to   w-stp-imp-vlb-val      .
           move      045                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                      *-----------------------------------------*
      *                      * Stampa totale a scadere                 *
      *                      *-----------------------------------------*
           move      w-tot-gen-tas        to   w-stp-imp-vlb-val      .
           move      060                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                      *-----------------------------------------*
      *                      * Stampa totale in circolazione           *
      *                      *-----------------------------------------*
           move      w-tot-gen-tci        to   w-stp-imp-vlb-val      .
           move      075                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                      *-----------------------------------------*
      *                      * Stampa esposizione globale              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      21                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      096                  to   p-pos                  .
           move      "Esposizione globale :"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Valore                              *
      *                          *-------------------------------------*
           move      w-tot-gen-teg        to   w-stp-imp-vlb-val      .
           move      118                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * 3. linea per totale generale                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "            ================  ============== =====
      -              "========= ============== ==============      =====
      -              "================================"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Inizializzazione totali per tipo scadenza       *
      *              *-------------------------------------------------*
           move      zero                 to   w-prn-ini-lr1-ctr      .
       prn-ini-lr1-100.
           add       1                    to   w-prn-ini-lr1-ctr      .
           if        w-prn-ini-lr1-ctr    >    12
                     go to prn-ini-lr1-120.
           move      zero                 to   w-tot-cli-num
                                              (w-prn-ini-lr1-ctr)     .
           move      zero                 to   w-tot-cli-sca
                                              (w-prn-ini-lr1-ctr)     .
           move      zero                 to   w-tot-cli-isp
                                              (w-prn-ini-lr1-ctr)     .
           move      zero                 to   w-tot-cli-asc
                                              (w-prn-ini-lr1-ctr)     .
           move      zero                 to   w-tot-cli-cir
                                              (w-prn-ini-lr1-ctr)     .
           go to     prn-ini-lr1-100.
       prn-ini-lr1-120.
      *              *-------------------------------------------------*
      *              * Inizializzazione totali cliente                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-cli-tsc          .
           move      zero                 to   w-tot-cli-tin          .
           move      zero                 to   w-tot-cli-tas          .
           move      zero                 to   w-tot-cli-tci          .
           move      zero                 to   w-tot-cli-teg          .
      *              *-------------------------------------------------*
      *              * Azzeramento contatore scadenze stampate         *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-sdb-ctr          .
      *              *-------------------------------------------------*
      *              * Aggiornamento contatore clienti stampati        *
      *              *-------------------------------------------------*
           add       1                    to   w-tot-cli-ctr          .
       prn-ini-lr1-200.
      *              *-------------------------------------------------*
      *              * Stampa ragione sociale del cliente              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo salto pa-   *
      *                  * gina                                        *
      *                  *---------------------------------------------*
           if        rr-tip-slp           =    01
                     go to prn-ini-lr1-210
           else if   rr-tip-slp           =    02
                     go to prn-ini-lr1-220.
       prn-ini-lr1-210.
      *                  *---------------------------------------------*
      *                  * Tipo salto pagina : No                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se righe residue sufficienti, a    *
      *                      * seconda se si deve stampare la sola ra- *
      *                      * gione sociale o l'indirizzo completo,   *
      *                      * e numero di telefono e/o agente         *
      *                      *-----------------------------------------*
           move      11                   to   w-lin-res-num-lin      .
           if        w-prs-gep-620-rsc    =    "I"
                     add   2              to   w-lin-res-num-lin      .
           if        w-prs-gep-620-tel    =    "S" or
                     w-prs-gep-620-tel    =    "C" or
                     w-prs-gep-620-tel    =    "F"
                     add   1              to   w-lin-res-num-lin      .
           if        w-prs-gep-620-tel    =    "E"
                     add   2              to   w-lin-res-num-lin      .
           if        w-prs-gep-620-age    =    "S"
                     add   1              to   w-lin-res-num-lin      .
      *
           if        p-res                >    w-lin-res-num-lin
                     go to prn-ini-lr1-300
           else      go to prn-ini-lr1-215.
       prn-ini-lr1-215.
      *                      *-----------------------------------------*
      *                      * Reintestazione                          *
      *                      *-----------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     prn-ini-lr1-300.
       prn-ini-lr1-220.
      *                  *---------------------------------------------*
      *                  * Tipo salto pagina : Ad ogni cliente         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Reintestazione                          *
      *                      *-----------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     prn-ini-lr1-300.
       prn-ini-lr1-300.
      *                  *---------------------------------------------*
      *                  * Interlinee subordinate                      *
      *                  *---------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       03
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr1-350.
      *                  *---------------------------------------------*
      *                  * Trattini superiori                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      48                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      043                  to   p-pos                  .
           move      all "="              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr1-400.
      *                  *---------------------------------------------*
      *                  * Ragione sociale cliente                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-prn-ini-lr1-x48      .
           move      1                    to   w-prn-ini-lr1-pnt      .
      *                          *-------------------------------------*
      *                          * Codice                              *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing                         *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      srt-cod-cli          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * String                          *
      *                              *---------------------------------*
           string    p-edt
                                delimited by   spaces
                                          into w-prn-ini-lr1-x48
                                  with pointer w-prn-ini-lr1-pnt      .
      *                          *-------------------------------------*
      *                          * Ragione sociale cliente             *
      *                          *-------------------------------------*
           string    " "
                                delimited by   size
                     srt-rag-soc
                                delimited by   size
                                          into w-prn-ini-lr1-x48
                                  with pointer w-prn-ini-lr1-pnt      .
      *                          *-------------------------------------*
      *                          * Determinazione numero spazi in coda *
      *                          *-------------------------------------*
           move      zero                 to   w-prn-ini-lr1-pnt      .
           inspect   w-prn-ini-lr1-x48
                                      tallying w-prn-ini-lr1-pnt
                                  for trailing spaces                 .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           subtract  48                   from w-prn-ini-lr1-pnt
                                        giving p-car                  .
           move      p-lnr                to   p-lin                  .
           divide    2                    into w-prn-ini-lr1-pnt
                                        giving p-pos                  .
           add       43                   to   p-pos                  .
           move      w-prn-ini-lr1-x48    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr1-450.
      *                  *---------------------------------------------*
      *                  * Se deve essere stampata solo la ragione so- *
      *                  * ciale e non l'indirizzo completo : a stam-  *
      *                  * pa trattini di chiusura                     *
      *                  *---------------------------------------------*
           if        w-prs-gep-620-rsc    not  = "I"
                     go to prn-ini-lr1-800.
      *                  *---------------------------------------------*
      *                  * Indirizzo                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
           move      srt-via-cli          to   w-prn-ini-lr1-x48      .
      *                          *-------------------------------------*
      *                          * Determinazione numero spazi in coda *
      *                          *-------------------------------------*
           move      zero                 to   w-prn-ini-lr1-pnt      .
           inspect   w-prn-ini-lr1-x48
                                      tallying w-prn-ini-lr1-pnt
                                  for trailing spaces                 .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           subtract  48                   from w-prn-ini-lr1-pnt
                                        giving p-car                  .
           move      p-lnr                to   p-lin                  .
           divide    2                    into w-prn-ini-lr1-pnt
                                        giving p-pos                  .
           add       43                   to   p-pos                  .
           move      w-prn-ini-lr1-x48    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Localita'                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
           move      srt-loc-cli          to   w-prn-ini-lr1-x48      .
      *                          *-------------------------------------*
      *                          * Determinazione numero spazi in coda *
      *                          *-------------------------------------*
           move      zero                 to   w-prn-ini-lr1-pnt      .
           inspect   w-prn-ini-lr1-x48
                                      tallying w-prn-ini-lr1-pnt
                                  for trailing spaces                 .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           subtract  48                   from w-prn-ini-lr1-pnt
                                        giving p-car                  .
           move      p-lnr                to   p-lin                  .
           divide    2                    into w-prn-ini-lr1-pnt
                                        giving p-pos                  .
           add       43                   to   p-pos                  .
           move      w-prn-ini-lr1-x48    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr1-500.
      *                  *---------------------------------------------*
      *                  * Se non deve essere stampato il numero di    *
      *                  * telefono : continuazione                    *
      *                  *---------------------------------------------*
           if        w-prs-gep-620-tel    not  = "S" and
                     w-prs-gep-620-tel    not  = "E"
                     go to prn-ini-lr1-510.
      *                  *---------------------------------------------*
      *                  * Se il numero di telefono e' a spaces :      *
      *                  * continuazione                               *
      *                  *---------------------------------------------*
           if        srt-tel-cli          =    spaces
                     go to prn-ini-lr1-510.
      *                  *---------------------------------------------*
      *                  * Numero di telefono                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-prn-ini-lr1-x48      .
           string    "Telefono: "
                                delimited by   size
                     srt-tel-cli
                                delimited by   size
                                          into w-prn-ini-lr1-x48      .
      *                          *-------------------------------------*
      *                          * Determinazione numero spazi in coda *
      *                          *-------------------------------------*
           move      zero                 to   w-prn-ini-lr1-pnt      .
           inspect   w-prn-ini-lr1-x48
                                      tallying w-prn-ini-lr1-pnt
                                  for trailing spaces                 .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           subtract  48                   from w-prn-ini-lr1-pnt
                                        giving p-car                  .
           move      p-lnr                to   p-lin                  .
           divide    2                    into w-prn-ini-lr1-pnt
                                        giving p-pos                  .
           add       43                   to   p-pos                  .
           move      w-prn-ini-lr1-x48    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr1-510.
      *                  *---------------------------------------------*
      *                  * Se non deve essere stampato il numero di    *
      *                  * cellulare : continuazione                   *
      *                  *---------------------------------------------*
           if        w-prs-gep-620-tel    not  = "C" and
                     w-prs-gep-620-tel    not  = "E"
                     go to prn-ini-lr1-520.
      *                  *---------------------------------------------*
      *                  * Se il numero di cellulare e' a spaces :     *
      *                  * continuazione                               *
      *                  *---------------------------------------------*
           if        srt-cel-cli          =    spaces
                     go to prn-ini-lr1-520.
      *                  *---------------------------------------------*
      *                  * Numero di cellulare                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-prn-ini-lr1-x48      .
           string    "Cellulare: "
                                delimited by   size
                     srt-cel-cli
                                delimited by   size
                                          into w-prn-ini-lr1-x48      .
      *                          *-------------------------------------*
      *                          * Determinazione numero spazi in coda *
      *                          *-------------------------------------*
           move      zero                 to   w-prn-ini-lr1-pnt      .
           inspect   w-prn-ini-lr1-x48
                                      tallying w-prn-ini-lr1-pnt
                                  for trailing spaces                 .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           subtract  48                   from w-prn-ini-lr1-pnt
                                        giving p-car                  .
           move      p-lnr                to   p-lin                  .
           divide    2                    into w-prn-ini-lr1-pnt
                                        giving p-pos                  .
           add       43                   to   p-pos                  .
           move      w-prn-ini-lr1-x48    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr1-520.
      *                  *---------------------------------------------*
      *                  * Se non deve essere stampato il numero di    *
      *                  * fax : continuazione                         *
      *                  *---------------------------------------------*
           if        w-prs-gep-620-tel    not  = "F"
                     go to prn-ini-lr1-550.
      *                  *---------------------------------------------*
      *                  * Se il numero di fax e' a spaces :           *
      *                  * continuazione                               *
      *                  *---------------------------------------------*
           if        srt-fax-cli          =    spaces
                     go to prn-ini-lr1-550.
      *                  *---------------------------------------------*
      *                  * Numero di telefono                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-prn-ini-lr1-x48      .
           string    "Fax: "
                                delimited by   size
                     srt-fax-cli
                                delimited by   size
                                          into w-prn-ini-lr1-x48      .
      *                          *-------------------------------------*
      *                          * Determinazione numero spazi in coda *
      *                          *-------------------------------------*
           move      zero                 to   w-prn-ini-lr1-pnt      .
           inspect   w-prn-ini-lr1-x48
                                      tallying w-prn-ini-lr1-pnt
                                  for trailing spaces                 .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           subtract  48                   from w-prn-ini-lr1-pnt
                                        giving p-car                  .
           move      p-lnr                to   p-lin                  .
           divide    2                    into w-prn-ini-lr1-pnt
                                        giving p-pos                  .
           add       43                   to   p-pos                  .
           move      w-prn-ini-lr1-x48    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr1-550.
      *                  *---------------------------------------------*
      *                  * Se non deve essere stampato il nome agen-   *
      *                  * te : continuazione                          *
      *                  *---------------------------------------------*
           if        w-prs-gep-620-age    not  = "S"
                     go to prn-ini-lr1-800.
      *                  *---------------------------------------------*
      *                  * Se il nome dell'agente e' a spaces : conti- *
      *                  * nuazione                                    *
      *                  *---------------------------------------------*
           if        srt-nag-cli          =    spaces
                     go to prn-ini-lr1-800.
      *                  *---------------------------------------------*
      *                  * Nome agente                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-prn-ini-lr1-x48      .
           string    "Agente: "
                                delimited by   size
                     srt-nag-cli
                                delimited by   size
                                          into w-prn-ini-lr1-x48      .
      *                          *-------------------------------------*
      *                          * Determinazione numero spazi in coda *
      *                          *-------------------------------------*
           move      zero                 to   w-prn-ini-lr1-pnt      .
           inspect   w-prn-ini-lr1-x48
                                      tallying w-prn-ini-lr1-pnt
                                  for trailing spaces                 .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           subtract  48                   from w-prn-ini-lr1-pnt
                                        giving p-car                  .
           move      p-lnr                to   p-lin                  .
           divide    2                    into w-prn-ini-lr1-pnt
                                        giving p-pos                  .
           add       43                   to   p-pos                  .
           move      w-prn-ini-lr1-x48    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr1-800.
      *                  *---------------------------------------------*
      *                  * Trattini inferiori                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      48                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      043                  to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa fincatura per dettaglio              *
      *                  *---------------------------------------------*
           perform   stp-fnc-det-000      thru stp-fnc-det-999        .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Aggiornamento totali generali                   *
      *              *-------------------------------------------------*
           add       w-tot-cli-tsc        to   w-tot-gen-tsc          .
           add       w-tot-cli-tin        to   w-tot-gen-tin          .
           add       w-tot-cli-tas        to   w-tot-gen-tas          .
           add       w-tot-cli-tci        to   w-tot-gen-tci          .
           add       w-tot-cli-teg        to   w-tot-gen-teg          .
      *              *-------------------------------------------------*
      *              * Stampa totale per cliente                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se totale per cliente da stampare      *
      *                  *---------------------------------------------*
           if        rr-tip-evd           not  = 01 and
                     rr-tip-evd           not  = 03
                     go to prn-fin-lr1-999.
       prn-fin-lr1-100.
      *                  *---------------------------------------------*
      *                  * Determinazione numero righe necessario      *
      *                  *---------------------------------------------*
           move      03                   to   w-prn-fin-lr1-nrn      .
           move      zero                 to   w-prn-fin-lr1-ctr      .
       prn-fin-lr1-120.
           add       1                    to   w-prn-fin-lr1-ctr      .
           if        w-prn-fin-lr1-ctr    >    12
                     go to prn-fin-lr1-140.
           if        w-tot-cli-num
                    (w-prn-fin-lr1-ctr)   not  = zero
                     add   1              to   w-prn-fin-lr1-nrn      .
           go to     prn-fin-lr1-120.
       prn-fin-lr1-140.
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    w-prn-fin-lr1-nrn
                     go to prn-fin-lr1-200.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-fin-lr1-999.
       prn-fin-lr1-200.
      *                  *---------------------------------------------*
      *                  * 1. linea trattini per totale cliente        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se da stampare                     *
      *                      *-----------------------------------------*
           if        rr-tip-evd           =    03
                     go to prn-fin-lr1-300.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "            --------          -------------- -----
      -              "--------- -------------- --------------           
      -              "                                "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-fin-lr1-300.
      *                  *---------------------------------------------*
      *                  * Totali per tipo scadenza                    *
      *                  *---------------------------------------------*
           move      zero                 to   w-prn-fin-lr1-ctr      .
       prn-fin-lr1-320.
           add       1                    to   w-prn-fin-lr1-ctr      .
           if        w-prn-fin-lr1-ctr    >    12
                     go to prn-fin-lr1-340.
      *                      *-----------------------------------------*
      *                      * Test se necessario                      *
      *                      *-----------------------------------------*
           if        w-tot-cli-num
                    (w-prn-fin-lr1-ctr)   =    zero
                     go to prn-fin-lr1-320.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Tipo scadenza                           *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      015                  to   p-pos                  .
           if        w-prn-fin-lr1-ctr    =    01
                     move  "RD  "         to   p-alf
           else if   w-prn-fin-lr1-ctr    =    02
                     move  "DC  "         to   p-alf
           else if   w-prn-fin-lr1-ctr    =    03
                     move  "IE  "         to   p-alf
           else if   w-prn-fin-lr1-ctr    =    04
                     move  "RIBA"         to   p-alf
           else if   w-prn-fin-lr1-ctr    =    05
                     move  "CDO "         to   p-alf
           else if   w-prn-fin-lr1-ctr    =    06
                     move  "MAV "         to   p-alf
           else if   w-prn-fin-lr1-ctr    =    07
                     move  "RID "         to   p-alf
           else if   w-prn-fin-lr1-ctr    =    08
                     move  "BB  "         to   p-alf
           else if   w-prn-fin-lr1-ctr    =    09
                     move  "CCP "         to   p-alf
           else if   w-prn-fin-lr1-ctr    =    10
                     move  "RB  "         to   p-alf
           else if   w-prn-fin-lr1-ctr    =    11
                     move  "TR  "         to   p-alf
           else if   w-prn-fin-lr1-ctr    =    12
                     move  "PC  "         to   p-alf
           else      move  spaces         to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa totale scaduto per tipo scadenza *
      *                      *-----------------------------------------*
           move      w-tot-cli-sca
                    (w-prn-fin-lr1-ctr)   to   w-stp-imp-vlb-val      .
           move      030                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                      *-----------------------------------------*
      *                      * Stampa totale insoluto per tipo scaden- *
      *                      * za                                      *
      *                      *-----------------------------------------*
           move      w-tot-cli-isp
                    (w-prn-fin-lr1-ctr)   to   w-stp-imp-vlb-val      .
           move      045                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                      *-----------------------------------------*
      *                      * Stampa totale a scadere per tipo sca-   *
      *                      * denza                                   *
      *                      *-----------------------------------------*
           move      w-tot-cli-asc
                    (w-prn-fin-lr1-ctr)   to   w-stp-imp-vlb-val      .
           move      060                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                      *-----------------------------------------*
      *                      * Stampa totale in circolazione per tipo  *
      *                      * scadenza                                *
      *                      *-----------------------------------------*
           move      w-tot-cli-cir
                    (w-prn-fin-lr1-ctr)   to   w-stp-imp-vlb-val      .
           move      075                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     prn-fin-lr1-320.
       prn-fin-lr1-340.
      *                  *---------------------------------------------*
      *                  * 2. linea trattini per totale cliente        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "            ----------------- -------------- -----
      -              "--------- -------------- --------------      -----
      -              "--------------------------------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-fin-lr1-400.
      *                  *---------------------------------------------*
      *                  * Totale globale cliente                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      17                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      013                  to   p-pos                  .
           move      "Totali cliente  :"  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa totale scaduto                   *
      *                      *-----------------------------------------*
           move      w-tot-cli-tsc        to   w-stp-imp-vlb-val      .
           move      030                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                      *-----------------------------------------*
      *                      * Stampa totale insoluto                  *
      *                      *-----------------------------------------*
           move      w-tot-cli-tin        to   w-stp-imp-vlb-val      .
           move      045                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                      *-----------------------------------------*
      *                      * Stampa totale a scadere                 *
      *                      *-----------------------------------------*
           move      w-tot-cli-tas        to   w-stp-imp-vlb-val      .
           move      060                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                      *-----------------------------------------*
      *                      * Stampa totale in circolazione           *
      *                      *-----------------------------------------*
           move      w-tot-cli-tci        to   w-stp-imp-vlb-val      .
           move      075                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                      *-----------------------------------------*
      *                      * Esposizione globale cliente             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      21                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      096                  to   p-pos                  .
           move      "Esposizione cliente :"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Valore                              *
      *                          *-------------------------------------*
           move      w-tot-cli-teg        to   w-stp-imp-vlb-val      .
           move      118                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Aggiornamento totali cliente                    *
      *              *-------------------------------------------------*
           perform   agg-tot-cli-000      thru agg-tot-cli-999        .
      *              *-------------------------------------------------*
      *              * Aggiornamento contatore scadenze stampate       *
      *              *-------------------------------------------------*
           add       1                    to   w-tot-sdb-ctr          .
       prn-liv-det-050.
      *              *-------------------------------------------------*
      *              * Stampa riga di dettaglio                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da stampare                         *
      *                  *---------------------------------------------*
           if        rr-tip-evd           not  = 01 and
                     rr-tip-evd           not  = 02
                     go to prn-liv-det-999.
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    1
                     go to prn-liv-det-100.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
      *                  *---------------------------------------------*
      *                  * Stampa fincatura per dettaglio              *
      *                  *---------------------------------------------*
           perform   stp-fnc-det-000      thru stp-fnc-det-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
       prn-liv-det-100.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-110.
      *                  *---------------------------------------------*
      *                  * Numero scadenza                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "P"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      srt-num-sdb          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Tipo scadenza                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      015                  to   p-pos                  .
      *
           if        srt-tip-sdb          =    01    and
                     srt-snx-dlc          =    "S"
                     move  "DC  "         to   p-alf
           else if   srt-tip-sdb          =    01    and
                     srt-snx-cts          =    "S"
                     move  "CT  "         to   p-alf
           else if   srt-tip-sdb          =    01    and
                     srt-snx-dlc          not  = "S" and
                     srt-snx-cts          not  = "S"
                     move  "RD  "         to   p-alf
           else if   srt-tip-sdb          =    02
                     move  "IE  "         to   p-alf
           else if   srt-tip-sdb          =    03
                     move  "RIBA"         to   p-alf
           else if   srt-tip-sdb          =    04
                     move  "CDO "         to   p-alf
           else if   srt-tip-sdb          =    05
                     move  "MAV "         to   p-alf
           else if   srt-tip-sdb          =    06
                     move  "RID "         to   p-alf
           else if   srt-tip-sdb          =    07
                     move  "BB  "         to   p-alf
           else if   srt-tip-sdb          =    08
                     move  "CCP "         to   p-alf
           else if   srt-tip-sdb          =    09
                     move  "RB  "         to   p-alf
           else if   srt-tip-sdb          =    10
                     move  "TR  "         to   p-alf
           else if   srt-tip-sdb          =    11
                     move  "PC  "         to   p-alf
           else      move  spaces         to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data scadenza                               *
      *                  *---------------------------------------------*
           if        srt-dts-eff          =    zero
                     go to prn-liv-det-120.
      *                      *-----------------------------------------*
      *                      * Se data scadenza diversa da zero        *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      022                  to   p-pos                  .
           move      srt-dts-eff          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           go to     prn-liv-det-140.
       prn-liv-det-120.
      *                      *-----------------------------------------*
      *                      * Se data scadenza uguale a zero          *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      022                  to   p-pos                  .
           move      "A vista "           to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-140.
      *                  *---------------------------------------------*
      *                  * Importo scadenza                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Determinazione posizione in funzione    *
      *                      * del tipo aggiornamento effettuato       *
      *                      *-----------------------------------------*
           if        w-agg-tot-cli-tae    =    01
                     move  030            to   w-stp-imp-vlb-pos
           else if   w-agg-tot-cli-tae    =    02
                     move  045            to   w-stp-imp-vlb-pos
           else if   w-agg-tot-cli-tae    =    03
                     move  060            to   w-stp-imp-vlb-pos
           else if   w-agg-tot-cli-tae    =    04
                     move  075            to   w-stp-imp-vlb-pos      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      srt-imp-sdb          to   w-stp-imp-vlb-val      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
       prn-liv-det-160.
      *                  *---------------------------------------------*
      *                  * Evidenziazione se scadenza a f/insoluto     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su personalizzazione               *
      *                      *-----------------------------------------*
           if        w-prs-gep-620-fie    not  = "S"
                     go to prn-liv-det-200.
      *                      *-----------------------------------------*
      *                      * Test che scadenza non sia gia' insoluto *
      *                      *-----------------------------------------*
           if        w-agg-tot-cli-tae    =    02
                     go to prn-liv-det-200.
      *                      *-----------------------------------------*
      *                      * Test su numero scadenza di origine      *
      *                      *-----------------------------------------*
           if        srt-nsc-org          =    zero
                     go to prn-liv-det-200.
      *                      *-----------------------------------------*
      *                      * Normalizzazione [sdb]                   *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                      *-----------------------------------------*
      *                      * Lettura scadenza di origine             *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMSDB    "         to   f-key                  .
           move      srt-nsc-org          to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                      *-----------------------------------------*
      *                      * Determinazione se scadenza proveniente  *
      *                      * da insoluto                             *
      *                      *-----------------------------------------*
           move      rr-dat-rfa           to   w-det-srd-sdb-drd      .
           perform   det-srd-sdb-000      thru det-srd-sdb-999        .
      *                          *-------------------------------------*
      *                          * Test su ultima operazione eseguita  *
      *                          *-------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to prn-liv-det-200.
      *                      *-----------------------------------------*
      *                      * Indicatore                              *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      051                  to   p-pos                  .
           move      "***"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-200.
      *                  *---------------------------------------------*
      *                  * Riferimenti                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test preliminare per verificare se la   *
      *                      * scadenza proviene da una compensazione  *
      *                      *-----------------------------------------*
           perform   prn-liv-det-flp-000  thru prn-liv-det-flp-999    .
           if        w-det-scd-cmp-flp    =    spaces
                     go to prn-liv-det-210.
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      23                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      092                  to   p-pos                  .
           move      "*** Scadenza cumulativa"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     prn-liv-det-600.
       prn-liv-det-210.
      *                      *-----------------------------------------*
      *                      * Tipo documento di riferimento           *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      093                  to   p-pos                  .
      *
           if        srt-tip-ddr          =    01
                     move  "FT"           to   p-alf
           else if   srt-tip-ddr          =    02
                     move  "ND"           to   p-alf
           else if   srt-tip-ddr          =    11
                     move  "NC"           to   p-alf
           else if   srt-tip-ddr          =    21
                     move  "AC"           to   p-alf
           else if   srt-tip-ddr          =    99
                     move  "DD"           to   p-alf
           else      move  spaces         to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Numero documento di riferimento         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se esiste il protocollo documento   *
      *                          * di riferimento si legge             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Test sul protocollo             *
      *                              *---------------------------------*
           if        srt-prt-fcl          =    zero
                     go to prn-liv-det-220.
      *                              *---------------------------------*
      *                              * Normalizzazione record [fit]    *
      *                              *---------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *                              *---------------------------------*
      *                              * Normalizzazione record [fit]    *
      *                              *---------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      srt-prt-fcl          to   rf-fit-num-prt         .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *                                  *-----------------------------*
      *                                  * Test su esito lettura       *
      *                                  *-----------------------------*
           if        f-sts                not  = e-not-err
                     go to prn-liv-det-220.
      *                              *---------------------------------*
      *                              * Test sul codice tipo movimento  *
      *                              *---------------------------------*
           if        rf-fit-cod-tmo       =    spaces
                     go to prn-liv-det-220.
      *                          *-------------------------------------*
      *                          * Tipo documento di riferimento       *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      092                  to   p-pos                  .
           move      rf-fit-cod-tmo       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-220.
      *                          *-------------------------------------*
      *                          * Allineamento a destra               *
      *                          *-------------------------------------*
           move      10                   to   w-all-str-lun          .
           move      srt-num-ddr          to   w-all-str-alf          .      
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      097                  to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-300.
      *                      *-----------------------------------------*
      *                      * Data documento di riferimento           *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      108                  to   p-pos                  .
           move      srt-dat-ddr          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Importo documento di riferimento        *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           if        srt-imp-ddr          >    99999999 or
                     srt-imp-ddr          <   -99999999
                     move  10             to   p-car
                     move  "B"            to   p-edm
           else      move  08             to   p-car
                     move  "GB"           to   p-edm                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      117                  to   p-pos                  .
           move      srt-imp-ddr          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Rata documento di riferimento           *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      130                  to   p-pos                  .
           move      srt-nra-ddr          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-600.
      *              *-------------------------------------------------*
      *              * Scansione eventuali scadenze compensate         *
      *              *-------------------------------------------------*
           perform   prn-liv-det-cmp-000  thru prn-liv-det-cmp-999    .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
       prn-liv-det-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Test di provenienza scadenza di origine                   *
      *    *-----------------------------------------------------------*
       prn-liv-det-flp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-scd-cmp-flp      .
      *              *-------------------------------------------------*
      *              * Test se presente scadenza di origine            *
      *              *-------------------------------------------------*
           if        srt-nsc-org          =    zero
                     go to prn-liv-det-flp-900.
       prn-liv-det-flp-200.
      *              *-------------------------------------------------*
      *              * Normalizzazione [sdb]                           *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *              *-------------------------------------------------*
      *              * Lettura [sdb] per la scadenza di origine        *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMSDB    "         to   f-key                  .
           move      srt-nsc-org          to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Test su esito della lettura                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to prn-liv-det-flp-900.
       prn-liv-det-flp-400.
      *              *-------------------------------------------------*
      *              * Test se la scadenza di orgine e' stata compen-  *
      *              * sata                                            *
      *              *-------------------------------------------------*
           if        rf-sdb-mod-ris       not  = 50
                     go to prn-liv-det-flp-900.
      *              *-------------------------------------------------*
      *              * Test se presente il numero riscossione          *
      *              *-------------------------------------------------*
           if        rf-sdb-num-ris       =    zero
                     go to prn-liv-det-flp-900.
       prn-liv-det-flp-600.
      *              *-------------------------------------------------*
      *              * Flag di uscita                                  *
      *              *-------------------------------------------------*
           move      "#"                  to   w-det-scd-cmp-flp      .
       prn-liv-det-flp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-flp-999.
       prn-liv-det-flp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Trattamento eventuali compensazioni                       *
      *    *-----------------------------------------------------------*
       prn-liv-det-cmp-000.
      *              *-------------------------------------------------*
      *              * Scadenze di origine, in caso di compensazione   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se la scadenza di origine proviene da  *
      *                  * una compensazione                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se presente scadenza di origine    *
      *                      *-----------------------------------------*
           if        srt-nsc-org          =    zero
                     go to prn-liv-det-cmp-900.
      *                      *-----------------------------------------*
      *                      * Normalizzazione [sdb]                   *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                      *-----------------------------------------*
      *                      * Lettura [sdb] per la scadenza di ori-   *
      *                      * gine                                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMSDB    "         to   f-key                  .
           move      srt-nsc-org          to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                          *-------------------------------------*
      *                          * Test su esito della lettura         *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to prn-liv-det-cmp-900.
      *                      *-----------------------------------------*
      *                      * Test se la scadenza di orgine e' stata  *
      *                      * compensata                              *
      *                      *-----------------------------------------*
           if        rf-sdb-mod-ris       not  = 50
                     go to prn-liv-det-cmp-900.
      *                      *-----------------------------------------*
      *                      * Test se presente il numero riscossione  *
      *                      *-----------------------------------------*
           if        rf-sdb-num-ris       =    zero
                     go to prn-liv-det-cmp-900.
       prn-liv-det-cmp-100.
      *                      *-----------------------------------------*
      *                      * Numero riscossione determinato          *
      *                      *-----------------------------------------*
           move      rf-sdb-num-ris       to   w-stp-sdb-srt-ris      .
           move      zero                 to   w-stp-sdb-srt-nrs      .
      *                      *-----------------------------------------*
      *                      * Scansione del file [sdb] per determina- *
      *                      * re tutte le scadenze appartenenti alla  *
      *                      * compensazione                           *
      *                      *-----------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "RISSDB    "         to   f-key                  .
           move      w-stp-sdb-srt-ris    to   rf-sdb-num-ris         .
           move      zero                 to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                          *-------------------------------------*
      *                          * Test su esito operazione            *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to prn-liv-det-cmp-900.
       prn-liv-det-cmp-200.
      *                      *-----------------------------------------*
      *                      * Lettura sequenziale record [sdb]        *
      *                      *-----------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                          *-------------------------------------*
      *                          * Test se 'At end'                    *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to prn-liv-det-cmp-900.
       prn-liv-det-cmp-300.
      *                      *-----------------------------------------*
      *                      * Test sul massimo                        *
      *                      *-----------------------------------------*
           if        rf-sdb-num-ris       not  = w-stp-sdb-srt-ris
                     go to prn-liv-det-cmp-900.
       prn-liv-det-cmp-400.
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-stp-sdb-srt-nrs      .
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    2
                     go to prn-liv-det-cmp-500.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-cmp-999.
      *                  *---------------------------------------------*
      *                  * Stampa fincatura per dettaglio              *
      *                  *---------------------------------------------*
           perform   stp-fnc-det-000      thru stp-fnc-det-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-cmp-999.
       prn-liv-det-cmp-500.
      *                  *---------------------------------------------*
      *                  * Test se primo passaggio                     *
      *                  *---------------------------------------------*
           if        w-stp-sdb-srt-nrs    >    1
                     go to prn-liv-det-cmp-510.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-cmp-510.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      30                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      048                  to   p-pos                  .
           move      "(A compensazione ns. scadenza:"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero scadenza                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "P"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      079                  to   p-pos                  .
           move      rf-sdb-num-sdb       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-cmp-600.
      *                  *---------------------------------------------*
      *                  * Riferimenti                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo documento di riferimento           *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      093                  to   p-pos                  .
      *
           if        rf-sdb-tip-ddr       =    01
                     move  "FT"           to   p-alf
           else if   rf-sdb-tip-ddr       =    02
                     move  "ND"           to   p-alf
           else if   rf-sdb-tip-ddr       =    11
                     move  "NC"           to   p-alf
           else if   rf-sdb-tip-ddr       =    21
                     move  "AC"           to   p-alf
           else if   rf-sdb-tip-ddr       =    99
                     move  "DD"           to   p-alf
           else      move  spaces         to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Numero documento di riferimento         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se esiste il protocollo documento   *
      *                          * di riferimento si legge             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Test sul protocollo             *
      *                              *---------------------------------*
           if        rf-sdb-prt-fcl       =    zero
                     go to prn-liv-det-cmp-620.
      *                              *---------------------------------*
      *                              * Normalizzazione record [fit]    *
      *                              *---------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *                              *---------------------------------*
      *                              * Normalizzazione record [fit]    *
      *                              *---------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      rf-sdb-prt-fcl       to   rf-fit-num-prt         .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *                                  *-----------------------------*
      *                                  * Test su esito lettura       *
      *                                  *-----------------------------*
           if        f-sts                not  = e-not-err
                     go to prn-liv-det-cmp-620.
      *                              *---------------------------------*
      *                              * Test sul codice tipo movimento  *
      *                              *---------------------------------*
           if        rf-fit-cod-tmo       =    spaces
                     go to prn-liv-det-cmp-620.
      *                          *-------------------------------------*
      *                          * Tipo documento di riferimento       *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      092                  to   p-pos                  .
           move      rf-fit-cod-tmo       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-cmp-620.
      *                          *-------------------------------------*
      *                          * Allineamento a destra               *
      *                          *-------------------------------------*
           move      10                   to   w-all-str-lun          .
           move      rf-sdb-num-ddr       to   w-all-str-alf          .      
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      097                  to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-cmp-630.
      *                      *-----------------------------------------*
      *                      * Data documento di riferimento           *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      108                  to   p-pos                  .
           move      rf-sdb-dat-ddr       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Importo scadenza                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           if        rf-sdb-imp-sdb       >    99999999 or
                     rf-sdb-imp-sdb       <   -99999999
                     move  10             to   p-car
                     move  "B"            to   p-edm
           else      move  08             to   p-car
                     move  "GB"           to   p-edm                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      117                  to   p-pos                  .
           move      rf-sdb-imp-sdb       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Rata documento di riferimento               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      130                  to   p-pos                  .
           move      rf-sdb-nra-ddr       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Chiusura prompt                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      132                  to   p-pos                  .
           move      ")"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-cmp-800.
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     prn-liv-det-cmp-200.
       prn-liv-det-cmp-900.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-cmp-999.
       prn-liv-det-cmp-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento totali per tipo scadenza                    *
      *    *-----------------------------------------------------------*
       agg-tot-cli-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo aggiornamento effettuato   *
      *              *-------------------------------------------------*
           move      zero                 to   w-agg-tot-cli-tae      .
      *              *-------------------------------------------------*
      *              * Determinazione indice per tabella tipi scadenza *
      *              *-------------------------------------------------*
           if        srt-tip-sdb          =    01 and
                     srt-snx-dlc          =    "N"
                     move  01             to   w-agg-tot-cli-its
           else if   srt-tip-sdb          =    01 and
                     srt-snx-dlc          =    "S"
                     move  02             to   w-agg-tot-cli-its
           else if   srt-tip-sdb          =    02
                     move  03             to   w-agg-tot-cli-its
           else if   srt-tip-sdb          =    03
                     move  04             to   w-agg-tot-cli-its
           else if   srt-tip-sdb          =    04
                     move  05             to   w-agg-tot-cli-its
           else if   srt-tip-sdb          =    05
                     move  06             to   w-agg-tot-cli-its
           else if   srt-tip-sdb          =    06
                     move  07             to   w-agg-tot-cli-its
           else if   srt-tip-sdb          =    07
                     move  08             to   w-agg-tot-cli-its
           else if   srt-tip-sdb          =    08
                     move  09             to   w-agg-tot-cli-its
           else if   srt-tip-sdb          =    09
                     move  10             to   w-agg-tot-cli-its
           else if   srt-tip-sdb          =    10
                     move  11             to   w-agg-tot-cli-its
           else if   srt-tip-sdb          =    11
                     move  12             to   w-agg-tot-cli-its      .
      *              *-------------------------------------------------*
      *              * Aggiornamento totale esposizione globale        *
      *              *-------------------------------------------------*
           add       srt-imp-sdb          to   w-tot-cli-teg          .
      *              *-------------------------------------------------*
      *              * Aggiornamento totale numero scadenze            *
      *              *-------------------------------------------------*
           add       1                    to   w-tot-cli-num
                                              (w-agg-tot-cli-its)     .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo scadenza        *
      *              *-------------------------------------------------*
           if        srt-tip-sdb          =    01 or
                     srt-tip-sdb          =    07 or
                     srt-tip-sdb          =    08
                     go to agg-tot-cli-100
           else      go to agg-tot-cli-200.
       agg-tot-cli-100.
      *              *-------------------------------------------------*
      *              * Se Rimesse dirette, Bonfici o C/C postali       *
      *              *-------------------------------------------------*
      *                   *--------------------------------------------*
      *                   * Deviazione a seconda della data scadenza   *
      *                   *--------------------------------------------*
           if        srt-dts-eff          >    rr-dat-rfa
                     go to agg-tot-cli-110
           else      go to agg-tot-cli-120.
       agg-tot-cli-110.
      *                   *--------------------------------------------*
      *                   * Se data scadenza maggiore della data rife- *
      *                   * rimento analisi                            *
      *                   *--------------------------------------------*
      *                       *----------------------------------------*
      *                       * Aggiornamento totale a scadere         *
      *                       *----------------------------------------*
           add       srt-imp-sdb          to    w-tot-cli-asc
                                               (w-agg-tot-cli-its)    .
           add       srt-imp-sdb          to    w-tot-cli-tas         .
      *                       *----------------------------------------*
      *                       * Determinazione tipo aggiornamento      *
      *                       *----------------------------------------*
           move      03                   to   w-agg-tot-cli-tae      .
      *                       *----------------------------------------*
      *                       * Uscita                                 *
      *                       *----------------------------------------*
           go to     agg-tot-cli-999.
       agg-tot-cli-120.
      *                   *--------------------------------------------*
      *                   * Se data scadenza minore o uguale alla data *
      *                   * riferimento analisi                        *
      *                   *--------------------------------------------*
      *                       *----------------------------------------*
      *                       * Aggiornamento totale scaduto           *
      *                       *----------------------------------------*
           add       srt-imp-sdb          to    w-tot-cli-sca
                                               (w-agg-tot-cli-its)    .
           add       srt-imp-sdb          to    w-tot-cli-tsc         .
      *                       *----------------------------------------*
      *                       * Determinazione tipo aggiornamento      *
      *                       *----------------------------------------*
           move      01                   to   w-agg-tot-cli-tae      .
      *                       *----------------------------------------*
      *                       * Uscita                                 *
      *                       *----------------------------------------*
           go to     agg-tot-cli-999.
       agg-tot-cli-200.
      *              *-------------------------------------------------*
      *              * Se altri tipi scadenza                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione della sigla ultima   *
      *                  * operazione effettuata sulla scadenza        *
      *                  *---------------------------------------------*
           if        srt-sgl-uop          =    "PRE" or
                     srt-sgl-uop          =    "ACT" or
                     srt-sgl-uop          =    "ACD"
                     go to agg-tot-cli-210
           else if   srt-sgl-uop          =    "ISP"
                     go to agg-tot-cli-220
           else      go to agg-tot-cli-230.
       agg-tot-cli-210.
      *                  *---------------------------------------------*
      *                  * Se sigla ultima operazione                  *
      *                  * - Presentazione                             *
      *                  * - Accettazione da parte della banca         *
      *                  * - Accredito                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento totale in circolazione    *
      *                      *-----------------------------------------*
           add       srt-imp-sdb          to    w-tot-cli-cir
                                               (w-agg-tot-cli-its)    .
           add       srt-imp-sdb          to    w-tot-cli-tci         .
      *                       *----------------------------------------*
      *                       * Determinazione tipo aggiornamento      *
      *                       *----------------------------------------*
           move      04                   to   w-agg-tot-cli-tae      .
      *                       *----------------------------------------*
      *                       * Uscita                                 *
      *                       *----------------------------------------*
           go to     agg-tot-cli-999.
       agg-tot-cli-220.
      *                  *---------------------------------------------*
      *                  * Se sigla ultima operazione                  *
      *                  * - Insoluto                                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento totale insoluti           *
      *                      *-----------------------------------------*
           add       srt-imp-sdb          to    w-tot-cli-isp
                                               (w-agg-tot-cli-its)    .
           add       srt-imp-sdb          to    w-tot-cli-tin         .
      *                       *----------------------------------------*
      *                       * Determinazione tipo aggiornamento      *
      *                       *----------------------------------------*
           move      02                   to   w-agg-tot-cli-tae      .
      *                       *----------------------------------------*
      *                       * Uscita                                 *
      *                       *----------------------------------------*
           go to     agg-tot-cli-999.
       agg-tot-cli-230.
      *                  *---------------------------------------------*
      *                  * Se altra sigla ultima operazione, cioe'     *
      *                  * scadenza in portafoglio                     *
      *                  *---------------------------------------------*
      *                       *----------------------------------------*
      *                       * Stesso trattamento che per Rimesse di- *
      *                       * rette, Bonifici o C/c postali          *
      *                       *----------------------------------------*
           go to     agg-tot-cli-100.
       agg-tot-cli-999.
           exit.

      *    *===========================================================*
      *    * Stampa fincatura per dettaglio                            *
      *    *-----------------------------------------------------------*
       stp-fnc-det-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo evidenziazione  *
      *              *-------------------------------------------------*
           if        rr-tip-evd           =    01 or
                     rr-tip-evd           =    02
                     go to stp-fnc-det-100
           else if   rr-tip-evd           =    03
                     go to stp-fnc-det-500.
       stp-fnc-det-100.
      *              *-------------------------------------------------*
      *              * Tipo evidenziazione : sia la lista che il rie-  *
      *              * pilogo oppure solo la lista                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    6
                     go to stp-fnc-det-200.
      *                      *-----------------------------------------*
      *                      * Reintestazione                          *
      *                      *-----------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to stp-fnc-det-999.
       stp-fnc-det-200.
      *                  *---------------------------------------------*
      *                  * Interlinea subordinata                      *
      *                  *---------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       02
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 1. riga fincatura                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "           Scadenza                               
      -              "      Importo                                     
      -              " Estremi del documento          "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Sottolinetura 1. riga fincatura             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "----------------------------- --------------------
      -              "---------------------------------------  ---------
      -              "--------------------------------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 2. riga fincatura                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "   Numero     Tipo     Data       Scaduto       In
      -              "soluto       A scadere     Circolante    Tipo   Nu
      -              "mero     Data     Importo   Rata"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Sottolinetura 2. riga fincatura             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "----------- -------- -------- -------------- -----
      -              "--------- -------------- --------------  ---- ----
      -              "------ -------- ----------- ----"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     stp-fnc-det-999.
       stp-fnc-det-500.
      *              *-------------------------------------------------*
      *              * Tipo evidenziazione : solo il riepilogo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    4
                     go to stp-fnc-det-600.
      *                      *-----------------------------------------*
      *                      * Reintestazione                          *
      *                      *-----------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to stp-fnc-det-999.
       stp-fnc-det-600.
      *                  *---------------------------------------------*
      *                  * Interlinea subordinata                      *
      *                  *---------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       02
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 1. riga fincatura                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "              Tipo                Scaduto       In
      -              "soluto       A scadere     Circolante             
      -              "                                "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Sottolinetura 1. riga fincatura             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "            --------          -------------- -----
      -              "--------- -------------- --------------           
      -              "                                "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     stp-fnc-det-999.
       stp-fnc-det-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri intestazione standard    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing data base calcolo mesi              *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      "<"                  to   p-edm                  .
           move      rr-dat-rfa           to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Composizione titolo                         *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-tit-des-tit      .
           string    "ANALISI DI PORTAFOGLIO CLIENTI AL "
                                delimited by   size
                     p-edt      delimited by   spaces
                                          into w-cnt-tit-des-tit      .
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-cnt-tit-dat-stp      .
           move      p-pag                to   w-cnt-tit-num-pag      .
           add       1                    to   w-cnt-tit-num-pag      .
      *              *-------------------------------------------------*
      *              * Intestazione standard                           *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per interruzione forzata          *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-sta-999.
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dcc]                         *
      *    *-----------------------------------------------------------*
       let-arc-dcc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codici a zero o spazi                   *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-cli    =    zero
                     go to let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI"             to   f-key                  .
           move      w-let-arc-dcc-cli    to   rf-dcc-cod-cli         .
           move      w-let-arc-dcc-dpz    to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcc-400.
       let-arc-dcc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcc-rag-key       to   w-let-arc-dcc-rsu      .
           move      rf-dcc-rag-soc       to   w-let-arc-dcc-rag      .
           move      rf-dcc-via-dcc       to   w-let-arc-dcc-via      .
           move      rf-dcc-loc-dcc       to   w-let-arc-dcc-loc      .
           move      rf-dcc-cod-age       to   w-let-arc-dcc-age      .
      *
           move      w-let-arc-dcc-age    to   w-let-arc-age-cod      .
           perform   let-arc-age-000      thru let-arc-age-999        .
           move      w-let-arc-age-nom    to   w-let-arc-dcc-nag      .
      *
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      02                   to   d-con-arc-tip-arc      .
           move      rf-dcc-cod-cli       to   d-con-arc-cod-arc      .
           move      rf-dcc-dpz-cli       to   d-con-arc-dpz-arc      .
           move      "TEL"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           perform   con-arc-tip-cll-000  thru con-arc-tip-cll-999    .
           move      d-con-arc-num-con (1)
                                          to   w-let-arc-dcc-tel      .
      *
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      02                   to   d-con-arc-tip-arc      .
           move      rf-dcc-cod-cli       to   d-con-arc-cod-arc      .
           move      rf-dcc-dpz-cli       to   d-con-arc-dpz-arc      .
           move      "CEL"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           perform   con-arc-tip-cll-000  thru con-arc-tip-cll-999    .
           move      d-con-arc-num-con (1)
                                          to   w-let-arc-dcc-cel      .
      *
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      02                   to   d-con-arc-tip-arc      .
           move      rf-dcc-cod-cli       to   d-con-arc-cod-arc      .
           move      rf-dcc-dpz-cli       to   d-con-arc-dpz-arc      .
           move      "FAX"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           perform   con-arc-tip-cll-000  thru con-arc-tip-cll-999    .
           move      d-con-arc-num-con (1)
                                          to   w-let-arc-dcc-fax      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcc-900.
       let-arc-dcc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcc-flg      .
           move      all   "."            to   w-let-arc-dcc-rag      .
           go to     let-arc-dcc-520.
       let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-rag      .
       let-arc-dcc-520.
           move      spaces               to   w-let-arc-dcc-via      .
           move      spaces               to   w-let-arc-dcc-loc      .
           move      spaces               to   w-let-arc-dcc-rsu      .
           move      spaces               to   w-let-arc-dcc-tel      .
           move      spaces               to   w-let-arc-dcc-cel      .
           move      spaces               to   w-let-arc-dcc-fax      .
           move      zero                 to   w-let-arc-dcc-age      .
           move      spaces               to   w-let-arc-dcc-nag      .
       let-arc-dcc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcc-999.
       let-arc-dcc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [age]                         *
      *    *-----------------------------------------------------------*
       let-arc-age-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-age-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-age-cod    =    zero
                     go to let-arc-age-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODAGE"             to   f-key                  .
           move      w-let-arc-age-cod    to   rf-age-cod-age         .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-age-400.
       let-arc-age-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-age-nom-age       to   w-let-arc-age-nom      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-age-999.
       let-arc-age-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-age-flg      .
           move      all   "."            to   w-let-arc-age-nom      .
           go to     let-arc-age-520.
       let-arc-age-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-age-nom      .
       let-arc-age-520.
           go to     let-arc-age-999.
       let-arc-age-999.
           exit.

      *    *===========================================================*
      *    * Determinazione status scadenza                            *
      *    *-----------------------------------------------------------*
       det-srd-sdb-000.
      *              *-------------------------------------------------*
      *              * Determinazione sigla ultima operazione eseguita *
      *              * sulla scadenza                                  *
      *              *-------------------------------------------------*
       det-srd-sdb-025.
      *                  *---------------------------------------------*
      *                  * Normalizzazione iniziale sigla              *
      *                  *---------------------------------------------*
           move      spaces               to   w-det-srd-sdb-suo      .
       det-srd-sdb-050.
      *                  *---------------------------------------------*
      *                  * Se la data di emissione scadenza e' supe-   *
      *                  * riore alla data di riferimento per la de-   *
      *                  * terminazione : uscita con status 'N'        *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-emi       >    w-det-srd-sdb-drd
                     move  "N"            to   w-det-srd-sdb-sts
                     go to det-srd-sdb-999.
       det-srd-sdb-100.
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "EMI"                to   w-det-srd-sdb-suo      .
       det-srd-sdb-125.
      *                  *---------------------------------------------*
      *                  * Storno                                      *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-sto       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-sto       not  = zero
                     move  "SSC"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-150.
      *                  *---------------------------------------------*
      *                  * Riscossione                                 *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-ris       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-ris       not  = zero
                     go to det-srd-sdb-155
           else      go to det-srd-sdb-200.
       det-srd-sdb-155.
      *                      *-----------------------------------------*
      *                      * Determinazione in funizione delle moda- *
      *                      * lita' di riscossione                    *
      *                      *-----------------------------------------*
           if        rf-sdb-mod-ris       =    01 or
                     rf-sdb-mod-ris       =    02 or
                     rf-sdb-mod-ris       =    03 or
                     rf-sdb-mod-ris       =    04
                     move  "RIS"          to   w-det-srd-sdb-suo
           else if   rf-sdb-mod-ris       =    21 or
                     rf-sdb-mod-ris       =    22 or
                     rf-sdb-mod-ris       =    23 or
                     rf-sdb-mod-ris       =    24
                     move  "PAG"          to   w-det-srd-sdb-suo
           else if   rf-sdb-mod-ris       =    50
                     move  "CMP"          to   w-det-srd-sdb-suo      .
           go to     det-srd-sdb-800.
       det-srd-sdb-200.
      *                  *---------------------------------------------*
      *                  * Richiamo della scadenza presentata          *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-rsp       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-rsp       not  = zero
                     move  "RSP"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-225.
      *                  *---------------------------------------------*
      *                  * Accredito scadenza al dopo incasso          *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-acs       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-acs       not  = zero
                     move  "ACS"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-250.
      *                  *---------------------------------------------*
      *                  * Notizia di buon esito sulla scadenza        *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-nbe       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-nbe       not  = zero
                     move  "NBE"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-275.
      *                  *---------------------------------------------*
      *                  * Presunto buon esito sulla scadenza          *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-pbe       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-pbe       not  = zero
                     move  "PBE"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-300.
      *                  *---------------------------------------------*
      *                  * Insoluto sulla scadenza presentata          *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-isp       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-isp       not  = zero
                     move  "ISP"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-400.
      *                  *---------------------------------------------*
      *                  * Operazioni relative alla distinta di pre-   *
      *                  * sentazione                                  *
      *                  *---------------------------------------------*
       det-srd-sdb-425.
      *                      *-----------------------------------------*
      *                      * Se la scadenza non porta un numero di-  *
      *                      * stinta si escludono tutti i controlli   *
      *                      * sulle operazioni relative alla distinta *
      *                      * di presentazione                        *
      *                      *-----------------------------------------*
           if        rf-sdb-num-ddp       =    zero
                     go to det-srd-sdb-625.
       det-srd-sdb-450.
      *                      *-----------------------------------------*
      *                      * Lettura distinta di presentazione       *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMDDP    "         to   f-key                  .
           move      rf-sdb-num-ddp       to   rf-ddp-num-ddp         .
           move      "pgm/gep/fls/ioc/obj/iofddp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ddp                 .
       det-srd-sdb-475.
      *                      *-----------------------------------------*
      *                      * Se distinta di presentazione non esi-   *
      *                      * stente in archivio distinte si escludo- *
      *                      * no tutti i controlli sulle operazioni   *
      *                      * relative alla distinta di presentazione *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-srd-sdb-625.
       det-srd-sdb-500.
      *                      *-----------------------------------------*
      *                      * Se la data di composizione distinta e'  *
      *                      * superiore alla data di riferimento per  *
      *                      * la determinazione si escludono tutti i  *
      *                      * controlli sulle operazioni relative al- *
      *                      * la distinta di presentazione            *
      *                      *-----------------------------------------*
           if        rf-ddp-dtr-com       >    w-det-srd-sdb-drd
                     go to det-srd-sdb-625.
       det-srd-sdb-525.
      *                      *-----------------------------------------*
      *                      * Composizione distinta                   *
      *                      *-----------------------------------------*
           move      "COM"                to   w-det-srd-sdb-suo      .
       det-srd-sdb-550.
      *                      *-----------------------------------------*
      *                      * Presentazione distinta                  *
      *                      *-----------------------------------------*
           if        rf-ddp-dtr-pre       not  > w-det-srd-sdb-drd and
                     rf-ddp-dtr-pre       not  = zero
                     move  "PRE"          to   w-det-srd-sdb-suo      .
       det-srd-sdb-575.
      *                      *-----------------------------------------*
      *                      * Accettazione distinta                   *
      *                      *-----------------------------------------*
           if        rf-ddp-dtr-act       not  > w-det-srd-sdb-drd and
                     rf-ddp-dtr-act       not  = zero
                     move  "ACT"          to   w-det-srd-sdb-suo      .
       det-srd-sdb-600.
      *                      *-----------------------------------------*
      *                      * Accredito distinta                      *
      *                      *-----------------------------------------*
           if        rf-ddp-dtr-acd       not  > w-det-srd-sdb-drd and
                     rf-ddp-dtr-acd       not  = zero
                     move  "ACD"          to   w-det-srd-sdb-suo      .
       det-srd-sdb-625.
      *                      *-----------------------------------------*
      *                      * Fine controlli su operazioni relative   *
      *                      * alla distinta di presentazione          *
      *                      *-----------------------------------------*
           go to     det-srd-sdb-800.
       det-srd-sdb-800.
      *              *-------------------------------------------------*
      *              * Determinazione dello status della scadenza in   *
      *              * funzione della sigla dell'ultima operazione e-  *
      *              * seguita sulla scadenza                          *
      *              *-------------------------------------------------*
           if        w-det-srd-sdb-suo    =    "EMI" or
                     w-det-srd-sdb-suo    =    "COM" or
                     w-det-srd-sdb-suo    =    "PRE" or
                     w-det-srd-sdb-suo    =    "ACT" or
                     w-det-srd-sdb-suo    =    "ACD"
                     move  "A"            to   w-det-srd-sdb-sts
           else if   w-det-srd-sdb-suo    =    "SSC" or
                     w-det-srd-sdb-suo    =    "RIS" or
                     w-det-srd-sdb-suo    =    "PAG" or
                     w-det-srd-sdb-suo    =    "CMP" or
                     w-det-srd-sdb-suo    =    "RSP" or
                     w-det-srd-sdb-suo    =    "ACS" or
                     w-det-srd-sdb-suo    =    "NBE" or
                     w-det-srd-sdb-suo    =    "PBE" or
                     w-det-srd-sdb-suo    =    "ISP"
                     move  "C"            to   w-det-srd-sdb-sts
           else      move  spaces         to   w-det-srd-sdb-sts      .
      *                  *---------------------------------------------*
      *                  * Eventuale aggiustamento in caso di insoluto *
      *                  *---------------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to det-srd-sdb-999.
      *                      *-----------------------------------------*
      *                      * Se la scadenza e' comunque stata ri-    *
      *                      * scossa : tutto inalterato               *
      *                      *-----------------------------------------*
           if        rf-sdb-dtr-ris       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-ris       not  = zero
                     go to det-srd-sdb-999.
      *                      *-----------------------------------------*
      *                      * Se a fronte dell'insoluto non e' stata  *
      *                      * emessa una nuova scadenza, essa e' da   *
      *                      * intendersi ancora aperta                *
      *                      *-----------------------------------------*
           if        rf-sdb-ens-isp       =    02   and
                     rf-sdb-nns-isp       =    zero
                     move  "A"            to   w-det-srd-sdb-sts      .
       det-srd-sdb-999.
           exit.

      *    *===========================================================*
      *    * Determinazione presenza accrediti per il cliente in       *
      *    * corso di trattamento                                      *
      *    *-----------------------------------------------------------*
       det-dbt-acc-000.
      *              *-------------------------------------------------*
      *              * Test preliminare se cliente gia' trattato       *
      *              *-------------------------------------------------*
           if        w-det-dbt-acc-svc    =    zero
                     go to det-dbt-acc-050.
           if        w-det-dbt-acc-cod    =    w-det-dbt-acc-svc
                     move  w-det-dbt-acc-svf
                                          to   w-det-dbt-acc-flg
                     go to det-dbt-acc-900.
       det-dbt-acc-050.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-dbt-acc-flg      .
      *              *-------------------------------------------------*
      *              * Bufferizzazione cliente                         *
      *              *-------------------------------------------------*
           move      w-det-dbt-acc-cod    to   w-det-dbt-acc-svc      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-dbt-acc-ctr      .
       det-dbt-acc-100.
      *              *-------------------------------------------------*
      *              * Start su file [sdb]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "DBTDTS    "         to   f-key                  .
           move      01                   to   rf-sdb-tip-dbt         .
           move      w-det-dbt-acc-cod    to   rf-sdb-cod-dbt         .
           move      zero                 to   rf-sdb-dts-sdb         .
           move      zero                 to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-dbt-acc-800.
       det-dbt-acc-200.
      *              *-------------------------------------------------*
      *              * Read Next su file [sdb]                         *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-dbt-acc-800.
       det-dbt-acc-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo debitore                       *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-dbt       not  = 01
                     go to det-dbt-acc-800.
      *                  *---------------------------------------------*
      *                  * Test su codice debitore                     *
      *                  *---------------------------------------------*
           if        rf-sdb-cod-dbt       not  = w-det-dbt-acc-cod
                     go to det-dbt-acc-800.
       det-dbt-acc-400.
      *              *-------------------------------------------------*
      *              * Selezioni sul record [sdb]                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Che non sia la scadenza stessa              *
      *                  *---------------------------------------------*
           if        rf-sdb-num-sdb       =    w-det-dbt-acc-num
                     go to det-dbt-acc-200.
      *                  *---------------------------------------------*
      *                  * Test su tipo documento di riferimento       *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-ddr       not  =  11
                     go to det-dbt-acc-200.
      *                  *---------------------------------------------*
      *                  * Determinazione status scadenza              *
      *                  *---------------------------------------------*
           move      rr-dat-rfa           to   w-det-srd-sdb-drd      .
           perform   det-srd-sdb-000      thru det-srd-sdb-999        .
           if        w-det-srd-sdb-sts    not  = "A"
                     go to det-dbt-acc-200.
           if        w-det-srd-sdb-suo    =    spaces
                     go to det-dbt-acc-200.
       det-dbt-acc-600.
      *              *-------------------------------------------------*
      *              * Incremento contatore                            *
      *              *-------------------------------------------------*
           add       1                    to   w-det-dbt-acc-ctr      .
       det-dbt-acc-800.
      *              *-------------------------------------------------*
      *              * Test sul contatore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Attivazione flag                            *
      *                  *---------------------------------------------*
           if        w-det-dbt-acc-ctr    =    zero
                     move  "#"            to   w-det-dbt-acc-flg      .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione flag                        *
      *                  *---------------------------------------------*
           move      w-det-dbt-acc-flg    to   w-det-dbt-acc-svf      .
       det-dbt-acc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-dbt-acc-999.
       det-dbt-acc-999.
           exit.

      *    *===========================================================*
      *    * Determinazione presenza scadenze adatte alla compensazio- *
      *    * ne, cioe' con la stessa data di scadenza                  *
      *    *-----------------------------------------------------------*
       det-scd-cmp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-scd-cmp-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-scd-cmp-ctr      .
       det-scd-cmp-100.
      *              *-------------------------------------------------*
      *              * Start su file [sdb]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "DBTDTS    "         to   f-key                  .
           move      01                   to   rf-sdb-tip-dbt         .
           move      w-det-scd-cmp-cod    to   rf-sdb-cod-dbt         .
           move      zero                 to   rf-sdb-dts-sdb         .
           move      zero                 to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-scd-cmp-800.
       det-scd-cmp-200.
      *              *-------------------------------------------------*
      *              * Read Next su file [sdb]                         *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-scd-cmp-800.
       det-scd-cmp-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo debitore                       *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-dbt       not  = 01
                     go to det-scd-cmp-800.
      *                  *---------------------------------------------*
      *                  * Test su codice debitore                     *
      *                  *---------------------------------------------*
           if        rf-sdb-cod-dbt       not  = w-det-scd-cmp-cod
                     go to det-scd-cmp-800.
       det-scd-cmp-400.
      *              *-------------------------------------------------*
      *              * Selezioni sul record [sdb]                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Che non sia la scadenza stessa              *
      *                  *---------------------------------------------*
           if        rf-sdb-num-sdb       =    w-det-scd-cmp-num
                     go to det-scd-cmp-200.
      *                  *---------------------------------------------*
      *                  * Test su data scadenza                       *
      *                  *---------------------------------------------*
           if        rf-sdb-dts-sdb       =    zero
                     move  w-det-scd-cmp-dat
                                          to   rf-sdb-dts-sdb         .
           if        rf-sdb-dts-sdb       not  = w-det-scd-cmp-dat
                     go to det-scd-cmp-200.
      *                  *---------------------------------------------*
      *                  * Determinazione status scadenza              *
      *                  *---------------------------------------------*
           move      rr-dat-rfa           to   w-det-srd-sdb-drd      .
           perform   det-srd-sdb-000      thru det-srd-sdb-999        .
           if        w-det-srd-sdb-sts    not  = "A"
                     go to det-scd-cmp-200.
           if        w-det-srd-sdb-suo    =    spaces
                     go to det-scd-cmp-200.
       det-scd-cmp-600.
      *              *-------------------------------------------------*
      *              * Incremento contatore                            *
      *              *-------------------------------------------------*
           add       1                    to   w-det-scd-cmp-ctr      .
       det-scd-cmp-800.
      *              *-------------------------------------------------*
      *              * Test sul contatore                              *
      *              *-------------------------------------------------*
           if        w-det-scd-cmp-ctr    =    zero
                     move  "#"            to   w-det-scd-cmp-flg      .
       det-scd-cmp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-scd-cmp-999.
       det-scd-cmp-999.
           exit.

      *    *===========================================================*
      *    * Subroutine per stampa importo in valuta base              *
      *    *-----------------------------------------------------------*
       stp-imp-vlb-000.
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-imp-vlb-pos    to   p-pos                  .
           move      "G"                  to   p-edm                  .
           move      w-stp-imp-vlb-val    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
        stp-imp-vlb-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per determinazione contatti                   *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/dconarc0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

