       Identification Division.
       Program-Id.                                 pgep300i           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    gep                 *
      *                                Settore:    mov                 *
      *                                   Fase:    gep300              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 10/01/92    *
      *                       Ultima revisione:    NdK del 09/02/25    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Movimenti per gestione portafoglio          *
      *                                                                *
      *                    Sottoprogramma per esecuzione funzione di : *
      *                                                                *
      *                    Stampa Effetti a fronte Distinta            *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record per ordinamento scadenze per :                *
      *    *                                                           *
      *    * -  Data di scadenza                                       *
      *    * -  Ragione sociale del debitore                           *
      *    * -  Tipo debitore                                          *
      *    * -  Codice debitore                                        *
      *    * -  Numero scadenza                                        *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Data di scadenza                                  *
      *            *---------------------------------------------------*
               10  srt-dts-sdb            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale del debitore                      *
      *            *---------------------------------------------------*
               10  srt-rag-soc            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Tipo debitore                                     *
      *            *---------------------------------------------------*
               10  srt-tip-dbt            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice debitore                                   *
      *            *---------------------------------------------------*
               10  srt-cod-dbt            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero scadenza                                   *
      *            *---------------------------------------------------*
               10  srt-num-sdb            pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Importo scadenza                                  *
      *            *---------------------------------------------------*
               10  srt-imp-sdb            pic s9(11)       sign is
                                                           trailing
                                                           separate
                                                           character  .
      *            *---------------------------------------------------*
      *            * Tipo scadenza                                     *
      *            *---------------------------------------------------*
               10  srt-tip-sdb            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo acquisizione scadenza                        *
      *            *---------------------------------------------------*
               10  srt-tac-sdb            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza del debitore                    *
      *            *---------------------------------------------------*
               10  srt-dpz-dbt            pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Inoltro scadenza al debitore                      *
      *            *---------------------------------------------------*
               10  srt-inl-sdb            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice ABI per l'appoggio                         *
      *            *---------------------------------------------------*
               10  srt-abi-app            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice CAB per l'appoggio                         *
      *            *---------------------------------------------------*
               10  srt-cab-app            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice C/C per l'appoggio                         *
      *            *---------------------------------------------------*
               10  srt-ccc-app            pic  x(12)                  .
      *            *---------------------------------------------------*
      *            * Data documento di riferimento                     *
      *            *---------------------------------------------------*
               10  srt-dat-ddr            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero documento di riferimento                   *
      *            *---------------------------------------------------*
               10  srt-num-ddr            pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Tipo documento di riferimento                     *
      *            *---------------------------------------------------*
               10  srt-tip-ddr            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Importo documento di riferimento                  *
      *            *---------------------------------------------------*
               10  srt-imp-ddr            pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Numero rata documento di riferimento              *
      *            *---------------------------------------------------*
               10  srt-nra-ddr            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo avviso ottenuto                              *
      *            *---------------------------------------------------*
               10  srt-tav-ott            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Status della scadenza                             *
      *            * - 00 : Normale                                    *
      *            * - 01 : Gia' richiamata                            *
      *            * - 02 : Gia' accreditata, se al dopo incasso       *
      *            * - 03 : Gia' avuta notizia di buon esito           *
      *            * - 04 : Gia' avuto presunto buon esito             *
      *            * - 05 : Gia' insoluta                              *
      *            * - 06 : Con flags di elaborazione bloccanti        *
      *            * - 07 : Con flags di sottoponibilita' a pulizia    *
      *            *---------------------------------------------------*
               10  srt-sts-sca            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Data registrazione movimento di richiamo scadenza *
      *            * presentata                                        *
      *            *---------------------------------------------------*
               10  srt-dtr-rsp            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data registrazione movimento di accredito scaden- *
      *            * za presentata al dopo incasso                     *
      *            *---------------------------------------------------*
               10  srt-dtr-acs            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data registrazione movimento di notizia di buon   *
      *            * esito su scadenza presentata                      *
      *            *---------------------------------------------------*
               10  srt-dtr-nbe            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data registrazione movimento di presunto buon     *
      *            * esito su scadenza presentata                      *
      *            *---------------------------------------------------*
               10  srt-dtr-pbe            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data registrazione movimento di insoluto su sca-  *
      *            * denza presentata                                  *
      *            *---------------------------------------------------*
               10  srt-dtr-isp            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Flag/contatore di stampa effetto eseguita         *
      *            *---------------------------------------------------*
               10  srt-flc-stp            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Flags di elaborazione, bloccanti e non-bloccanti  *
      *            * denza presentata                                  *
      *            *---------------------------------------------------*
               10  srt-flg-ela.
                   15  srt-flg-blo.
                       20  srt-flg-blx
                               occurs 07  pic  x(01)                  .
                   15  srt-flg-nbl.
                       20  srt-flg-nbx
                               occurs 03  pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di sottoponibilita' a pulizia                *
      *            *---------------------------------------------------*
               10  srt-flg-pul            pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine rou-let-reg-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-let-reg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-ins-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-ins      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-mod-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-mod      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-vis-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-vis      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-snx-del      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-snx-del      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-tus.
      *            *---------------------------------------------------*
      *            * Da accettazione campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-nok      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione testata                           *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione corpo                             *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione riga corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione piede                             *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-key-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per controllo se chiave vuota                     *
      *            *---------------------------------------------------*
               10  w-cnt-key-vuo-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-nok-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per tasto Do su riga corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-rig-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su modalita' di funzionamento      *
      *        *-------------------------------------------------------*
           05  w-cnt-mfu.
      *            *---------------------------------------------------*
      *            * Tipo impostazione                                 *
      *            * - K : Impostazione campi chiave                   *
      *            * - T : Impostazione campi testata                  *
      *            * - C : Impostazione primo campo riga corpo         *
      *            * - R : Impostazione altri campi riga corpo         *
      *            * - P : Impostazione campi piede                    *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-imp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo funzione                                     *
      *            * - I : Inserimento                                 *
      *            * - M : Modifica                                    *
      *            * - V : Visualizzazione                             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-fun      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flag di controllo su status visualizzazione titolo    *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis-tit          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione chiave                               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina testata in corso di trattamento     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-npt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Salvataggio per il campo precedente               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-svp      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Si/No pagina testata in corso di trattamento      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-snp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagine componenti la testata               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-mpt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Impostazione testata                              *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione pagine di testata                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-pte.
                   15  w-cnt-sts-imp-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Ingresso in pagine di testata                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-ing-pte.
                   15  w-cnt-sts-ing-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione corpo                                *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione riga corpo                           *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione piede                                *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-pie      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di inibizione manuale tasto Delt             *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-itd      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts chiave                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts testata                   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts pagine di testata         *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-pte.
                   15  w-cnt-sts-pmt-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts corpo                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts riga accettazione corpo   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts piede                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati chiave                       *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati testata                      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati pagine di testata            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-pte.
                   15  w-cnt-sts-vis-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati riga di accettazione corpo   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati piede                        *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per trattamento corpo               *
      *        *-------------------------------------------------------*
           05  w-cnt-cor.
      *            *---------------------------------------------------*
      *            * Numero riga da accettare                          *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrg-dac      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero riga da visualizzare                       *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrg-dav      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo visualizzazione riga                         *
      *            *---------------------------------------------------*
               10  w-cnt-cor-tvi-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina corpo da visualizzare               *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrp-dav      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina corpo visualizzata                  *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrp-vis      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo aggiornamento post-riga (+ o -)              *
      *            *---------------------------------------------------*
               10  w-cnt-cor-tip-agg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per variazioni                      *
      *        *-------------------------------------------------------*
           05  w-cnt-var.
      *            *---------------------------------------------------*
      *            * Flag di variazioni in testata che si ripercuotono *
      *            * su tutte le righe corpo                           *
      *            *---------------------------------------------------*
               10  w-cnt-var-tes-cor      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per Slct da primo campo riga corpo  *
      *        *-------------------------------------------------------*
           05  w-cnt-slc.
      *            *---------------------------------------------------*
      *            * Numero riga di destinazione per Slct              *
      *            *---------------------------------------------------*
               10  w-cnt-slc-num-rig      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Rappresentazione alfa del numero riga             *
      *            *---------------------------------------------------*
               10  w-cnt-slc-rap-alf.
                   15  w-cnt-slc-rap-chr
                               occurs 05  pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Rappresentazione numerica del numero riga         *
      *            *---------------------------------------------------*
               10  w-cnt-slc-rap-num      pic  9(05)                  .
               10  w-cnt-slc-rap-n02 redefines
                   w-cnt-slc-rap-num.
                   15  w-cnt-slc-rap-cif
                               occurs 05  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per accettazioni singoli campi      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
               10  w-cnt-acc-flg-aum      pic  x(01)                  .
               10  w-cnt-acc-sav-tip      pic  x(01)                  .
               10  w-cnt-acc-sav-car      pic  9(02)                  .
               10  w-cnt-acc-sav-ldt      pic  9(02)                  .
               10  w-cnt-acc-sav-dec      pic  9(01)                  .
               10  w-cnt-acc-sav-sgn      pic  x(01)                  .
               10  w-cnt-acc-sav-edm      pic  x(10)                  .
               10  w-cnt-acc-sav-msk      pic  x(24)                  .
               10  w-cnt-acc-sav-lin      pic  9(02)                  .
               10  w-cnt-acc-sav-pos      pic  9(02)                  .
               10  w-cnt-acc-sav-alf      pic  x(80)                  .
               10  w-cnt-acc-sav-txt.
                   15  filler occurs 400  pic  x(01)                  .
               10  w-cnt-acc-sav-num      pic s9(13)v9(05)  trailing
                                                            separate
                                                            character .
               10  w-cnt-acc-sav-dat      pic  9(07)                  .
               10  w-cnt-acc-sav-ufk      pic  x(80)                  .
               10  w-cnt-acc-sav-mod      pic  x(01)                  .
               10  w-cnt-acc-sav-l23      pic  x(80)                  .
               10  w-cnt-acc-sav-l24      pic  x(80)                  .
      *        *-------------------------------------------------------*
      *        * Work area                                             *
      *        *-------------------------------------------------------*
           05  w-cnt-wrk.
               10  w-cnt-wrk-ctr-001      pic  9(05)                  .
               10  w-cnt-wrk-ctr-002      pic  9(05)                  .
               10  w-cnt-wrk-ctr-003      pic  9(05)                  .
               10  w-cnt-wrk-ctr-008      pic  9(05)                  .
               10  w-cnt-wrk-ctr-009      pic  9(05)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [zsb]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfzsb"                          .
      *        *-------------------------------------------------------*
      *        * [gep]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfgep"                          .
      *        *-------------------------------------------------------*
      *        * [sdb]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfsdb"                          .
      *        *-------------------------------------------------------*
      *        * [obp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfobp"                          .
      *        *-------------------------------------------------------*
      *        * [ddp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfddp"                          .
      *        *-------------------------------------------------------*
      *        * [cbp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfcbp"                          .
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [axi]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxi"                          .
      *        *-------------------------------------------------------*
      *        * [axs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxs"                          .
      *        *-------------------------------------------------------*
      *        * [axc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxc"                          .

      *    *===========================================================*
      *    * Work-area per bufferizzazione testata                     *
      *    *-----------------------------------------------------------*
       01  w-tes.
      *        *-------------------------------------------------------*
      *        * Valori chiave                                         *
      *        *-------------------------------------------------------*
           05  w-tes-val-key.
      *            *---------------------------------------------------*
      *            * Data di registrazione                             *
      *            *---------------------------------------------------*
               10  w-tes-dat-reg          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Tipo operazione                                   *
      *            *---------------------------------------------------*
               10  w-tes-tip-ope          pic  9(04)                  .
      *            *---------------------------------------------------*
      *            * Descrizione tipo operazione                       *
      *            *---------------------------------------------------*
               10  w-tes-tip-ope-des      pic  x(50)                  .
      *            *---------------------------------------------------*
      *            * Numero distinta impostato in chiave               *
      *            *---------------------------------------------------*
               10  w-tes-num-dis          pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Valori attuali e precedenti                           *
      *        *-------------------------------------------------------*
           05  w-tes-val-aep occurs 2.
      *            *---------------------------------------------------*
      *            * Per scelte di stampa                              *
      *            *---------------------------------------------------*
               10  w-tes-sce-sta.
      *                *-----------------------------------------------*
      *                * Numero ricevute bancarie nella distinta       *
      *                *-----------------------------------------------*
                   15  w-tes-sce-nrb      pic  9(03)                  .
      *                *-----------------------------------------------*
      *                * Numero tratte nella distinta                  *
      *                *-----------------------------------------------*
                   15  w-tes-sce-ntr      pic  9(03)                  .
      *                *-----------------------------------------------*
      *                * Tipo di selezione scadenze da stampare        *
      *                * - 01 : Solo scadenze mai stampate finora      *
      *                * - 02 : Solo scadenze selezionate manualmente  *
      *                * - 03 : Tutte le scadenze incluse in distinta  *
      *                *-----------------------------------------------*
                   15  w-tes-sce-tse      pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Numero effetti appartenenti alla distinta che *
      *                * sono gia' stati stampati                      *
      *                *-----------------------------------------------*
                   15  w-tes-sce-ngs      pic  9(03)                  .
      *                *-----------------------------------------------*
      *                * Si/No stampa ricevute bancarie                *
      *                * - S : Si                                      *
      *                * - N : No                                      *
      *                *-----------------------------------------------*
                   15  w-tes-sce-srb      pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Si/No stampa tratte                           *
      *                * - S : Si                                      *
      *                * - N : No                                      *
      *                *-----------------------------------------------*
                   15  w-tes-sce-str      pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Si/No stampa nostra intestazione              *
      *                * - S : Si                                      *
      *                * - N : No                                      *
      *                *-----------------------------------------------*
                   15  w-tes-sce-sni      pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Si/No stampa denominazione della banca di     *
      *                * presentazione                                 *
      *                * - S : Si                                      *
      *                * - N : No                                      *
      *                *-----------------------------------------------*
                   15  w-tes-sce-sbp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Data di sistema di ultimo inserimento/modifica    *
      *            *---------------------------------------------------*
               10  w-tes-ide-dat          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice utente di ultimo inserimento/modifica      *
      *            *---------------------------------------------------*
               10  w-tes-ide-ute          pic  x(08)                  .
      *            *---------------------------------------------------*
      *            * Fase di ultimo inserimento/modifica               *
      *            *---------------------------------------------------*
               10  w-tes-ide-fas          pic  x(06)                  .
      *            *---------------------------------------------------*
      *            * Data registrazione movimento di composizione di-  *
      *            * stinta                                            *
      *            *---------------------------------------------------*
               10  w-tes-dtr-com          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero distinta : s.aa.nnnnnnnn                   *
      *            *---------------------------------------------------*
               10  w-tes-num-ddp          pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Tipo distinta                                     *
      *            * - 01 : Incassi elettronici                        *
      *            * - 02 : Effetti                                    *
      *            * - 03 : Paghero' cambiari                          *
      *            * - 04 : Cessioni da clienti                        *
      *            *---------------------------------------------------*
               10  w-tes-tip-ddp          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo avviso richiesto                             *
      *            * - 01 : Conferme d'ordine oppure Ri.Ba.            *
      *            * - 02 : Conferme d'ordine oppure M.Av.             *
      *            * - 03 : Solo Ri.Ba.                                *
      *            * - 04 : Solo M.Av.                                 *
      *            * - 05 : Solo R.I.D.                                *
      *            *---------------------------------------------------*
               10  w-tes-tav-ric          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipi scadenza da includere in distinta            *
      *            * - 0002 : Incassi elettronici                      *
      *            * - 0003 : Ri.Ba.                                   *
      *            * - 0004 : C.d.O.                                   *
      *            * - 0005 : M.Av.                                    *
      *            * - 0006 : R.I.D.                                   *
      *            * - 0009 : Ricevute bancarie                        *
      *            * - 0010 : Tratte                                   *
      *            * - 0011 : Paghero' cambiari                        *
      *            * - 0061 : Paghero' cambiari avuti in cessione      *
      *            * - 0203 : Incassi elettronici e Ri.Ba.             *
      *            * - 0204 : Incassi elettronici e C.d.O.             *
      *            * - 0205 : Incassi elettronici e M.Av.              *
      *            * - 0910 : Ricevute bancarie e Tratte               *
      *            *---------------------------------------------------*
               10  w-tes-tsc-das          pic  9(04)                  .
      *            *---------------------------------------------------*
      *            * Data scadenza minima da selezionare               *
      *            *---------------------------------------------------*
               10  w-tes-dsc-min          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data scadenza massima da selezionare              *
      *            *---------------------------------------------------*
               10  w-tes-dsc-max          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Anche scadenze a vista da selezionare             *
      *            * - S : Si                                          *
      *            * - N : No                                          *
      *            *---------------------------------------------------*
               10  w-tes-dsc-vis          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Selezione su circuiti interbancari                *
      *            *                                                   *
      *            * N.B.: Questa selezione e' stata sostituita da     *
      *            *       quella sulla nostra banca di presentazione  *
      *            *       per la selezione su anagrafiche clienti     *
      *            *---------------------------------------------------*
               10  w-tes-cir-itb.
                   15  w-tes-cod-cib  occurs 05
                                          pic  x(02)                  .
      *            *---------------------------------------------------*
      *            * Codice nostra banca per la presentazione per la   *
      *            * selezione su anagrafiche clienti                  *
      *            *---------------------------------------------------*
               10  w-tes-cod-bpe          pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Codice nostra banca per la presentazione, descri- *
      *            * zione                                             *
      *            *---------------------------------------------------*
               10  w-tes-cod-bpe-des      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Importo massimo per la distinta                   *
      *            *---------------------------------------------------*
               10  w-tes-imp-max          pic s9(13)       sign is
                                                           trailing
                                                           separate
                                                           character  .
      *            *---------------------------------------------------*
      *            * Importo effettivo della distinta                  *
      *            *---------------------------------------------------*
               10  w-tes-imp-ddp          pic s9(13)       sign is
                                                           trailing
                                                           separate
                                                           character  .
      *            *---------------------------------------------------*
      *            * Data registrazione movimento di presentazione di- *
      *            * stinta                                            *
      *            *---------------------------------------------------*
               10  w-tes-dtr-pre          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data registrazione movimento di contabilita' a    *
      *            * fronte del movimento di presentazione distinta    *
      *            *---------------------------------------------------*
               10  w-tes-drc-pre          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero protocollo movimento di contabilita' a     *
      *            * fronte del movimento di presentazione distinta    *
      *            *---------------------------------------------------*
               10  w-tes-npc-pre          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Tipo di presentazione                             *
      *            * - 01 : Accredito SBF a maturazione di valuta      *
      *            * - 02 : Accredito immediato SBF                    *
      *            * - 03 : Accredito al dopo incasso                  *
      *            * - 04 : Allo sconto                                *
      *            *---------------------------------------------------*
               10  w-tes-tip-pre          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice nostra banca per la presentazione          *
      *            *---------------------------------------------------*
               10  w-tes-cod-cbp          pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Codice nostra banca per la presentazione, descri- *
      *            * zione                                             *
      *            *---------------------------------------------------*
               10  w-tes-cod-cbp-des      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice nostra banca per la presentazione, codice  *
      *            * A.B.I.                                            *
      *            *---------------------------------------------------*
               10  w-tes-cod-cbp-abi      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice nostra banca per la presentazione, codice  *
      *            * A.B.I.                                            *
      *            *---------------------------------------------------*
               10  w-tes-cod-cbp-cab      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice nostra banca per la presentazione, codice  *
      *            * sottoconto per il conto corrente                  *
      *            *---------------------------------------------------*
               10  w-tes-cod-cbp-cco      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice nostra banca per la presentazione, codice  *
      *            * sottoconto per la presentazione della distinta    *
      *            *---------------------------------------------------*
               10  w-tes-cod-cbp-pre      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice nostra banca per la presentazione, codice  *
      *            * sottoconto per gli oneri bancari                  *
      *            *---------------------------------------------------*
               10  w-tes-cod-cbp-onb      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice nostra banca per la presentazione, codice  *
      *            * sottoconto per gli interessi bancari              *
      *            *---------------------------------------------------*
               10  w-tes-cod-cbp-inb      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Stampa cartacea distinta                          *
      *            * - S : Si                                          *
      *            * - N : No                                          *
      *            *---------------------------------------------------*
               10  w-tes-snx-stp          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag/contatore di stampa su carta eseguita        *
      *            *---------------------------------------------------*
               10  w-tes-flc-stp          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Preparazione archivio di supporto per trasmis-    *
      *            * sione distinta alla banca                         *
      *            * - S : Si                                          *
      *            * - N : No                                          *
      *            *---------------------------------------------------*
               10  w-tes-snx-ads          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag/contatore di preparazione archivio di sup-   *
      *            * porto per trasmissione distinta alla banca ese-   *
      *            * guita                                             *
      *            *---------------------------------------------------*
               10  w-tes-flc-ads          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo di invio dell'archivio di supporto alla      *
      *            * banca                                             *
      *            * - 01 : Tramite dischetto                          *
      *            * - 02 : Tramite Home Banking                       *
      *            *---------------------------------------------------*
               10  w-tes-tip-ias          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Flag/contatore di invio dell'archivio di supporto *
      *            * alla banca eseguito                               *
      *            *---------------------------------------------------*
               10  w-tes-flc-ias          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Data registrazione movimento di accettazione di-  *
      *            * stinta da parte della banca                       *
      *            *---------------------------------------------------*
               10  w-tes-dtr-act          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data registrazione movimento di contabilita' a    *
      *            * fronte del movimento di accettazione distinta da  *
      *            * parte della banca                                 *
      *            *---------------------------------------------------*
               10  w-tes-drc-act          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero protocollo movimento di contabilita' a     *
      *            * fronte del movimento di accettazione distinta da  *
      *            * parte della banca                                 *
      *            *---------------------------------------------------*
               10  w-tes-npc-act          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data contabile bancaria per il movimento di ac-   *
      *            * cettazione distinta da parte della banca          *
      *            *---------------------------------------------------*
               10  w-tes-dcb-act          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero contabile bancaria per il movimento di ac- *
      *            * cettazione distinta da parte della banca          *
      *            *---------------------------------------------------*
               10  w-tes-ncb-act          pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Importo spese addebitate dalla banca al momento   *
      *            * della accettazione della distinta                 *
      *            *---------------------------------------------------*
               10  w-tes-spe-act          pic s9(11)       sign is
                                                           trailing
                                                           separate
                                                           character  .
      *            *---------------------------------------------------*
      *            * Importo interessi addebitati dalla banca al mo-   *
      *            * mento della accettazione della distinta           *
      *            *---------------------------------------------------*
               10  w-tes-int-act          pic s9(11)       sign is
                                                           trailing
                                                           separate
                                                           character  .
      *            *---------------------------------------------------*
      *            * Data registrazione movimento di accredito di-     *
      *            * stinta in conto corrente da parte della banca     *
      *            *---------------------------------------------------*
               10  w-tes-dtr-acd          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data registrazione movimento di contabilita' a    *
      *            * fronte del movimento di accredito distinta in     *
      *            * conto corrente da parte della banca               *
      *            *---------------------------------------------------*
               10  w-tes-drc-acd          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero protocollo movimento di contabilita' a     *
      *            * fronte del movimento di accredito distinta in     *
      *            * conto corrente da parte della banca               *
      *            *---------------------------------------------------*
               10  w-tes-npc-acd          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data contabile bancaria per il movimento di ac-   *
      *            * credito distinta in conto corrente da parte della *
      *            * banca                                             *
      *            *---------------------------------------------------*
               10  w-tes-dcb-acd          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero contabile bancaria per il movimento di ac- *
      *            * credito distinta in conto corrente da parte della *
      *            * banca                                             *
      *            *---------------------------------------------------*
               10  w-tes-ncb-acd          pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Importo spese addebitate dalla banca al momento   *
      *            * dell'accredito distinta in conto corrente da      *
      *            * parte della banca                                 *
      *            *---------------------------------------------------*
               10  w-tes-spe-acd          pic s9(11)       sign is
                                                           trailing
                                                           separate
                                                           character  .
      *            *---------------------------------------------------*
      *            * Importo interessi addebitati dalla banca al mo-   *
      *            * mento dell'accredito distinta in conto corrente   *
      *            * da parte della banca                              *
      *            *---------------------------------------------------*
               10  w-tes-int-acd          pic s9(11)       sign is
                                                           trailing
                                                           separate
                                                           character  .
      *            *---------------------------------------------------*
      *            * Flags di elaborazione                             *
      *            *---------------------------------------------------*
               10  w-tes-flg-ela.
      *                *-----------------------------------------------*
      *                * Flags di elaborazione bloccanti               *
      *                *-----------------------------------------------*
                   15  w-tes-flg-blo.
                       20  w-tes-flg-blx occurs 07
                                          pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Flags di elaborazione non bloccanti           *
      *                *-----------------------------------------------*
                   15  w-tes-flg-nbl.
                       20  w-tes-flg-nbx occurs 03
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di sottoponibilita' a pulizia                *
      *            *---------------------------------------------------*
               10  w-tes-flg-pul          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area libera per espansioni speciali               *
      *            *---------------------------------------------------*
               10  w-tes-alx-exp.
                   15  filler  occurs 20  pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per bufferizzazione riga corpo                  *
      *    *-----------------------------------------------------------*
       01  w-rig.
      *        *-------------------------------------------------------*
      *        * Area valori attuali e precedenti                      *
      *        *-------------------------------------------------------*
           05  w-rig-val-aep     occurs 2.
      *            *---------------------------------------------------*
      *            * Numero progressivo                                *
      *            *---------------------------------------------------*
               10  w-rig-num-prg          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Per scelte di stampa                              *
      *            *---------------------------------------------------*
               10  w-rig-sce-sta.
      *                *-----------------------------------------------*
      *                * Si no selezione stampa effetto                *
      *                * - S : Si                                      *
      *                * - N : No                                      *
      *                *                                               *
      *                * Significativo solo se tipo selezione effetti  *
      *                * da stampare : manuale                         *
      *                *-----------------------------------------------*
                   15  w-rig-sce-sns      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero scadenza                                   *
      *            *---------------------------------------------------*
               10  w-rig-num-sdb          pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Tipo scadenza                                     *
      *            *---------------------------------------------------*
               10  w-rig-tip-sdb          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo acquisizione scadenza                        *
      *            *---------------------------------------------------*
               10  w-rig-tac-sdb          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Data scadenza                                     *
      *            *---------------------------------------------------*
               10  w-rig-dts-sdb          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Tipo debitore                                     *
      *            *---------------------------------------------------*
               10  w-rig-tip-dbt          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice debitore                                   *
      *            *---------------------------------------------------*
               10  w-rig-cod-dbt          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice debitore, ragione sociale                  *
      *            *---------------------------------------------------*
               10  w-rig-cod-dbt-rag      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice debitore, indirizo                         *
      *            *---------------------------------------------------*
               10  w-rig-cod-dbt-via      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice debitore, localita'                        *
      *            *---------------------------------------------------*
               10  w-rig-cod-dbt-loc      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza del debitore                    *
      *            *---------------------------------------------------*
               10  w-rig-dpz-dbt          pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza del debitore, ragione sociale   *
      *            *---------------------------------------------------*
               10  w-rig-dpz-dbt-rag      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza del debitore, indirizzo         *
      *            *---------------------------------------------------*
               10  w-rig-dpz-dbt-via      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza del debitore, localita'         *
      *            *---------------------------------------------------*
               10  w-rig-dpz-dbt-loc      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Inoltro scadenza al debitore                      *
      *            *---------------------------------------------------*
               10  w-rig-inl-sdb          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Importo scadenza                                  *
      *            *---------------------------------------------------*
               10  w-rig-imp-sdb          pic s9(11)       sign is
                                                           trailing
                                                           separate
                                                           character  .
      *            *---------------------------------------------------*
      *            * Codice ABI per l'appoggio                         *
      *            *---------------------------------------------------*
               10  w-rig-abi-app          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice CAB per l'appoggio                         *
      *            *---------------------------------------------------*
               10  w-rig-cab-app          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice C/C per l'appoggio                         *
      *            *---------------------------------------------------*
               10  w-rig-ccc-app          pic  x(12)                  .
      *            *---------------------------------------------------*
      *            * Data documento di riferimento                     *
      *            *---------------------------------------------------*
               10  w-rig-dat-ddr          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero documento di riferimento                   *
      *            *---------------------------------------------------*
               10  w-rig-num-ddr          pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Tipo documento di riferimento                     *
      *            *---------------------------------------------------*
               10  w-rig-tip-ddr          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Importo documento di riferimento                  *
      *            *---------------------------------------------------*
               10  w-rig-imp-ddr          pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Numero rata documento di riferimento              *
      *            *---------------------------------------------------*
               10  w-rig-nra-ddr          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo avviso ottenuto                              *
      *            * - 00 : Non significativo o non ancora determinato *
      *            * - 03 : Ri.Ba.                                     *
      *            * - 04 : C.d.O.                                     *
      *            * - 05 : M.Av.                                      *
      *            *---------------------------------------------------*
               10  w-rig-tav-ott          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Flag contatore di stampa effetto eseguita         *
      *            *---------------------------------------------------*
               10  w-rig-flc-stp          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Status della scadenza                             *
      *            * - 00 : Normale                                    *
      *            * - 01 : Gia' richiamata                            *
      *            * - 02 : Gia' accreditata, se al dopo incasso       *
      *            * - 03 : Gia' avuta notizia di buon esito           *
      *            * - 04 : Gia' avuto presunto buon esito             *
      *            * - 05 : Gia' insoluta                              *
      *            * - 06 : Con flags di elaborazione bloccanti        *
      *            * - 07 : Con flags di sottoponibilita' a pulizia    *
      *            *---------------------------------------------------*
               10  w-rig-sts-sca          pic  9(02)                  .

      *    *===========================================================*
      *    * Area di comunicazione per gestione catena rig, con buffer *
      *    * dati in grado di ospitare l'area w-rig                    *
      *    *-----------------------------------------------------------*
       01  w-cat-rig.
           05  w-cat-rig-ope              pic  x(02)                  .
           05  w-cat-rig-exs              pic  x(01)                  .
           05  w-cat-rig-num              pic  9(05)                  .
           05  w-cat-rig-cur              pic  9(05)                  .
           05  w-cat-rig-prg              pic  9(05)                  .
           05  w-cat-rig-max              pic  9(05)                  .
           05  w-cat-rig-app              pic  x(01)                  .
           05  w-cat-rig-ins              pic  x(01)                  .
           05  w-cat-rig-new              pic  x(01)                  .
           05  w-cat-rig-lst              pic  x(01)                  .
           05  w-cat-rig-buf.
               10  filler occurs 1024     pic  x(01)                  .

      *    *===========================================================*
      *    * Work per linea corpo a video                              *
      *    *-----------------------------------------------------------*
       01  w-lin.
      *        *-------------------------------------------------------*
      *        * Numero righe di corpo effettive visibili contempora-  *
      *        * neamente in una pagina di corpo nell'area di scroll   *
      *        *-------------------------------------------------------*
           05  w-lin-num-lin-vis          pic  9(02)       value 08   .
      *        *-------------------------------------------------------*
      *        * Numero linee di display impegnate per ogni riga corpo *
      *        * nell'area di scroll                                   *
      *        *-------------------------------------------------------*
           05  w-lin-num-lin-prc          pic  9(02)       value 01   .
      *        *-------------------------------------------------------*
      *        * Prima linea di display utilizzata per le righe corpo  *
      *        * nell'area di scroll                                   *
      *        *-------------------------------------------------------*
           05  w-lin-pri-lin-vid          pic  9(02)       value 10   .
      *        *-------------------------------------------------------*
      *        * Immagine di una riga di corpo su video                *
      *        *-------------------------------------------------------*
           05  w-lin-imm.
      *            *---------------------------------------------------*
      *            * Linee di display per ogni riga corpo in scroll    *
      *            *---------------------------------------------------*
               10  w-lin-imm-dsp.
                   15  w-lin-imm-dsp-lin occurs 01
                                          pic  x(80)                  .
      *            *---------------------------------------------------*
      *            * Riga corpo in scroll rappresentata linearmente    *
      *            *---------------------------------------------------*
               10  w-lin-imm-scr redefines
                   w-lin-imm-dsp.
      *                *-----------------------------------------------*
      *                * Numero linea                                  *
      *                *-----------------------------------------------*
                   15  w-lin-imm-num-lin  pic  x(03)                  .
      *                *-----------------------------------------------*
      *                * Altri dati visualizzati                       *
      *                *-----------------------------------------------*
                   15  w-lin-imm-w01-w02  pic  x(77)                  .
      *        *-------------------------------------------------------*
      *        * Work per immagine di una riga di corpo su video con   *
      *        * la selezione manuale effetti da stampare              *
      *        *-------------------------------------------------------*
           05  w-lin-w01.
               10  filler                 pic  x(02)                  .
               10  w-lin-w01-sce-sns      pic  x(02)                  .
               10  filler                 pic  x(02)                  .
               10  w-lin-w01-tip-sdb      pic  x(04)                  .
               10  w-lin-w01-flc-stp      pic  x(01)                  .
               10  filler                 pic  x(01)                  .
               10  w-lin-w01-rag-dpz      pic  x(40)                  .
               10  w-lin-w01-imp-sca      pic  x(15)                  .
               10  filler                 pic  x(02)                  .
               10  w-lin-w01-dat-sca      pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Work per immagine di una riga di corpo su video senza *
      *        * la selezione manuale effetti da stampare              *
      *        *-------------------------------------------------------*
           05  w-lin-w02.
               10  filler                 pic  x(02)                  .
               10  w-lin-w02-flc-stp      pic  x(01)                  .
               10  filler                 pic  x(03)                  .
               10  w-lin-w02-rag-dpz      pic  x(40)                  .
               10  filler                 pic  x(05)                  .
               10  w-lin-w02-imp-sca      pic  x(15)                  .
               10  filler                 pic  x(03)                  .
               10  w-lin-w02-dat-sca      pic  x(08)                  .

      *    *===========================================================*
      *    * Work per subroutines di Find                              *
      *    *-----------------------------------------------------------*
       01  w-fnd.
      *        *-------------------------------------------------------*
      *        * Work per Find su archivio [ddp]                       *
      *        *-------------------------------------------------------*
           05  w-fnd-arc-ddp.
               10  w-fnd-arc-ddp-sns      pic  x(01)                  .
               10  w-fnd-arc-ddp-sel      pic  x(01)                  .
               10  w-fnd-arc-ddp-tip      pic  9(02)                  .
               10  w-fnd-arc-ddp-sld      pic  9(02)                  .
               10  w-fnd-arc-ddp-num      pic  9(11)                  .

      *    *===========================================================*
      *    * Work per subroutines di Espansione                        *
      *    *-----------------------------------------------------------*
       01  w-esp.
      *        *-------------------------------------------------------*
      *        * Work per Espansione su archivio [ddp]                 *
      *        *-------------------------------------------------------*
           05  w-esp-arc-ddp.
               10  w-esp-arc-ddp-sns      pic  x(01)                  .
               10  w-esp-arc-ddp-sel      pic  x(01)                  .
               10  w-esp-arc-ddp-num      pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Work per Espansione su archivio [sdb]                 *
      *        *-------------------------------------------------------*
           05  w-esp-arc-sdb.
               10  w-esp-arc-sdb-sns      pic  x(01)                  .
               10  w-esp-arc-sdb-sel      pic  x(01)                  .
               10  w-esp-arc-sdb-num      pic  9(11)                  .
               
      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio scadenze                     *
      *        *-------------------------------------------------------*
           05  w-let-arc-sdb.
               10  w-let-arc-sdb-flg      pic  x(01)                  .
               10  w-let-arc-sdb-num      pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio obbligati principali         *
      *        *-------------------------------------------------------*
           05  w-let-arc-obp.
               10  w-let-arc-obp-flg      pic  x(01)                  .
               10  w-let-arc-obp-tip      pic  9(02)                  .
               10  w-let-arc-obp-num      pic  9(11)                  .
               10  w-let-arc-obp-rag      pic  x(40)                  .
               10  w-let-arc-obp-via      pic  x(40)                  .
               10  w-let-arc-obp-loc      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio debitori                     *
      *        *-------------------------------------------------------*
           05  w-let-arc-dbt.
               10  w-let-arc-dbt-flg      pic  x(01)                  .
               10  w-let-arc-dbt-tip      pic  9(02)                  .
               10  w-let-arc-dbt-cod      pic  9(07)                  .
               10  w-let-arc-dbt-rag      pic  x(40)                  .
               10  w-let-arc-dbt-via      pic  x(40)                  .
               10  w-let-arc-dbt-loc      pic  x(40)                  .
               10  w-let-arc-dbt-cge      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio dipendenze debitori          *
      *        *-------------------------------------------------------*
           05  w-let-dpz-dbt.
               10  w-let-dpz-dbt-flg      pic  x(01)                  .
               10  w-let-dpz-dbt-tip      pic  9(02)                  .
               10  w-let-dpz-dbt-cod      pic  9(07)                  .
               10  w-let-dpz-dbt-dpz      pic  x(04)                  .
               10  w-let-dpz-dbt-rag      pic  x(40)                  .
               10  w-let-dpz-dbt-via      pic  x(40)                  .
               10  w-let-dpz-dbt-loc      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [cli]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-cli.
               10  w-let-arc-cli-flg      pic  x(01)                  .
               10  w-let-arc-cli-cod      pic  9(07)                  .
               10  w-let-arc-cli-rag      pic  x(40)                  .
               10  w-let-arc-cli-via      pic  x(40)                  .
               10  w-let-arc-cli-loc      pic  x(40)                  .
               10  w-let-arc-cli-cge      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcc.
               10  w-let-arc-dcc-flg      pic  x(01)                  .
               10  w-let-arc-dcc-tle      pic  x(01)                  .
               10  w-let-arc-dcc-cod      pic  9(07)                  .
               10  w-let-arc-dcc-dpz      pic  x(04)                  .
               10  w-let-arc-dcc-rag      pic  x(40)                  .
               10  w-let-arc-dcc-via      pic  x(40)                  .
               10  w-let-arc-dcc-loc      pic  x(40)                  .
               10  w-let-arc-dcc-abi      pic  9(05)                  .
               10  w-let-arc-dcc-cab      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [axi]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-axi.
               10  w-let-arc-axi-flg      pic  x(01)                  .
               10  w-let-arc-axi-cod      pic  9(05)                  .
               10  w-let-arc-axi-den      pic  x(40)                  .
               10  w-let-arc-axi-cib.
                   15  w-let-arc-axi-cic
                               occurs 05  pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [axs]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-axs.
               10  w-let-arc-axs-flg      pic  x(01)                  .
               10  w-let-arc-axs-abi      pic  9(05)                  .
               10  w-let-arc-axs-cab      pic  9(05)                  .
               10  w-let-arc-axs-den      pic  x(40)                  .
               10  w-let-arc-axs-via      pic  x(40)                  .
               10  w-let-arc-axs-loc      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [axc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-axc.
               10  w-let-arc-axc-flg      pic  x(01)                  .
               10  w-let-arc-axc-cod      pic  x(02)                  .
               10  w-let-arc-axc-des      pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [cbp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-cbp.
               10  w-let-arc-cbp-flg      pic  x(01)                  .
               10  w-let-arc-cbp-tip      pic  9(02)                  .
               10  w-let-arc-cbp-cod      pic  x(10)                  .
               10  w-let-arc-cbp-des      pic  x(40)                  .
               10  w-let-arc-cbp-csc      pic  9(07)                  .
               10  w-let-arc-cbp-csa      pic  9(07)                  .
               10  w-let-arc-cbp-abi      pic  9(05)                  .
               10  w-let-arc-cbp-cab      pic  9(05)                  .
               10  w-let-arc-cbp-ccb      pic  x(12)                  .
               10  w-let-arc-cbp-cco      pic  9(07)                  .
               10  w-let-arc-cbp-bba      pic  9(07)                  .
               10  w-let-arc-cbp-bbp      pic  9(07)                  .
               10  w-let-arc-cbp-psm      pic  9(07)                  .
               10  w-let-arc-cbp-psi      pic  9(07)                  .
               10  w-let-arc-cbp-pdi      pic  9(07)                  .
               10  w-let-arc-cbp-psc      pic  9(07)                  .
               10  w-let-arc-cbp-anv      pic  9(07)                  .
               10  w-let-arc-cbp-dfp      pic  9(07)                  .
               10  w-let-arc-cbp-dfa      pic  9(07)                  .
               10  w-let-arc-cbp-onb      pic  9(07)                  .
               10  w-let-arc-cbp-inb      pic  9(07)                  .
               10  w-let-arc-cbp-ccp      pic  x(12)                  .
               10  w-let-arc-cbp-bpa      pic  9(07)                  .
               10  w-let-arc-cbp-bpp      pic  9(07)                  .

      *    *===========================================================*
      *    * Work-area per salvataggi                                  *
      *    *-----------------------------------------------------------*
       01  w-sav.
      *        *-------------------------------------------------------*
      *        * Area per catena                                       *
      *        *-------------------------------------------------------*
           05  w-sav-cat-rig.
               10  filler    occurs 1512  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area w-rig                                            *
      *        *-------------------------------------------------------*
           05  w-sav-wrk-rig.
               10  filler    occurs 1024  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Numero scadenza                                       *
      *        *-------------------------------------------------------*
           05  w-sav-num-sdb              pic  9(11)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo selezione effetti da stampare         *
      *        *-------------------------------------------------------*
           05  w-exp-sce-tse.
               10  w-exp-sce-tse-num      pic  9(02)       value 03   .
               10  w-exp-sce-tse-lun      pic  9(02)       value 40   .
               10  w-exp-sce-tse-tbl.
                   15  filler             pic  x(40) value
                            "solo scadenze Mai stampate finora       ".
                   15  filler             pic  x(40) value
                            "solo scadenze Selezionate manualmente   ".
                   15  filler             pic  x(40) value
                            "Tutte le scadenze incluse in distinta   ".
      *        *-------------------------------------------------------*
      *        * Work per : Si/No stampa ricevute bancarie             *
      *        *-------------------------------------------------------*
           05  w-exp-sce-srb.
               10  w-exp-sce-srb-num      pic  9(02)       value 02   .
               10  w-exp-sce-srb-lun      pic  9(02)       value 02   .
               10  w-exp-sce-srb-tbl.
                   15  filler             pic  x(02) value
                            "Si"                                      .
                   15  filler             pic  x(02) value
                            "No"                                      .
      *        *-------------------------------------------------------*
      *        * Work per : Si/No stampa tratte                        *
      *        *-------------------------------------------------------*
           05  w-exp-sce-str.
               10  w-exp-sce-str-num      pic  9(02)       value 02   .
               10  w-exp-sce-str-lun      pic  9(02)       value 02   .
               10  w-exp-sce-str-tbl.
                   15  filler             pic  x(02) value
                            "No"                                      .
                   15  filler             pic  x(02) value
                            "Si"                                      .
      *        *-------------------------------------------------------*
      *        * Work per : Si/No stampa nostra intestazione           *
      *        *-------------------------------------------------------*
           05  w-exp-sce-sni.
               10  w-exp-sce-sni-num      pic  9(02)       value 02   .
               10  w-exp-sce-sni-lun      pic  9(02)       value 02   .
               10  w-exp-sce-sni-tbl.
                   15  filler             pic  x(02) value
                            "Si"                                      .
                   15  filler             pic  x(02) value
                            "No"                                      .
      *        *-------------------------------------------------------*
      *        * Work per : Si/No stampa denominazione banca di pre-   *
      *        *            sentazione                                 *
      *        *-------------------------------------------------------*
           05  w-exp-sce-sbp.
               10  w-exp-sce-sbp-num      pic  9(02)       value 02   .
               10  w-exp-sce-sbp-lun      pic  9(02)       value 02   .
               10  w-exp-sce-sbp-tbl.
                   15  filler             pic  x(02) value
                            "No"                                      .
                   15  filler             pic  x(02) value
                            "Si"                                      .
      *        *-------------------------------------------------------*
      *        * Work per : Si/No selezione stampa effetto             *
      *        *-------------------------------------------------------*
           05  w-exp-sce-sns.
               10  w-exp-sce-sns-num      pic  9(02)       value 02   .
               10  w-exp-sce-sns-lun      pic  9(02)       value 02   .
               10  w-exp-sce-sns-tbl.
                   15  filler             pic  x(02) value
                            "Si"                                      .
                   15  filler             pic  x(02) value
                            "No"                                      .
      *        *-------------------------------------------------------*
      *        * Work per : Tipo scadenza                              *
      *        *-------------------------------------------------------*
           05  w-exp-tip-sdb.
               10  w-exp-tip-sdb-num      pic  9(02)       value 11   .
               10  w-exp-tip-sdb-lun      pic  9(02)       value 20   .
               10  w-exp-tip-sdb-tbl.
                   15  filler             pic  x(20) value
                            "Tipo : RD            "                   .
                   15  filler             pic  x(20) value
                            "Tipo : IE            "                   .
                   15  filler             pic  x(20) value
                            "Tipo : RIBA          "                   .
                   15  filler             pic  x(20) value
                            "Tipo : CDO           "                   .
                   15  filler             pic  x(20) value
                            "Tipo : MAV           "                   .
                   15  filler             pic  x(20) value
                            "Tipo : RID           "                   .
                   15  filler             pic  x(20) value
                            "Tipo : BB            "                   .
                   15  filler             pic  x(20) value
                            "Tipo : CCP           "                   .
                   15  filler             pic  x(20) value
                            "Tipo : RB            "                   .
                   15  filler             pic  x(20) value
                            "Tipo : TR            "                   .
                   15  filler             pic  x(20) value
                            "Tipo : CP            "                   .
      *        *-------------------------------------------------------*
      *        * Work per : Tipo distinta                              *
      *        *-------------------------------------------------------*
           05  w-exp-tip-ddp.
               10  w-exp-tip-ddp-num      pic  9(02)       value 04   .
               10  w-exp-tip-ddp-lun      pic  9(02)       value 40   .
               10  w-exp-tip-ddp-tbl.
                   15  filler             pic  x(40) value
                            "distinta Incassi elettronici            ".
                   15  filler             pic  x(40) value
                            "distinta Effetti                        ".
                   15  filler             pic  x(40) value
                            "distinta Paghero' cambiari              ".
                   15  filler             pic  x(40) value
                            "distinta Cessioni                       ".
      *        *-------------------------------------------------------*
      *        * Work per : Tipo di presentazione distinta             *
      *        *-------------------------------------------------------*
           05  w-exp-tip-pre.
               10  w-exp-tip-pre-num      pic  9(02)       value 04   .
               10  w-exp-tip-pre-lun      pic  9(02)       value 40   .
               10  w-exp-tip-pre-tbl.
                   15  filler             pic  x(40) value
                            "accredito SBF a Maturazione di valuta   ".
                   15  filler             pic  x(40) value
                            "accredito Immediato SBF                 ".
                   15  filler             pic  x(40) value
                            "accredito al Dopo incasso               ".
                   15  filler             pic  x(40) value
                            "allo Sconto                             ".
      *        *-------------------------------------------------------*
      *        * Work per : Tipo avviso richiesto in presentazione     *
      *        *-------------------------------------------------------*
           05  w-exp-tav-ric.
               10  w-exp-tav-ric-num      pic  9(02)       value 05   .
               10  w-exp-tav-ric-lun      pic  9(02)       value 40   .
               10  w-exp-tav-ric-tbl.
                   15  filler             pic  x(40) value
                            "CDO, o in alternativa RIBA              ".
                   15  filler             pic  x(40) value
                            "CDO, o in alternativa MAV               ".
                   15  filler             pic  x(40) value
                            "Tutte RIBA                              ".
                   15  filler             pic  x(40) value
                            "Tutti MAV                               ".
                   15  filler             pic  x(40) value
                            "Tutti RID                               ".
      *        *-------------------------------------------------------*
      *        * Work per : Si/No stampa cartacea distinta             *
      *        *-------------------------------------------------------*
           05  w-exp-snx-stp.
               10  w-exp-snx-stp-num      pic  9(02)       value 02   .
               10  w-exp-snx-stp-lun      pic  9(02)       value 02   .
               10  w-exp-snx-stp-tbl.
                   15  filler             pic  x(02) value
                            "Si"                                      .
                   15  filler             pic  x(02) value
                            "No"                                      .
      *        *-------------------------------------------------------*
      *        * Work per : Si/No preparazione archivio di supporto    *
      *        *            per trasmissione alla banca                *
      *        *-------------------------------------------------------*
           05  w-exp-snx-ads.
               10  w-exp-snx-ads-num      pic  9(02)       value 02   .
               10  w-exp-snx-ads-lun      pic  9(02)       value 02   .
               10  w-exp-snx-ads-tbl.
                   15  filler             pic  x(02) value
                            "Si"                                      .
                   15  filler             pic  x(02) value
                            "No"                                      .
      *        *-------------------------------------------------------*
      *        * Work per : Tipo di invio archivio di supporto distin- *
      *        *            ta alla banca                              *
      *        *-------------------------------------------------------*
           05  w-exp-tip-ias.
               10  w-exp-tip-ias-num      pic  9(02)       value 02   .
               10  w-exp-tip-ias-lun      pic  9(02)       value 40   .
               10  w-exp-tip-ias-tbl.
                   15  filler             pic  x(40) value
                            "tramite Dischetto                       ".
                   15  filler             pic  x(40) value
                            "tramite Home banking                    ".

      *    *===========================================================*
      *    * Work per determinazione numero linea a video per tratta-  *
      *    * mento del corpo direttamente nelle righe di scroll        *
      *    *-----------------------------------------------------------*
       01  w-num-lin-scr.
      *        *-------------------------------------------------------*
      *        * Numero riga corpo di riferimento                      *
      *        *-------------------------------------------------------*
           05  w-num-lin-scr-rig          pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Numero linea determinato                              *
      *        *-------------------------------------------------------*
           05  w-num-lin-scr-lin          pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work di comodo per determinazione                     *
      *        *-------------------------------------------------------*
           05  w-num-lin-scr-w01          pic  9(05)                  .
           05  w-num-lin-scr-w02          pic  9(05)                  .

      *    *===========================================================*
      *    * Work per visualizzazioni particolari                      *
      *    *-----------------------------------------------------------*
       01  w-vis.
      *        *-------------------------------------------------------*
      *        * Work per : Visualizzazione prompts di testata         *
      *        *-------------------------------------------------------*
           05  w-vis-pmt-tes.
      *            *---------------------------------------------------*
      *            * Flag per il controllo della visualizzazione dei   *
      *            * prompts di testata, pagina 1, al primo passaggio  *
      *            * - Spaces : non ancora visualizzati                *
      *            * - #      : gia' visualizzati                      *
      *            *---------------------------------------------------*
               10  w-vis-pmt-tes-001     pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per : Circuiti interbancari                      *
      *        *-------------------------------------------------------*
           05  w-vis-cir-itb.
      *            *---------------------------------------------------*
      *            * 5 elementi editati                                *
      *            *---------------------------------------------------*
               10  w-vis-cir-itb-edt.
                   15  w-vis-cir-itb-edy occurs 05.
                       20  w-vis-cir-itb-edx
                                          pic  x(02)                  .
                       20  filler         pic  x(02)                  .
      *            *---------------------------------------------------*
      *            * Indice 1..5                                       *
      *            *---------------------------------------------------*
               10  w-vis-cir-itb-inx      pic  9(02)                  .

      *    *===========================================================*
      *    * Work per caricamento iniziale scadenze per distinta per   *
      *    * mezzo della rilettura della distinta pre-esistente e re-  *
      *    * lativo sort                                               *
      *    *-----------------------------------------------------------*
       01  w-srt-sdb.
      *        *-------------------------------------------------------*
      *        * Parametri in output                                   *
      *        *-------------------------------------------------------*
           05  w-srt-sdb-out.
      *            *---------------------------------------------------*
      *            * Importo globale caricato                          *
      *            *---------------------------------------------------*
               10  w-srt-sdb-out-igc      pic s9(13)       sign is
                                                           trailing
                                                           separate
                                                           character  .
      *            *---------------------------------------------------*
      *            * Numero ricevute bancarie caricate                 *
      *            *---------------------------------------------------*
               10  w-srt-sdb-out-nrb      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero tratte caricate                            *
      *            *---------------------------------------------------*
               10  w-srt-sdb-out-ntr      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero effetti appartenenti alla distinta che so- *
      *            * no gia' stati stampati                            *
      *            *---------------------------------------------------*
               10  w-srt-sdb-out-ngs      pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale, o per messaggi centra- *
      *        * li circondati da un box                               *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .
               10  w-err-box-err-m03      pic  x(65)                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mpslct" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/r"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Filler di 16 Kb                                           *
      *    *-----------------------------------------------------------*
       01  w-kbf-16k.
      *        *-------------------------------------------------------*
      *        * Attenzione : Questo filler e' qui inserito per ovvia- *
      *        *              re ad un errore del compilatore fornito  *
      *        *              dalla Acucobol.                          *
      *        *              Il filler e' stato inserito esattamente  *
      *        *              a questa posizione in quanto e' stato    *
      *        *              constatato, con le liste estese di com-  *
      *        *              pilazione, che a questo punto si e' in   *
      *        *              prossimita', nella working-storage, dei  *
      *        *              64 Kb occupati.                          *
      *        *              L'errore sembra verificarsi proprio nel  *
      *        *              caso in cui si usano dati la cui defini- *
      *        *              zione e' a cavallo dei 64 Kb, ricordan-  *
      *        *              dosi pero' che anche i literal diretta-  *
      *        *              mente contenuti nelle istruzioni vengo-  *
      *        *              no accodati alla working-storage.        *
      *        *-------------------------------------------------------*
           05  filler       occurs 16384  pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area di controllo sub-funzione di stampa             *
      *    *-----------------------------------------------------------*
       01  w-stp.
      *        *-------------------------------------------------------*
      *        * Flag di uscita dalla routine stp-frg-inc-000          *
      *        * - Spaces : Stampa effettivamente eseguita             *
      *        * - #      : Stampa non eseguita                        *
      *        *-------------------------------------------------------*
           05  w-stp-frg-inc-flg          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        * per sub-funzione di stampa                            *
      *        *-------------------------------------------------------*
           05  w-stp-flg.
      *            *---------------------------------------------------*
      *            * Per routine opn-fls-stp-000 per stampa            *
      *            *---------------------------------------------------*
               10  w-stp-opn-fls-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine sel-prm-stp-000 per stampa            *
      *            *---------------------------------------------------*
               10  w-stp-sel-prm-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000 per stampa            *
      *            *---------------------------------------------------*
               10  w-stp-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-srt-stp-000 per stampa            *
      *            *---------------------------------------------------*
               10  w-stp-exe-srt-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area per preparazione parametri selezione stampa      *
      *        *-------------------------------------------------------*
           05  w-stp-stp.
      *            *---------------------------------------------------*
      *            * Tipo di selezione                                 *
      *            *---------------------------------------------------*
               10  w-stp-stp-tip-sel      pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Codice stampante                                  *
      *            *---------------------------------------------------*
               10  w-stp-stp-cod-stp      pic  x(08)                  .
      *            *---------------------------------------------------*
      *            * Tipo stampante                                    *
      *            *---------------------------------------------------*
               10  w-stp-stp-tip-sta      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice modulo                                     *
      *            *---------------------------------------------------*
               10  w-stp-stp-cod-mod      pic  x(08)                  .
      *            *---------------------------------------------------*
      *            * Tipo modulo                                       *
      *            *---------------------------------------------------*
               10  w-stp-stp-tip-mod      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Ampiezza linea in caratteri                       *
      *            *---------------------------------------------------*
               10  w-stp-stp-amp-lin      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero di interlinee di top                       *
      *            *---------------------------------------------------*
               10  w-stp-stp-top-lin      pic  9(04)                  .
      *            *---------------------------------------------------*
      *            * Numero minimo di interlinee di corpo              *
      *            *---------------------------------------------------*
               10  w-stp-stp-lin-min      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Numero di interlinee di bottom                    *
      *            *---------------------------------------------------*
               10  w-stp-stp-bot-lin      pic  9(04)                  .
      *            *---------------------------------------------------*
      *            * Ampiezza caratteri                                *
      *            *---------------------------------------------------*
               10  w-stp-stp-amp-car      pic  9(02)v9(02)            .
      *            *---------------------------------------------------*
      *            * Altezza interlinea                                *
      *            *---------------------------------------------------*
               10  w-stp-stp-alt-int      pic  9(02)v9(02)            .
      *            *---------------------------------------------------*
      *            * Area riservata per espansioni future              *
      *            *---------------------------------------------------*
               10  w-stp-stp-esp-fut      pic  x(99)                  .
      *            *---------------------------------------------------*
      *            * Area riservata per funzioni speciali              *
      *            *---------------------------------------------------*
               10  w-stp-stp-fnz-spc      pic  x(99)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-stp-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-stp-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-stp-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-stp-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-stp-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-stp-prn-sav-liv.
                   15  w-stp-prn-sav-l05  pic  x(64)                  .
                   15  w-stp-prn-sav-l04  pic  x(64)                  .
                   15  w-stp-prn-sav-l03  pic  x(64)                  .
                   15  w-stp-prn-sav-l02  pic  x(64)                  .
                   15  w-stp-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-stp-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-stp-tit.
               10  w-stp-tit-des-tit.
                   15  w-stp-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-stp-tit-num-pag      pic  9(05)                  .
               10  w-stp-tit-dat-stp      pic  9(07)                  .
               10  w-stp-tit-des-azi.
                   15  w-stp-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-stp-tit-ctr-wrk      pic  9(02)                  .
               10  w-stp-tit-ctr-azi      pic  9(02)                  .
               10  w-stp-tit-ctr-tit      pic  9(02)                  .
               10  w-stp-tit-pos-tit      pic  9(03)                  .
               10  w-stp-tit-ctr-dep      pic  9(02)                  .
               10  w-stp-tit-ctr-cif      pic  9(02)                  .
               10  w-stp-tit-pos-dep      pic  9(03)                  .
               10  w-stp-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-stp-stu.
               10  w-stp-stu-num-seg      pic  9(05)                  .
               10  w-stp-stu-pnt-stu      pic  9(05)                  .
               10  w-stp-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-stp-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  filler                 pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per stampa effetti a fronte distinta            *
      *    *-----------------------------------------------------------*
       01  w-sta-eff.
      *        *-------------------------------------------------------*
      *        * Flag per controllo ciclo stampa standard              *
      *        *-------------------------------------------------------*
           05  w-sta-eff-flg-uno          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area per totalizzazioni                               *
      *        *-------------------------------------------------------*
           05  w-sta-eff-tot.
      *            *---------------------------------------------------*
      *            * Numero effetti letti                              *
      *            *---------------------------------------------------*
               10  w-sta-eff-tot-let      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero effetti stampati per la prima volta        *
      *            *---------------------------------------------------*
               10  w-sta-eff-tot-stp      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero effetti ristampati                         *
      *            *---------------------------------------------------*
               10  w-sta-eff-tot-ris      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero effetti non stampati                       *
      *            *---------------------------------------------------*
               10  w-sta-eff-tot-nst      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Area per decodifica cifre lettere                     *
      *        *-------------------------------------------------------*
           05  w-sta-eff-cfl.
      *            *---------------------------------------------------*
      *            * 1. troncone                                       *
      *            *---------------------------------------------------*
               10  w-sta-eff-cfl-001.
                   15  w-sta-eff-cfl-042  pic  x(42)                  .
                   15  w-sta-eff-cfl-043  pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * 2. troncone                                       *
      *            *---------------------------------------------------*
               10  w-sta-eff-cfl-002      pic  x(66)                  .
      *        *-------------------------------------------------------*
      *        * Area per i riferimenti interni                        *
      *        *-------------------------------------------------------*
           05  w-sta-eff-rif.
                   15  w-sta-eff-rif-nse  pic  x(11)                  .
                   15  w-sta-eff-rif-sbe  pic  x(20)                  .
                   15  w-sta-eff-rif-com  pic  x(50)                  .
      *        *-------------------------------------------------------*
      *        * Area per la denominazione ABI                         *
      *        *-------------------------------------------------------*
           05  w-sta-eff-abi.
                   15  w-sta-eff-abi-001  pic  x(20)                  .
                   15  w-sta-eff-abi-002  pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Area per la denominazione CAB                         *
      *        *-------------------------------------------------------*
           05  w-sta-eff-cab.
                   15  w-sta-eff-cab-001  pic  x(20)                  .
                   15  w-sta-eff-cab-002  pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Area per bufferizzazione generalita' del debitore     *
      *        *-------------------------------------------------------*
           05  w-sta-eff-deb.
      *            *---------------------------------------------------*
      *            * Ragione sociale                                   *
      *            *---------------------------------------------------*
               10  w-sta-eff-deb-rag      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Indirizzo                                         *
      *            *---------------------------------------------------*
               10  w-sta-eff-deb-via      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Localita'                                         *
      *            *---------------------------------------------------*
               10  w-sta-eff-deb-loc      pic  x(40)                  .

      *    *===========================================================*
      *    * Work per personalizzazioni di portafoglio                 *
      *    *-----------------------------------------------------------*
       01  w-prs-gep.
      *        *-------------------------------------------------------*
      *        * Work per personalizzazioni portafoglio S.I.A.         *
      *        *-------------------------------------------------------*
           05  w-prs-sia.
      *            *---------------------------------------------------*
      *            * Dati del record di personalizzazione              *
      *            *---------------------------------------------------*
               10  w-prs-sia-dat-rec.
      *                *-----------------------------------------------*
      *                * Descrizione azienda S.I.A. - parte 1.         *
      *                *-----------------------------------------------*
                   15  w-prs-sia-daz-001  pic  x(24)                  .
      *                *-----------------------------------------------*
      *                * Descrizione azienda S.I.A. - parte 2.         *
      *                *-----------------------------------------------*
                   15  w-prs-sia-daz-002  pic  x(24)                  .
      *                *-----------------------------------------------*
      *                * Descrizione azienda S.I.A. - parte 3.         *
      *                *-----------------------------------------------*
                   15  w-prs-sia-daz-003  pic  x(24)                  .
      *                *-----------------------------------------------*
      *                * Descrizione azienda S.I.A. - parte 4.         *
      *                *-----------------------------------------------*
                   15  w-prs-sia-daz-004  pic  x(24)                  .
      *                *-----------------------------------------------*
      *                * Firma emittente per S.I.A.                    *
      *                *-----------------------------------------------*
                   15  w-prs-sia-fir-emi  pic  x(20)                  .
      *                *-----------------------------------------------*
      *                * Codice azienda per S.I.A.                     *
      *                *-----------------------------------------------*
                   15  w-prs-sia-cda-sia  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Conto ordinante e/o NDG                       *
      *                *-----------------------------------------------*
                   15  w-prs-sia-cor-ndg  pic  x(12)                  .
      *                *-----------------------------------------------*
      *                * Provincia autorizzazione                      *
      *                *-----------------------------------------------*
                   15  w-prs-sia-pvc-aut  pic  x(15)                  .
      *                *-----------------------------------------------*
      *                * Numero autorizzazione                         *
      *                *-----------------------------------------------*
                   15  w-prs-sia-num-aut  pic  9(10)                  .
      *                *-----------------------------------------------*
      *                * Data autorizzazione                           *
      *                *-----------------------------------------------*
                   15  w-prs-sia-dat-aut  pic  9(07)                  .

      *    *===========================================================*
      *    * Work per subroutine di calcolo spese bollo su scadenza    *
      *    *-----------------------------------------------------------*
       01  w-spe-bol.
      *        *-------------------------------------------------------*
      *        * Tipo scadenza                                         *
      *        *-------------------------------------------------------*
           05  w-spe-bol-tip-sdb          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Importo scadenza                                      *
      *        *-------------------------------------------------------*
           05  w-spe-bol-imp-sdb          pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Importo spese bollo calcolate                         *
      *        *-------------------------------------------------------*
           05  w-spe-bol-spe-bol          pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Tabella spese bollo per tipo scadenza                 *
      *        * - Indice 01 : Ricevute bancarie                       *
      *        * - Indice 02 : Tratte                                  *
      *        * - Indice 03 : Paghero' cambiari                       *
      *        *-------------------------------------------------------*
           05  w-spe-bol-tab-spb.
      *            *---------------------------------------------------*
      *            * Elementi della tabella                            *
      *            *---------------------------------------------------*
               10  w-spe-bol-ele-spb occurs 03.
      *                *-----------------------------------------------*
      *                * Si/No elemento esistente                      *
      *                * - S      : Si                                 *
      *                * - Spaces : No                                 *
      *                *-----------------------------------------------*
                   15  w-spe-bol-snx-ele  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Tipo di automatismo per calcolo spesa         *
      *                * - 01 : In percentuale sul totale scadenza     *
      *                * - 02 : A scaglioni                            *
      *                * - 03 : A scaglioni con percentuale sull'ecce- *
      *                *        denza                                  *
      *                *-----------------------------------------------*
                   15  w-spe-bol-tau-spb  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Percentuale per calcolo spesa                 *
      *                *                                               *
      *                * Solo se tipo automatismo 01                   *
      *                *-----------------------------------------------*
                   15  w-spe-bol-per-spb  pic  9(02)v9(01)            .
      *                *-----------------------------------------------*
      *                * Tabella scaglioni per calcolo spesa           *
      *                *                                               *
      *                * Solo se tipo automatismo 02 o 03              *
      *                *-----------------------------------------------*
                   15  w-spe-bol-tbs-spb occurs 10.
      *                    *-------------------------------------------*
      *                    * Elemento della tabella scaglioni          *
      *                    *-------------------------------------------*
                       20  w-spe-bol-tbe-spb.
      *                        *---------------------------------------*
      *                        * Scaglione                             *
      *                        *---------------------------------------*
                           25  w-spe-bol-tbe-scg
                                          pic  9(11)                  .
      *                        *---------------------------------------*
      *                        * Ammontare sullo scaglione             *
      *                        *                                       *
      *                        * Solo se tipo di automatismo 02        *
      *                        *---------------------------------------*
                           25  w-spe-bol-tbe-asc
                                          pic  9(11)                  .
      *                        *---------------------------------------*
      *                        * Percentuale sullo scaglione           *
      *                        *                                       *
      *                        * Solo se tipo di automatismo 03        *
      *                        *---------------------------------------*
                           25  w-spe-bol-tbe-psc
                                          pic  9(02)v9(01)            .
      *                *-----------------------------------------------*
      *                * Tetto di esenzione per l'importo scadenza     *
      *                *-----------------------------------------------*
                   15  w-spe-bol-tet-spb  pic  9(11)                  .
      *                *-----------------------------------------------*
      *                * Valore minimo delle spese bollo per il tipo   *
      *                * di pagamento                                  *
      *                *-----------------------------------------------*
                   15  w-spe-bol-min-spb  pic  9(11)                  .
      *                *-----------------------------------------------*
      *                * Valore massimo delle spese bollo per il tipo  *
      *                * di pagamento                                  *
      *                *-----------------------------------------------*
                   15  w-spe-bol-max-spb  pic  9(11)                  .
      *                *-----------------------------------------------*
      *                * Tipo di arrotondamento sul valore delle spese *
      *                * bollo calcolate                               *
      *                * - 00 : Nessun arrotondamento                  *
      *                * - 01 : Arrotondamento al valore superiore     *
      *                * - 02 : Arrotondamento al valore inferiore     *
      *                * - 03 : Arrotondamento di tipo commerciale     *
      *                * - 04 : Arrotondamento di tipo statale         *
      *                *-----------------------------------------------*
                   15  w-spe-bol-tar-spb  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Valore di arrotondamento sul valore delle     *
      *                * spese bollo calcolate                         *
      *                *                                               *
      *                * Solo se tipo arrotondamento diverso da 00     *
      *                *-----------------------------------------------*
                   15  w-spe-bol-var-spb  pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Indice per il tipo pagamento su tabella spese bollo   *
      *        * per tipo scadenza                                     *
      *        *-------------------------------------------------------*
           05  w-spe-bol-inx-pag          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Indice per tabella scaglioni                          *
      *        *-------------------------------------------------------*
           05  w-spe-bol-inx-scg          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per imponibile spesa decrescente per calcolo   *
      *        * spese bollo con tipo automatismo 03                   *
      *        *-------------------------------------------------------*
           05  w-spe-bol-ibl-t03          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Comodi di 13 cifre per calcoli intermedi              *
      *        *-------------------------------------------------------*
           05  w-spe-bol-wrk-s01          pic s9(13)                  .
           05  w-spe-bol-wrk-s02          pic s9(13)                  .

      *    *===========================================================*
      *    * Work per subroutines di decodifica numero in stringa      *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wciflet0.cpw"                   .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di Link per programmi della fase 'pgep3000'          *
      *    *-----------------------------------------------------------*
           copy      "pgm/gep/prg/cpy/pgep3000.pgl"                   .

      ******************************************************************
       Procedure Division                using i-ide
                                               w-prs
                                               w-top
                                               w-def
                                               w-key                  .
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
      *              *-------------------------------------------------*
      *              * Flag di visualizzazione titolo in On            *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-tit      .
      *              *-------------------------------------------------*
      *              * Accettazione campi chiave                       *
      *              *-------------------------------------------------*
           perform   acc-key-reg-000      thru acc-key-reg-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo uscita            *
      *              *-------------------------------------------------*
           if        w-cnt-tus-acc-key    =    "E"
                     go to main-100
           else if   w-cnt-tus-acc-key    =    "U"
                     go to main-200
           else      go to main-300.
       main-100.
      *              *-------------------------------------------------*
      *              * Se tipo uscita 'E'                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad 'E'                       *
      *                  *---------------------------------------------*
           move      "E"                  to   w-key-tus-ack          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     main-900.
       main-200.
      *              *-------------------------------------------------*
      *              * Se tipo uscita 'U'                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad 'U'                       *
      *                  *---------------------------------------------*
           move      "U"                  to   w-key-tus-ack          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Se tipo uscita a Spaces                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura registrazione pre-esistente         *
      *                  *---------------------------------------------*
           perform   rou-let-reg-000      thru rou-let-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se esito negativo : uscita con Spaces       *
      *                  *---------------------------------------------*
           if        w-cnt-rou-let-reg    not  = spaces
                     move  spaces         to   w-key-tus-ack
                     go to main-900.
       main-400.
      *                  *---------------------------------------------*
      *                  * Routine pre-accettazione campi non chiave;  *
      *                  * se anomalie si esce con Spaces              *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     go to main-420
           else if   w-cnt-mfu-tip-fun    =    "M"
                     go to main-440
           else if   w-cnt-mfu-tip-fun    =    "V"
                     go to main-460
           else      move  spaces         to   w-key-tus-ack
                     go to main-900.
       main-420.
           move      spaces               to   w-cnt-pre-acc-ins      .
           perform   pre-acc-ins-000      thru pre-acc-ins-999        .
           if        w-cnt-pre-acc-ins    =    spaces
                     go to main-500
           else      move  spaces         to   w-key-tus-ack
                     go to main-900.
       main-440.
           move      spaces               to   w-cnt-pre-acc-mod      .
           perform   pre-acc-mod-000      thru pre-acc-mod-999        .
           if        w-cnt-pre-acc-mod    =    spaces
                     go to main-500
           else      move  spaces         to   w-key-tus-ack
                     go to main-900.
       main-460.
           move      spaces               to   w-cnt-pre-acc-vis      .
           perform   pre-acc-vis-000      thru pre-acc-vis-999        .
           if        w-cnt-pre-acc-vis    =    spaces
                     go to main-500
           else      move  spaces         to   w-key-tus-ack
                     go to main-900.
       main-500.
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di modifica di almeno  *
      *                  * un campo non chiave                         *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-acc-flg-aum      .
      *                  *---------------------------------------------*
      *                  * Accettazione campi non chiave               *
      *                  *---------------------------------------------*
           perform   acc-nok-reg-000      thru acc-nok-reg-999        .
       main-600.
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit si esegue la routine     *
      *                  * post-exit                                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "E"
                     go to main-700.
      *                      *-----------------------------------------*
      *                      * Se Inserimento                          *
      *                      *-----------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-exi-ins-000
                                          thru pos-exi-ins-999
      *                      *-----------------------------------------*
      *                      * Se Modifica                             *
      *                      *-----------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-exi-mod-000
                                          thru pos-exi-mod-999
      *                      *-----------------------------------------*
      *                      * Se Visualizzazione                      *
      *                      *-----------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "V"
                     perform   pos-exi-vis-000
                                          thru pos-exi-vis-999        .
      *                      *-----------------------------------------*
      *                      * Quindi si esce con Spaces               *
      *                      *-----------------------------------------*
           move      spaces               to   w-key-tus-ack          .
           go to     main-900.
       main-700.
      *                  *---------------------------------------------*
      *                  * Se uscita per annullamento                  *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "X"
                     go to main-800.
      *                      *-----------------------------------------*
      *                      * Routine post-conferma di annullamento   *
      *                      *-----------------------------------------*
           perform   pos-cnf-ann-000      thru pos-cnf-ann-999        .
      *                      *-----------------------------------------*
      *                      * Quindi si esce con Spaces               *
      *                      *-----------------------------------------*
           move      spaces               to   w-key-tus-ack          .
           go to     main-900.
       main-800.
      *                  *---------------------------------------------*
      *                  * Se uscita per conferma si esegue la routine *
      *                  * post-conferma                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se post-conferma di Inserimento         *
      *                      *-----------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-cnf-ins-000
                                          thru pos-cnf-ins-999
      *                      *-----------------------------------------*
      *                      * Se post-conferma di Modifica            *
      *                      *-----------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-cnf-mod-000
                                          thru pos-cnf-mod-999        .
      *                      *-----------------------------------------*
      *                      * Quindi si esce con Spaces               *
      *                      *-----------------------------------------*
           move      spaces               to   w-key-tus-ack          .
           go to     main-900.
       main-900.
      *              *-------------------------------------------------*
      *              * Esecuzione routine post-esecuzione programma    *
      *              *-------------------------------------------------*
           perform   pos-exe-pgm-000      thru pos-exe-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Prsc :                        *
      *              * - se in tipo impostazione testata e su pagina   *
      *              *   maggiore di 1 : abilitato                     *
      *              * - altrimenti    : invariato                     *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "T" and
                     w-cnt-sts-imp-npt    >    1
                     move  "PRSC"         to   v-pfk (07)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Nxsc :                        *
      *              * - se in tipo impostazione testata e se pagina   *
      *              *   gia' completamente impostata o testata gia'   *
      *              *   completamente impostata : abilitato           *
      *              *  - altrimenti             : invariato           *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    not  = "T"
                     go to exe-acc-cmp-050.
           if        w-cnt-sts-imp-tes    not  = spaces or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     move  "NXSC"         to   v-pfk (08)             .
       exe-acc-cmp-050.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Delt : sempre disabilitato    *
      *              *-------------------------------------------------*
           move      spaces               to   v-pfk (19)             .
       exe-acc-cmp-100.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Do :                          *
      *              *  - se Visualizzazione     : disabilitato        *
      *              *  - altrimenti             : inalterato          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     move  spaces         to   v-pfk (05)             .
      *              *-------------------------------------------------*
      *              * Tasti di funzione Insr e Remv :                 *
      *              *  - se Visualizzazione e in                      *
      *              *    primo campo riga corpo : disabilitati        *
      *              *  - altrimenti             : inalterati          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V" and
                     w-cnt-mfu-tip-imp    =    "C"
                     move  spaces         to   v-pfk (04)
                     move  spaces         to   v-pfk (06)             .
      *              *-------------------------------------------------*
      *              * Salvataggio parametri di accettazione           *
      *              *-------------------------------------------------*
           move      v-tip                to   w-cnt-acc-sav-tip      .
           move      v-car                to   w-cnt-acc-sav-car      .
           move      v-lin                to   w-cnt-acc-sav-lin      .
           move      v-pos                to   w-cnt-acc-sav-pos      .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  v-alf          to   w-cnt-acc-sav-alf      .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  v-dec          to   w-cnt-acc-sav-dec
                     move  v-sgn          to   w-cnt-acc-sav-sgn
                     move  v-edm          to   w-cnt-acc-sav-edm
                     move  v-msk          to   w-cnt-acc-sav-msk
                     move  v-num          to   w-cnt-acc-sav-num      .
           if        v-tip                =    "D"
                     move  v-dat          to   w-cnt-acc-sav-dat      .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  v-ldt          to   w-cnt-acc-sav-ldt
                     move  v-txt          to   w-cnt-acc-sav-txt      .
           move      v-ufk                to   w-cnt-acc-sav-ufk      .
       exe-acc-cmp-200.
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Memorizzazione segnale di campo modificato      *
      *              *-------------------------------------------------*
           move      v-mod                to   w-cnt-acc-sav-mod      .
       exe-acc-cmp-600.
      *              *-------------------------------------------------*
      *              * Flag globale di avvenuta almeno una modifica    *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     move  "#"            to   w-cnt-acc-flg-aum      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Test su flag di visualizzazione titolo          *
      *              *-------------------------------------------------*
           if        w-cnt-sts-vis-tit    not  = spaces
                     move  spaces         to   w-cnt-sts-vis-tit
                     go to vis-tit-pgm-999.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione tipo funzionamento                        *
      *    *-----------------------------------------------------------*
       vis-tip-fun-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      66                   to   v-pos                  .
           if        w-cnt-mfu-tip-fun    =    "I"
                     move  "         Stampa"
                                          to   v-alf
           else if   w-cnt-mfu-tip-fun    =    "M"
                     move  "         Stampa"
                                          to   v-alf
           else if   w-cnt-mfu-tip-fun    =    "V"
                     move  "Visualizzazione"
                                          to   v-alf
           else      move  spaces         to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Azzeramento totali per riepilogo stampa effetti *
      *              * a fronte distinta                               *
      *              *-------------------------------------------------*
           perform   azt-rie-ste-000      thru azt-rie-ste-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Routine post-esecuzione programma                         *
      *    *-----------------------------------------------------------*
       pos-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione riepilogo stampa effetti a      *
      *              * fronte distinta                                 *
      *              *-------------------------------------------------*
           perform   vis-rie-ste-000      thru vis-rie-ste-999        .
       pos-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali per riepilogo stampa effetti a fronte  *
      *    * distinta                                                  *
      *    *-----------------------------------------------------------*
       azt-rie-ste-000.
      *              *-------------------------------------------------*
      *              * Numero effetti letti                            *
      *              *-------------------------------------------------*
           move      zero                 to   w-sta-eff-tot-let      .
      *              *-------------------------------------------------*
      *              * Numero effetti stampati per la prima volta      *
      *              *-------------------------------------------------*
           move      zero                 to   w-sta-eff-tot-stp      .
      *              *-------------------------------------------------*
      *              * Numero effetti ristampati                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-sta-eff-tot-ris      .
      *              *-------------------------------------------------*
      *              * Numero effetti non stampati                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-sta-eff-tot-nst      .
       azt-rie-ste-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione riepilogo stampa effetti a fronte distin- *
      *    * ta                                                        *
      *    *-----------------------------------------------------------*
       vis-rie-ste-000.
      *              *-------------------------------------------------*
      *              * Se numero effetti letti a zero : nessuna visua- *
      *              * lizzazione                                      *
      *              *-------------------------------------------------*
           if        w-sta-eff-tot-let    =    zero
                     go to vis-rie-ste-999.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      21                   to   v-lto                  .
           move      80                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      42                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      20                   to   v-pos                  .
           move      "Riepilogo stampa effetti a fronte distinta"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura titolo                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      42                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      20                   to   v-pos                  .
           move      "------------------------------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literal per numero effetti totali               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      43                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Numero effetti che compongono la distinta :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Valore per numero effetti totali                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      12                   to   v-lin                  .
           move      47                   to   v-pos                  .
           move      w-sta-eff-tot-let    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literal per numero effetti stampati             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      43                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Numero effetti stampati                   :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Valore per numero effetti stampati              *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      14                   to   v-lin                  .
           move      47                   to   v-pos                  .
           move      w-sta-eff-tot-stp    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literal per numero effetti ristampati           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      43                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Numero effetti ristampati                 :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Valore per numero effetti ristampati            *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      16                   to   v-lin                  .
           move      47                   to   v-pos                  .
           move      w-sta-eff-tot-ris    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literal per numero effetti non stampati         *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      43                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Numero effetti non stampati               :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Valore per numero effetti non stampati          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      18                   to   v-lin                  .
           move      47                   to   v-pos                  .
           move      w-sta-eff-tot-nst    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literal per 'Presa visione'                     *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      76                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      20                   to   v-lin                  .
           move      77                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rie-ste-999.
           exit.

      *    *===========================================================*
      *    * Richiamo sottoprogramma per gestione catena righe         *
      *    *-----------------------------------------------------------*
       cll-sub-cat-000.
           move      "pgm/gep/prg/obj/pgep3002"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using w-cat-rig              .
       cll-sub-cat-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi chiave della registrazione             *
      *    *-----------------------------------------------------------*
       acc-key-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-fun      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo impostazione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-sts-imp-npt      .
           move      spaces               to   w-cnt-sts-imp-key
                                               w-cnt-sts-imp-tes
                                               w-cnt-sts-imp-pte
                                               w-cnt-sts-ing-pte
                                               w-cnt-sts-imp-cor
                                               w-cnt-sts-imp-rig
                                               w-cnt-sts-imp-pie
                                               w-cnt-sts-imp-itd      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key
                                               w-cnt-sts-pmt-tes
                                               w-cnt-sts-pmt-pte
                                               w-cnt-sts-pmt-cor
                                               w-cnt-sts-pmt-rig
                                               w-cnt-sts-pmt-pie      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-key
                                               w-cnt-sts-vis-tes
                                               w-cnt-sts-vis-pte
                                               w-cnt-sts-vis-cor
                                               w-cnt-sts-vis-rig
                                               w-cnt-sts-vis-pie      .
      *              *-------------------------------------------------*
      *              * Normalizzazione area di controllo variazioni    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-var-tes-cor      .
      *              *-------------------------------------------------*
      *              * Normalizzazione registrazione                   *
      *              *-------------------------------------------------*
           perform   nor-key-nok-000      thru nor-key-nok-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           perform   pmt-key-reg-000      thru pmt-key-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per prima pagina testata            *
      *                  *---------------------------------------------*
           perform   pmt-tes-reg-000      thru pmt-tes-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : chiave                      *
      *              *-------------------------------------------------*
           move      "K"                  to   w-cnt-mfu-tip-imp      .
       acc-key-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Numero distinta di presentazione            *
      *                  *---------------------------------------------*
           perform   acc-num-dis-000      thru acc-num-dis-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
       acc-key-reg-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-key      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visual. dati chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-key      .
      *              *-------------------------------------------------*
      *              * Test se chiave vuota                            *
      *              *-------------------------------------------------*
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-key-reg-999.
      *              *-------------------------------------------------*
      *              * Controllo globale su tasto Do su chiave         *
      *              *-------------------------------------------------*
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-key-reg-100.
           move      "S"                  to   w-cnt-tus-acc-key      .
       acc-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campi chiave della registrazione          *
      *    *-----------------------------------------------------------*
       vis-key-reg-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo impostazione      *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    spaces
                     go to vis-key-reg-100
           else      go to vis-key-reg-200.
       vis-key-reg-100.
      *              *-------------------------------------------------*
      *              * Se in continuazione impostazione chiave per     *
      *              * provenienza dal main-program                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nessuna visualizzazione, uscita             *
      *                  *---------------------------------------------*
           go to     vis-key-reg-999.
       vis-key-reg-200.
      *              *-------------------------------------------------*
      *              * In tutti gli altri casi                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Data registrazione                          *
      *                  *---------------------------------------------*
           perform   vis-dat-reg-000      thru vis-dat-reg-999        .
      *                  *---------------------------------------------*
      *                  * Codice tipo operazione                      *
      *                  *---------------------------------------------*
           perform   vis-tip-ope-000      thru vis-tip-ope-999        .
      *                  *---------------------------------------------*
      *                  * Codice tipo operazione, descrizione         *
      *                  *---------------------------------------------*
           perform   vis-tip-ope-des-000  thru vis-tip-ope-des-999    .
      *                  *---------------------------------------------*
      *                  * Numero distinta                             *
      *                  *---------------------------------------------*
           perform   vis-num-dis-000      thru vis-num-dis-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     vis-key-reg-999.
       vis-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per campi chiave                  *
      *    *-----------------------------------------------------------*
       pmt-key-reg-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo impostazione      *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    spaces
                     go to pmt-key-reg-100
           else      go to pmt-key-reg-200.
       pmt-key-reg-100.
      *              *-------------------------------------------------*
      *              * Se in continuazione impostazione chiave per     *
      *              * provenienza dal main-program                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Erase linee impegnate                       *
      *                  *---------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      06                   to   v-lin                  .
           move      07                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Numero distinta                             *
      *                  *---------------------------------------------*
           perform   pmt-num-dis-000      thru pmt-num-dis-999        .
      *                  *---------------------------------------------*
      *                  * Linea di trattini                           *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pmt-key-reg-999.
       pmt-key-reg-200.
      *              *-------------------------------------------------*
      *              * In tutti gli altri casi                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Erase linee impegnate                       *
      *                  *---------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      07                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Data registrazione                          *
      *                  *---------------------------------------------*
           perform   pmt-dat-reg-000      thru pmt-dat-reg-999        .
      *                  *---------------------------------------------*
      *                  * Tipo operazione                             *
      *                  *---------------------------------------------*
           perform   pmt-tip-ope-000      thru pmt-tip-ope-999        .
      *                  *---------------------------------------------*
      *                  * Numero distinta                             *
      *                  *---------------------------------------------*
           perform   pmt-num-dis-000      thru pmt-num-dis-999        .
      *                  *---------------------------------------------*
      *                  * Linea di trattini                           *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pmt-key-reg-999.
       pmt-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Prompt per data di registrazione                          *
      *    *-----------------------------------------------------------*
       pmt-dat-reg-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data registrazione :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-dat-reg-999.
           exit.

      *    *===========================================================*
      *    * Prompt per tipo operazione                                *
      *    *-----------------------------------------------------------*
       pmt-tip-ope-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo operazione    :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-tip-ope-999.
           exit.

      *    *===========================================================*
      *    * Prompt per numero distinta                                *
      *    *-----------------------------------------------------------*
       pmt-num-dis-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero distinta    :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-num-dis-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Data registrazione                *
      *    *-----------------------------------------------------------*
       vis-dat-reg-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      04                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-tes-dat-reg        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-dat-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice tipo operazione            *
      *    *-----------------------------------------------------------*
       vis-tip-ope-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      05                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-tes-tip-ope        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-ope-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice tipo operazione, descri-   *
      *    *                         zione                             *
      *    *-----------------------------------------------------------*
       vis-tip-ope-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      27                   to   v-pos                  .
           move      w-tes-tip-ope-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-tip-ope-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Numero distinta                      *
      *    *-----------------------------------------------------------*
       acc-num-dis-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-num-dis-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      "<"                  to   v-edm                  .
           move      06                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXPD"               to   v-pfk (12)             .
           move      w-tes-num-dis        to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-num-dis-999.
       acc-num-dis-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-num-dis          .
       acc-num-dis-250.
      *              *-------------------------------------------------*
      *              * Se Find                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "FIND"
                     go to acc-num-dis-300.
      *                  *---------------------------------------------*
      *                  * Find su distinte di presentazione           *
      *                  *---------------------------------------------*
           move      "S"                  to   w-fnd-arc-ddp-sns      .
           move      02                   to   w-fnd-arc-ddp-tip      .
           move      05                   to   w-fnd-arc-ddp-sld      .
           perform   fnd-arc-ddp-000      thru fnd-arc-ddp-999        .
      *                  *---------------------------------------------*
      *                  * Se selezione non effettuata : a reimposta-  *
      *                  * zione                                       *
      *                  *---------------------------------------------*
           if        w-fnd-arc-ddp-sel    not  = spaces
                     go to acc-num-dis-100.
      *                  *---------------------------------------------*
      *                  * Ripresa numero distinta selezionata         *
      *                  *---------------------------------------------*
           move      w-fnd-arc-ddp-num    to   w-tes-num-dis          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione numero distinta selezionata *
      *                  *---------------------------------------------*
           perform   vis-num-dis-000      thru vis-num-dis-999        .
      *                  *---------------------------------------------*
      *                  * Forzatura simulata del tasto Do             *
      *                  *---------------------------------------------*
           move      "DO  "               to   v-key                  .
           go to     acc-num-dis-400.
       acc-num-dis-300.
      *              *-------------------------------------------------*
      *              * Se Expd                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "EXPD"
                     go to acc-num-dis-400.
      *                  *---------------------------------------------*
      *                  * Espansione su distinte di presentazione     *
      *                  *---------------------------------------------*
           move      "S"                  to   w-esp-arc-ddp-sns      .
           move      w-tes-num-dis        to   w-esp-arc-ddp-num      .
           perform   esp-arc-ddp-000      thru esp-arc-ddp-999        .
      *                  *---------------------------------------------*
      *                  * Se selezione non effettuata : a reimposta-  *
      *                  * zione                                       *
      *                  *---------------------------------------------*
           if        w-esp-arc-ddp-sel    not  = spaces
                     go to acc-num-dis-100.
      *                  *---------------------------------------------*
      *                  * Ripresa numero distinta selezionata         *
      *                  *---------------------------------------------*
           move      w-esp-arc-ddp-num    to   w-tes-num-dis          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione numero distinta selezionata *
      *                  *---------------------------------------------*
           perform   vis-num-dis-000      thru vis-num-dis-999        .
      *                  *---------------------------------------------*
      *                  * Forzatura simulata del tasto Do             *
      *                  *---------------------------------------------*
           move      "DO  "               to   v-key                  .
           go to     acc-num-dis-400.
       acc-num-dis-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-num-dis-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tasto funzione u-  *
      *                  * tilizzato                                   *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-num-dis-650
           else      go to acc-num-dis-700.
       acc-num-dis-650.
      *                  *---------------------------------------------*
      *                  * Se terminazione con tasto Up                *
      *                  *---------------------------------------------*
       acc-num-dis-655.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione nume- *
      *                      * ro distinta                             *
      *                      *-----------------------------------------*
           if        w-tes-num-dis        =    zero
                     go to acc-num-dis-660.
           move      zero                 to   w-tes-num-dis          .
           perform   vis-num-dis-000      thru vis-num-dis-999        .
       acc-num-dis-660.
      *                      *-----------------------------------------*
      *                      * Forzatura del tasto Exit                *
      *                      *-----------------------------------------*
           move      "EXIT"               to   v-key                  .
      *                      *-----------------------------------------*
      *                      * Forzatura del tipo uscita per Up        *
      *                      *-----------------------------------------*
           move      "U"                  to   w-cnt-tus-acc-key      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     acc-num-dis-999.
       acc-num-dis-700.
      *                  *---------------------------------------------*
      *                  * In tutti gli altri casi                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     acc-num-dis-800.
       acc-num-dis-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-num-dis-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-num-dis-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-num-dis-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-num-dis-999.
       acc-num-dis-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Numero distinta                   *
      *    *-----------------------------------------------------------*
       vis-num-dis-000.
           move      "DS"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      "<"                  to   v-edm                  .
           move      06                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-tes-num-dis        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-num-dis-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi non chiave della registrazione         *
      *    *-----------------------------------------------------------*
       acc-nok-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-nok      .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           perform   vis-tip-fun-000      thru vis-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione se in modi- *
      *              * fica o visualizzazione, per testata e corpo     *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M" or
                     w-cnt-mfu-tip-fun    =    "V"
                     move  "#"            to   w-cnt-sts-imp-tes
                     move  all "#"        to   w-cnt-sts-imp-pte
                     move  all "#"        to   w-cnt-sts-ing-pte
                     move  "#"            to   w-cnt-sts-imp-cor      .
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione per piede   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-pie      .
       acc-nok-reg-200.
      *              *-------------------------------------------------*
      *              * Trattamento testata                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione del numero di pagine che     *
      *                  * compongono la testata                       *
      *                  *---------------------------------------------*
           perform   dmp-tes-reg-000      thru dmp-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati corpo                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-cor      
                                               w-cnt-sts-vis-cor      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati riga corpo             *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-rig      
                                               w-cnt-sts-vis-rig      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati piede                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-pie      
                                               w-cnt-sts-vis-pie      .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-key    =    spaces
                     perform pmt-key-reg-000
                                          thru pmt-key-reg-999
                     move    "#"          to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati campi chiave           *
      *                  *---------------------------------------------*
           if        w-cnt-sts-vis-key    =    spaces
                     perform vis-key-reg-000
                                          thru vis-key-reg-999
                     move    "#"          to   w-cnt-sts-vis-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per pagina di testata               *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-ptx
                    (w-cnt-sts-imp-npt)   =    spaces
                     perform pmt-tes-reg-000
                                          thru pmt-tes-reg-999
                     move    "#"          to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati pagina testata         *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M"      or
                     w-cnt-mfu-tip-fun    =    "V"      or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces or
                     w-cnt-sts-ing-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     if    w-cnt-sts-vis-ptx
                          (w-cnt-sts-imp-npt)
                                          =    spaces
                           perform vis-tes-reg-000
                                          thru vis-tes-reg-999
                           move    "#"    to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Flag di ingresso in pagina di testata       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-ing-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione dati testata                   *
      *                  *---------------------------------------------*
           perform   acc-tes-reg-000      thru acc-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita definitivo                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "S" or
                     w-cnt-tus-acc-tes    =    "X" or
                     w-cnt-tus-acc-tes    =    "E"
                     move  w-cnt-tus-acc-tes
                                          to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999.
      *                  *---------------------------------------------*
      *                  * Se spostamento di pagina                    *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "-"
                     go to acc-nok-reg-225
           else      go to acc-nok-reg-250.
       acc-nok-reg-225.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina precedente      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' 1 si ignora *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  > 1
                     go to acc-nok-reg-200.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina attuale a : no    *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
       acc-nok-reg-230.
      *                          *-------------------------------------*
      *                          * Decremento numero pagina attuale    *
      *                          *-------------------------------------*
           subtract  1                    from w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : decremento ulteriore        *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces and
                     w-cnt-sts-imp-npt    >    1
                     go to acc-nok-reg-230.
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-250.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina successiva      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Salvataggio numero pagina attuale   *
      *                          *-------------------------------------*
           move      w-cnt-sts-imp-npt    to   w-cnt-sts-imp-svp      .
       acc-nok-reg-260.
      *                          *-------------------------------------*
      *                          * Status di impostazione dati della   *
      *                          * della pagina attuale a : si'        *
      *                          *-------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si pone lo status di impostazione   *
      *                          * dati generale testata a si'         *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  "#"            to   w-cnt-sts-imp-tes      .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si va' ad accettazione corpo        *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  w-cnt-sts-imp-svp
                                          to   w-cnt-sts-imp-npt
                     go to acc-nok-reg-300.
      *                          *-------------------------------------*
      *                          * Incremento numero pagina attuale    *
      *                          *-------------------------------------*
           add       1                    to   w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : a re-incremento             *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces
                     go to acc-nok-reg-260.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina impostata a : no  *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-svp)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-svp)     .
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-300.
      *                  *---------------------------------------------*
      *                  * Numero riga corpo da accettare : 1          *
      *                  *---------------------------------------------*
           move       1                   to   w-cnt-cor-nrg-dac      .
       acc-nok-reg-400.
      *              *-------------------------------------------------*
      *              * Trattamento corpo                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati chiave                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      
                                               w-cnt-sts-vis-key      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati testata                *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-tes
                                               w-cnt-sts-pmt-pte
                                               w-cnt-sts-vis-tes
                                               w-cnt-sts-vis-pte      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati piede                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-pie      
                                               w-cnt-sts-vis-pie      .
      *                  *---------------------------------------------*
      *                  * Accettazione dati corpo                     *
      *                  *---------------------------------------------*
           perform   acc-cor-reg-000      thru acc-cor-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita definitivo                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-cor    =    "S" or
                     w-cnt-tus-acc-cor    =    "X" or
                     w-cnt-tus-acc-cor    =    "E"
                     move  w-cnt-tus-acc-cor
                                          to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999.
      *                  *---------------------------------------------*
      *                  * Se tipo uscita "-"                          *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-cor    =    "-"
                     go to acc-nok-reg-200.
       acc-nok-reg-800.
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Se attualmente visualizzato il corpo si e-  *
      *                  * segue la visualizzazione dei prompts della  *
      *                  * riga corpo espansa                          *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-cor    =    spaces
                     go to acc-nok-reg-805.
           perform   pmt-rig-cor-000      thru pmt-rig-cor-999        .
       acc-nok-reg-805.
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-nok-reg-810.
      *                  *---------------------------------------------*
      *                  * Test se sola visualizzazione                *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to acc-nok-reg-820
           else      go to acc-nok-reg-830.
       acc-nok-reg-820.
      *                      *-----------------------------------------*
      *                      * Accettazione se sola visualizzazione    *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#VIS"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "E"                  to   v-msk                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "E"
                     move  "EXIT"         to   v-key                  .
           go to     acc-nok-reg-840.
       acc-nok-reg-830.
      *                      *-----------------------------------------*
      *                      * Accettazione se inserimento o modifica  *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "Conferma stampa della distinta (S/N/E) ?"
                                          to   v-not
           else      move  "Conferma stampa della distinta (S/N/E) ?"
                                          to   v-not                  .
           move      spaces               to   v-alf                  .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "SNE"          to   v-msk
           else      move  "NE"           to   v-msk                  .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-nok-reg-840.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-nok-reg-850
           else if   v-key                =    "EXIT"
                     go to acc-nok-reg-860
           else if   v-key                =    "UP  "
                     go to acc-nok-reg-870
           else      go to acc-nok-reg-810.
       acc-nok-reg-850.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-tus-acc-nok      .
           perform   cnt-tdo-nok-000      thru cnt-tdo-nok-999        .
           if        w-cnt-tdo-nok-flg    not  = spaces
                     go to acc-nok-reg-870.
           go to     acc-nok-reg-999.
       acc-nok-reg-860.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-nok      .
           go to     acc-nok-reg-999.
       acc-nok-reg-870.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nr riga corpo da accettare : max        *
      *                      *                                         *
      *                      * N.B. : questa e' una modifica rispetto  *
      *                      *        allo standard, il quale rimanda  *
      *                      *        alla riga (max + 1)              *
      *                      *-----------------------------------------*
           move      w-cat-rig-max        to   w-cnt-cor-nrg-dac      .
      *                      *-----------------------------------------*
      *                      * Ad accettazione corpo                   *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
           go to     acc-nok-reg-400.
       acc-nok-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione numero pagine che compongono la testata    *
      *    *-----------------------------------------------------------*
       dmp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * La testata e' composta di nr. 3 pagine          *
      *              *-------------------------------------------------*
           move      3                    to   w-cnt-sts-imp-mpt      .
       dmp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione si/no pagina w-cnt-sts-imp-npt da trattare *
      *    *-----------------------------------------------------------*
       snp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del numero pagina        *
      *              *-------------------------------------------------*
           if        w-cnt-sts-imp-npt    =    01
                     go to snp-tes-reg-100
           else if   w-cnt-sts-imp-npt    =    02
                     go to snp-tes-reg-200
           else      go to snp-tes-reg-300.
       snp-tes-reg-100.
      *              *-------------------------------------------------*
      *              * Se pagina 1                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita a Si                         *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-snp      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     snp-tes-reg-999.
       snp-tes-reg-200.
      *              *-------------------------------------------------*
      *              * Se pagina 2                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita a Si                         *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-snp      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     snp-tes-reg-999.
       snp-tes-reg-300.
      *              *-------------------------------------------------*
      *              * Se pagina 3                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita a Si, a meno che non si sia  *
      *                  * in Visualizzazione                          *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     move  "#"            to   w-cnt-sts-imp-snp
           else      move  spaces         to   w-cnt-sts-imp-snp      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     snp-tes-reg-999.
       snp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione testata registrazione                        *
      *    *-----------------------------------------------------------*
       acc-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-tes      .
      *              *-------------------------------------------------*
      *              * Normalizzazione function-key                    *
      *              *-------------------------------------------------*
           move      spaces               to   v-key                  .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : testata                     *
      *              *-------------------------------------------------*
           move      "T"                  to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del numero pagina    *
      *                  *---------------------------------------------*
           go to     acc-tes-reg-100
                     acc-tes-reg-200
                     acc-tes-reg-300
                     depending            on   w-cnt-sts-imp-npt      .
           go to     acc-tes-reg-999.
       acc-tes-reg-100.
      *                  *---------------------------------------------*
      *                  * Pagina 1                                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione func-key d'impostazione *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
       acc-tes-reg-110.
      *                      *-----------------------------------------*
      *                      * Visualizzazione dati di pagina 1        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Video in Off                        *
      *                          *-------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Visualizzazione                     *
      *                          *-------------------------------------*
           perform   vis-tes-001-000      thru vis-tes-001-999        .
      *                          *-------------------------------------*
      *                          * Video in On                         *
      *                          *-------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-tes-reg-190.
      *                      *-----------------------------------------*
      *                      * Presa visione per pagina 1              *
      *                      *-----------------------------------------*
           perform   acc-pre-vpg-000      thru acc-pre-vpg-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-190.
      *                      *-----------------------------------------*
      *                      * Fine Pagina                             *
      *                      *-----------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-tes      .
           go to     acc-tes-reg-999.
       acc-tes-reg-200.
      *                  *---------------------------------------------*
      *                  * Pagina 2                                    *
      *                  *---------------------------------------------*
       acc-tes-reg-210.
      *                      *-----------------------------------------*
      *                      * Visualizzazione dati di pagina 2        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Video in Off                        *
      *                          *-------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Visualizzazione                     *
      *                          *-------------------------------------*
           perform   vis-tes-002-000      thru vis-tes-002-999        .
      *                          *-------------------------------------*
      *                          * Video in On                         *
      *                          *-------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-tes-reg-290.
      *                      *-----------------------------------------*
      *                      * Presa visione per pagina 2              *
      *                      *-----------------------------------------*
           perform   acc-pre-vpg-000      thru acc-pre-vpg-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "UP  "
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
      *                      *-----------------------------------------*
      *                      * Fine Pagina                             *
      *                      *-----------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-tes      .
           go to     acc-tes-reg-999.
       acc-tes-reg-300.
      *                  *---------------------------------------------*
      *                  * Pagina 3                                    *
      *                  *---------------------------------------------*
       acc-tes-reg-305.
      *                      *-----------------------------------------*
      *                      * Visualizzazione numero ricevute banca-  *
      *                      * rie incluse nella distinta              *
      *                      *-----------------------------------------*
           perform   vis-sce-nrb-000      thru vis-sce-nrb-999        .
      *                      *-----------------------------------------*
      *                      * Visualizzazione numero tratte incluse   *
      *                      * nella distinta                          *
      *                      *-----------------------------------------*
           perform   vis-sce-ntr-000      thru vis-sce-ntr-999        .
       acc-tes-reg-310.
      *                      *-----------------------------------------*
      *                      * Tipo selezione scadenze da stampare     *
      *                      *-----------------------------------------*
           perform   acc-sce-tse-000      thru acc-sce-tse-999        .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "UP  "
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
       acc-tes-reg-315.
      *                      *-----------------------------------------*
      *                      * Si/No stampa ricevute bancarie          *
      *                      *-----------------------------------------*
           perform   acc-sce-srb-000      thru acc-sce-srb-999        .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-310.
       acc-tes-reg-320.
      *                      *-----------------------------------------*
      *                      * Si/No stampa tratte                     *
      *                      *-----------------------------------------*
           perform   acc-sce-str-000      thru acc-sce-str-999        .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-315.
       acc-tes-reg-325.
      *                      *-----------------------------------------*
      *                      * Si/No stampa nostra intestazione        *
      *                      *-----------------------------------------*
           perform   acc-sce-sni-000      thru acc-sce-sni-999        .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-320.
       acc-tes-reg-330.
      *                      *-----------------------------------------*
      *                      * Si/No stampa denominazione della banca  *
      *                      * di presentazione                        *
      *                      *-----------------------------------------*
           perform   acc-sce-sbp-000      thru acc-sce-sbp-999        .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-325.
       acc-tes-reg-390.
      *                      *-----------------------------------------*
      *                      * Presa visione per pagina 3              *
      *                      *-----------------------------------------*
           perform   acc-pre-vpg-000      thru acc-pre-vpg-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-330.
      *                      *-----------------------------------------*
      *                      * Fine Pagina                             *
      *                      *-----------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-tes      .
           go to     acc-tes-reg-999.
       acc-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione testata registrazione                     *
      *    *-----------------------------------------------------------*
       vis-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Se flag di visualizzazione prompts di testata,  *
      *              * pagina 1, a 'non ancora visualizzati' si effet- *
      *              * tua la visualizzazione dei prompts di testata   *
      *              * e si pone il flag a 'gia' visualizzati'         *
      *              *-------------------------------------------------*
           if        w-vis-pmt-tes-001    not  = spaces
                     go to vis-tes-reg-050.
           move      "#"                  to   w-vis-pmt-tes-001      .
           perform   pmt-tes-reg-000      thru pmt-tes-reg-999        .
       vis-tes-reg-050.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del numero pagina        *
      *              *-------------------------------------------------*
           go to     vis-tes-reg-100
                     vis-tes-reg-200
                     vis-tes-reg-300
                     depending            on   w-cnt-sts-imp-npt      .
           go to     vis-tes-reg-999.
       vis-tes-reg-100.
      *              *-------------------------------------------------*
      *              * Pagina 1                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           perform   vis-tes-001-000      thru vis-tes-001-999        .
      *                  *---------------------------------------------*
      *                  * Fine Pagina                                 *
      *                  *---------------------------------------------*
           go to     vis-tes-reg-999.
       vis-tes-reg-200.
      *              *-------------------------------------------------*
      *              * Pagina 2                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           perform   vis-tes-002-000      thru vis-tes-002-999        .
      *                  *---------------------------------------------*
      *                  * Fine Pagina                                 *
      *                  *---------------------------------------------*
           go to     vis-tes-reg-999.
       vis-tes-reg-300.
      *              *-------------------------------------------------*
      *              * Pagina 3                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           perform   vis-tes-003-000      thru vis-tes-003-999        .
      *                  *---------------------------------------------*
      *                  * Fine Pagina                                 *
      *                  *---------------------------------------------*
           go to     vis-tes-reg-999.
       vis-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina di testata numero 1                *
      *    *-----------------------------------------------------------*
       vis-tes-001-000.
      *              *-------------------------------------------------*
      *              * Data composizione distinta                      *
      *              *-------------------------------------------------*
           perform   vis-dtr-com-000      thru vis-dtr-com-999        .
      *              *-------------------------------------------------*
      *              * Tipo di distinta                                *
      *              *-------------------------------------------------*
           perform   vis-tip-ddp-000      thru vis-tip-ddp-999        .
      *              *-------------------------------------------------*
      *              * Tipo di avviso richiesto                        *
      *              *-------------------------------------------------*
           perform   vis-tav-ric-000      thru vis-tav-ric-999        .
      *              *-------------------------------------------------*
      *              * Codice nostra banca per la presentazione        *
      *              *-------------------------------------------------*
           perform   vis-cod-bpe-000      thru vis-cod-bpe-999        .
      *              *-------------------------------------------------*
      *              * Codice nostra banca per la presentazione,       *
      *              * descrizione                                     *
      *              *-------------------------------------------------*
           perform   vis-cod-bpe-des-000  thru vis-cod-bpe-des-999    .
      *              *-------------------------------------------------*
      *              * Importo globale distinta                        *
      *              *-------------------------------------------------*
           perform   vis-imp-ddp-000      thru vis-imp-ddp-999        .
      *              *-------------------------------------------------*
      *              * Numero di effetti appartenenti alla distinta    *
      *              * che sono gia' stati stampati                    *
      *              *-------------------------------------------------*
           perform   vis-sce-ngs-000      thru vis-sce-ngs-999        .
       vis-tes-001-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina di testata numero 2                *
      *    *-----------------------------------------------------------*
       vis-tes-002-000.
      *              *-------------------------------------------------*
      *              * Data presentazione distinta                     *
      *              *-------------------------------------------------*
           perform   vis-dtr-pre-000      thru vis-dtr-pre-999        .
      *              *-------------------------------------------------*
      *              * Tipo presentazione distinta                     *
      *              *-------------------------------------------------*
           perform   vis-tip-pre-000      thru vis-tip-pre-999        .
      *              *-------------------------------------------------*
      *              * Codice nostra banca per la presentazione        *
      *              *-------------------------------------------------*
           perform   vis-cod-cbp-000      thru vis-cod-cbp-999        .
      *              *-------------------------------------------------*
      *              * Codice nostra banca per la presentazione, de-   *
      *              * scrizione                                       *
      *              *-------------------------------------------------*
           perform   vis-cod-cbp-des-000  thru vis-cod-cbp-des-999    .
      *              *-------------------------------------------------*
      *              * Stampa cartacea distinta                        *
      *              *-------------------------------------------------*
           perform   vis-snx-stp-000      thru vis-snx-stp-999        .
      *              *-------------------------------------------------*
      *              * Preparazione archivio per trasmissione elettro- *
      *              * nica                                            *
      *              *-------------------------------------------------*
           perform   vis-snx-ads-000      thru vis-snx-ads-999        .
      *              *-------------------------------------------------*
      *              * Tipo di invio dell'archivio di supporto alla    *
      *              * banca                                           *
      *              *-------------------------------------------------*
           perform   vis-tip-ias-000      thru vis-tip-ias-999        .
       vis-tes-002-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina di testata numero 3                *
      *    *-----------------------------------------------------------*
       vis-tes-003-000.
      *              *-------------------------------------------------*
      *              * Numero ricevute bancarie incluse nella distinta *
      *              *-------------------------------------------------*
           perform   vis-sce-nrb-000      thru vis-sce-nrb-999        .
      *              *-------------------------------------------------*
      *              * Numero tratte incluse nella distinta            *
      *              *-------------------------------------------------*
           perform   vis-sce-ntr-000      thru vis-sce-ntr-999        .
      *              *-------------------------------------------------*
      *              * Tipo selezione scadenze da stampare             *
      *              *-------------------------------------------------*
           perform   vis-sce-tse-000      thru vis-sce-tse-999        .
      *              *-------------------------------------------------*
      *              * Si/No stampa ricevute bancarie                  *
      *              *-------------------------------------------------*
           perform   vis-sce-srb-000      thru vis-sce-srb-999        .
      *              *-------------------------------------------------*
      *              * Si/No stampa tratte                             *
      *              *-------------------------------------------------*
           perform   vis-sce-str-000      thru vis-sce-str-999        .
      *              *-------------------------------------------------*
      *              * Si/No stampa nostra intestazione                *
      *              *-------------------------------------------------*
           perform   vis-sce-sni-000      thru vis-sce-sni-999        .
      *              *-------------------------------------------------*
      *              * Si/No stampa denominazione della banca di pre-  *
      *              * sentazione                                      *
      *              *-------------------------------------------------*
           perform   vis-sce-sbp-000      thru vis-sce-sbp-999        .
       vis-tes-003-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts testata                           *
      *    *-----------------------------------------------------------*
       pmt-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Se pre-impostazione campi chiave : nessuna vi-  *
      *              * sualizzazione, e flag di visualizzazione prompt *
      *              * di testata, pagina 1, a 'non ancora visualizza- *
      *              * ti'                                             *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    spaces
                     move  spaces         to   w-vis-pmt-tes-001
                     go to pmt-tes-reg-999.
       pmt-tes-reg-050.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del numero pagina        *
      *              *-------------------------------------------------*
           go to     pmt-tes-reg-100
                     pmt-tes-reg-200
                     pmt-tes-reg-300
                     depending            on   w-cnt-sts-imp-npt      .
           go to     pmt-tes-reg-999.
       pmt-tes-reg-100.
      *              *-------------------------------------------------*
      *              * Pagina 1                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           perform   pmt-tes-001-000      thru pmt-tes-001-999        .
      *                  *---------------------------------------------*
      *                  * Fine Pagina                                 *
      *                  *---------------------------------------------*
           go to     pmt-tes-reg-999.
       pmt-tes-reg-200.
      *              *-------------------------------------------------*
      *              * Pagina 2                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           perform   pmt-tes-002-000      thru pmt-tes-002-999        .
      *                  *---------------------------------------------*
      *                  * Fine Pagina                                 *
      *                  *---------------------------------------------*
           go to     pmt-tes-reg-999.
       pmt-tes-reg-300.
      *              *-------------------------------------------------*
      *              * Pagina 3                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           perform   pmt-tes-003-000      thru pmt-tes-003-999        .
      *                  *---------------------------------------------*
      *                  * Fine Pagina                                 *
      *                  *---------------------------------------------*
           go to     pmt-tes-reg-999.
       pmt-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts di testata pagina 1               *
      *    *-----------------------------------------------------------*
       pmt-tes-001-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate                           *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Data composizione distinta                      *
      *              *-------------------------------------------------*
           perform   pmt-dtr-com-000      thru pmt-dtr-com-999        .
      *              *-------------------------------------------------*
      *              * Tipo di distinta                                *
      *              *-------------------------------------------------*
           perform   pmt-tip-ddp-000      thru pmt-tip-ddp-999        .
      *              *-------------------------------------------------*
      *              * Tipo di avviso richiesto                        *
      *              *-------------------------------------------------*
           perform   pmt-tav-ric-000      thru pmt-tav-ric-999        .
      *              *-------------------------------------------------*
      *              * Codice nostra banca per la presentazione        *
      *              *-------------------------------------------------*
           perform   pmt-cod-bpe-000      thru pmt-cod-bpe-999        .
      *              *-------------------------------------------------*
      *              * Importo globale distinta                        *
      *              *-------------------------------------------------*
           perform   pmt-imp-ddp-000      thru pmt-imp-ddp-999        .
      *              *-------------------------------------------------*
      *              * Numero effetti appartenenti alla distinta che   *
      *              * sono gia' stati stampati                        *
      *              *-------------------------------------------------*
           perform   pmt-sce-ngs-000      thru pmt-sce-ngs-999        .
       pmt-tes-001-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts di testata pagina 2               *
      *    *-----------------------------------------------------------*
       pmt-tes-002-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate                           *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Data presentazione distinta                     *
      *              *-------------------------------------------------*
           perform   pmt-dtr-pre-000      thru pmt-dtr-pre-999        .
      *              *-------------------------------------------------*
      *              * Tipo presentazione distinta                     *
      *              *-------------------------------------------------*
           perform   pmt-tip-pre-000      thru pmt-tip-pre-999        .
      *              *-------------------------------------------------*
      *              * Codice nostra banca per la presentazione        *
      *              *-------------------------------------------------*
           perform   pmt-cod-cbp-000      thru pmt-cod-cbp-999        .
      *              *-------------------------------------------------*
      *              * Stampa cartacea distinta                        *
      *              *-------------------------------------------------*
           perform   pmt-snx-stp-000      thru pmt-snx-stp-999        .
      *              *-------------------------------------------------*
      *              * Preparazione archivio per trasmissione elettro- *
      *              * nica                                            *
      *              *-------------------------------------------------*
           perform   pmt-snx-ads-000      thru pmt-snx-ads-999        .
      *              *-------------------------------------------------*
      *              * Tipo di invio dell'archivio di supporto alla    *
      *              * banca                                           *
      *              *-------------------------------------------------*
           perform   pmt-tip-ias-000      thru pmt-tip-ias-999        .
       pmt-tes-002-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts di testata pagina 3               *
      *    *-----------------------------------------------------------*
       pmt-tes-003-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate                           *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Numero ricevute bancarie incluse nella distinta *
      *              *-------------------------------------------------*
           perform   pmt-sce-nrb-000      thru pmt-sce-nrb-999        .
      *              *-------------------------------------------------*
      *              * Numero tratte incluse nella distinta            *
      *              *-------------------------------------------------*
           perform   pmt-sce-ntr-000      thru pmt-sce-ntr-999        .
      *              *-------------------------------------------------*
      *              * Tipo selezione scadenze da stampare             *
      *              *-------------------------------------------------*
           perform   pmt-sce-tse-000      thru pmt-sce-tse-999        .
      *              *-------------------------------------------------*
      *              * Si/No stampa ricevute bancarie                  *
      *              *-------------------------------------------------*
           perform   pmt-sce-srb-000      thru pmt-sce-srb-999        .
      *              *-------------------------------------------------*
      *              * Si/No stampa tratte                             *
      *              *-------------------------------------------------*
           perform   pmt-sce-str-000      thru pmt-sce-str-999        .
      *              *-------------------------------------------------*
      *              * Si/No stampa nostra intestazione                *
      *              *-------------------------------------------------*
           perform   pmt-sce-sni-000      thru pmt-sce-sni-999        .
      *              *-------------------------------------------------*
      *              * Si/No stampa denominazione della banca di pre-  *
      *              * sentazione                                      *
      *              *-------------------------------------------------*
           perform   pmt-sce-sbp-000      thru pmt-sce-sbp-999        .
       pmt-tes-003-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Data composizione distinta                   *
      *    *-----------------------------------------------------------*
       pmt-dtr-com-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data composizione distinta :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dtr-com-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Tipo di distinta                             *
      *    *-----------------------------------------------------------*
       pmt-tip-ddp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo di distinta           :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-tip-ddp-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Tipo di avviso richiesto                     *
      *    *-----------------------------------------------------------*
       pmt-tav-ric-000.
      *              *-------------------------------------------------*
      *              * Test se prompt da visualizzare                  *
      *              *-------------------------------------------------*
           if        w-tes-tip-ddp (1)    not  = 01
                     go to pmt-tav-ric-999.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo avviso richiesto      :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-tav-ric-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Selezione su codice nostra banca             *
      *    *-----------------------------------------------------------*
       pmt-cod-bpe-000.
      *              *-------------------------------------------------*
      *              * Test se prompt da visualizzare                  *
      *              *-------------------------------------------------*
           if        w-tes-tip-ddp (1)    not  = 01
                     go to pmt-cod-bpe-999.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Ns. banca di presentazione :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "per selezione su clienti    "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cod-bpe-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Importo globale distinta                     *
      *    *-----------------------------------------------------------*
       pmt-imp-ddp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Importo totale distinta    :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-imp-ddp-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Numero effetti appartenenti alla distinta    *
      *    *              che sono gia' stati stampati                 *
      *    *-----------------------------------------------------------*
       pmt-sce-ngs-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero effetti appartenen- :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "  ti alla distinta che so-  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "   no gia' stati stampati   "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-sce-ngs-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Data presentazione distinta                  *
      *    *-----------------------------------------------------------*
       pmt-dtr-pre-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data presentazione distinta:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dtr-pre-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Tipo presentazione distinta                  *
      *    *-----------------------------------------------------------*
       pmt-tip-pre-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo di presentazione      :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-tip-pre-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Codice nostra banca per la presentazione     *
      *    *-----------------------------------------------------------*
       pmt-cod-cbp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice nostra banca per la :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "             presentazione  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cod-cbp-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Stampa cartacea distinta                     *
      *    *-----------------------------------------------------------*
       pmt-snx-stp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Stampa cartacea distinta   :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-snx-stp-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Preparazione archivio per trasmissione elet- *
      *    *              tronica                                      *
      *    *-----------------------------------------------------------*
       pmt-snx-ads-000.
      *              *-------------------------------------------------*
      *              * Test se prompt da visualizzare                  *
      *              *-------------------------------------------------*
           if        w-tes-tip-ddp (1)    not  = 01
                     go to pmt-snx-ads-999.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Preparazione archivio per  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      " trasmissione elettronica   "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-snx-ads-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Tipo di invio dell'archivio di supporto alla *
      *    *              banca                                        *
      *    *-----------------------------------------------------------*
       pmt-tip-ias-000.
      *              *-------------------------------------------------*
      *              * Test se prompt da visualizzare                  *
      *              *-------------------------------------------------*
           if        w-tes-tip-ddp (1)    not  = 01
                     go to pmt-tip-ias-999.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo di invio elettronico  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-tip-ias-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Numero ricevute bancarie incluse nella di-   *
      *    *              stinta                                       *
      *    *-----------------------------------------------------------*
       pmt-sce-nrb-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero ricevute bancarie   :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-sce-nrb-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Numero tratte incluse nella distinta         *
      *    *-----------------------------------------------------------*
       pmt-sce-ntr-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero tratte              :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-sce-ntr-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Tipo selezione scadenze da stampare          *
      *    *-----------------------------------------------------------*
       pmt-sce-tse-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo di selezione scadenze :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "               da stampare  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-sce-tse-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Si/No stampa ricevute bancarie               *
      *    *-----------------------------------------------------------*
       pmt-sce-srb-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Stampa ricevute bancarie   :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-sce-srb-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Si/No stampa tratte                          *
      *    *-----------------------------------------------------------*
       pmt-sce-str-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Stampa tratte              :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-sce-str-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Si/No stampa nostra intestazione             *
      *    *-----------------------------------------------------------*
       pmt-sce-sni-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Stampa nostra intestazione :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-sce-sni-999.
           exit.

      *    *===========================================================*
      *    * Prompt per : Si/No stampa denominazione della banca di    *
      *    *              presentazione                                *
      *    *-----------------------------------------------------------*
       pmt-sce-sbp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Stampa denominazione della :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "    banca di presentazione  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-sce-sbp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Data composizione distinta        *
      *    *-----------------------------------------------------------*
       vis-dtr-com-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      08                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-dtr-com (1)    to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dtr-com-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Tipo di distinta                  *
      *    *-----------------------------------------------------------*
       vis-tip-ddp-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-ddp-lun    to   v-car                  .
           move      w-exp-tip-ddp-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-tip-ddp-tbl    to   v-txt                  .
           move      10                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-tip-ddp (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-ddp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Tipo di avviso richiesto          *
      *    *-----------------------------------------------------------*
       vis-tav-ric-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di distinta     *
      *              *-------------------------------------------------*
           if        w-tes-tip-ddp (1)    =    01
                     go to vis-tav-ric-100
           else      go to vis-tav-ric-900.
       vis-tav-ric-100.
      *              *-------------------------------------------------*
      *              * Se tipo distinta : 01                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tav-ric-lun    to   v-car                  .
           move      w-exp-tav-ric-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-tav-ric-tbl    to   v-txt                  .
           move      12                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-tav-ric (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     vis-tav-ric-999.
       vis-tav-ric-900.
      *              *-------------------------------------------------*
      *              * Per tutti gli altri tipi di distinta            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     vis-tav-ric-999.
       vis-tav-ric-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice banca per la presentazio-  *
      *    *                         ne, descrizione                   *
      *    *-----------------------------------------------------------*
       vis-cod-bpe-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-cod-bpe (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-bpe-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice banca per la presentazio-  *
      *    *                         ne, descrizione                   *
      *    *-----------------------------------------------------------*
       vis-cod-bpe-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-cod-bpe-des (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-bpe-des-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Importo globale per la distinta   *
      *    *-----------------------------------------------------------*
       vis-imp-ddp-000.
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "<G"                 to   v-edm                  .
           move      17                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-imp-ddp (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-imp-ddp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Numero effetti appartenenti alla  *
      *    *                         distinta, che sono gia' stati     *
      *    *                         stampati                          *
      *    *-----------------------------------------------------------*
       vis-sce-ngs-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      19                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-sce-ngs (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sce-ngs-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Data presentazione distinta       *
      *    *-----------------------------------------------------------*
       vis-dtr-pre-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      08                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-dtr-pre (1)    to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dtr-pre-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Tipo presentazione distinta       *
      *    *-----------------------------------------------------------*
       vis-tip-pre-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-pre-lun    to   v-car                  .
           move      w-exp-tip-pre-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-tip-pre-tbl    to   v-txt                  .
           move      10                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-tip-pre (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-pre-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice banca per la presentazio-  *
      *    *                         ne,                               *
      *    *-----------------------------------------------------------*
       vis-cod-cbp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-cod-cbp (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cbp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice banca per la presentazio-  *
      *    *                         ne, descrizione                   *
      *    *-----------------------------------------------------------*
       vis-cod-cbp-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-cod-cbp-des (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cbp-des-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Stampa cartacea distinta          *
      *    *-----------------------------------------------------------*
       vis-snx-stp-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-stp-lun    to   v-car                  .
           move      w-exp-snx-stp-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-snx-stp-tbl    to   v-txt                  .
           move      15                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        w-tes-snx-stp (1)    =    "S"
                     move  01             to   v-num
           else if   w-tes-snx-stp (1)    =    "N"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-snx-stp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Preparazione archivio di supporto *
      *    *                         per trasmissione alla banca       *
      *    *-----------------------------------------------------------*
       vis-snx-ads-000.
      *              *-------------------------------------------------*
      *              * Test se campo da visualizzare                   *
      *              *-------------------------------------------------*
           if        w-tes-tip-ddp (1)    not  = 01
                     go to vis-snx-ads-999.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-ads-lun    to   v-car                  .
           move      w-exp-snx-ads-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-snx-ads-tbl    to   v-txt                  .
           move      17                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        w-tes-snx-ads (1)    =    "S"
                     move  01             to   v-num
           else if   w-tes-snx-ads (1)    =    "N"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-snx-ads-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Tipo di invio supporto distinta   *
      *    *                         alla banca                        *
      *    *-----------------------------------------------------------*
       vis-tip-ias-000.
      *              *-------------------------------------------------*
      *              * Test se campo da visualizzare                   *
      *              *-------------------------------------------------*
           if        w-tes-tip-ddp (1)    not  = 01
                     go to vis-tip-ias-999.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-ias-lun    to   v-car                  .
           move      w-exp-tip-ias-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-tip-ias-tbl    to   v-txt                  .
           move      20                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-tip-ias (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-ias-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Numero ricevute bancarie incluse  *
      *    *                         nella distinta                    *
      *    *-----------------------------------------------------------*
       vis-sce-nrb-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      08                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-sce-nrb (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sce-nrb-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Numero tratte incluse nella di-   *
      *    *                         stinta                            *
      *    *-----------------------------------------------------------*
       vis-sce-ntr-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      09                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-sce-ntr (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sce-ntr-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Tipo selezione scadenze da stampare  *
      *    *-----------------------------------------------------------*
       acc-sce-tse-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-sce-tse-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sce-tse-lun    to   v-car                  .
           move      w-exp-sce-tse-num    to   v-ldt                  .
           move      "MST#"               to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sce-tse-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      11                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-sce-tse (1)    to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-sce-tse-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-sce-tse-999.
       acc-sce-tse-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-sce-tse (1)      .
       acc-sce-tse-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-sce-tse-425.
      *                  *---------------------------------------------*
      *                  * Test che il valore non sia a zero, a meno   *
      *                  * che non si sia in Up                        *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    not  = zero
                     go to acc-sce-tse-600.
           if        v-key                =    "UP  "
                     go to acc-sce-tse-600
           else      go to acc-sce-tse-100.
       acc-sce-tse-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-sce-tse-625.
      *                  *---------------------------------------------*
      *                  * Se tipo selezione effetti da stampare manu- *
      *                  * ale : si normalizza e si visualizza la      *
      *                  * scelta di stampa per le ricevute bancarie   *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    not  = 02
                     go to acc-sce-tse-650.
           if        w-tes-sce-srb (1)    =    spaces
                     go to acc-sce-tse-650.
           move      spaces               to   w-tes-sce-srb (1)      .
           perform   vis-sce-srb-000      thru vis-sce-srb-999        .
       acc-sce-tse-650.
      *                  *---------------------------------------------*
      *                  * Se tipo selezione effetti da stampare manu- *
      *                  * ale : si normalizza e si visualizza la      *
      *                  * scelta di stampa per le tratte              *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    not  = 02
                     go to acc-sce-tse-675.
           if        w-tes-sce-str (1)    =    spaces
                     go to acc-sce-tse-675.
           move      spaces               to   w-tes-sce-str (1)      .
           perform   vis-sce-str-000      thru vis-sce-str-999        .
       acc-sce-tse-675.
      *                  *---------------------------------------------*
      *                  * Fine dipendenze dall'impostazione           *
      *                  *---------------------------------------------*
           go to     acc-sce-tse-800.
       acc-sce-tse-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-sce-tse-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-sce-tse-100.
       acc-sce-tse-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Tipo selezione scadenze da stam-  *
      *    *                         pare                              *
      *    *-----------------------------------------------------------*
       vis-sce-tse-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sce-tse-lun    to   v-car                  .
           move      w-exp-sce-tse-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sce-tse-tbl    to   v-txt                  .
           move      11                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-sce-tse (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sce-tse-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Si/No stampa ricevute bancarie       *
      *    *-----------------------------------------------------------*
       acc-sce-srb-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-sce-srb-025.
      *                  *---------------------------------------------*
      *                  * Se selezione scadenze manuale : normalizza- *
      *                  * zazione, visualizzazione, ed uscita         *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    not  = 02
                     go to acc-sce-srb-050.
           if        w-tes-sce-srb (1)    =    spaces
                     go to acc-sce-srb-027.
           move      spaces               to   w-tes-sce-srb (1)      .
           perform   vis-sce-srb-000      thru vis-sce-srb-999        .
       acc-sce-srb-027.
           go to     acc-sce-srb-999.
       acc-sce-srb-050.
      *                  *---------------------------------------------*
      *                  * Se numero ricevute bancarie a zero : norma- *
      *                  * lizzazione, visualizzazione, ed uscita      *
      *                  *---------------------------------------------*
           if        w-tes-sce-nrb (1)    not  = zero
                     go to acc-sce-srb-100.
           move      spaces               to   w-tes-sce-srb (1)      .
           perform   vis-sce-srb-000      thru vis-sce-srb-999        .
           go to     acc-sce-srb-999.
       acc-sce-srb-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sce-srb-lun    to   v-car                  .
           move      w-exp-sce-srb-num    to   v-ldt                  .
           move      "SN#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sce-srb-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      14                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        w-tes-sce-srb (1)    =    "S"
                     move  01             to   v-num
           else if   w-tes-sce-srb (1)    =    "N"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-sce-srb-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-sce-srb-999.
       acc-sce-srb-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  "S"            to   w-tes-sce-srb (1)
           else if   v-num                =    02
                     move  "N"            to   w-tes-sce-srb (1)
           else      move  spaces         to   w-tes-sce-srb (1)      .
       acc-sce-srb-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-sce-srb-425.
      *                  *---------------------------------------------*
      *                  * Test che sia un valore accettabile          *
      *                  *---------------------------------------------*
           if        w-tes-sce-srb (1)    not  = spaces and
                     w-tes-sce-srb (1)    not  = "S"    and
                     w-tes-sce-srb (1)    not  = "N"
                     go to acc-sce-srb-100.
       acc-sce-srb-450.
      *                  *---------------------------------------------*
      *                  * Test che il valore non sia a spaces, a meno *
      *                  * che non si sia in Up                        *
      *                  *---------------------------------------------*
           if        w-tes-sce-srb (1)    not  = spaces
                     go to acc-sce-srb-600.
           if        v-key                =    "UP  "
                     go to acc-sce-srb-600
           else      go to acc-sce-srb-100.
       acc-sce-srb-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-sce-srb-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-sce-srb-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-sce-srb-100.
       acc-sce-srb-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Si/No stampa ricevute bancarie    *
      *    *-----------------------------------------------------------*
       vis-sce-srb-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sce-srb-lun    to   v-car                  .
           move      w-exp-sce-srb-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sce-srb-tbl    to   v-txt                  .
           move      14                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        w-tes-sce-srb (1)    =    "S"
                     move  01             to   v-num
           else if   w-tes-sce-srb (1)    =    "N"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sce-srb-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Si/No stampa tratte                  *
      *    *-----------------------------------------------------------*
       acc-sce-str-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-sce-str-025.
      *                  *---------------------------------------------*
      *                  * Se selezione scadenze manuale : normalizza- *
      *                  * zazione, visualizzazione, ed uscita         *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    not  = 02
                     go to acc-sce-str-050.
           if        w-tes-sce-str (1)    =    spaces
                     go to acc-sce-str-027.
           move      spaces               to   w-tes-sce-str (1)      .
           perform   vis-sce-str-000      thru vis-sce-str-999        .
       acc-sce-str-027.
           go to     acc-sce-str-999.
       acc-sce-str-050.
      *                  *---------------------------------------------*
      *                  * Se numero ricevute bancarie a zero : norma- *
      *                  * lizzazione, visualizzazione, ed uscita      *
      *                  *---------------------------------------------*
           if        w-tes-sce-ntr (1)    not  = zero
                     go to acc-sce-str-100.
           move      spaces               to   w-tes-sce-str (1)      .
           perform   vis-sce-str-000      thru vis-sce-str-999        .
           go to     acc-sce-str-999.
       acc-sce-str-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sce-str-lun    to   v-car                  .
           move      w-exp-sce-str-num    to   v-ldt                  .
           move      "NS#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sce-str-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      16                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        w-tes-sce-str (1)    =    "N"
                     move  01             to   v-num
           else if   w-tes-sce-str (1)    =    "S"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-sce-str-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-sce-str-999.
       acc-sce-str-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  "N"            to   w-tes-sce-str (1)
           else if   v-num                =    02
                     move  "S"            to   w-tes-sce-str (1)
           else      move  spaces         to   w-tes-sce-str (1)      .
       acc-sce-str-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-sce-str-425.
      *                  *---------------------------------------------*
      *                  * Test che sia un valore accettabile          *
      *                  *---------------------------------------------*
           if        w-tes-sce-str (1)    not  = spaces and
                     w-tes-sce-str (1)    not  = "S"    and
                     w-tes-sce-str (1)    not  = "N"
                     go to acc-sce-str-100.
       acc-sce-str-450.
      *                  *---------------------------------------------*
      *                  * Test che il valore non sia a spaces, a meno *
      *                  * che non si sia in Up                        *
      *                  *---------------------------------------------*
           if        w-tes-sce-str (1)    not  = spaces
                     go to acc-sce-str-600.
           if        v-key                =    "UP  "
                     go to acc-sce-str-600
           else      go to acc-sce-str-100.
       acc-sce-str-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-sce-str-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-sce-str-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-sce-str-100.
       acc-sce-str-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Si/No stampa tratte               *
      *    *-----------------------------------------------------------*
       vis-sce-str-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sce-str-lun    to   v-car                  .
           move      w-exp-sce-str-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sce-str-tbl    to   v-txt                  .
           move      16                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        w-tes-sce-str (1)    =    "N"
                     move  01             to   v-num
           else if   w-tes-sce-str (1)    =    "S"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sce-str-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Si/No stampa nostra intestazione     *
      *    *-----------------------------------------------------------*
       acc-sce-sni-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-sce-sni-025.
      *                  *---------------------------------------------*
      *                  * Se selezione scadenze manuale : ad accetta- *
      *                  * zione                                       *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     go to acc-sce-sni-100.
       acc-sce-sni-050.
      *                  *---------------------------------------------*
      *                  * Se stampa ricevute bancarie e stampa tratta *
      *                  * entrambi a No : normalizzazione, visualiz-  *
      *                  * zazione, ed uscita                          *
      *                  *---------------------------------------------*
           if        w-tes-sce-srb (1)    =    "S" or
                     w-tes-sce-str (1)    =    "S"
                     go to acc-sce-sni-100.
           if        w-tes-sce-sni (1)    =    spaces
                     go to acc-sce-sni-052.
           move      spaces               to   w-tes-sce-sni (1)      .
           perform   vis-sce-sni-000      thru vis-sce-sni-999        .
       acc-sce-sni-052.
           go to     acc-sce-sni-999.
       acc-sce-sni-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sce-sni-lun    to   v-car                  .
           move      w-exp-sce-sni-num    to   v-ldt                  .
           move      "SN#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sce-sni-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      18                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        w-tes-sce-sni (1)    =    "S"
                     move  01             to   v-num
           else if   w-tes-sce-sni (1)    =    "N"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-sce-sni-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-sce-sni-999.
       acc-sce-sni-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  "S"            to   w-tes-sce-sni (1)
           else if   v-num                =    02
                     move  "N"            to   w-tes-sce-sni (1)
           else      move  spaces         to   w-tes-sce-sni (1)      .
       acc-sce-sni-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-sce-sni-425.
      *                  *---------------------------------------------*
      *                  * Test che sia un valore accettabile          *
      *                  *---------------------------------------------*
           if        w-tes-sce-sni (1)    not  = spaces and
                     w-tes-sce-sni (1)    not  = "S"    and
                     w-tes-sce-sni (1)    not  = "N"
                     go to acc-sce-sni-100.
       acc-sce-sni-450.
      *                  *---------------------------------------------*
      *                  * Test che il valore non sia a spaces, a meno *
      *                  * che non si sia in Up                        *
      *                  *---------------------------------------------*
           if        w-tes-sce-sni (1)    not  = spaces
                     go to acc-sce-sni-600.
           if        v-key                =    "UP  "
                     go to acc-sce-sni-600
           else      go to acc-sce-sni-100.
       acc-sce-sni-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-sce-sni-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-sce-sni-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-sce-sni-100.
       acc-sce-sni-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Si/No stampa nostra intestazione  *
      *    *-----------------------------------------------------------*
       vis-sce-sni-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sce-sni-lun    to   v-car                  .
           move      w-exp-sce-sni-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sce-sni-tbl    to   v-txt                  .
           move      18                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        w-tes-sce-sni (1)    =    "S"
                     move  01             to   v-num
           else if   w-tes-sce-sni (1)    =    "N"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sce-sni-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Si/No stampa denominazione della     *
      *    *                      banca di presentazione               *
      *    *-----------------------------------------------------------*
       acc-sce-sbp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-sce-sbp-025.
      *                  *---------------------------------------------*
      *                  * Se selezione scadenze manuale : ad accetta- *
      *                  * zione                                       *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     go to acc-sce-sbp-100.
       acc-sce-sbp-050.
      *                  *---------------------------------------------*
      *                  * Se stampa ricevute bancarie e stampa tratta *
      *                  * entrambi a No : normalizzazione, visualiz-  *
      *                  * zazione, ed uscita                          *
      *                  *---------------------------------------------*
           if        w-tes-sce-srb (1)    =    "S" or
                     w-tes-sce-str (1)    =    "S"
                     go to acc-sce-sbp-100.
           if        w-tes-sce-sbp (1)    =    spaces
                     go to acc-sce-sbp-052.
           move      spaces               to   w-tes-sce-sbp (1)      .
           perform   vis-sce-sbp-000      thru vis-sce-sbp-999        .
       acc-sce-sbp-052.
           go to     acc-sce-sbp-999.
       acc-sce-sbp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sce-sbp-lun    to   v-car                  .
           move      w-exp-sce-sbp-num    to   v-ldt                  .
           move      "NS#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sce-sbp-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      20                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        w-tes-sce-sbp (1)    =    "N"
                     move  01             to   v-num
           else if   w-tes-sce-sbp (1)    =    "S"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-sce-sbp-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-sce-sbp-999.
       acc-sce-sbp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  "N"            to   w-tes-sce-sbp (1)
           else if   v-num                =    02
                     move  "S"            to   w-tes-sce-sbp (1)
           else      move  spaces         to   w-tes-sce-sbp (1)      .
       acc-sce-sbp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-sce-sbp-425.
      *                  *---------------------------------------------*
      *                  * Test che sia un valore accettabile          *
      *                  *---------------------------------------------*
           if        w-tes-sce-sbp (1)    not  = spaces and
                     w-tes-sce-sbp (1)    not  = "S"    and
                     w-tes-sce-sbp (1)    not  = "N"
                     go to acc-sce-sbp-100.
       acc-sce-sbp-450.
      *                  *---------------------------------------------*
      *                  * Test che il valore non sia a spaces, a meno *
      *                  * che non si sia in Up                        *
      *                  *---------------------------------------------*
           if        w-tes-sce-sbp (1)    not  = spaces
                     go to acc-sce-sbp-600.
           if        v-key                =    "UP  "
                     go to acc-sce-sbp-600
           else      go to acc-sce-sbp-100.
       acc-sce-sbp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-sce-sbp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-sce-sbp-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-sce-sbp-100.
       acc-sce-sbp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Si/No stampa denominazione della  *
      *    *                         banca di presentazione            *
      *    *-----------------------------------------------------------*
       vis-sce-sbp-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sce-sbp-lun    to   v-car                  .
           move      w-exp-sce-sbp-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sce-sbp-tbl    to   v-txt                  .
           move      20                   to   v-lin                  .
           move      30                   to   v-pos                  .
           if        w-tes-sce-sbp (1)    =    "N"
                     move  01             to   v-num
           else if   w-tes-sce-sbp (1)    =    "S"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sce-sbp-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Presa visione per pagina     *
      *    *-----------------------------------------------------------*
       acc-pre-vpg-000.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      spaces               to   v-msk                  .
           move      spaces               to   v-alf                  .
           move      spaces               to   v-not                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           if        w-cnt-sts-imp-npt    >    1
                     move  "PRSC"         to   v-pfk (07)             .
           move      "NXSC"               to   v-pfk (08)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-pre-vpg-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-pre-vpg-000.
       acc-pre-vpg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione corpo a partire dalla riga con numero d'or-  *
      *    * dine : w-cnt-cor-nrg-dac                                  *
      *    *-----------------------------------------------------------*
       acc-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita da corpo            *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-cor      .
      *              *-------------------------------------------------*
      *              * Confronto tra numero d'ordine riga da accettare *
      *              * e numero d'ordine dell'ultima riga              *
      *              *-------------------------------------------------*
           if        w-cnt-cor-nrg-dac    not  > w-cat-rig-max
                     go to acc-cor-reg-025.
      *              *-------------------------------------------------*
      *              * Se oltre numero riga massimo si esce comunque   *
      *              * con status di uscita "+", in quanto non e' mai  *
      *              * possibile aggiungere righe in questo programma  *
      *              *                                                 *
      *              * N.B. : Questa e' l'unica modifica fatta alla    *
      *              *        routine 'acc-cor-reg-000/999' per far    *
      *              *        si' che non sia ammesso l'inserimento    *
      *              *        di righe aggiuntive.                     *
      *              *        Oltre a questo l'accettazione del pri-   *
      *              *        mo campo della riga corpo espansa vede   *
      *              *        inibiti i tasti funzione Insr e Remv.    *
      *              *        Inoltre la routine di conferma imposta-  *
      *              *        zioni rimandera', per il tasto Up, al-   *
      *              *        l'ultima riga effettiva anziche alla     *
      *              *        prima in Append.                         *
      *              *-------------------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-025.
      *              *-------------------------------------------------*
      *              * Video in 'OFF'                                  *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Prompts per corpo                               *
      *              *-------------------------------------------------*
           if        w-cnt-sts-pmt-cor    =    spaces
                     perform pmt-cor-reg-000
                                          thru pmt-cor-reg-999
                     move    "#"          to   w-cnt-sts-pmt-cor      .
      *              *-------------------------------------------------*
      *              * Visualizzazione dati corpo                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione nr pagina da visualizzare    *
      *                  *---------------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrp-dav      .
           add       w-lin-num-lin-vis    to   w-cnt-cor-nrp-dav      .
           subtract  1                    from w-cnt-cor-nrp-dav      .
           divide    w-lin-num-lin-vis    into w-cnt-cor-nrp-dav      .
      *                  *---------------------------------------------*
      *                  * Se non e' visualizzata nessuna pagina corpo *
      *                  * o una pagina corpo diversa da quella da vi- *
      *                  * sualizzare si procede alla visualizzazione  *
      *                  *---------------------------------------------*
           if        w-cnt-sts-vis-cor    =    spaces           or
                     w-cnt-cor-nrp-vis    not  = w-cnt-cor-nrp-dav
                     perform vis-cor-reg-000
                                          thru vis-cor-reg-999
                     move    "#"          to   w-cnt-sts-vis-cor
                     move    w-cnt-cor-nrp-dav
                                          to   w-cnt-cor-nrp-vis      .
      *              *-------------------------------------------------*
      *              * Lettura riga da catena                          *
      *              *-------------------------------------------------*
           move      "RD"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
           move      w-cat-rig-buf        to   w-rig                  .
      *              *-------------------------------------------------*
      *              * Se riga nuova si normalizza il corpo            *
      *              *-------------------------------------------------*
           if        w-cat-rig-new        =    spaces
                     go to acc-cor-reg-050.
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
           move      w-rig-val-aep (1)    to   w-rig-val-aep (2)      .
       acc-cor-reg-050.
      *              *-------------------------------------------------*
      *              * Routine pre-accettazione riga corpo             *
      *              *-------------------------------------------------*
           perform   pre-rig-cor-000      thru pre-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts per riga d'accettazione *
      *              *-------------------------------------------------*
           perform   pmt-rig-cor-000      thru pmt-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione dati per riga di accettazione   *
      *              *-------------------------------------------------*
           perform   vis-rig-cor-000      thru vis-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Video in 'ON'                                   *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Flag di status impostazione corpo               *
      *              *-------------------------------------------------*
           if        w-cat-rig-max        =    zero
                     move  spaces         to   w-cnt-sts-imp-cor
           else      move  "#"            to   w-cnt-sts-imp-cor      .
           if        w-cat-rig-max        =    1        and
                     w-cat-rig-new        not  = spaces and
                     w-cat-rig-lst        not  = spaces
                     move  spaces         to   w-cnt-sts-imp-cor      .
      *              *-------------------------------------------------*
      *              * Flag di status impostione riga attuale          *
      *              *-------------------------------------------------*
           if        w-cat-rig-new        =    spaces
                     move  "#"            to   w-cnt-sts-imp-rig
           else      move  spaces         to   w-cnt-sts-imp-rig      .
      *              *-------------------------------------------------*
      *              * Indicatore linea in corso di trattamento        *
      *              *-------------------------------------------------*
           move      "I"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita da riga corpo       *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-rig      .
       acc-cor-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo selezione ef- *
      *                  * fetti da stampare                           *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     go to acc-cor-reg-200
           else      go to acc-cor-reg-400.
       acc-cor-reg-200.
      *                  *---------------------------------------------*
      *                  * Se trattamento corpo con selezione manuale  *
      *                  * degli effetti da stampare                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo impostazione : primo campo riga    *
      *                      * corpo                                   *
      *                      *-----------------------------------------*
           move      "C"                  to   w-cnt-mfu-tip-imp      .
      *                      *-----------------------------------------*
      *                      * Accettazione si/no selezione effetto    *
      *                      *-----------------------------------------*
           perform   acc-sce-sns-000      thru acc-sce-sns-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-925.
      *                      *-----------------------------------------*
      *                      * Tipo impostazione : altri campi riga    *
      *                      * corpo                                   *
      *                      *-----------------------------------------*
           move      "R"                  to   w-cnt-mfu-tip-imp      .
       acc-cor-reg-250.
      *                      *-----------------------------------------*
      *                      * Normalizzazione func-key di impostazio- *
      *                      * ne                                      *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
       acc-cor-reg-300.
      *                      *-----------------------------------------*
      *                      * Controllo finale su riga impostata      *
      *                      *-----------------------------------------*
           perform   cnt-tdo-rig-000      thru cnt-tdo-rig-999        .
           if        w-cnt-tdo-rig-flg    not  = spaces
                     move  spaces         to   w-cnt-tdo-rig-flg
                     move  "UP  "         to   v-key
                     go to acc-cor-reg-200.
      *                      *-----------------------------------------*
      *                      * Continuazione comune                    *
      *                      *-----------------------------------------*
           go to     acc-cor-reg-900.
       acc-cor-reg-400.
      *                  *---------------------------------------------*
      *                  * Se trattamento corpo con selezione non ma-  *
      *                  * buale degli effetti da stampare             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo impostazione : primo campo riga    *
      *                      * corpo                                   *
      *                      *-----------------------------------------*
           move      "C"                  to   w-cnt-mfu-tip-imp      .
      *                      *-----------------------------------------*
      *                      * Accettazione numero scadenza            *
      *                      *-----------------------------------------*
           perform   acc-num-sdb-000      thru acc-num-sdb-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-925.
      *                      *-----------------------------------------*
      *                      * Tipo impostazione : altri campi riga    *
      *                      * corpo                                   *
      *                      *-----------------------------------------*
           move      "R"                  to   w-cnt-mfu-tip-imp      .
       acc-cor-reg-450.
      *                      *-----------------------------------------*
      *                      * Normalizzazione func-key di impostazio- *
      *                      * ne                                      *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
      *                      *-----------------------------------------*
      *                      * Accettazione presa visione per corpo    *
      *                      *-----------------------------------------*
           perform   acc-pvi-cor-000      thru acc-pvi-cor-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
       acc-cor-reg-500.
      *                      *-----------------------------------------*
      *                      * Controllo finale su riga impostata      *
      *                      *-----------------------------------------*
           perform   cnt-tdo-rig-000      thru cnt-tdo-rig-999        .
           if        w-cnt-tdo-rig-flg    not  = spaces
                     move  spaces         to   w-cnt-tdo-rig-flg
                     move  "UP  "         to   v-key
                     go to acc-cor-reg-450.
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     acc-cor-reg-900.
       acc-cor-reg-900.
      *              *-------------------------------------------------*
      *              * Tests per uscita significativa da interno riga  *
      *              *-------------------------------------------------*
           if        w-cnt-tus-acc-rig    =    spaces or
                     w-cnt-tus-acc-rig    =    "S"
                     go to acc-cor-reg-905
           else if   w-cnt-tus-acc-rig    =    "R"
                     go to acc-cor-reg-910.
      *                  *---------------------------------------------*
      *                  * Se Exit da interno riga                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se riga New funzionamento come per Remv *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        not  = spaces
                     go to acc-cor-reg-915.
      *                      *-----------------------------------------*
      *                      * Se riga non New                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Visualizzazione numero riga         *
      *                          *-------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
           go to     acc-cor-reg-000.
       acc-cor-reg-905.
      *                  *---------------------------------------------*
      *                  * Se Do da interno riga                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se record di tipo New attribuzione del  *
      *                      * numero progressivo per la riga          *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces
                     go to acc-cor-reg-907.
           perform   prg-rig-cor-000      thru prg-rig-cor-999        .
       acc-cor-reg-907.
      *                      *-----------------------------------------*
      *                      * Routine post-accettazione riga          *
      *                      *-----------------------------------------*
           move      "+"                  to   w-cnt-cor-tip-agg      .
           perform   pos-rig-cor-000      thru pos-rig-cor-999        .
      *                      *-----------------------------------------*
      *                      * Update riga in catena movimenti         *
      *                      *-----------------------------------------*
           move      "UP"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           move      w-rig                to   w-cat-rig-buf          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *                      *-----------------------------------------*
      *                      * Visualizzazione linea corpo             *
      *                      *-----------------------------------------*
           move      "R"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Incremento del numero d'ordine della    *
      *                      * riga da accettare                       *
      *                      *-----------------------------------------*
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-910.
      *                  *---------------------------------------------*
      *                  * Se Remv da interno riga                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se riga non new : routine post-accetta- *
      *                      * zione riga                              *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        not  = spaces
                     go to acc-cor-reg-915.
           move      "-"                  to   w-cnt-cor-tip-agg      .
           perform   pos-rig-cor-000      thru pos-rig-cor-999        .
       acc-cor-reg-915.
      *                      *-----------------------------------------*
      *                      * Visualizzazione numero riga a spaces se *
      *                      * si e' in Append                         *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        not  = spaces and
                     w-cat-rig-lst        not  = spaces
                     move    "S"          to   w-cnt-cor-tvi-rig
                     move    w-cnt-cor-nrg-dac
                                          to   w-cnt-cor-nrg-dav
                     perform vis-lin-cor-000
                                          thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Numero pagina attualmente  visualizzata *
      *                      * a zero per forzare la rivisualizzazione *
      *                      * a meno che non si sia in Append         *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces or
                     w-cat-rig-lst        =    spaces
                     move  zero           to   w-cnt-cor-nrp-vis      .
      *                      *-----------------------------------------*
      *                      * Rimozione record dalla catena           *
      *                      *-----------------------------------------*
           move      "RM"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *                      *-----------------------------------------*
      *                      * Segnale di almeno una modifica          *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-acc-flg-aum      .
           go to     acc-cor-reg-000.
       acc-cor-reg-925.
      *              *-------------------------------------------------*
      *              * Tests per uscita significativa dal primo campo  *
      *              * di impostazione della riga                      *
      *              *-------------------------------------------------*
           if        w-cnt-tus-acc-rig    =    "U"
                     go to acc-cor-reg-935
           else if   w-cnt-tus-acc-rig    =    "D"
                     go to acc-cor-reg-940
           else if   w-cnt-tus-acc-rig    =    "S"
                     go to acc-cor-reg-945
           else if   w-cnt-tus-acc-rig    =    "X"
                     go to acc-cor-reg-950
           else if   w-cnt-tus-acc-rig    =    "I"
                     go to acc-cor-reg-955
           else if   w-cnt-tus-acc-rig    =    "R"
                     go to acc-cor-reg-960
           else if   w-cnt-tus-acc-rig    =    "T"
                     go to acc-cor-reg-965
           else if   w-cnt-tus-acc-rig    =    "B"
                     go to acc-cor-reg-970
           else if   w-cnt-tus-acc-rig    =    "N"
                     go to acc-cor-reg-975
           else if   w-cnt-tus-acc-rig    =    "P"
                     go to acc-cor-reg-980
           else if   w-cnt-tus-acc-rig    =    "."
                     go to acc-cor-reg-985.
       acc-cor-reg-930.
      *                  *---------------------------------------------*
      *                  * Se Exit da primo campo di impostazione riga *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-935.
      *                  *---------------------------------------------*
      *                  * Se Up da primo campo di impostazione riga   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se record New                           *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces
                     go to acc-cor-reg-936.
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga a   *
      *                          * spaces se si e' in Append           *
      *                          *-------------------------------------*
           if        w-cat-rig-new        not  = spaces and
                     w-cat-rig-lst        not  = spaces
                     move    "S"          to   w-cnt-cor-tvi-rig
                     move    w-cnt-cor-nrg-dac
                                          to   w-cnt-cor-nrg-dav
                     perform vis-lin-cor-000
                                          thru vis-lin-cor-999        .
      *                          *-------------------------------------*
      *                          * Numero pagina attualmente visualiz- *
      *                          * zata a zero per forzare la rivisua- *
      *                          * lizzazione,  a meno che non si sia  *
      *                          * in Append                           *
      *                          *-------------------------------------*
           if        w-cat-rig-new        =    spaces or
                     w-cat-rig-lst        =    spaces
                     move  zero           to   w-cnt-cor-nrp-vis      .
      *                          *-------------------------------------*
      *                          * Rimozione record dalla catena       *
      *                          *-------------------------------------*
           move      "RM"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
           go to     acc-cor-reg-937.
       acc-cor-reg-936.
      *                      *-----------------------------------------*
      *                      * Se record non New                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga     *
      *                          *-------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
       acc-cor-reg-937.
      *                          *-------------------------------------*
      *                          * Se si e' sulla riga numero 1        *
      *                          *-------------------------------------*
           if        w-cnt-cor-nrg-dac    =    1
                     move  "-"            to   w-cnt-tus-acc-cor
                     go to acc-cor-reg-990.
      *                          *-------------------------------------*
      *                          * Se non si e' sulla riga numero 1    *
      *                          *-------------------------------------*
           subtract  1                    from w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-940.
      *                  *---------------------------------------------*
      *                  * Se Down da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se record New                           *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces
                     go to acc-cor-reg-941.
      *                          *-------------------------------------*
      *                          * Se si e' in Append si prepara il    *
      *                          * tipo uscita "+" e si visualizza il  *
      *                          * numero riga a spaces                *
      *                          *-------------------------------------*
           if        w-cat-rig-new        not  = spaces and
                     w-cat-rig-lst        not  = spaces
                     move    "+"          to   w-cnt-tus-acc-cor
                     move    "S"          to   w-cnt-cor-tvi-rig
                     move    w-cnt-cor-nrg-dac
                                          to   w-cnt-cor-nrg-dav
                     perform vis-lin-cor-000
                                          thru vis-lin-cor-999
      *                          *-------------------------------------*
      *                          * Altrimenti si prepara il numero pa- *
      *                          * gina attualmente visualizzata a ze- *
      *                          * ro per forzare la rivisualizzazione *
      *                          *-------------------------------------*
           else      move  zero           to   w-cnt-cor-nrp-vis      .
      *                          *-------------------------------------*
      *                          * Rimozione record dalla catena       *
      *                          *-------------------------------------*
           move      "RM"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *                          *-------------------------------------*
      *                          * Se si era in Append : uscita        *
      *                          *-------------------------------------*
           if        w-cnt-tus-acc-cor    =    "+"
                     go to acc-cor-reg-990
      *                          *-------------------------------------*
      *                          * Altrimenti : riciclo                *
      *                          *-------------------------------------*
           else      go to acc-cor-reg-000.
       acc-cor-reg-941.
      *                      *-----------------------------------------*
      *                      * Se record non New                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga     *
      *                          *-------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                          *-------------------------------------*
      *                          * Incremento del numero riga          *
      *                          *-------------------------------------*
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-945.
      *                  *---------------------------------------------*
      *                  * Se Do da primo campo di impostazione riga   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se record New                           *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces
                     go to acc-cor-reg-946.
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga a   *
      *                          * spaces                              *
      *                          *-------------------------------------*
           move      "S"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                          *-------------------------------------*
      *                          * Rimozione record dalla catena       *
      *                          *-------------------------------------*
           move      "RM"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
       acc-cor-reg-946.
      *                      *-----------------------------------------*
      *                      * Se record non New                       *
      *                      *-----------------------------------------*
           move      "S"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-950.
      *                  *---------------------------------------------*
      *                  * Se Delt da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se record New                           *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces
                     go to acc-cor-reg-951.
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga a   *
      *                          * spaces                              *
      *                          *-------------------------------------*
           move      "S"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                          *-------------------------------------*
      *                          * Rimozione record dalla catena       *
      *                          *-------------------------------------*
           move      "RM"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
       acc-cor-reg-951.
      *                      *-----------------------------------------*
      *                      * Se record non New                       *
      *                      *-----------------------------------------*
           move      "X"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-955.
      *                  *---------------------------------------------*
      *                  * Se Insr da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Inserimento record nella catena         *
      *                      *-----------------------------------------*
           move      "IN"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *                      *-----------------------------------------*
      *                      * Numero pagina attualmente  visualizzata *
      *                      * a zero per forzare la rivisualizzazione *
      *                      *-----------------------------------------*
           move      zero                 to   w-cnt-cor-nrp-vis      .
           go to     acc-cor-reg-000.
       acc-cor-reg-960.
      *                  *---------------------------------------------*
      *                  * Se Remv da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se riga non new : routine post-accetta- *
      *                      * zione riga                              *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        not  = spaces
                     go to acc-cor-reg-962.
           move      "-"                  to   w-cnt-cor-tip-agg      .
           perform   pos-rig-cor-000      thru pos-rig-cor-999        .
       acc-cor-reg-962.
      *                      *-----------------------------------------*
      *                      * Se in Append : visualizzazione del nu-  *
      *                      * mero riga a spaces                      *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        not  = spaces and
                     w-cat-rig-lst        not  = spaces
                     move    "S"          to   w-cnt-cor-tvi-rig
                     move    w-cnt-cor-nrg-dac
                                          to   w-cnt-cor-nrg-dav
                     perform vis-lin-cor-000
                                          thru vis-lin-cor-999
      *                      *-----------------------------------------*
      *                      * Altrimenti si prepara il numero pagina  *
      *                      * attualmente visualizzata a zero per     *
      *                      * forzare la rivisualizzazione            *
      *                      *-----------------------------------------*
           else      move  zero           to   w-cnt-cor-nrp-vis      .
      *                      *-----------------------------------------*
      *                      * Rimozione record dalla catena           *
      *                      *-----------------------------------------*
           move      "RM"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *                      *-----------------------------------------*
      *                      * Segnale di almeno una modifica          *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-acc-flg-aum      .
           go to     acc-cor-reg-000.
       acc-cor-reg-965.
      *                  *---------------------------------------------*
      *                  * Se Tab da primo campo di impostazione riga  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se record New                           *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces
                     go to acc-cor-reg-966.
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga a   *
      *                          * spaces                              *
      *                          *-------------------------------------*
           move      "S"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                          *-------------------------------------*
      *                          * Numero pagina attualmente visualiz- *
      *                          * zata a zero per forzare la rivisua- *
      *                          * lizzazione a meno che non si sia in *
      *                          * Append                              *
      *                          *-------------------------------------*
           if        w-cat-rig-new        =    spaces or
                     w-cat-rig-lst        =    spaces
                     move  zero           to   w-cnt-cor-nrp-vis      .
      *                          *-------------------------------------*
      *                          * Rimozione record dalla catena       *
      *                          *-------------------------------------*
           move      "RM"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
           go to     acc-cor-reg-967.
       acc-cor-reg-966.
      *                      *-----------------------------------------*
      *                      * Se record non New                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga     *
      *                          *-------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
       acc-cor-reg-967.
      *                          *-------------------------------------*
      *                          * Ad accettazione max                 *
      *                          *                                     *
      *                          * N.B. : Questa e' una modifica fatta *
      *                          *        alla routine 'acc-cor-reg',  *
      *                          *        che normalmente esegue l'ac- *
      *                          *        cettazione del max + 1       *
      *                          *-------------------------------------*
           move      w-cat-rig-max        to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-970.
      *                  *---------------------------------------------*
      *                  * Se Back da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se record New                           *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces
                     go to acc-cor-reg-971.
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga a   *
      *                          * spaces                              *
      *                          *-------------------------------------*
           move      "S"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                          *-------------------------------------*
      *                          * Numero pagina attualmente visualiz- *
      *                          * zata a zero per forzare la rivisua- *
      *                          * lizzazione a meno che non si sia in *
      *                          * Append                              *
      *                          *-------------------------------------*
           if        w-cat-rig-new        =    spaces or
                     w-cat-rig-lst        =    spaces
                     move  zero           to   w-cnt-cor-nrp-vis      .
      *                          *-------------------------------------*
      *                          * Rimozione record dalla catena       *
      *                          *-------------------------------------*
           move      "RM"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
           move      1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-971.
      *                      *-----------------------------------------*
      *                      * Se record non New                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga     *
      *                          *-------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
           move      1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-975.
      *                  *---------------------------------------------*
      *                  * Se Nxsc da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se record New                           *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces
                     go to acc-cor-reg-976.
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga a   *
      *                          * spaces                              *
      *                          *-------------------------------------*
           move      "S"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                          *-------------------------------------*
      *                          * Numero pagina attualmente visualiz- *
      *                          * zata a zero per forzare la rivisua- *
      *                          * lizzazione a meno che non si sia in *
      *                          * Append                              *
      *                          *-------------------------------------*
           if        w-cat-rig-new        =    spaces or
                     w-cat-rig-lst        =    spaces
                     move  zero           to   w-cnt-cor-nrp-vis      .
      *                          *-------------------------------------*
      *                          * Rimozione record dalla catena       *
      *                          *-------------------------------------*
           move      "RM"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
           go to     acc-cor-reg-977.
       acc-cor-reg-976.
      *                      *-----------------------------------------*
      *                      * Se record non New                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga     *
      *                          *-------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
       acc-cor-reg-977.
      *                          *-------------------------------------*
      *                          * Se si era nell'ultima riga, ed essa *
      *                          * era in Append : tipo uscita "+" e   *
      *                          * si esce                             *
      *                          *-------------------------------------*
           if        w-cnt-cor-nrg-dac    >    w-cat-rig-max
                     move    "+"          to   w-cnt-tus-acc-cor
                     go to acc-cor-reg-990.
      *                          *-------------------------------------*
      *                          * Determinazione numero d'ordine del- *
      *                          * la prima riga appartenente alla pa- *
      *                          * gina (max + 1)                      *
      *                          *-------------------------------------*
           move      w-cat-rig-max        to   w-cnt-wrk-ctr-001      .
           add       w-lin-num-lin-vis    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001      .
           multiply  w-lin-num-lin-vis    by   w-cnt-wrk-ctr-001      .
           add       1                    to   w-cnt-wrk-ctr-001      .
      *                          *-------------------------------------*
      *                          * Determinazione numero d'ordine del- *
      *                          * la prima riga appartenente alla pa- *
      *                          * gina (attuale + 1)                  *
      *                          *-------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-cnt-wrk-ctr-002      .
           add       w-lin-num-lin-vis    to   w-cnt-wrk-ctr-002      .
           subtract  1                    from w-cnt-wrk-ctr-002      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-002      .
           multiply  w-lin-num-lin-vis    by   w-cnt-wrk-ctr-002      .
           add       1                    to   w-cnt-wrk-ctr-002      .
      *                          *-------------------------------------*
      *                          * Se la prossima pagina e' sicuramen- *
      *                          * te prima dell'ultima                *
      *                          *-------------------------------------*
           if        w-cnt-wrk-ctr-002    <    w-cnt-wrk-ctr-001
                     move  w-cnt-wrk-ctr-002
                                          to   w-cnt-cor-nrg-dac
                     go to acc-cor-reg-000.
      *                          *-------------------------------------*
      *                          * Se si e' sull'ultima pagina la qua- *
      *                          * le e' pero' completamente piena     *
      *                          *-------------------------------------*
           subtract  1                    from w-cnt-wrk-ctr-001      .
           if        w-cat-rig-max        =    w-cnt-wrk-ctr-001
                     move  w-cnt-wrk-ctr-002
                                          to   w-cnt-cor-nrg-dac
                     go to acc-cor-reg-000.
      *                          *-------------------------------------*
      *                          * Se si supera l'ultima pagina        *
      *                          *-------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-980.
      *                  *---------------------------------------------*
      *                  * Se Prsc da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se record New                           *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces
                     go to acc-cor-reg-981.
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga a   *
      *                          * spaces                              *
      *                          *-------------------------------------*
           move      "S"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                          *-------------------------------------*
      *                          * Numero pagina attualmente visualiz- *
      *                          * zata a zero per forzare la rivisua- *
      *                          * lizzazione a meno che non si sia in *
      *                          * Append                              *
      *                          *-------------------------------------*
           if        w-cat-rig-new        =    spaces or
                     w-cat-rig-lst        =    spaces
                     move  zero           to   w-cnt-cor-nrp-vis      .
      *                          *-------------------------------------*
      *                          * Rimozione record dalla catena       *
      *                          *-------------------------------------*
           move      "RM"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
           go to     acc-cor-reg-982.
       acc-cor-reg-981.
      *                      *-----------------------------------------*
      *                      * Se record non New                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga     *
      *                          *-------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
       acc-cor-reg-982.
      *                          *-------------------------------------*
      *                          * Se si e' sulla prima pagina         *
      *                          *-------------------------------------*
           if        w-cnt-cor-nrg-dac    not  > w-lin-num-lin-vis
                     move  "-"            to   w-cnt-tus-acc-cor
                     go to acc-cor-reg-990.
      *                          *-------------------------------------*
      *                          * Se non si e' sulla prima pagina     *
      *                          *-------------------------------------*
           subtract  w-lin-num-lin-vis    from w-cnt-cor-nrg-dac      .
           subtract  1                    from w-cnt-cor-nrg-dac      .
           divide    w-lin-num-lin-vis    into w-cnt-cor-nrg-dac      .
           multiply  w-lin-num-lin-vis    by   w-cnt-cor-nrg-dac      .
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-985.
      *                  *---------------------------------------------*
      *                  * Se Slct da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se record New                           *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces
                     go to acc-cor-reg-986.
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga a   *
      *                          * spaces                              *
      *                          *-------------------------------------*
           move      "S"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                          *-------------------------------------*
      *                          * Numero pagina attualmente visualiz- *
      *                          * zata a zero per forzare la rivisua- *
      *                          * lizzazione a meno che non si sia in *
      *                          * Append                              *
      *                          *-------------------------------------*
           if        w-cat-rig-new        =    spaces or
                     w-cat-rig-lst        =    spaces
                     move  zero           to   w-cnt-cor-nrp-vis      .
      *                          *-------------------------------------*
      *                          * Rimozione record dalla catena       *
      *                          *-------------------------------------*
           move      "RM"                 to   w-cat-rig-ope          .
           move      w-cnt-cor-nrg-dac    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *                          *-------------------------------------*
      *                          * Se il numero riga di destinazione   *
      *                          * risulta oltre il numero d'ordine    *
      *                          * attuale si sottrae 1 al numero ri-  *
      *                          * ga di destinazione                  *
      *                          *-------------------------------------*
           if        w-cnt-slc-num-rig    >    w-cnt-cor-nrg-dac
                     subtract  1          from w-cnt-slc-num-rig      .
           go to     acc-cor-reg-987.
       acc-cor-reg-986.
      *                      *-----------------------------------------*
      *                      * Se record non New                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Visualizzazione del numero riga     *
      *                          *-------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
       acc-cor-reg-987.
      *                          *-------------------------------------*
      *                          * Ad accettazione nr riga selezionato *
      *                          *-------------------------------------*
           move      w-cnt-slc-num-rig    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-990.
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione corpo       *
      *              *-------------------------------------------------*
           if        w-cat-rig-max        =    zero
                     move  spaces         to   w-cnt-sts-imp-cor
           else      move  "#"            to   w-cnt-sts-imp-cor      .
       acc-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina corpo numero : w-cnt-cor-nrp-dav   *
      *    *-----------------------------------------------------------*
       vis-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate, escluse fincature        *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      10                   to   v-lin                  .
           move      17                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-cor-reg-150.
      *              *-------------------------------------------------*
      *              * Determinazione numero d'ordine del primo numero *
      *              * riga da visualizzare                            *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrp-dav    to   w-cnt-wrk-ctr-008      .
           multiply  w-lin-num-lin-vis    by   w-cnt-wrk-ctr-008      .
           add       1                    to   w-cnt-wrk-ctr-008      .
           subtract  w-lin-num-lin-vis    from w-cnt-wrk-ctr-008      .
      *              *-------------------------------------------------*
      *              * Determinazione numero d'ordine dell'ultimo nu-  *
      *              * mero riga da visualizzare                       *
      *              *-------------------------------------------------*
           move      w-cnt-wrk-ctr-008    to   w-cnt-wrk-ctr-009      .
           add       w-lin-num-lin-vis    to   w-cnt-wrk-ctr-009      .
           subtract  1                    from w-cnt-wrk-ctr-009      .
      *              *-------------------------------------------------*
      *              * Operazione di Start su catena movimenti         *
      *              *-------------------------------------------------*
           move      "ST"                 to   w-cat-rig-ope          .
           move      w-cnt-wrk-ctr-008    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *                  *---------------------------------------------*
      *                  * Se start errata : fine visualizzazione      *
      *                  *---------------------------------------------*
           if        w-cat-rig-exs        not  = spaces
                     go to  vis-cor-reg-999.
       vis-cor-reg-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale catena movimenti            *
      *              *-------------------------------------------------*
           move      "RN"                 to   w-cat-rig-ope          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *              *-------------------------------------------------*
      *              * Se fine lettura : fine visualizzazione          *
      *              *-------------------------------------------------*
           if        w-cat-rig-exs        not  = spaces
                     go to  vis-cor-reg-999.
      *              *-------------------------------------------------*
      *              * Movimento da buffer catena movimenti a work di  *
      *              * lavoro                                          *
      *              *-------------------------------------------------*
           move      w-cat-rig-buf        to   w-rig                  .
      *              *-------------------------------------------------*
      *              * Riga singolo movimento                          *
      *              *-------------------------------------------------*
           move      "R"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-wrk-ctr-008    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *              *-------------------------------------------------*
      *              * Incremento numero riga da visualizzare          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-wrk-ctr-008      .
      *              *-------------------------------------------------*
      *              * Test se oltre ultima riga da visualizzare       *
      *              *-------------------------------------------------*
           if        w-cnt-wrk-ctr-008    not  > w-cnt-wrk-ctr-009
                     go to vis-cor-reg-200.
       vis-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione linea corpo numero : w-cnt-cor-nrg-dav    *
      *    *-----------------------------------------------------------*
       vis-lin-cor-000.
      *              *-------------------------------------------------*
      *              * Abblencamento immagine linea di corpo           *
      *              *-------------------------------------------------*
           move      spaces               to   w-lin-imm              .
      *              *-------------------------------------------------*
      *              * Determinazione numero linea assoluta a video,   *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrg-dav    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001
                                        giving w-cnt-wrk-ctr-003
                                     remainder w-cnt-wrk-ctr-002      .
           multiply  w-lin-num-lin-prc    by   w-cnt-wrk-ctr-002      .
           add       w-lin-pri-lin-vid    to   w-cnt-wrk-ctr-002      .
      *              *-------------------------------------------------*
      *              * Test su tipo visualizzazione riga               *
      *              *-------------------------------------------------*
           if        w-cnt-cor-tvi-rig    =    "I"
                     go to vis-lin-cor-100
           else if   w-cnt-cor-tvi-rig    =    "S"
                     go to vis-lin-cor-200
           else if   w-cnt-cor-tvi-rig    =    "N"
                     go to vis-lin-cor-300
           else      go to vis-lin-cor-400.
       vis-lin-cor-100.
      *                  *---------------------------------------------*
      *                  * Se visualizzazione indicatore linea         *
      *                  *---------------------------------------------*
           move      "==>"                to   w-lin-imm-num-lin      .
           move      03                   to   v-car                  .
           go to     vis-lin-cor-900.
       vis-lin-cor-200.
      *                  *---------------------------------------------*
      *                  * Se visualizzazione numero linea a spaces    *
      *                  *---------------------------------------------*
           move      spaces               to   w-lin-imm-num-lin      .
           move      03                   to   v-car                  .
           go to     vis-lin-cor-900.
       vis-lin-cor-300.
      *                  *---------------------------------------------*
      *                  * Se visualizzazione numero d'ordine riga     *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      spaces               to   v-edm                  .
           move      w-cat-rig-cur        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-num-lin      .
           go to     vis-lin-cor-900.
       vis-lin-cor-400.
      *                  *---------------------------------------------*
      *                  * Se visualizzazione riga intera              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se riga in append : uscita              *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        not  = spaces and
                     w-cat-rig-lst        not  = spaces
                     go to  vis-lin-cor-999.
      *                      *-----------------------------------------*
      *                      * Editing Numero d'ordine riga            *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      spaces               to   v-edm                  .
           move      w-cat-rig-cur        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-num-lin      .
      *                      *-----------------------------------------*
      *                      * Se riga di tipo New : fine editing      *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        not  = spaces
                     go to vis-lin-cor-800.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del tipo di sele-  *
      *                      * zione effetti da stampare               *
      *                      *-----------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     go to vis-lin-cor-500
           else      go to vis-lin-cor-600.
       vis-lin-cor-500.
      *                      *-----------------------------------------*
      *                      * Se trattamento corpo con selezione ma-  *
      *                      * nuale degli effetti da stampare         *
      *                      *-----------------------------------------*
       vis-lin-cor-510.
      *                          *-------------------------------------*
      *                          * Normalizzazione work-area editing   *
      *                          *-------------------------------------*
           move      spaces               to   w-lin-w02              .
       vis-lin-cor-520.
      *                          *-------------------------------------*
      *                          * Si/No effetto da stampare           *
      *                          *-------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sce-sns-lun    to   v-car                  .
           move      w-exp-sce-sns-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sce-sns-tbl    to   v-txt                  .
           if        w-rig-sce-sns (1)    =    "S"
                     move  01             to   v-num
           else if   w-rig-tav-ott (1)    =    "N"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-w01-sce-sns      .
       vis-lin-cor-530.
      *                          *-------------------------------------*
      *                          * Segnale di effetto gia' stampato    *
      *                          *-------------------------------------*
           if        w-rig-flc-stp (1)    =    zero
                     move  spaces         to   w-lin-w01-flc-stp
           else      move  "*"            to   w-lin-w01-flc-stp      .
       vis-lin-cor-540.
      *                          *-------------------------------------*
      *                          * Tipo scadenza                       *
      *                          *-------------------------------------*
           if        w-rig-tip-sdb (1)    =    01
                     move  "RD  "         to   w-lin-w01-tip-sdb
           else if   w-rig-tip-sdb (1)    =    02
                     move  "IE  "         to   w-lin-w01-tip-sdb
           else if   w-rig-tip-sdb (1)    =    03
                     move  "RIBA"         to   w-lin-w01-tip-sdb
           else if   w-rig-tip-sdb (1)    =    04
                     move  "CDO "         to   w-lin-w01-tip-sdb
           else if   w-rig-tip-sdb (1)    =    05
                     move  "MAV "         to   w-lin-w01-tip-sdb
           else if   w-rig-tip-sdb (1)    =    06
                     move  "RID "         to   w-lin-w01-tip-sdb
           else if   w-rig-tip-sdb (1)    =    07
                     move  "BB  "         to   w-lin-w01-tip-sdb
           else if   w-rig-tip-sdb (1)    =    08
                     move  "CCP "         to   w-lin-w01-tip-sdb
           else if   w-rig-tip-sdb (1)    =    09
                     move  "RB  "         to   w-lin-w01-tip-sdb
           else if   w-rig-tip-sdb (1)    =    10
                     move  "TR  "         to   w-lin-w01-tip-sdb
           else if   w-rig-tip-sdb (1)    =    11
                     move  "PC  "         to   w-lin-w01-tip-sdb
           else      move  "????"         to   w-lin-w01-tip-sdb      .
       vis-lin-cor-550.
      *                          *-------------------------------------*
      *                          * Codice debitore, ragione sociale    *
      *                          *-------------------------------------*
           move      w-rig-dpz-dbt-rag (1)
                                          to   w-lin-w01-rag-dpz      .
       vis-lin-cor-560.
      *                          *-------------------------------------*
      *                          * Importo scadenza                    *
      *                          *-------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      w-rig-imp-sdb (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-w01-imp-sca      .
       vis-lin-cor-570.
      *                          *-------------------------------------*
      *                          * Data scadenza                       *
      *                          *-------------------------------------*
           if        w-rig-dts-sdb (1)    =    zero
                     go to vis-lin-cor-572
           else      go to vis-lin-cor-574.
       vis-lin-cor-572.
           move      " A vista"           to   w-lin-w01-dat-sca      .
           go to     vis-lin-cor-580.
       vis-lin-cor-574.
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      w-rig-dts-sdb (1)    to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-edt                to   w-lin-w01-dat-sca      .
           go to     vis-lin-cor-580.
       vis-lin-cor-580.
      *                          *-------------------------------------*
      *                          * Work-area editing in area definiti- *
      *                          * va editing                          *
      *                          *-------------------------------------*
           move      w-lin-w01            to   w-lin-imm-w01-w02      .
      *                          *-------------------------------------*
      *                          * A visualizzazione                   *
      *                          *-------------------------------------*
           go to     vis-lin-cor-800.
       vis-lin-cor-600.
      *                      *-----------------------------------------*
      *                      * Se trattamento corpo con selezione non  *
      *                      * manuale degli effetti da stampare       *
      *                      *-----------------------------------------*
       vis-lin-cor-610.
      *                          *-------------------------------------*
      *                          * Normalizzazione work-area editing   *
      *                          *-------------------------------------*
           move      spaces               to   w-lin-w02              .
       vis-lin-cor-620.
      *                          *-------------------------------------*
      *                          * Segnale di effetto gia' stampato    *
      *                          *-------------------------------------*
           if        w-rig-flc-stp (1)    =    zero
                     move  spaces         to   w-lin-w02-flc-stp
           else      move  "*"            to   w-lin-w02-flc-stp      .
       vis-lin-cor-630.
      *                          *-------------------------------------*
      *                          * Codice debitore, ragione sociale    *
      *                          *-------------------------------------*
           move      w-rig-dpz-dbt-rag (1)
                                          to   w-lin-w02-rag-dpz      .
       vis-lin-cor-640.
      *                          *-------------------------------------*
      *                          * Importo scadenza                    *
      *                          *-------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      w-rig-imp-sdb (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-w02-imp-sca      .
       vis-lin-cor-650.
      *                          *-------------------------------------*
      *                          * Data scadenza                       *
      *                          *-------------------------------------*
           if        w-rig-dts-sdb (1)    =    zero
                     go to vis-lin-cor-652
           else      go to vis-lin-cor-654.
       vis-lin-cor-652.
           move      " A vista"           to   w-lin-w02-dat-sca      .
           go to     vis-lin-cor-660.
       vis-lin-cor-654.
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      w-rig-dts-sdb (1)    to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-edt                to   w-lin-w02-dat-sca      .
           go to     vis-lin-cor-660.
       vis-lin-cor-660.
      *                          *-------------------------------------*
      *                          * Work-area editing in area definiti- *
      *                          * va editing                          *
      *                          *-------------------------------------*
           move      w-lin-w02            to   w-lin-imm-w01-w02      .
      *                          *-------------------------------------*
      *                          * A visualizzazione                   *
      *                          *-------------------------------------*
           go to     vis-lin-cor-800.
       vis-lin-cor-800.
      *                      *-----------------------------------------*
      *                      * Parametri per visualizzazione           *
      *                      *-----------------------------------------*
           move      80                   to   v-car                  .
       vis-lin-cor-900.
      *              *-------------------------------------------------*
      *              * Esecuzione visualizzazione prima linea          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-lin-imm-dsp-lin (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se una sola linea : uscita                      *
      *              *-------------------------------------------------*
           if        w-lin-num-lin-prc    =    1
                     go to vis-lin-cor-999.
      *              *-------------------------------------------------*
      *              * Esecuzione visualizzazione altre linee          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-wrk-ctr-003      .
       vis-lin-cor-925.
           add       1                    to   w-cnt-wrk-ctr-003      .
           if        w-cnt-wrk-ctr-003    >    w-lin-num-lin-prc
                     go to vis-lin-cor-999.
           add       1                    to   w-cnt-wrk-ctr-002      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-lin-imm-dsp-lin
                    (w-cnt-wrk-ctr-003)   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     vis-lin-cor-925.
       vis-lin-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts area linee di corpo               *
      *    *-----------------------------------------------------------*
       pmt-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo di selezione ef-  *
      *              * fetti da stampare                               *
      *              *-------------------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     go to pmt-cor-reg-200
           else      go to pmt-cor-reg-400.
       pmt-cor-reg-200.
      *              *-------------------------------------------------*
      *              * Se tipo trattamento righe  del corpo con sele-  *
      *              * zione manuale degli effetti da stampare         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Erase linee impegnate sia dall'area per la  *
      *                  * fincatura che dall'area delle righe effet-  *
      *                  * tive                                        *
      *                  *---------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Fincatura                                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "N.R  St  Tipo       Ragione sociale del debitore  
      -              "          Importo     Scadenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Sottolineatura fincatura                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "---  --  ----  -----------------------------------
      -              "-----  -------------  --------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Riga di chiusura linee corpo                *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "--------------------------------------------------
      -              "------------------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Note operative a fondo pagina               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * 1. linea di note operative              *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "             Tasto funzione [1] = Si' stampa      
      -              "      Return = Nessuna azione "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * 2. linea di note operative              *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Note :                                            
      -              "                              "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * 3. linea di note operative              *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "             Tasto funzione [2] = No stampa       
      -              "      Expand = Espansione riga"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pmt-cor-reg-999.
       pmt-cor-reg-400.
      *              *-------------------------------------------------*
      *              * Se tipo trattamento righe  del corpo con sele-  *
      *              * zione non manuale degli effetti da stampare     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Erase linee impegnate sia dall'area per la  *
      *                  * fincatura che dall'area delle righe effet-  *
      *                  * tive                                        *
      *                  *---------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      18                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Fincatura                                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "N.R            Ragione sociale del debitore       
      -              "        Importo       Scadenza"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Sottolineatura fincatura                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "---  ---------------------------------------------
      -              "---  --------------   --------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Riga di chiusura                            *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "--------------------------------------------------
      -              "------------------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pmt-cor-reg-999.
       pmt-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione riga corpo di accettazione in w-rig       *
      *    *-----------------------------------------------------------*
       vis-rig-cor-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo di selezione ef-  *
      *              * fetti da stampare                               *
      *              *-------------------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     go to vis-rig-cor-200
           else      go to vis-rig-cor-400.
       vis-rig-cor-200.
      *              *-------------------------------------------------*
      *              * Se tipo trattamento righe  del corpo con sele-  *
      *              * zione manuale degli effetti da stampare         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     vis-rig-cor-999.
       vis-rig-cor-400.
      *              *-------------------------------------------------*
      *              * Se tipo trattamento righe  del corpo con sele-  *
      *              * zione non manuale degli effetti da stampare     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se riga di tipo New : nessuna visualizza-   *
      *                  * zione                                       *
      *                  *---------------------------------------------*
           if        w-cat-rig-new        not  = spaces
                     go to vis-rig-cor-999.
      *                  *---------------------------------------------*
      *                  * Numero scadenza                             *
      *                  *---------------------------------------------*
           perform   vis-num-sdb-000      thru vis-num-sdb-999        .
      *                  *---------------------------------------------*
      *                  * Tipo scadenza                               *
      *                  *---------------------------------------------*
           perform   vis-tip-sdb-000      thru vis-tip-sdb-999        .
      *                  *---------------------------------------------*
      *                  * Data scadenza                               *
      *                  *---------------------------------------------*
           perform   vis-dts-sdb-000      thru vis-dts-sdb-999        .
      *                  *---------------------------------------------*
      *                  * Importo scadenza                            *
      *                  *---------------------------------------------*
           perform   vis-imp-sdb-000      thru vis-imp-sdb-999        .
      *                  *---------------------------------------------*
      *                  * Codice debitore con Codice dipendenza       *
      *                  *---------------------------------------------*
           perform   vis-ccd-dbt-000      thru vis-ccd-dbt-999        .
      *                  *---------------------------------------------*
      *                  * Codice debitore, ragione sociale            *
      *                  *---------------------------------------------*
           perform   vis-cod-dbt-rag-000  thru vis-cod-dbt-rag-999    .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     vis-rig-cor-999.
       vis-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per riga corpo di accettazione    *
      *    *-----------------------------------------------------------*
       pmt-rig-cor-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo di selezione ef-  *
      *              * fetti da stampare                               *
      *              *-------------------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     go to pmt-rig-cor-200
           else      go to pmt-rig-cor-400.
       pmt-rig-cor-200.
      *              *-------------------------------------------------*
      *              * Se tipo trattamento righe  del corpo con sele-  *
      *              * zione manuale degli effetti da stampare         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pmt-rig-cor-999.
       pmt-rig-cor-400.
      *              *-------------------------------------------------*
      *              * Se tipo trattamento righe  del corpo con sele-  *
      *              * zione non manuale degli effetti da stampare     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Erase linee impegnate dall'area di imposta- *
      *                  * zione della singola riga corpo espansa a    *
      *                  * piede                                       *
      *                  *---------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      19                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione prompts per riga corpo e-   *
      *                  * spansa                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Numero scadenza                         *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      17                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero scadenza :"  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Data scadenza                           *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      17                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data scadenza   :"  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Importo scadenza                        *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      46                   to   v-pos                  .
           move      "Importo :"          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Codice cliente                          *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      17                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice cliente  :"  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pmt-rig-cor-999.
       pmt-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Accettazione Si/no selezione effetto                      *
      *    *-----------------------------------------------------------*
       acc-sce-sns-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-sce-sns-025.
      *                  *---------------------------------------------*
      *                  * Determinazione numero linea a video per     *
      *                  * trattamento del corpo direttamente nelle    *
      *                  * righe di scroll                             *
      *                  *---------------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-num-lin-scr-rig      .
           perform   num-lin-scr-000      thru num-lin-scr-999        .
       acc-sce-sns-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Parametri generici                          *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      w-num-lin-scr-lin    to   v-lin                  .
           move      06                   to   v-pos                  .
       acc-sce-sns-150.
      *                  *---------------------------------------------*
      *                  * Tasti funzione                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Up   : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "UP  "               to   v-pfk (01)             .
      *                      *-----------------------------------------*
      *                      * Down : sempre ammesso a meno che non ci *
      *                      *        siano zero righe                 *
      *                      *-----------------------------------------*
           if        w-cnt-sts-imp-cor    not  = spaces
                     move  "DOWN"         to   v-pfk (02)             .
      *                      *-----------------------------------------*
      *                      * Find : mai ammesso, in quanto il campo  *
      *                      * non ammette il Find                     *
      *                      *-----------------------------------------*
           move      spaces               to   v-pfk (03)             .
      *                      *-----------------------------------------*
      *                      * Insr : mai ammesso                      *
      *                      *                                         *
      *                      * N.B. : Questa e' una modifica rispetto  *
      *                      *        al comportamento standard delle  *
      *                      *        righe corpo, per impedire l'in-  *
      *                      *        serimento di righe nuove. Oltre  *
      *                      *        a questo c'e' l'inibizione del   *
      *                      *        tasto Remv, e l'inibizione del-  *
      *                      *        la funzione di Append nella ro-  *
      *                      *        utine 'acc-cor-reg-000/999', ed  *
      *                      *        inoltre la modifica alla funzio- *
      *                      *        ne Up in conferma impostazioni.  *
      *                      *-----------------------------------------*
           move      spaces               to   v-pfk (04)             .
      *                      *-----------------------------------------*
      *                      * Do   : sempre ammesso, purche' sia con- *
      *                      *        cesso dallo status delle impo-   *
      *                      *        stazioni; eventualmente disat-   *
      *                      *        tivato dal richiamo della sub-   *
      *                      *        routine di accettazione          *
      *                      *-----------------------------------------*
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
      *                      *-----------------------------------------*
      *                      * Remv : mai ammesso                      *
      *                      *                                         *
      *                      * N.B. : Questa e' una modifica rispetto  *
      *                      *        al comportamento standard delle  *
      *                      *        righe corpo, per impedire l'in-  *
      *                      *        serimento di righe nuove. Oltre  *
      *                      *        a questo c'e' l'inibizione del   *
      *                      *        tasto Insr, e l'inibizione del-  *
      *                      *        la funzione di Append nella ro-  *
      *                      *        utine 'acc-cor-reg-000/999', ed  *
      *                      *        inoltre la modifica alla funzio- *
      *                      *        ne Up in conferma impostazioni.  *
      *                      *-----------------------------------------*
           move      spaces               to   v-pfk (06)             .
      *                      *-----------------------------------------*
      *                      * Prsc : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "PRSC"               to   v-pfk (07)             .
      *                      *-----------------------------------------*
      *                      * Nxsc : sempre ammesso a meno che non ci *
      *                      *        siano zero righe                 *
      *                      *-----------------------------------------*
           if        w-cnt-sts-imp-cor    not  = spaces
                     move  "NXSC"         to   v-pfk (08)             .
      *                      *-----------------------------------------*
      *                      * Back : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sulla prima riga     *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  = 1
                     move  "BACK"         to   v-pfk (09)             .
      *                      *-----------------------------------------*
      *                      * Tab  : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sull'ultima riga e   *
      *                      *        che questa sia in Append         *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces or
                     w-cat-rig-lst        =    spaces
                     move  "TAB "         to   v-pfk (10)             .
      *                      *-----------------------------------------*
      *                      * Slct : mai ammesso, in quanto il campo  *
      *                      *        non puo' accettare valori        *
      *                      *-----------------------------------------*
           move      spaces               to   v-pfk (11)             .
      *                      *-----------------------------------------*
      *                      * Expd : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "EXPD"               to   v-pfk (12)             .
      *                      *-----------------------------------------*
      *                      * Pf1  : sempre ammesso, a meno che non   *
      *                      *        si sia in sola Visualizzazione   *
      *                      *-----------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     move  spaces         to   v-pfk (15)
           else      move  "[1] "         to   v-pfk (15)             .
      *                      *-----------------------------------------*
      *                      * Pf2  : sempre ammesso, a meno che non   *
      *                      *        si sia in sola Visualizzazione   *
      *                      *-----------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     move  spaces         to   v-pfk (16)
           else      move  "[2] "         to   v-pfk (16)             .
       acc-sce-sns-200.
      *                      *-----------------------------------------*
      *                      * Richiamo subroutine di accettazione     *
      *                      *-----------------------------------------*
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-sce-sns-225.
      *              *-------------------------------------------------*
      *              * Se Expd                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "EXPD"
                     go to acc-sce-sns-250.
      *                  *---------------------------------------------*
      *                  * Espansione su scadenze debitori             *
      *                  *---------------------------------------------*
           move      "N"                  to   w-esp-arc-sdb-sns      .
           move      w-rig-num-sdb (1)    to   w-esp-arc-sdb-num      .
           perform   esp-arc-sdb-000      thru esp-arc-sdb-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-sce-sns-100.
       acc-sce-sns-250.
      *              *-------------------------------------------------*
      *              * Se Return  o Pf1 o Pf2                          *
      *              *-------------------------------------------------*
           if        v-key                =    spaces or
                     v-key                =    "[1] " or
                     v-key                =    "[2] "
                     go to acc-sce-sns-400.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-sce-sns-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-rig
                     go to acc-sce-sns-999.
      *              *-------------------------------------------------*
      *              * Se premuto un altro tasto funzione non deve es- *
      *              * sere avvenuta variazione del campo d'impostaz.  *
      *              *                                                 *
      *              * N.B. : Questa istruzione e' inutile rispetto    *
      *              *        allo standard, in quanto non puo' mai    *
      *              *        esserci variazione del valore del cam-   *
      *              *        po.                                      *
      *              *-------------------------------------------------*
           if        v-mod                not  = spaces
                     go to acc-sce-sns-100.
      *              *-------------------------------------------------*
      *              * Se Up                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "UP  "
                     move  "U"            to   w-cnt-tus-acc-rig
                     go to acc-sce-sns-999.
      *              *-------------------------------------------------*
      *              * Se Down                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DOWN"
                     move  "D"            to   w-cnt-tus-acc-rig
                     go to acc-sce-sns-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-sce-sns-999
                     else    go to acc-sce-sns-100.
      *              *-------------------------------------------------*
      *              * Se Insr                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "INSR"
                     move  "I"            to   w-cnt-tus-acc-rig
                     go to acc-sce-sns-999.
      *              *-------------------------------------------------*
      *              * Se Remv                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "REMV"
                     move  "R"            to   w-cnt-tus-acc-rig
                     go to acc-sce-sns-999.
      *              *-------------------------------------------------*
      *              * Se Tab                                          *
      *              *-------------------------------------------------*
           if        v-key                =    "TAB "
                     move  "T"            to   w-cnt-tus-acc-rig
                     go to acc-sce-sns-999.
      *              *-------------------------------------------------*
      *              * Se Back                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "BACK"
                     move  "B"            to   w-cnt-tus-acc-rig
                     go to acc-sce-sns-999.
      *              *-------------------------------------------------*
      *              * Se Nxsc                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "NXSC"
                     move  "N"            to   w-cnt-tus-acc-rig
                     go to acc-sce-sns-999.
      *              *-------------------------------------------------*
      *              * Se Prsc                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "PRSC"
                     move  "P"            to   w-cnt-tus-acc-rig
                     go to acc-sce-sns-999.
       acc-sce-sns-400.
      *              *-------------------------------------------------*
      *              * Se Return  o Pf1 o Pf2                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione della function-key   *
      *                  * impostata                                   *
      *                  *---------------------------------------------*
           if        v-key                =    spaces
                     go to acc-sce-sns-425
           else if   v-key                =    "[1] "
                     go to acc-sce-sns-450
           else if   v-key                =    "[2] "
                     go to acc-sce-sns-475
           else      go to acc-sce-sns-100.
       acc-sce-sns-425.
      *                  *---------------------------------------------*
      *                  * Se impostata function-key Return            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione function-key            *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     acc-sce-sns-600.
       acc-sce-sns-450.
      *                  *---------------------------------------------*
      *                  * Se impostata function-key Pf1               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Si/No stampa : Si                       *
      *                      *-----------------------------------------*
           move      "S"                  to   w-rig-sce-sns (1)      .
      *                      *-----------------------------------------*
      *                      * Normalizzazione function-key            *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     acc-sce-sns-600.
       acc-sce-sns-475.
      *                  *---------------------------------------------*
      *                  * Se impostata function-key Pf2               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Si/No stampa : No                       *
      *                      *-----------------------------------------*
           move      "N"                  to   w-rig-sce-sns (1)      .
      *                      *-----------------------------------------*
      *                      * Normalizzazione function-key            *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     acc-sce-sns-600.
       acc-sce-sns-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-sce-sns-800.
       acc-sce-sns-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione Si/no selezione effetto                   *
      *    *-----------------------------------------------------------*
       vis-sce-sns-000.
      *              *-------------------------------------------------*
      *              * Determinazione numero linea a video per tratta- *
      *              * mento del corpo direttamente nelle righe di     *
      *              * scroll                                          *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-num-lin-scr-rig      .
           perform   num-lin-scr-000      thru num-lin-scr-999        .
      *              *-------------------------------------------------*
      *              * Editing                                         *
      *              *-------------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sce-sns-lun    to   v-car                  .
           move      w-exp-sce-sns-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sce-sns-tbl    to   v-txt                  .
           if        w-rig-sce-sns (1)    =    "S"
                     move  01             to   v-num
           else if   w-rig-sce-sns (1)    =    "N"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-exp-sce-sns-lun    to   v-car                  .
           move      w-num-lin-scr-lin    to   v-lin                  .
           move      06                   to   v-pos                  .
           move      v-edt                to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sce-sns-999.
           exit.

      *    *===========================================================*
      *    * Determinazione numero linea a video per trattamento del   *
      *    * corpo direttamente nelle righe di scroll                  *
      *    *-----------------------------------------------------------*
       num-lin-scr-000.
           move      w-num-lin-scr-rig    to   w-num-lin-scr-w01      .
           subtract  1                    from w-num-lin-scr-w01      .
           divide    w-lin-num-lin-vis    into w-num-lin-scr-w01
                                        giving w-num-lin-scr-w02
                                     remainder w-num-lin-scr-lin      .
           multiply  w-lin-num-lin-prc    by   w-num-lin-scr-lin      .
           add       w-lin-pri-lin-vid    to   w-num-lin-scr-lin      .
       num-lin-scr-999.
           exit.

      *    *===========================================================*
      *    * Accettazione Numero scadenza                              *
      *    *-----------------------------------------------------------*
       acc-num-sdb-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-rig-num-sdb (1)    to   w-sav-num-sdb          .
       acc-num-sdb-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ripristino valore precedente                *
      *                  *---------------------------------------------*
           move      w-sav-num-sdb        to   w-rig-num-sdb (1)      .
      *                  *---------------------------------------------*
      *                  * Parametri generici                          *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      "<"                  to   v-edm                  .
           move      19                   to   v-lin                  .
           move      19                   to   v-pos                  .
      *                  *---------------------------------------------*
      *                  * Tasti funzione                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Up   : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "UP  "               to   v-pfk (01)             .
      *                      *-----------------------------------------*
      *                      * Down : sempre ammesso a meno che non ci *
      *                      *        siano zero righe                 *
      *                      *-----------------------------------------*
           if        w-cnt-sts-imp-cor    not  = spaces
                     move  "DOWN"         to   v-pfk (02)             .
      *                      *-----------------------------------------*
      *                      * Find : mai ammesso                      *
      *                      *-----------------------------------------*
           move      spaces               to   v-pfk (03)             .
      *                      *-----------------------------------------*
      *                      * Insr : mai ammesso                      *
      *                      *                                         *
      *                      * N.B. : Questa e' una modifica rispetto  *
      *                      *        al comportamento standard delle  *
      *                      *        righe corpo, per impedire l'in-  *
      *                      *        serimento di righe nuove. Oltre  *
      *                      *        a questo c'e' l'inibizione del   *
      *                      *        tasto Remv, e l'inibizione del-  *
      *                      *        la funzione di Append nella ro-  *
      *                      *        utine 'acc-cor-reg-000/999', ed  *
      *                      *        inoltre la modifica alla funzio- *
      *                      *        ne Up in conferma impostazioni.  *
      *                      *-----------------------------------------*
           move      spaces               to   v-pfk (04)             .
      *                      *-----------------------------------------*
      *                      * Do   : sempre ammesso, purche' sia con- *
      *                      *        cesso dallo status delle impo-   *
      *                      *        stazioni; eventualmente disat-   *
      *                      *        tivato dal richiamo della sub-   *
      *                      *        routine di accettazione          *
      *                      *-----------------------------------------*
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
      *                      *-----------------------------------------*
      *                      * Remv : mai ammesso                      *
      *                      *                                         *
      *                      * N.B. : Questa e' una modifica rispetto  *
      *                      *        al comportamento standard delle  *
      *                      *        righe corpo, per impedire l'in-  *
      *                      *        serimento di righe nuove. Oltre  *
      *                      *        a questo c'e' l'inibizione del   *
      *                      *        tasto Insr, e l'inibizione del-  *
      *                      *        la funzione di Append nella ro-  *
      *                      *        utine 'acc-cor-reg-000/999', ed  *
      *                      *        inoltre la modifica alla funzio- *
      *                      *        ne Up in conferma impostazioni.  *
      *                      *-----------------------------------------*
           move      spaces               to   v-pfk (06)             .
      *                      *-----------------------------------------*
      *                      * Prsc : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "PRSC"               to   v-pfk (07)             .
      *                      *-----------------------------------------*
      *                      * Nxsc : sempre ammesso a meno che non ci *
      *                      *        siano zero righe                 *
      *                      *-----------------------------------------*
           if        w-cnt-sts-imp-cor    not  = spaces
                     move  "NXSC"         to   v-pfk (08)             .
      *                      *-----------------------------------------*
      *                      * Back : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sulla prima riga     *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  = 1
                     move  "BACK"         to   v-pfk (09)             .
      *                      *-----------------------------------------*
      *                      * Tab  : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sull'ultima riga e   *
      *                      *        che questa sia in Append         *
      *                      *-----------------------------------------*
           if        w-cat-rig-new        =    spaces or
                     w-cat-rig-lst        =    spaces
                     move  "TAB "         to   v-pfk (10)             .
      *                      *-----------------------------------------*
      *                      * Slct : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sull'unica riga      *
      *                      *-----------------------------------------*
           if        w-cat-rig-max        not  = 1
                     move  "SLCT"         to   v-pfk (11)             .
      *                      *-----------------------------------------*
      *                      * Expd : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "EXPD"               to   v-pfk (12)             .
      *                      *-----------------------------------------*
      *                      * Valore di accettazione                  *
      *                      *-----------------------------------------*
           move      w-rig-num-sdb (1)    to   v-num                  .
      *                      *-----------------------------------------*
      *                      * Richiamo subroutine di accettazione     *
      *                      *-----------------------------------------*
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-num-sdb-200.
      *              *-------------------------------------------------*
      *              * Se Return                                       *
      *              *-------------------------------------------------*
           if        v-key                =    spaces
                     go to acc-num-sdb-400.
       acc-num-sdb-225.
      *              *-------------------------------------------------*
      *              * Se Expd                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "EXPD"
                     go to acc-num-sdb-250.
      *                  *---------------------------------------------*
      *                  * Espansione su scadenze debitori             *
      *                  *---------------------------------------------*
           move      "N"                  to   w-esp-arc-sdb-sns      .
           move      w-rig-num-sdb (1)    to   w-esp-arc-sdb-num      .
           perform   esp-arc-sdb-000      thru esp-arc-sdb-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-num-sdb-100.
       acc-num-sdb-250.
      *              *-------------------------------------------------*
      *              * Se Slct                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "SLCT"
                     go to acc-num-sdb-300
           else      go to acc-num-sdb-350.
       acc-num-sdb-300.
      *                  *---------------------------------------------*
      *                  * Conversione numero riga impostato in forma- *
      *                  * to numerico                                 *
      *                  *---------------------------------------------*
           move      v-num                to   w-cnt-slc-rap-num      .
       acc-num-sdb-320.
      *                  *---------------------------------------------*
      *                  * Se numero riga impostato minore di 1 o mag- *
      *                  * maggiore del massimo : reimpostazione       *
      *                  *---------------------------------------------*
           if        w-cnt-slc-rap-num    =    zero       or
                     w-cnt-slc-rap-num    >    w-cat-rig-max
                     go to acc-num-sdb-100.
      *                  *---------------------------------------------*
      *                  * Se numero riga impostato pari a numero riga *
      *                  * attuale : reimpostazione                    *
      *                  *---------------------------------------------*
           if        w-cnt-slc-rap-num    =    w-cnt-cor-nrg-dac
                     go to acc-num-sdb-100.
      *                  *---------------------------------------------*
      *                  * Preparazione parametri e uscita             *
      *                  *---------------------------------------------*
           move      w-cnt-slc-rap-num    to   w-cnt-slc-num-rig      .
           move      "."                  to   w-cnt-tus-acc-rig      .
           go to     acc-num-sdb-999.
       acc-num-sdb-350.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-num-sdb-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-rig
                     go to acc-num-sdb-999.
      *              *-------------------------------------------------*
      *              * Se premuto un altro tasto funzione non deve es- *
      *              * sere avvenuta variazione del campo d'impostaz.  *
      *              *-------------------------------------------------*
           if        v-mod                not  = spaces
                     go to acc-num-sdb-100.
      *              *-------------------------------------------------*
      *              * Se Up                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "UP  "
                     move  "U"            to   w-cnt-tus-acc-rig
                     go to acc-num-sdb-999.
      *              *-------------------------------------------------*
      *              * Se Down                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DOWN"
                     move  "D"            to   w-cnt-tus-acc-rig
                     go to acc-num-sdb-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-num-sdb-999
                     else    go to acc-num-sdb-100.
      *              *-------------------------------------------------*
      *              * Se Insr                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "INSR"
                     move  "I"            to   w-cnt-tus-acc-rig
                     go to acc-num-sdb-999.
      *              *-------------------------------------------------*
      *              * Se Remv                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "REMV"
                     move  "R"            to   w-cnt-tus-acc-rig
                     go to acc-num-sdb-999.
      *              *-------------------------------------------------*
      *              * Se Tab                                          *
      *              *-------------------------------------------------*
           if        v-key                =    "TAB "
                     move  "T"            to   w-cnt-tus-acc-rig
                     go to acc-num-sdb-999.
      *              *-------------------------------------------------*
      *              * Se Back                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "BACK"
                     move  "B"            to   w-cnt-tus-acc-rig
                     go to acc-num-sdb-999.
      *              *-------------------------------------------------*
      *              * Se Nxsc                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "NXSC"
                     move  "N"            to   w-cnt-tus-acc-rig
                     go to acc-num-sdb-999.
      *              *-------------------------------------------------*
      *              * Se Prsc                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "PRSC"
                     move  "P"            to   w-cnt-tus-acc-rig
                     go to acc-num-sdb-999.
       acc-num-sdb-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-num-sdb-425.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se il valore e' stato  *
      *                  * variato oppure no                           *
      *                  *---------------------------------------------*
           if        v-num                =    w-sav-num-sdb
                     go to acc-num-sdb-450
           else      go to acc-num-sdb-475.
       acc-num-sdb-450.
      *                  *---------------------------------------------*
      *                  * Se il valore non e' stato variato           *
      *                  *---------------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione function-key        *
      *                          *-------------------------------------*
           move      spaces               to   v-key                  .
      *                          *-------------------------------------*
      *                          * Ad uscita                           *
      *                          *-------------------------------------*
           go to     acc-num-sdb-600.
       acc-num-sdb-475.
      *                  *---------------------------------------------*
      *                  * Se il valore e' stato variato               *
      *                  *---------------------------------------------*
      *                          *-------------------------------------*
      *                          * A ripristino e reimpostazione       *
      *                          *-------------------------------------*
           go to     acc-num-sdb-100.
       acc-num-sdb-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-num-sdb-800.
       acc-num-sdb-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione Numero scadenza                           *
      *    *-----------------------------------------------------------*
       vis-num-sdb-000.
           move      "DS"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      "<"                  to   v-edm                  .
           move      19                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      w-rig-num-sdb (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-num-sdb-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione Tipo scadenza                             *
      *    *-----------------------------------------------------------*
       vis-tip-sdb-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-sdb-lun    to   v-car                  .
           move      w-exp-tip-sdb-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-tip-sdb-tbl    to   v-txt                  .
           move      19                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-rig-tip-sdb (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-sdb-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione Data scadenza                             *
      *    *-----------------------------------------------------------*
       vis-dts-sdb-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del valore della data di *
      *              * scadenza                                        *
      *              *-------------------------------------------------*
           if        w-rig-dts-sdb (1)    =    zero
                     go to vis-dts-sdb-200
           else      go to vis-dts-sdb-400.
       vis-dts-sdb-200.
      *              *-------------------------------------------------*
      *              * Se data di scadenza a zero                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione literal 'A vista'           *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      " A vista"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     vis-dts-sdb-999.
       vis-dts-sdb-400.
      *              *-------------------------------------------------*
      *              * Se data di scadenza diversa da zero             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione data scadenza               *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      20                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      w-rig-dts-sdb (1)    to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     vis-dts-sdb-999.
       vis-dts-sdb-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione Importo scadenza                          *
      *    *-----------------------------------------------------------*
       vis-imp-sdb-000.
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      20                   to   v-lin                  .
           move      55                   to   v-pos                  .
           move      w-rig-imp-sdb (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-imp-sdb-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione Codice debitore con Codice dipendenza     *
      *    *-----------------------------------------------------------*
       vis-ccd-dbt-000.
      *              *-------------------------------------------------*
      *              * Editing del codice debitore                     *
      *              *-------------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-rig-cod-dbt (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del valore del codice del- *
      *              * la dipendenza                                   *
      *              *-------------------------------------------------*
           if        w-rig-dpz-dbt (1)    =    spaces
                     go to vis-ccd-dbt-200
           else      go to vis-ccd-dbt-400.
       vis-ccd-dbt-200.
      *              *-------------------------------------------------*
      *              * Se codice dipendenza a spaces                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      12                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      v-edt                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     vis-ccd-dbt-999.
       vis-ccd-dbt-400.
      *              *-------------------------------------------------*
      *              * Se codice dipendenza diverso da spaces          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione valore editato composto        *
      *                  *---------------------------------------------*
           move      spaces               to   v-alf                  .
           string    v-edt      delimited by   spaces
                     "-"        delimited by   size
                     w-rig-dpz-dbt (1)
                                delimited by   spaces
                                          into v-alf                  .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      12                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      19                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     vis-ccd-dbt-999.
       vis-ccd-dbt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione Codice debitore, ragione sociale          *
      *    *-----------------------------------------------------------*
       vis-cod-dbt-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      28                   to   v-pos                  .
           move      w-rig-cod-dbt-rag (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-dbt-rag-999.
           exit.

      *    *===========================================================*
      *    * Accettazione presa visione per riga corpo espansa         *
      *    *-----------------------------------------------------------*
       acc-pvi-cor-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione prompt locale per l'accet-  *
      *                  * tazione                                     *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      78                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-pvi-cor-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *                                                 *
      *              * N.B. : Il tasto Remv e' stato qui inibito, in   *
      *              *        quanto il programma non ammette ne' in-  *
      *              *        serimenti di nuove righe, ne' cancella-  *
      *              *        zione di righe pre-esistenti             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      21                   to   v-lin                  .
           move      79                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      spaces               to   v-pfk (06)             .
           move      "EXPD"               to   v-pfk (12)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-pvi-cor-999.
      *              *-------------------------------------------------*
      *              * Se Remv                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "REMV"
                     move  "R"            to   w-cnt-tus-acc-rig
                     go to acc-pvi-cor-999.
       acc-pvi-cor-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-pvi-cor-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-pvi-cor-625.
      *                  *---------------------------------------------*
      *                  * Se Expd                                     *
      *                  *---------------------------------------------*
           if        v-key                not  = "EXPD"
                     go to acc-pvi-cor-800.
      *                  *---------------------------------------------*
      *                  * Espansione su scadenze debitori             *
      *                  *---------------------------------------------*
           move      "N"                  to   w-esp-arc-sdb-sns      .
           move      w-rig-num-sdb (1)    to   w-esp-arc-sdb-num      .
           perform   esp-arc-sdb-000      thru esp-arc-sdb-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-pvi-cor-100.
       acc-pvi-cor-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-pvi-cor-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-pvi-cor-100.
       acc-pvi-cor-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su tre righe          *
      *    *-----------------------------------------------------------*
       box-msg-e03-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      10                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 03                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m03    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e03-999.
           exit.

      *    *===========================================================*
      *    * Messaggio centrale circondato da un box                   *
      *    *-----------------------------------------------------------*
       msg-cnt-box-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del valore del messaggio   *
      *              *-------------------------------------------------*
           if        w-err-box-err-msg    =    spaces
                     go to msg-cnt-box-600.
       msg-cnt-box-200.
      *              *-------------------------------------------------*
      *              * Se valore del messaggio diverso da spaces       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio immagine video                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Messaggio nel box                           *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      08                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     msg-cnt-box-999.
       msg-cnt-box-600.
      *              *-------------------------------------------------*
      *              * Se valore del messaggio a spaces                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ripristino immagine video                   *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     msg-cnt-box-999.
       msg-cnt-box-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi chiave           *
      *    *-----------------------------------------------------------*
       cnt-tdo-key-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-key-flg      .
       cnt-tdo-key-999.
           exit.
           
      *    *===========================================================*
      *    * Controllo se chiave vuota                                 *
      *    *-----------------------------------------------------------*
       cnt-key-vuo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-key-vuo-flg      .
       cnt-key-vuo-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi non chiave       *
      *    *-----------------------------------------------------------*
       cnt-tdo-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-nok-flg      .
       cnt-tdo-nok-100.
      *              *-------------------------------------------------*
      *              * Controlli                                       *
      *              *-------------------------------------------------*
       cnt-tdo-nok-120.
      *                  *---------------------------------------------*
      *                  * Tipo selezione effetti da stampare          *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    not  = zero
                     go to cnt-tdo-nok-125.
           move      "Manca il tipo di selezione su scadenze da stampare
      -              "               "    to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-125.
           if        w-tes-sce-tse (1)    =    01 or
                     w-tes-sce-tse (1)    =    02 or
                     w-tes-sce-tse (1)    =    03
                     go to cnt-tdo-nok-140.
           move      "Tipo di selezione su scadenze da stampare errato  
      -              "               "    to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-140.
      *                  *---------------------------------------------*
      *                  * Si/No stampa ricevute bancarie              *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     go to cnt-tdo-nok-160.
           if        w-tes-sce-nrb (1)    =    zero
                     go to cnt-tdo-nok-160.
           if        w-tes-sce-srb (1)    not  = spaces
                     go to cnt-tdo-nok-145.
           move      "Manca la scelta se stampare le ricevute bancarie  
      -              "               "    to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-145.
           if        w-tes-sce-srb (1)    =    "S" or
                     w-tes-sce-srb (1)    =    "N"
                     go to cnt-tdo-nok-160.
           move      "Scelta di stampa per le ricevute bancarie errata  
      -              "               "    to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-160.
      *                  *---------------------------------------------*
      *                  * Si/No stampa tratte                         *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     go to cnt-tdo-nok-180.
           if        w-tes-sce-ntr (1)    =    zero
                     go to cnt-tdo-nok-180.
           if        w-tes-sce-str (1)    not  = spaces
                     go to cnt-tdo-nok-165.
           move      "Manca la scelta se stampare le tratte             
      -              "               "    to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-165.
           if        w-tes-sce-str (1)    =    "S" or
                     w-tes-sce-str (1)    =    "N"
                     go to cnt-tdo-nok-180.
           move      "Scelta di stampa per le tratte errata             
      -              "               "    to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-180.
      *                  *---------------------------------------------*
      *                  * Stampa ricevute bancarie e tratte combinate *
      *                  * insieme                                     *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     go to cnt-tdo-nok-200.
           if        w-tes-sce-srb (1)    =    "S" or
                     w-tes-sce-str (1)    =    "S"
                     go to cnt-tdo-nok-200.
           move      "Non e' stato scelto alcun tipo di effetto da stamp
      -              "are            "    to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-200.
      *                  *---------------------------------------------*
      *                  * Si/No stampa nostra intestazione            *
      *                  *---------------------------------------------*
           if        w-tes-sce-sni (1)    not  = spaces
                     go to cnt-tdo-nok-205.
           move      "Manca la scelta se stampare la nostra intestazione
      -              "               "    to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-205.
           if        w-tes-sce-sni (1)    =    "S" or
                     w-tes-sce-sni (1)    =    "N"
                     go to cnt-tdo-nok-220.
           move      "Scelta di stampa per la nostra intestazione errata
      -              "               "    to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-220.
      *                  *---------------------------------------------*
      *                  * Si/No stampa banca di presentazione         *
      *                  *---------------------------------------------*
           if        w-tes-sce-sbp (1)    not  = spaces
                     go to cnt-tdo-nok-225.
           move      "Manca la scelta se stampare la banca di presentazi
      -              "one            "    to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-225.
           if        w-tes-sce-sbp (1)    =    "S" or
                     w-tes-sce-sbp (1)    =    "N"
                     go to cnt-tdo-nok-240.
           move      "Scelta di stampa per la banca di presentazione err
      -              "ata            "    to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-240.
      *                  *---------------------------------------------*
      *                  * Fine controlli : a normalizzazioni          *
      *                  *---------------------------------------------*
           go to     cnt-tdo-nok-600.
       cnt-tdo-nok-600.
      *              *-------------------------------------------------*
      *              * Normalizzazioni                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Si/No stampa ricevute bancarie              *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     move  spaces         to   w-tes-sce-srb (1)      .
      *                  *---------------------------------------------*
      *                  * Si/No stampa tratte                         *
      *                  *---------------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     move  spaces         to   w-tes-sce-str (1)      .
       cnt-tdo-nok-700.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     cnt-tdo-nok-999.
       cnt-tdo-nok-900.
      *              *-------------------------------------------------*
      *              * Se controllo non superato                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Emissione messaggio di errore               *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di errore in uscita                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-nok-flg      .
       cnt-tdo-nok-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do riga corpo             *
      *    *-----------------------------------------------------------*
       cnt-tdo-rig-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-rig-flg      .
       cnt-tdo-rig-999.
           exit.

      *    *===========================================================*
      *    * Preparazioni pre-accettazione riga corpo                  *
      *    *-----------------------------------------------------------*
       pre-rig-cor-000.
       pre-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Attribuzione del numero progressivo per la riga New       *
      *    *-----------------------------------------------------------*
       prg-rig-cor-000.
      *              *-------------------------------------------------*
      *              * Prelevamento da area di controllo catena        *
      *              *-------------------------------------------------*
           move      w-cat-rig-prg        to   w-rig-num-prg (1)      .
       prg-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Azioni post-accettazione riga corpo                       *
      *    *-----------------------------------------------------------*
       pos-rig-cor-000.
       pos-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati chiave e non chiave                  *
      *    *-----------------------------------------------------------*
       nor-key-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione dati chiave                     *
      *              *-------------------------------------------------*
           perform   nor-key-reg-000      thru nor-key-reg-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave testata         *
      *              *-------------------------------------------------*
           perform   nor-nok-tes-000      thru nor-nok-tes-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave riga corpo      *
      *              *-------------------------------------------------*
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave piede           *
      *              *-------------------------------------------------*
           perform   nor-nok-pie-000      thru nor-nok-pie-999        .
      *              *-------------------------------------------------*
      *              * Inizializzazione catena [rig]                   *
      *              *-------------------------------------------------*
           move      "BE"                 to   w-cat-rig-ope          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
       nor-key-nok-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati chiave                               *
      *    *-----------------------------------------------------------*
       nor-key-reg-000.
      *              *-------------------------------------------------*
      *              * Ripresa dati passati dal main-program           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Data registrazione                          *
      *                  *---------------------------------------------*
           move      w-key-dat-reg        to   w-tes-dat-reg          .
      *                  *---------------------------------------------*
      *                  * Codice tipo operazione                      *
      *                  *---------------------------------------------*
           move      w-key-tip-ope        to   w-tes-tip-ope          .
      *                  *---------------------------------------------*
      *                  * Codice tipo operazione, descrizione         *
      *                  *---------------------------------------------*
           move      w-key-tip-ope-des    to   w-tes-tip-ope-des      .
       nor-key-reg-100.
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non passati dal main       *
      *              *-------------------------------------------------*
           move      zero                 to   w-tes-num-dis          .
       nor-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave testata                   *
      *    *-----------------------------------------------------------*
       nor-nok-tes-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione dati testata                    *
      *              *-------------------------------------------------*
           perform   nor-war-wte-000      thru nor-war-wte-999        .
       nor-nok-tes-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave riga corpo, ad esclusione *
      *    * del numero progressivo riga                               *
      *    *-----------------------------------------------------------*
       nor-nok-rig-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione dati riga corpo                 *
      *              *-------------------------------------------------*
           perform   nor-war-wri-000      thru nor-war-wri-999        .
       nor-nok-rig-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave piede                     *
      *    *-----------------------------------------------------------*
       nor-nok-pie-000.
       nor-nok-pie-999.
           exit.

      *    *===========================================================*
      *    * Lettura registrazione pre-esistente                       *
      *    *-----------------------------------------------------------*
       rou-let-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-let-reg      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del valore del numero di-  *
      *              * stinta                                          *
      *              *-------------------------------------------------*
           if        w-tes-num-dis        =    zero
                     go to rou-let-reg-025
           else      go to rou-let-reg-050.
       rou-let-reg-025.
      *              *-------------------------------------------------*
      *              * Se numero distinta a zero                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Manca il numero distinta                          
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Status di uscita ad errore                  *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-rou-let-reg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-050.
      *              *-------------------------------------------------*
      *              * Se numero distinta diverso da zero              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura distinta da [ddp]                   *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMDDP    "         to   f-key                  .
           move      w-tes-num-dis        to   rf-ddp-num-ddp         .
           move      "pgm/gep/fls/ioc/obj/iofddp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ddp                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito della let-  *
      *                  * tura                                        *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to rou-let-reg-100.
       rou-let-reg-075.
      *                  *---------------------------------------------*
      *                  * Se record non esistente                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Distinta di presentazione non esistente in archivi
      -              "o              "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * Status di uscita ad errore              *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-rou-let-reg      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-100.
      *                  *---------------------------------------------*
      *                  * Se record esistente                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo funzionamento : Inserimento        *
      *                      *                                         *
      *                      * N.B. : Il tipo funzionamento in questo  *
      *                      *        programma e' puramente conven-   *
      *                      *        zionale.                         *
      *                      *-----------------------------------------*
           move      "I"                  to   w-cnt-mfu-tip-fun      .
      *                      *-----------------------------------------*
      *                      * Distribuzione dati da record [ddp] a    *
      *                      * work per testata                        *
      *                      *-----------------------------------------*
           perform   dda-ddp-wte-000      thru dda-ddp-wte-999        .
       rou-let-reg-150.
      *                      *-----------------------------------------*
      *                      * Se la distinta non e' una Distinta Ef-  *
      *                      * fetti si emette un messaggio di errore  *
      *                      * e si esce                               *
      *                      *-----------------------------------------*
           if        w-tes-tip-ddp (1)    =    02
                     go to rou-let-reg-200.
           if        w-tes-tip-ddp (1)    =    01
                     go to rou-let-reg-151
           else if   w-tes-tip-ddp (1)    =    03
                     go to rou-let-reg-153
           else if   w-tes-tip-ddp (1)    =    04
                     go to rou-let-reg-154
           else      go to rou-let-reg-159.
       rou-let-reg-151.
           move      "Attenzione : La distinta e' di Incassi Elettronici
      -              ", mentre       "    to   w-err-box-err-msg      .
           move      "             la stampa effetti a fronte distinta p
      -              "uo' esse-      "    to   w-err-box-err-m02      .
           move      "             re eseguita solamente per le Distinte
      -              " Effetti.      "    to   w-err-box-err-m03      .
           perform   box-msg-e03-000      thru box-msg-e03-999        .
           move      "#"                  to   w-cnt-rou-let-reg      .
           go to     rou-let-reg-999.
       rou-let-reg-153.
           move      "Attenzione : La distinta e' di Paghero' Cambiari, 
      -              "mentre         "    to   w-err-box-err-msg      .
           move      "             la stampa effetti a fronte distinta p
      -              "uo' esse-      "    to   w-err-box-err-m02      .
           move      "             re eseguita solamente per le Distinte
      -              " Effetti.      "    to   w-err-box-err-m03      .
           perform   box-msg-e03-000      thru box-msg-e03-999        .
           move      "#"                  to   w-cnt-rou-let-reg      .
           go to     rou-let-reg-999.
       rou-let-reg-154.
           move      "Attenzione : La distinta e' di Paghero' avuti in C
      -              "essione,       "    to   w-err-box-err-msg      .
           move      "             e la stampa effetti a fronte distinta
      -              " puo'          "    to   w-err-box-err-m02      .
           move      "             essere eseguita solo per le Distinte 
      -              " Effetti.      "    to   w-err-box-err-m03      .
           perform   box-msg-e03-000      thru box-msg-e03-999        .
           move      "#"                  to   w-cnt-rou-let-reg      .
           go to     rou-let-reg-999.
       rou-let-reg-159.
           move      "Attenzione : La distinta e' di tipo non riconosciu
      -              "to,            "    to   w-err-box-err-msg      .
           move      "             e la stampa effetti a fronte distinta
      -              " puo'          "    to   w-err-box-err-m02      .
           move      "             essere eseguita solo per le Distinte 
      -              " Effetti.      "    to   w-err-box-err-m03      .
           perform   box-msg-e03-000      thru box-msg-e03-999        .
           move      "#"                  to   w-cnt-rou-let-reg      .
           go to     rou-let-reg-999.
       rou-let-reg-200.
      *                      *-----------------------------------------*
      *                      * Se la data di registrazione e' inferio- *
      *                      * re alla data di composizione distinta   *
      *                      * si pone la sola Visualizzazione, dopo   *
      *                      * aver emesso un messaggio di errore.     *
      *                      *                                         *
      *                      * N.B. : Il tipo funzionamento in questo  *
      *                      *        programma e' puramente conven-   *
      *                      *        zionale.                         *
      *                      *-----------------------------------------*
           if        w-tes-dat-reg        not  < w-tes-dtr-com (1)
                     go to rou-let-reg-250.
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to rou-let-reg-250.
           move      "Attenzione : La data di registrazione, che rappres
      -              "enta la data   "    to   w-err-box-err-msg      .
           move      "             di stampa, non puo' essere inferiore 
      -              "alla data di   "    to   w-err-box-err-m02      .
           move      "             composizione della distinta. - Stampa
      -              "non ammessa.   "    to   w-err-box-err-m03      .
           perform   box-msg-e03-000      thru box-msg-e03-999        .
           move      "V"                  to   w-cnt-mfu-tip-fun      .
       rou-let-reg-250.
      *                      *-----------------------------------------*
      *                      * Se la distinta ha il flag di sottoponi- *
      *                      * bilita' a pulizia in On si pone la sola *
      *                      * Visualizzazione, dopo aver emesso un    *
      *                      * messaggio di errore                     *
      *                      *                                         *
      *                      * N.B. : Il tipo funzionamento in questo  *
      *                      *        programma e' puramente conven-   *
      *                      *        zionale.                         *
      *                      *-----------------------------------------*
           if        w-tes-flg-pul (1)    =    spaces
                     go to rou-let-reg-275.
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to rou-let-reg-275.
           move      "Attenzione : La distinta e' in corso di eliminazio
      -              "ne.            "    to   w-err-box-err-msg      .
           move      "             Pertanto la stampa effetti non e' amm
      -              "essa.          "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
           move      "V"                  to   w-cnt-mfu-tip-fun      .
       rou-let-reg-275.
      *                      *-----------------------------------------*
      *                      * Se la distinta non e' ancora stata pre- *
      *                      * sentata si pone la sola Visualizzazio-  *
      *                      * ne, dopo aver emesso un messaggio di    *
      *                      * errore                                  *
      *                      *                                         *
      *                      * N.B. : Il tipo funzionamento in questo  *
      *                      *        programma e' puramente conven-   *
      *                      *        zionale.                         *
      *                      *-----------------------------------------*
           if        w-tes-dtr-pre (1)    not  = zero
                     go to rou-let-reg-300.
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to rou-let-reg-300.
           move      "Attenzione : La distinta non e' ancora stata prese
      -              "ntata.         "    to   w-err-box-err-msg      .
           move      "             Pertanto la stampa effetti non e' amm
      -              "essa.          "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
           move      "V"                  to   w-cnt-mfu-tip-fun      .
       rou-let-reg-300.
      *                      *-----------------------------------------*
      *                      * A caricamento righe                     *
      *                      *-----------------------------------------*
           go to     rou-let-reg-700.
       rou-let-reg-700.
      *                      *-----------------------------------------*
      *                      * Caricamento righe, con ordinamento per  *
      *                      * data di scadenza, e con calcolo del to- *
      *                      * tale importo scadenze caricate          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Messaggio di caricamento in esecu-  *
      *                          * zione                               *
      *                          *-------------------------------------*
           move      "               Caricamento distinta in esecuzione 
      -              "               "    to   w-err-box-err-msg      .
           perform   msg-cnt-box-000      thru msg-cnt-box-999        .
      *                          *-------------------------------------*
      *                          * Sort                                *
      *                          *-------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   srt-inp-prc-000
                                          thru srt-inp-prc-999
                     output procedure     is   srt-out-prc-000
                                          thru srt-out-prc-999        .
      *                          *-------------------------------------*
      *                          * Messaggio di fine caricamento       *
      *                          * zione                               *
      *                          *-------------------------------------*
           move      spaces               to   w-err-box-err-msg      .
           perform   msg-cnt-box-000      thru msg-cnt-box-999        .
       rou-let-reg-725.
      *                      *-----------------------------------------*
      *                      * Assestamenti post-caricamento righe di- *
      *                      * stinta                                  *
      *                      *-----------------------------------------*
       rou-let-reg-730.
      *                          *-------------------------------------*
      *                          * Controllo che l'importo effettivo   *
      *                          * della distinta sia pari alla som-   *
      *                          * matoria delle righe caricate        *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Se si' : continuazione          *
      *                              *---------------------------------*
           if        w-srt-sdb-out-igc    =    w-tes-imp-ddp (1)
                     go to rou-let-reg-735.
      *                              *---------------------------------*
      *                              * Se no                           *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Se si e' gia' in sola Vi-   *
      *                                  * sualizzazione : nessun mes- *
      *                                  * saggio                      *
      *                                  *-----------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to rou-let-reg-735.
      *                                  *-----------------------------*
      *                                  * Emissione messaggio di er-  *
      *                                  * rore                        *
      *                                  *-----------------------------*
           move      "Attenzione : L'importo totale della distinta risul
      -              "ta diverso da  "    to   w-err-box-err-msg      .
           move      "             quello determinato nella composizione
      -              " distinta !    "    to   w-err-box-err-m02      .
           move      "             Pertanto la stampa effetti non e' amm
      -              "essa.          "    to   w-err-box-err-m03      .
           perform   box-msg-e03-000      thru box-msg-e03-999        .
      *                                  *-----------------------------*
      *                                  * Sola visualizzazione        *
      *                                  *                             *
      *                                  * N.B. : Il tipo funzionamen- *
      *                                  *        to in questo pro-    *
      *                                  *        gramma e' puramente  *
      *                                  *        convenzionale        *
      *                                  *-----------------------------*
           move      "V"                  to   w-cnt-mfu-tip-fun      .
       rou-let-reg-735.
      *                          *-------------------------------------*
      *                          * Controllo che la distinta comprenda *
      *                          * almeno una ricevuta bancaria o una  *
      *                          * tratta                              *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Se si' : continuazione          *
      *                              *---------------------------------*
           if        w-srt-sdb-out-nrb    >    zero or
                     w-srt-sdb-out-ntr    >    zero
                     go to rou-let-reg-740.
      *                              *---------------------------------*
      *                              * Se no                           *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Se si e' gia' in sola Vi-   *
      *                                  * sualizzazione : nessun mes- *
      *                                  * saggio                      *
      *                                  *-----------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to rou-let-reg-740.
      *                                  *-----------------------------*
      *                                  * Emissione messaggio di er-  *
      *                                  * rore                        *
      *                                  *-----------------------------*
           move      "Attenzione : La distinta non comprende nemmeno una
      -              " scadenza di   "    to   w-err-box-err-msg      .
           move      "             tipo Ricevuta Bancaria o Tratta !    
      -              "               "    to   w-err-box-err-m02      .
           move      "             Pertanto la stampa effetti non e' amm
      -              "essa.          "    to   w-err-box-err-m03      .
           perform   box-msg-e03-000      thru box-msg-e03-999        .
      *                                  *-----------------------------*
      *                                  * Sola visualizzazione        *
      *                                  *                             *
      *                                  * N.B. : Il tipo funzionamen- *
      *                                  *        to in questo pro-    *
      *                                  *        gramma e' puramente  *
      *                                  *        convenzionale        *
      *                                  *-----------------------------*
           move      "V"                  to   w-cnt-mfu-tip-fun      .
       rou-let-reg-740.
      *                          *-------------------------------------*
      *                          * Importo effettivo della distinta,   *
      *                          * da sommatoria righe caricate        *
      *                          *-------------------------------------*
           move      w-srt-sdb-out-igc    to   w-tes-imp-ddp (1)      .
      *                          *-------------------------------------*
      *                          * Numero ricevute bancarie incluse    *
      *                          * nella distinta                      *
      *                          *-------------------------------------*
           move      w-srt-sdb-out-nrb    to   w-tes-sce-nrb (1)      .
      *                          *-------------------------------------*
      *                          * Numero tratte incluse nella distin- *
      *                          * ta                                  *
      *                          *-------------------------------------*
           move      w-srt-sdb-out-ntr    to   w-tes-sce-ntr (1)      .
      *                          *-------------------------------------*
      *                          * Numero effetti appartenenti alla    *
      *                          * distinta, che sono gia' stati stam- *
      *                          * pati                                *
      *                          *-------------------------------------*
           move      w-srt-sdb-out-ngs    to   w-tes-sce-ngs (1)      .
       rou-let-reg-800.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort scadenze della distinta per :    *
      *    *                                                           *
      *    * -  Data di scadenza                                       *
      *    * -  Ragione sociale del debitore                           *
      *    * -  Tipo debitore                                          *
      *    * -  Codice debitore                                        *
      *    * -  Numero scadenza                                        *
      *    *-----------------------------------------------------------*
       srt-inp-prc-000.
      *              *-------------------------------------------------*
      *              * Start su scadenze appartenenti alla distinta di *
      *              * presentazione                                   *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "DDPNRS    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-tes-num-dis        to   rf-sdb-num-ddp         .
           move      zero                 to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *              *-------------------------------------------------*
      *              * Se start errata : fine input procedure          *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  srt-inp-prc-999.
       srt-inp-prc-200.
      *              *-------------------------------------------------*
      *              * Next su scadenze appartenenti alla distinta di  *
      *              * presentazione                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *              *-------------------------------------------------*
      *              * Se at end : fine input procedure                *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  srt-inp-prc-999.
       srt-inp-prc-300.
      *              *-------------------------------------------------*
      *              * Test max su su scadenze appartenenti alla di-   *
      *              * stinta di presentazione, se non superato : fi-  *
      *              * ne input procedure                              *
      *              *-------------------------------------------------*
           if        rf-sdb-num-ddp       not  = w-tes-num-dis
                     go to  srt-inp-prc-999.
       srt-inp-prc-400.
      *              *-------------------------------------------------*
      *              * Composizione sort-record                        *
      *              *-------------------------------------------------*
       srt-inp-prc-410.
      *                  *---------------------------------------------*
      *                  * Normalizzazione preliminare                 *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
       srt-inp-prc-420.
      *                  *---------------------------------------------*
      *                  * Data di scadenza                            *
      *                  *---------------------------------------------*
           move      rf-sdb-dts-sdb       to   srt-dts-sdb            .
       srt-inp-prc-430.
      *                  *---------------------------------------------*
      *                  * Ragione sociale del debitore                *
      *                  *---------------------------------------------*
           move      rf-sdb-tip-dbt       to   w-let-arc-dbt-tip      .
           move      rf-sdb-cod-dbt       to   w-let-arc-dbt-cod      .
           perform   let-arc-dbt-000      thru let-arc-dbt-999        .
           move      w-let-arc-dbt-rag    to   srt-rag-soc            .
       srt-inp-prc-440.
      *                  *---------------------------------------------*
      *                  * Tipo debitore                               *
      *                  *---------------------------------------------*
           move      rf-sdb-tip-dbt       to   srt-tip-dbt            .
       srt-inp-prc-450.
      *                  *---------------------------------------------*
      *                  * Codice debitore                             *
      *                  *---------------------------------------------*
           move      rf-sdb-cod-dbt       to   srt-cod-dbt            .
       srt-inp-prc-460.
      *                  *---------------------------------------------*
      *                  * Numero scadenza                             *
      *                  *---------------------------------------------*
           move      rf-sdb-num-sdb       to   srt-num-sdb            .
       srt-inp-prc-470.
      *                  *---------------------------------------------*
      *                  * Importo scadenza                            *
      *                  *---------------------------------------------*
           move      rf-sdb-imp-sdb       to   srt-imp-sdb            .
       srt-inp-prc-480.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza                               *
      *                  *---------------------------------------------*
           move      rf-sdb-tip-sdb       to   srt-tip-sdb            .
       srt-inp-prc-490.
      *                  *---------------------------------------------*
      *                  * Tipo acquisizione scadenza                  *
      *                  *---------------------------------------------*
           move      rf-sdb-tac-sdb       to   srt-tac-sdb            .
       srt-inp-prc-500.
      *                  *---------------------------------------------*
      *                  * Codice dipendenza del debitore              *
      *                  *---------------------------------------------*
           move      rf-sdb-dpz-dbt       to   srt-dpz-dbt            .
       srt-inp-prc-510.
      *                  *---------------------------------------------*
      *                  * Inoltro scadenza al debitore                *
      *                  *---------------------------------------------*
           move      rf-sdb-inl-sdb       to   srt-inl-sdb            .
       srt-inp-prc-520.
      *                  *---------------------------------------------*
      *                  * Codice ABI per l'appoggio                   *
      *                  *---------------------------------------------*
           move      rf-sdb-abi-app       to   srt-abi-app            .
       srt-inp-prc-530.
      *                  *---------------------------------------------*
      *                  * Codice CAB per l'appoggio                   *
      *                  *---------------------------------------------*
           move      rf-sdb-cab-app       to   srt-cab-app            .
       srt-inp-prc-540.
      *                  *---------------------------------------------*
      *                  * Codice C/C per l'appoggio                   *
      *                  *---------------------------------------------*
           move      rf-sdb-ccc-app       to   srt-ccc-app            .
       srt-inp-prc-550.
      *                  *---------------------------------------------*
      *                  * Data documento di riferimento               *
      *                  *---------------------------------------------*
           move      rf-sdb-dat-ddr       to   srt-dat-ddr            .
       srt-inp-prc-560.
      *                  *---------------------------------------------*
      *                  * Numero documento di riferimento             *
      *                  *---------------------------------------------*
           move      rf-sdb-num-ddr       to   srt-num-ddr            .
       srt-inp-prc-570.
      *                  *---------------------------------------------*
      *                  * Tipo documento di riferimento               *
      *                  *---------------------------------------------*
           move      rf-sdb-tip-ddr       to   srt-tip-ddr            .
       srt-inp-prc-580.
      *                  *---------------------------------------------*
      *                  * Importo documento di riferimento            *
      *                  *---------------------------------------------*
           move      rf-sdb-imp-ddr       to   srt-imp-ddr            .
       srt-inp-prc-590.
      *                  *---------------------------------------------*
      *                  * Numero rata documento di riferimento        *
      *                  *---------------------------------------------*
           move      rf-sdb-nra-ddr       to   srt-nra-ddr            .
       srt-inp-prc-600.
      *                  *---------------------------------------------*
      *                  * Tipo avviso ottenuto                        *
      *                  *---------------------------------------------*
           move      rf-sdb-tav-ott       to   srt-tav-ott            .
       srt-inp-prc-610.
      *                  *---------------------------------------------*
      *                  * Status della scadenza                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se richiamata                           *
      *                      *-----------------------------------------*
           if        rf-sdb-dtr-rsp       not  = zero
                     move  01             to   srt-sts-sca
                     go to srt-inp-prc-620.
      *                      *-----------------------------------------*
      *                      * Se accreditata, se al dopo incasso      *
      *                      *-----------------------------------------*
           if        rf-sdb-dtr-acs       not  = zero
                     move  02             to   srt-sts-sca
                     go to srt-inp-prc-620.
      *                      *-----------------------------------------*
      *                      * Se con notizia di buon esito            *
      *                      *-----------------------------------------*
           if        rf-sdb-dtr-nbe       not  = zero
                     move  03             to   srt-sts-sca
                     go to srt-inp-prc-620.
      *                      *-----------------------------------------*
      *                      * Se con presunto buon esito              *
      *                      *-----------------------------------------*
           if        rf-sdb-dtr-pbe       not  = zero
                     move  04             to   srt-sts-sca
                     go to srt-inp-prc-620.
      *                      *-----------------------------------------*
      *                      * Se insoluta                             *
      *                      *-----------------------------------------*
           if        rf-sdb-dtr-isp       not  = zero
                     move  05             to   srt-sts-sca
                     go to srt-inp-prc-620.
      *                      *-----------------------------------------*
      *                      * Se con flags di elaborazione bloccanti  *
      *                      *-----------------------------------------*
           if        rf-sdb-flg-blo       not  = spaces
                     move  06             to   srt-sts-sca
                     go to srt-inp-prc-620.
      *                      *-----------------------------------------*
      *                      * Se con flags di sottoponibilita' a pu-  *
      *                      * lizia                                   *
      *                      *-----------------------------------------*
           if        rf-sdb-flg-pul       not  = spaces
                     move  07             to   srt-sts-sca
                     go to srt-inp-prc-620.
      *                      *-----------------------------------------*
      *                      * Altrimenti : normale                    *
      *                      *-----------------------------------------*
           move      zero                 to   srt-sts-sca            .
       srt-inp-prc-620.
      *                  *---------------------------------------------*
      *                  * Data registrazione movimento di richiamo    *
      *                  * scadenza presentata                         *
      *                  *---------------------------------------------*
           move      rf-sdb-dtr-rsp       to   srt-dtr-rsp            .
       srt-inp-prc-630.
      *                  *---------------------------------------------*
      *                  * Data registrazione movimento di accredito   *
      *                  * scadenza presentata al dopo incasso         *
      *                  *---------------------------------------------*
           move      rf-sdb-dtr-acs       to   srt-dtr-acs            .
       srt-inp-prc-640.
      *                  *---------------------------------------------*
      *                  * Data registrazione movimento di notizia di  *
      *                  * buon esito su scadenza presentata           *
      *                  *---------------------------------------------*
           move      rf-sdb-dtr-nbe       to   srt-dtr-nbe            .
       srt-inp-prc-650.
      *                  *---------------------------------------------*
      *                  * Data registrazione movimento di presunto    *
      *                  * buon esito su scadenza presentata           *
      *                  *---------------------------------------------*
           move      rf-sdb-dtr-pbe       to   srt-dtr-pbe            .
       srt-inp-prc-660.
      *                  *---------------------------------------------*
      *                  * Data registrazione movimento di insoluto su *
      *                  * scadenza presentata                         *
      *                  *---------------------------------------------*
           move      rf-sdb-dtr-isp       to   srt-dtr-isp            .
       srt-inp-prc-665.
      *                  *---------------------------------------------*
      *                  * Flag/contatore di stampa effetto eseguita   *
      *                  * scadenza presentata                         *
      *                  *---------------------------------------------*
           move      rf-sdb-flc-stp       to   srt-flc-stp            .
       srt-inp-prc-670.
      *                  *---------------------------------------------*
      *                  * Flags di elaborazione, sia bloccanti che    *
      *                  * non bloccanti                               *
      *                  *---------------------------------------------*
           move      rf-sdb-flg-ela       to   srt-flg-ela            .
       srt-inp-prc-680.
      *                  *---------------------------------------------*
      *                  * Flag di sottoponibilita' a pulizia          *
      *                  *---------------------------------------------*
           move      rf-sdb-flg-pul       to   srt-flg-pul            .
       srt-inp-prc-700.
      *                  *---------------------------------------------*
      *                  * Fine composizione                           *
      *                  *---------------------------------------------*
           go to     srt-inp-prc-800.
       srt-inp-prc-800.
      *              *-------------------------------------------------*
      *              * Rilascio record al sort                         *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
       srt-inp-prc-900.
      *              *-------------------------------------------------*
      *              * Riciclo a  Next su scadenze appartenenti alla   *
      *              * distinta                                        *
      *              *-------------------------------------------------*
           go to     srt-inp-prc-200.
       srt-inp-prc-999.
           exit.

      *    *===========================================================*
      *    * Output procedure per sort scadenze della distinta per :   *
      *    *                                                           *
      *    * -  Data di scadenza                                       *
      *    * -  Ragione sociale del debitore                           *
      *    * -  Tipo debitore                                          *
      *    * -  Codice debitore                                        *
      *    * -  Numero scadenza                                        *
      *    *-----------------------------------------------------------*
       srt-out-prc-000.
      *              *-------------------------------------------------*
      *              * Preparazioni iniziali                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione importo globale caricato    *
      *                  *---------------------------------------------*
           move      zero                 to   w-srt-sdb-out-igc      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione numero ricevute bancarie    *
      *                  * incluse nella distinta                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-srt-sdb-out-nrb      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione numero tratte incluse nella *
      *                  * distinta                                    *
      *                  *---------------------------------------------*
           move      zero                 to   w-srt-sdb-out-ntr      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione numero effetti appartenenti *
      *                  * alla distinta che sono gia' stati stampati  *
      *                  *---------------------------------------------*
           move      zero                 to   w-srt-sdb-out-ngs      .
       srt-out-prc-200.
      *              *-------------------------------------------------*
      *              * Reperimento record dal sort, se fine lettura :  *
      *              * a fine output procedure                         *
      *              *-------------------------------------------------*
           return    srt    at end
                            go to srt-out-prc-999.
       srt-out-prc-500.
      *              *-------------------------------------------------*
      *              * Aggiornamento importo globale caricato          *
      *              *-------------------------------------------------*
           add       srt-imp-sdb          to   w-srt-sdb-out-igc      .
      *              *-------------------------------------------------*
      *              * Aggiornamento numero ricevute bancarie incluse  *
      *              * nella distinta                                  *
      *              *-------------------------------------------------*
           if        srt-tip-sdb          =    09
                     add   1              to   w-srt-sdb-out-nrb      .
      *              *-------------------------------------------------*
      *              * Aggiornamento numero trette incluse nella di-   *
      *              * stinta                                          *
      *              *-------------------------------------------------*
           if        srt-tip-sdb          =    10
                     add   1              to   w-srt-sdb-out-ntr      .
      *              *-------------------------------------------------*
      *              * Aggiornamento numero effetti appartenenti alla  *
      *              * distinta e che sono gia' stati stampati         *
      *              *-------------------------------------------------*
           if        srt-tip-sdb          =    09 or
                     srt-tip-sdb          =    10
                     if      srt-flc-stp  >    zero
                             add   1      to   w-srt-sdb-out-ngs      .
      *              *-------------------------------------------------*
      *              * Put su catena movimenti [rig]                   *
      *              *-------------------------------------------------*
           perform   srt-put-wri-000      thru srt-put-wri-999        .
       srt-out-prc-600.
      *                  *---------------------------------------------*
      *                  * Tests vari su scadenza caricata             *
      *                  *---------------------------------------------*
       srt-out-prc-625.
      *                          *-------------------------------------*
      *                          * Su flags di sottoponibilita' a pu-  *
      *                          * lizia                               *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Se flag di sottoponibilita' a   *
      *                              * pulizia a spaces : il controllo *
      *                              * e' superato                     *
      *                              *---------------------------------*
           if        srt-flg-pul          =    spaces
                     go to srt-out-prc-700.
      *                              *---------------------------------*
      *                              * Altrimenti                      *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Se si e' gia in sola Visua- *
      *                                  * lizzazione : continuazione  *
      *                                  *-----------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to srt-out-prc-700.
      *                                  *-----------------------------*
      *                                  * Messaggio di errore         *
      *                                  *-----------------------------*
           move      "ED"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      "<"                  to   v-edm                  .
           move      srt-num-sdb          to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      spaces               to   w-err-box-err-msg      .
           string    "Attenzione : Anomalia relativa alla scadenza nr. "
                                delimited by   size
                     v-edt      delimited by   spaces
                     "!"        delimited by   size
                                          into w-err-box-err-msg      .
           move      "             La scadenza e' in corso di eliminazio
      -              "ne.            "    to   w-err-box-err-m02      .
           move      "             Pertanto la stampa effetti non e' amm
      -              "essa.          "    to   w-err-box-err-m03      .
           perform   box-msg-e03-000      thru box-msg-e03-999        .
      *                                  *-----------------------------*
      *                                  * Sola visualizzazione        *
      *                                  *                             *
      *                                  * N.B. : Il tipo funzionamen- *
      *                                  *        to in questo pro-    *
      *                                  *        gramma e' puramente  *
      *                                  *        convenzionale        *
      *                                  *-----------------------------*
           move      "V"                  to   w-cnt-mfu-tip-fun      .
       srt-out-prc-700.
      *                      *-----------------------------------------*
      *                      * Fine controlli relativi ai movimenti su *
      *                      * scadenza che possono essere eseguiti    *
      *                      * solamente post-composizione-distinta    *
      *                      *-----------------------------------------*
           go to     srt-out-prc-800.
       srt-out-prc-800.
      *              *-------------------------------------------------*
      *              * Riciclo a reperimento record dal sort           *
      *              *-------------------------------------------------*
           go to     srt-out-prc-200.
       srt-out-prc-999.
           exit.

      *    *===========================================================*
      *    * Procedure per memorizzazione scadenza in catena w-rig per *
      *    * sort scadenze della distinta per :                        *
      *    *                                                           *
      *    * -  Data di scadenza                                       *
      *    * -  Ragione sociale del debitore                           *
      *    * -  Tipo debitore                                          *
      *    * -  Codice debitore                                        *
      *    * -  Numero scadenza                                        *
      *    *-----------------------------------------------------------*
       srt-put-wri-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave riga corpo      *
      *              *-------------------------------------------------*
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
      *              *-------------------------------------------------*
      *              * Preparazione area w-rig, indice 1, da scadenza  *
      *              * letta in area sort [srt], ad esclusione del     *
      *              * numero progressivo                              *
      *              *-------------------------------------------------*
           perform   pre-wri-sdb-000      thru pre-wri-sdb-999        .
      *              *-------------------------------------------------*
      *              * Append di un record vuoto a fine catena         *
      *              *-------------------------------------------------*
           move      "AP"                 to   w-cat-rig-ope          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *              *-------------------------------------------------*
      *              * Aggiornamento del numero progressivo            *
      *              *-------------------------------------------------*
           perform   prg-rig-cor-000      thru prg-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Duplicazione dati attuali su dati precedenti    *
      *              *-------------------------------------------------*
           move      w-rig-val-aep (1)    to   w-rig-val-aep (2)      .
      *              *-------------------------------------------------*
      *              * Update del record vuoto di fine catena          *
      *              *-------------------------------------------------*
           move      "UP"                 to   w-cat-rig-ope          .
           move      w-cat-rig-max        to   w-cat-rig-num          .
           move      w-rig                to   w-cat-rig-buf          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
       srt-put-wri-999.
           exit.

      *    *===========================================================*
      *    * Preparazione area w-rig, indice 1, da scadenza letta in   *
      *    * area sort [srt], ad esclusione del numero progressivo     *
      *    *-----------------------------------------------------------*
       pre-wri-sdb-000.
      *              *-------------------------------------------------*
      *              * Valori forzati                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Si/No selezione stampa effetto              *
      *                  *---------------------------------------------*
           move      spaces               to   w-rig-sce-sns (1)      .
       pre-wri-sdb-100.
      *              *-------------------------------------------------*
      *              * Valori presi direttamente dal record [srt]      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero scadenza                             *
      *                  *---------------------------------------------*
           move      srt-num-sdb          to   w-rig-num-sdb (1)      .
      *                  *---------------------------------------------*
      *                  * Tipo scadenza                               *
      *                  *---------------------------------------------*
           move      srt-tip-sdb          to   w-rig-tip-sdb (1)      .
      *                  *---------------------------------------------*
      *                  * Tipo acquisizione scadenza                  *
      *                  *---------------------------------------------*
           move      srt-tac-sdb          to   w-rig-tac-sdb (1)      .
      *                  *---------------------------------------------*
      *                  * Data scadenza                               *
      *                  *---------------------------------------------*
           move      srt-dts-sdb          to   w-rig-dts-sdb (1)      .
      *                  *---------------------------------------------*
      *                  * Tipo debitore                               *
      *                  *---------------------------------------------*
           move      srt-tip-dbt          to   w-rig-tip-dbt (1)      .
      *                  *---------------------------------------------*
      *                  * Codice debitore                             *
      *                  *---------------------------------------------*
           move      srt-cod-dbt          to   w-rig-cod-dbt (1)      .
      *                  *---------------------------------------------*
      *                  * Codice dipendenza del debitore              *
      *                  *---------------------------------------------*
           move      srt-dpz-dbt          to   w-rig-dpz-dbt (1)      .
      *                  *---------------------------------------------*
      *                  * Inoltro scadenza al debitore                *
      *                  *---------------------------------------------*
           move      srt-inl-sdb          to   w-rig-inl-sdb (1)      .
      *                  *---------------------------------------------*
      *                  * Importo scadenza                            *
      *                  *---------------------------------------------*
           move      srt-imp-sdb          to   w-rig-imp-sdb (1)      .
      *                  *---------------------------------------------*
      *                  * Codice ABI per l'appoggio                   *
      *                  *---------------------------------------------*
           move      srt-abi-app          to   w-rig-abi-app (1)      .
      *                  *---------------------------------------------*
      *                  * Codice CAB per l'appoggio                   *
      *                  *---------------------------------------------*
           move      srt-cab-app          to   w-rig-cab-app (1)      .
      *                  *---------------------------------------------*
      *                  * Codice C/C per l'appoggio                   *
      *                  *---------------------------------------------*
           move      srt-ccc-app          to   w-rig-ccc-app (1)      .
      *                  *---------------------------------------------*
      *                  * Data documento di riferimento               *
      *                  *---------------------------------------------*
           move      srt-dat-ddr          to   w-rig-dat-ddr (1)      .
      *                  *---------------------------------------------*
      *                  * Numero documento di riferimento             *
      *                  *---------------------------------------------*
           move      srt-num-ddr          to   w-rig-num-ddr (1)      .
      *                  *---------------------------------------------*
      *                  * Tipo documento di riferimento               *
      *                  *---------------------------------------------*
           move      srt-tip-ddr          to   w-rig-tip-ddr (1)      .
      *                  *---------------------------------------------*
      *                  * Importo documento di riferimento            *
      *                  *---------------------------------------------*
           move      srt-imp-ddr          to   w-rig-imp-ddr (1)      .
      *                  *---------------------------------------------*
      *                  * Numero rata documento di riferimento        *
      *                  *---------------------------------------------*
           move      srt-nra-ddr          to   w-rig-nra-ddr (1)      .
      *                  *---------------------------------------------*
      *                  * Tipo avviso ottenuto                        *
      *                  *---------------------------------------------*
           move      srt-tav-ott          to   w-rig-tav-ott (1)      .
      *                  *---------------------------------------------*
      *                  * Flag contatore di stampa effetto eseguita   *
      *                  *---------------------------------------------*
           move      srt-flc-stp          to   w-rig-flc-stp (1)      .
      *                  *---------------------------------------------*
      *                  * Status scadenza                             *
      *                  *---------------------------------------------*
           move      srt-sts-sca          to   w-rig-sts-sca (1)      .
       pre-wri-sdb-500.
      *              *-------------------------------------------------*
      *              * Valori ottenuti indirettamente                  *
      *              *-------------------------------------------------*
       pre-wri-sdb-525.
      *                  *---------------------------------------------*
      *                  * Codice debitore, ragione sociale            *
      *                  *                  indirizzo                  *
      *                  *                  localita'                  *
      *                  *---------------------------------------------*
           move      w-rig-tip-dbt (1)    to   w-let-arc-dbt-tip      .
           move      w-rig-cod-dbt (1)    to   w-let-arc-dbt-cod      .
           perform   let-arc-dbt-000      thru let-arc-dbt-999        .
           move      w-let-arc-dbt-rag    to   w-rig-cod-dbt-rag (1)  .
           move      w-let-arc-dbt-via    to   w-rig-cod-dbt-via (1)  .
           move      w-let-arc-dbt-loc    to   w-rig-cod-dbt-loc (1)  .
       pre-wri-sdb-550.
      *                  *---------------------------------------------*
      *                  * Codice dipendenza del debitore, ragione so- *
      *                  * ciale, indirizzo, localita'                 *
      *                  *---------------------------------------------*
           move      w-rig-tip-dbt (1)    to   w-let-dpz-dbt-tip      .
           move      w-rig-cod-dbt (1)    to   w-let-dpz-dbt-cod      .
           move      w-rig-dpz-dbt (1)    to   w-let-dpz-dbt-dpz      .
           perform   let-dpz-dbt-000      thru let-dpz-dbt-999        .
           move      w-let-dpz-dbt-rag    to   w-rig-dpz-dbt-rag (1)  .
           move      w-let-dpz-dbt-via    to   w-rig-dpz-dbt-via (1)  .
           move      w-let-dpz-dbt-loc    to   w-rig-dpz-dbt-loc (1)  .
       pre-wri-sdb-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per inserimento                  *
      *    *-----------------------------------------------------------*
       pre-acc-ins-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-ins      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Visualizzazione testata registrazione           *
      *              *-------------------------------------------------*
           perform   vis-tes-reg-000      thru vis-tes-reg-999        .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pre-acc-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per modifica                     *
      *    *-----------------------------------------------------------*
       pre-acc-mod-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-mod      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Visualizzazione testata registrazione           *
      *              *-------------------------------------------------*
           perform   vis-tes-reg-000      thru vis-tes-reg-999        .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pre-acc-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per visualizzazione              *
      *    *-----------------------------------------------------------*
       pre-acc-vis-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-vis      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Visualizzazione testata registrazione           *
      *              *-------------------------------------------------*
           perform   vis-tes-reg-000      thru vis-tes-reg-999        .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pre-acc-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-richiesta di ratifica tasto Delete            *
      *    *-----------------------------------------------------------*
       pre-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-snx-del      .
       pre-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-richiesta di ratifica tasto Delete           *
      *    *-----------------------------------------------------------*
       pos-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-snx-del      .
       pos-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su inserimento                          *
      *    *-----------------------------------------------------------*
       pos-exi-ins-000.
       pos-exi-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su modifica                             *
      *    *-----------------------------------------------------------*
       pos-exi-mod-000.
       pos-exi-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su visualizzazione                      *
      *    *-----------------------------------------------------------*
       pos-exi-vis-000.
       pos-exi-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di inserimento                      *
      *    *-----------------------------------------------------------*
       pos-cnf-ins-000.
      *              *-------------------------------------------------*
      *              * Lettura record [ddp], senza lock                *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMDDP    "         to   f-key                  .
           move      w-tes-num-ddp (1)    to   rf-ddp-num-ddp         .
           move      "pgm/gep/fls/ioc/obj/iofddp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ddp                 .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to pos-cnf-ins-200.
       pos-cnf-ins-100.
      *              *-------------------------------------------------*
      *              * Se record [ddp] non esistente                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Emissione messaggio di errore               *
      *                  *---------------------------------------------*
           perform   e01-cnf-ins-000      thru e01-cnf-ins-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pos-cnf-ins-999.
       pos-cnf-ins-200.
      *              *-------------------------------------------------*
      *              * Se record [ddp] esistente                       *
      *              *-------------------------------------------------*
       pos-cnf-ins-250.
      *                  *---------------------------------------------*
      *                  * Controllo che la distinta di presentazione  *
      *                  * non sia nel frattempo stata variata         *
      *                  *---------------------------------------------*
           if        rf-ddp-dtr-com       not  = w-tes-dtr-com (1) or
                     rf-ddp-dtr-pre       not  = w-tes-dtr-pre (1) or
                     rf-ddp-drc-pre       not  = w-tes-drc-pre (1) or
                     rf-ddp-npc-pre       not  = w-tes-npc-pre (1) or
                     rf-ddp-cod-cbp       not  = w-tes-cod-cbp (1) or
                     rf-ddp-snx-stp       not  = w-tes-snx-stp (1) or
                     rf-ddp-flc-stp       not  = w-tes-flc-stp (1) or
                     rf-ddp-snx-ads       not  = w-tes-snx-ads (1) or
                     rf-ddp-flc-ads       not  = w-tes-flc-ads (1) or
                     rf-ddp-tip-ias       not  = w-tes-tip-ias (1) or
                     rf-ddp-flc-ias       not  = w-tes-flc-ias (1) or
                     rf-ddp-dtr-act       not  = w-tes-dtr-act (1) or
                     rf-ddp-drc-act       not  = w-tes-drc-act (1) or
                     rf-ddp-npc-act       not  = w-tes-npc-act (1) or
                     rf-ddp-dtr-acd       not  = w-tes-dtr-acd (1) or
                     rf-ddp-drc-acd       not  = w-tes-drc-acd (1) or
                     rf-ddp-npc-acd       not  = w-tes-npc-acd (1) or
                     rf-ddp-flg-ela       not  = w-tes-flg-ela (1) or
                     rf-ddp-flg-pul       not  = w-tes-flg-pul (1)
                     go to pos-cnf-ins-275.
           go to     pos-cnf-ins-600.
       pos-cnf-ins-275.
      *                  *---------------------------------------------*
      *                  * Se la distinta di presentazione e' stata    *
      *                  * nel frattempo variata                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Emissione messaggio di errore           *
      *                      *-----------------------------------------*
           perform   e11-cnf-ins-000      thru e11-cnf-ins-999        .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     pos-cnf-ins-999.
       pos-cnf-ins-600.
      *                  *---------------------------------------------*
      *                  * Esecuzione della stampa effettiva degli ef- *
      *                  * fetti a fronte distinta, in foreground      *
      *                  *---------------------------------------------*
           perform   stp-frg-inc-000      thru stp-frg-inc-999        .
       pos-cnf-ins-999.
           exit.

      *    *===========================================================*
      *    * Messaggio di errore di tipo 01 su conferma impostazioni   *
      *    * per inserimento                                           *
      *    *                                                           *
      *    * Distinta di presentazione non piu' esistente              *
      *    *-----------------------------------------------------------*
       e01-cnf-ins-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      18                   to   v-lto                  .
           move      80                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literal per 'Attenzione'                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      12                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Attenzione :"       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Contenuto per il literal di 'Attenzione'        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione numero distinta editato        *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      "<"                  to   v-edm                  .
           move      w-tes-num-ddp (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contenuto literal di 'At-   *
      *                  * tenzione'                                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      63                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      16                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "Non esiste piu' la distinta numero "
                                delimited by   size
                     v-edt      delimited by   spaces
                     " !"       delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literal per 'Messaggio'                         *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      12                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Messaggio  :"       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Contenuto per il literal di 'Messaggio'         *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      63                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      16                   to   v-pos                  .
           move      "La stampa degli effetti non puo' pertanto essere e
      -              "seguita.     "      to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literal per 'Presa visione'                     *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      38                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "Premere un tasto per presa visione [ ]"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      77                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       e01-cnf-ins-999.
           exit.

      *    *===========================================================*
      *    * Messaggio di errore di tipo 02 su conferma impostazioni   *
      *    * per inserimento                                           *
      *    *                                                           *
      *    * Distinta di presentazione variata nel frattempo           *
      *    *-----------------------------------------------------------*
       e11-cnf-ins-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      18                   to   v-lto                  .
           move      80                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literal per 'Attenzione'                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      12                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Attenzione :"       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Contenuto per il literal di 'Attenzione'        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione numero distinta editato        *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      "<"                  to   v-edm                  .
           move      w-tes-num-ddp (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contenuto literal di 'At-   *
      *                  * tenzione'                                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      63                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      16                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "La distinta numero "
                                delimited by   size
                     v-edt      delimited by   spaces
                     " e' nel frattempo stata variata !"
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literal per 'Messaggio'                         *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      12                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Messaggio  :"       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Contenuto per il literal di 'Messaggio'         *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      63                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      16                   to   v-pos                  .
           move      "La stampa degli effetti non puo' pertanto essere e
      -              "seguita.     "      to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literal per 'Presa visione'                     *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      38                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "Premere un tasto per presa visione [ ]"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      77                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       e11-cnf-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di modifica                         *
      *    *-----------------------------------------------------------*
       pos-cnf-mod-000.
       pos-cnf-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di annullamento                     *
      *    *-----------------------------------------------------------*
       pos-cnf-ann-000.
       pos-cnf-ann-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione work per testata                          *
      *    *-----------------------------------------------------------*
       nor-war-wte-000.
           move      zero                 to   w-tes-sce-nrb (1)      .
           move      zero                 to   w-tes-sce-ntr (1)      .
           move      zero                 to   w-tes-sce-ngs (1)      .
           move      spaces               to   w-tes-sce-srb (1)      .
           move      spaces               to   w-tes-sce-str (1)      .
           move      spaces               to   w-tes-sce-sni (1)      .
           move      spaces               to   w-tes-sce-sbp (1)      .
           move      zero                 to   w-tes-sce-tse (1)      .
           move      zero                 to   w-tes-ide-dat (1)      .
           move      spaces               to   w-tes-ide-ute (1)      .
           move      spaces               to   w-tes-ide-fas (1)      .
           move      zero                 to   w-tes-dtr-com (1)      .
           move      zero                 to   w-tes-num-ddp (1)      .
           move      zero                 to   w-tes-tip-ddp (1)      .
           move      zero                 to   w-tes-tav-ric (1)      .
           move      zero                 to   w-tes-tsc-das (1)      .
           move      zero                 to   w-tes-dsc-min (1)      .
           move      zero                 to   w-tes-dsc-max (1)      .
           move      spaces               to   w-tes-dsc-vis (1)      .
           move      spaces               to   w-tes-cir-itb (1)      .
           move      spaces               to   w-tes-cod-bpe (1)      .
           move      spaces               to   w-tes-cod-bpe-des (1)  .
           move      zero                 to   w-tes-imp-max (1)      .
           move      zero                 to   w-tes-imp-ddp (1)      .
           move      zero                 to   w-tes-dtr-pre (1)      .
           move      zero                 to   w-tes-drc-pre (1)      .
           move      zero                 to   w-tes-npc-pre (1)      .
           move      zero                 to   w-tes-tip-pre (1)      .
           move      spaces               to   w-tes-cod-cbp (1)      .
           move      spaces               to   w-tes-cod-cbp-des (1)  .
           move      zero                 to   w-tes-cod-cbp-abi (1)  .
           move      zero                 to   w-tes-cod-cbp-cab (1)  .
           move      zero                 to   w-tes-cod-cbp-cco (1)  .
           move      zero                 to   w-tes-cod-cbp-pre (1)  .
           move      zero                 to   w-tes-cod-cbp-onb (1)  .
           move      zero                 to   w-tes-cod-cbp-inb (1)  .
           move      spaces               to   w-tes-snx-stp (1)      .
           move      zero                 to   w-tes-flc-stp (1)      .
           move      spaces               to   w-tes-snx-ads (1)      .
           move      zero                 to   w-tes-flc-ads (1)      .
           move      zero                 to   w-tes-tip-ias (1)      .
           move      zero                 to   w-tes-flc-ias (1)      .
           move      zero                 to   w-tes-dtr-act (1)      .
           move      zero                 to   w-tes-drc-act (1)      .
           move      zero                 to   w-tes-npc-act (1)      .
           move      zero                 to   w-tes-dcb-act (1)      .
           move      spaces               to   w-tes-ncb-act (1)      .
           move      zero                 to   w-tes-spe-act (1)      .
           move      zero                 to   w-tes-int-act (1)      .
           move      zero                 to   w-tes-dtr-acd (1)      .
           move      zero                 to   w-tes-drc-acd (1)      .
           move      zero                 to   w-tes-npc-acd (1)      .
           move      zero                 to   w-tes-dcb-acd (1)      .
           move      spaces               to   w-tes-ncb-acd (1)      .
           move      zero                 to   w-tes-spe-acd (1)      .
           move      zero                 to   w-tes-int-acd (1)      .
           move      spaces               to   w-tes-flg-ela (1)      .
           move      spaces               to   w-tes-flg-pul (1)      .
           move      spaces               to   w-tes-alx-exp (1)      .
       nor-war-wte-999.
           exit.

      *    *===========================================================*
      *    * Distribuzione dati da record [ddp] a work per testata     *
      *    *-----------------------------------------------------------*
       dda-ddp-wte-000.
      *              *-------------------------------------------------*
      *              * Valori contenuti direttamente in [ddp]          *
      *              *-------------------------------------------------*
           move      rf-ddp-ide-dat       to   w-tes-ide-dat (1)      .
           move      rf-ddp-ide-ute       to   w-tes-ide-ute (1)      .
           move      rf-ddp-ide-fas       to   w-tes-ide-fas (1)      .
           move      rf-ddp-dtr-com       to   w-tes-dtr-com (1)      .
           move      rf-ddp-num-ddp       to   w-tes-num-ddp (1)      .
           move      rf-ddp-tip-ddp       to   w-tes-tip-ddp (1)      .
           move      rf-ddp-tav-ric       to   w-tes-tav-ric (1)      .
           move      rf-ddp-tsc-das       to   w-tes-tsc-das (1)      .
           move      rf-ddp-dsc-min       to   w-tes-dsc-min (1)      .
           move      rf-ddp-dsc-max       to   w-tes-dsc-max (1)      .
           move      rf-ddp-dsc-vis       to   w-tes-dsc-vis (1)      .
           move      rf-ddp-cir-itb       to   w-tes-cod-bpe (1)      .
           move      rf-ddp-imp-max       to   w-tes-imp-max (1)      .
           move      rf-ddp-imp-ddp       to   w-tes-imp-ddp (1)      .
           move      rf-ddp-dtr-pre       to   w-tes-dtr-pre (1)      .
           move      rf-ddp-drc-pre       to   w-tes-drc-pre (1)      .
           move      rf-ddp-npc-pre       to   w-tes-npc-pre (1)      .
           move      rf-ddp-tip-pre       to   w-tes-tip-pre (1)      .
           move      rf-ddp-cod-cbp       to   w-tes-cod-cbp (1)      .
           move      rf-ddp-snx-stp       to   w-tes-snx-stp (1)      .
           move      rf-ddp-flc-stp       to   w-tes-flc-stp (1)      .
           move      rf-ddp-snx-ads       to   w-tes-snx-ads (1)      .
           move      rf-ddp-flc-ads       to   w-tes-flc-ads (1)      .
           move      rf-ddp-tip-ias       to   w-tes-tip-ias (1)      .
           move      rf-ddp-flc-ias       to   w-tes-flc-ias (1)      .
           move      rf-ddp-dtr-act       to   w-tes-dtr-act (1)      .
           move      rf-ddp-drc-act       to   w-tes-drc-act (1)      .
           move      rf-ddp-npc-act       to   w-tes-npc-act (1)      .
           move      rf-ddp-dcb-act       to   w-tes-dcb-act (1)      .
           move      rf-ddp-ncb-act       to   w-tes-ncb-act (1)      .
           move      rf-ddp-spe-act       to   w-tes-spe-act (1)      .
           move      rf-ddp-int-act       to   w-tes-int-act (1)      .
           move      rf-ddp-dtr-acd       to   w-tes-dtr-acd (1)      .
           move      rf-ddp-drc-acd       to   w-tes-drc-acd (1)      .
           move      rf-ddp-npc-acd       to   w-tes-npc-acd (1)      .
           move      rf-ddp-dcb-acd       to   w-tes-dcb-acd (1)      .
           move      rf-ddp-ncb-acd       to   w-tes-ncb-acd (1)      .
           move      rf-ddp-spe-acd       to   w-tes-spe-acd (1)      .
           move      rf-ddp-int-acd       to   w-tes-int-acd (1)      .
           move      rf-ddp-flg-ela       to   w-tes-flg-ela (1)      .
           move      rf-ddp-flg-pul       to   w-tes-flg-pul (1)      .
           move      rf-ddp-alx-exp       to   w-tes-alx-exp (1)      .
       dda-ddp-wte-500.
      *              *-------------------------------------------------*
      *              * Valori indirettamente ottenuti da [ddp]         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Da codice banca di presentazione            *
      *                  *---------------------------------------------*
           move      02                   to   w-let-arc-cbp-tip      .
           move      w-tes-cod-cbp (1)    to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
           move      w-let-arc-cbp-des    to   w-tes-cod-cbp-des (1)  .
           move      w-let-arc-cbp-abi    to   w-tes-cod-cbp-abi (1)  .
           move      w-let-arc-cbp-cab    to   w-tes-cod-cbp-cab (1)  .
           move      w-let-arc-cbp-cco    to   w-tes-cod-cbp-cco (1)  .
           if        w-tes-tip-pre (1)    =    01
                     move  w-let-arc-cbp-psm
                                          to   w-tes-cod-cbp-pre (1)
           else if   w-tes-tip-pre (1)    =    02
                     move  w-let-arc-cbp-psi
                                          to   w-tes-cod-cbp-pre (1)
           else if   w-tes-tip-pre (1)    =    03
                     move  w-let-arc-cbp-pdi
                                          to   w-tes-cod-cbp-pre (1)
           else if   w-tes-tip-pre (1)    =    04
                     move  w-let-arc-cbp-psc
                                          to   w-tes-cod-cbp-pre (1)
           else      move  zero           to   w-tes-cod-cbp-pre (1)  .
           move      w-let-arc-cbp-onb    to   w-tes-cod-cbp-onb (1)  .
           move      w-let-arc-cbp-inb    to   w-tes-cod-cbp-inb (1)  .
      *                  *---------------------------------------------*
      *                  * Da codice banca di presentazione per la     *
      *                  * selezioni su clienti                        *
      *                  *---------------------------------------------*
           move      02                   to   w-let-arc-cbp-tip      .
           move      w-tes-cod-bpe (1)    to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
           move      w-let-arc-cbp-des    to   w-tes-cod-bpe-des (1)  .
       dda-ddp-wte-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione work per riga corpo, ad esclusione del    *
      *    * numero progressivo                                        *
      *    *-----------------------------------------------------------*
       nor-war-wri-000.
           move      spaces               to   w-rig-sce-sns (1)      .
           move      zero                 to   w-rig-num-sdb (1)      .
           move      zero                 to   w-rig-tip-sdb (1)      .
           move      zero                 to   w-rig-tac-sdb (1)      .
           move      zero                 to   w-rig-dts-sdb (1)      .
           move      zero                 to   w-rig-tip-dbt (1)      .
           move      zero                 to   w-rig-cod-dbt (1)      .
           move      spaces               to   w-rig-cod-dbt-rag (1)  .
           move      spaces               to   w-rig-cod-dbt-via (1)  .
           move      spaces               to   w-rig-cod-dbt-loc (1)  .
           move      spaces               to   w-rig-dpz-dbt (1)      .
           move      spaces               to   w-rig-dpz-dbt-rag (1)  .
           move      spaces               to   w-rig-dpz-dbt-via (1)  .
           move      spaces               to   w-rig-dpz-dbt-loc (1)  .
           move      zero                 to   w-rig-inl-sdb (1)      .
           move      zero                 to   w-rig-imp-sdb (1)      .
           move      zero                 to   w-rig-abi-app (1)      .
           move      zero                 to   w-rig-cab-app (1)      .
           move      spaces               to   w-rig-ccc-app (1)      .
           move      zero                 to   w-rig-dat-ddr (1)      .
           move      spaces               to   w-rig-num-ddr (1)      .
           move      zero                 to   w-rig-tip-ddr (1)      .
           move      zero                 to   w-rig-imp-ddr (1)      .
           move      zero                 to   w-rig-nra-ddr (1)      .
           move      zero                 to   w-rig-tav-ott (1)      .
           move      zero                 to   w-rig-flc-stp (1)      .
           move      zero                 to   w-rig-sts-sca (1)      .
       nor-war-wri-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [sdb]                         *
      *    *-----------------------------------------------------------*
       let-arc-sdb-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-sdb-flg      .
      *              *-------------------------------------------------*
      *              * Test se numero scadenza a zero                  *
      *              *-------------------------------------------------*
           if        w-let-arc-sdb-num    =    zero
                     go to let-arc-sdb-500.
      *              *-------------------------------------------------*
      *              * Lettura per numero scadenza                     *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMSDB    "         to   f-key                  .
           move      w-let-arc-sdb-num    to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-sdb-400.
       let-arc-sdb-200.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-sdb-999.
       let-arc-sdb-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-sdb-flg      .
       let-arc-sdb-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione area record                     *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
           move      w-let-arc-sdb-num    to   rf-sdb-num-sdb         .
       let-arc-sdb-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [obp]                         *
      *    *-----------------------------------------------------------*
       let-arc-obp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-obp-flg      .
      *              *-------------------------------------------------*
      *              * Test se tipo record a zero                      *
      *              *-------------------------------------------------*
           if        w-let-arc-obp-tip    =    zero
                     go to let-arc-obp-500.
      *              *-------------------------------------------------*
      *              * Test se numero scadenza a zero                  *
      *              *-------------------------------------------------*
           if        w-let-arc-obp-num    =    zero
                     go to let-arc-obp-500.
      *              *-------------------------------------------------*
      *              * Lettura per numero scadenza                     *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMOBP    "         to   f-key                  .
           move      w-let-arc-obp-tip    to   rf-obp-tip-obp         .
           move      w-let-arc-obp-num    to   rf-obp-num-obp         .
           move      "pgm/gep/fls/ioc/obj/iofobp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-obp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-obp-400.
       let-arc-obp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-obp-rag-obp       to   w-let-arc-obp-rag      .
           move      rf-obp-via-obp       to   w-let-arc-obp-via      .
           move      rf-obp-loc-obp       to   w-let-arc-obp-loc      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-obp-999.
       let-arc-obp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-obp-flg      .
           move      all   "."            to   w-let-arc-obp-rag      .
           go to     let-arc-obp-600.
       let-arc-obp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-obp-rag      .
       let-arc-obp-600.
           move      spaces               to   w-let-arc-obp-via      .
           move      spaces               to   w-let-arc-obp-loc      .
       let-arc-obp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio debitori                      *
      *    *-----------------------------------------------------------*
       let-arc-dbt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dbt-flg      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo debitore          *
      *              *-------------------------------------------------*
           if        w-let-arc-dbt-tip    =    zero
                     go to let-arc-dbt-100
           else if   w-let-arc-dbt-tip    =    01
                     go to let-arc-dbt-200
           else      go to let-arc-dbt-900.
       let-arc-dbt-100.
      *              *-------------------------------------------------*
      *              * Se tipo debitore : zero                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del codice debitore    *
      *                  *---------------------------------------------*
           if        w-let-arc-dbt-cod    =    zero
                     go to let-arc-dbt-120
           else      go to let-arc-dbt-140.
       let-arc-dbt-120.
      *                  *---------------------------------------------*
      *                  * Se codice debitore : zero                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione work area               *
      *                      *-----------------------------------------*
           move      spaces               to   w-let-arc-dbt-rag      .
           move      spaces               to   w-let-arc-dbt-via      .
           move      spaces               to   w-let-arc-dbt-loc      .
           move      zero                 to   w-let-arc-dbt-cge      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-dbt-999.
       let-arc-dbt-140.
      *                  *---------------------------------------------*
      *                  * Se codice debitore : diverso da zero        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Marker di uscita ad errore              *
      *                      *-----------------------------------------*
           move      "#"                  to   w-let-arc-dbt-flg      .
           move      all   "."            to   w-let-arc-dbt-rag      .
           move      spaces               to   w-let-arc-dbt-via      .
           move      spaces               to   w-let-arc-dbt-loc      .
           move      zero                 to   w-let-arc-dbt-cge      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-dbt-999.
       let-arc-dbt-200.
      *              *-------------------------------------------------*
      *              * Se tipo debitore : 01                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [cli]                      *
      *                  *---------------------------------------------*
           move      w-let-arc-dbt-cod    to   w-let-arc-cli-cod      .
           perform   let-arc-cli-000      thru let-arc-cli-999        .
      *                  *---------------------------------------------*
      *                  * Riporto risultati da lettura                *
      *                  *---------------------------------------------*
           move      w-let-arc-cli-flg    to   w-let-arc-dbt-flg      .
           move      w-let-arc-cli-rag    to   w-let-arc-dbt-rag      .
           move      w-let-arc-cli-via    to   w-let-arc-dbt-via      .
           move      w-let-arc-cli-loc    to   w-let-arc-dbt-loc      .
           move      w-let-arc-cli-cge    to   w-let-arc-dbt-cge      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-dbt-999.
       let-arc-dbt-900.
      *              *-------------------------------------------------*
      *              * Se tipo debitore : non riconosciuto             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del codice debitore    *
      *                  *---------------------------------------------*
           if        w-let-arc-dbt-cod    =    zero
                     go to let-arc-dbt-920
           else      go to let-arc-dbt-940.
       let-arc-dbt-920.
      *                  *---------------------------------------------*
      *                  * Se codice debitore : zero                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione work area               *
      *                      *-----------------------------------------*
           move      spaces               to   w-let-arc-dbt-rag      .
           move      spaces               to   w-let-arc-dbt-via      .
           move      spaces               to   w-let-arc-dbt-loc      .
           move      zero                 to   w-let-arc-dbt-cge      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-dbt-999.
       let-arc-dbt-940.
      *                  *---------------------------------------------*
      *                  * Se codice debitore : diverso da zero        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Marker di uscita ad errore              *
      *                      *-----------------------------------------*
           move      "#"                  to   w-let-arc-dbt-flg      .
           move      all   "."            to   w-let-arc-dbt-rag      .
           move      spaces               to   w-let-arc-dbt-via      .
           move      spaces               to   w-let-arc-dbt-loc      .
           move      zero                 to   w-let-arc-dbt-cge      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-dbt-999.
       let-arc-dbt-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dbt]                         *
      *    *-----------------------------------------------------------*
       let-dpz-dbt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-dpz-dbt-flg      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo debitore          *
      *              *-------------------------------------------------*
           if        w-let-dpz-dbt-tip    =    zero
                     go to let-dpz-dbt-100
           else if   w-let-dpz-dbt-tip    =    01
                     go to let-dpz-dbt-200
           else      go to let-dpz-dbt-900.
       let-dpz-dbt-100.
      *              *-------------------------------------------------*
      *              * Se tipo debitore : zero                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del codice debitore e  *
      *                  * della dipendenza                            *
      *                  *---------------------------------------------*
           if        w-let-dpz-dbt-cod    =    zero   and
                     w-let-dpz-dbt-dpz    =    spaces
                     go to let-dpz-dbt-120
           else      go to let-dpz-dbt-140.
       let-dpz-dbt-120.
      *                  *---------------------------------------------*
      *                  * Se codice debitore e dipendenza a zero ed a *
      *                  * spaces                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione work area               *
      *                      *-----------------------------------------*
           move      spaces               to   w-let-dpz-dbt-rag      .
           move      spaces               to   w-let-dpz-dbt-via      .
           move      spaces               to   w-let-dpz-dbt-loc      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-dpz-dbt-999.
       let-dpz-dbt-140.
      *                  *---------------------------------------------*
      *                  * Se codice debitore e dipendenza diversi da  *
      *                  * zero e spaces                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Marker di uscita ad errore              *
      *                      *-----------------------------------------*
           move      "#"                  to   w-let-dpz-dbt-flg      .
           move      all   "."            to   w-let-dpz-dbt-rag      .
           move      spaces               to   w-let-dpz-dbt-via      .
           move      spaces               to   w-let-dpz-dbt-loc      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-dpz-dbt-999.
       let-dpz-dbt-200.
      *              *-------------------------------------------------*
      *              * Se tipo debitore : 01                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcc]                      *
      *                  *---------------------------------------------*
           if        w-let-dpz-dbt-dpz    =    spaces
                     move  "C"            to   w-let-arc-dcc-tle
           else      move  "D"            to   w-let-arc-dcc-tle      .
           move      w-let-dpz-dbt-cod    to   w-let-arc-dcc-cod      .
           move      w-let-dpz-dbt-dpz    to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                  *---------------------------------------------*
      *                  * Riporto risultati da lettura                *
      *                  *---------------------------------------------*
           move      w-let-arc-dcc-flg    to   w-let-dpz-dbt-flg      .
           move      w-let-arc-dcc-rag    to   w-let-dpz-dbt-rag      .
           move      w-let-arc-dcc-via    to   w-let-dpz-dbt-via      .
           move      w-let-arc-dcc-loc    to   w-let-dpz-dbt-loc      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-dpz-dbt-999.
       let-dpz-dbt-900.
      *              *-------------------------------------------------*
      *              * Se tipo debitore : non riconosciuto             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del codice debitore e  *
      *                  * della dipendenza                            *
      *                  *---------------------------------------------*
           if        w-let-dpz-dbt-cod    =    zero   and
                     w-let-dpz-dbt-dpz    =    spaces
                     go to let-dpz-dbt-920
           else      go to let-dpz-dbt-940.
       let-dpz-dbt-920.
      *                  *---------------------------------------------*
      *                  * Se codice debitore e dipendenza a zero ed a *
      *                  * spaces                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione work area               *
      *                      *-----------------------------------------*
           move      spaces               to   w-let-dpz-dbt-rag      .
           move      spaces               to   w-let-dpz-dbt-via      .
           move      spaces               to   w-let-dpz-dbt-loc      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-dpz-dbt-999.
       let-dpz-dbt-940.
      *                  *---------------------------------------------*
      *                  * Se codice debitore e dipendenza diversi da  *
      *                  * zero e spaces                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Marker di uscita ad errore              *
      *                      *-----------------------------------------*
           move      "#"                  to   w-let-dpz-dbt-flg      .
           move      all   "."            to   w-let-dpz-dbt-rag      .
           move      spaces               to   w-let-dpz-dbt-via      .
           move      spaces               to   w-let-dpz-dbt-loc      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-dpz-dbt-999.
       let-dpz-dbt-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [cli]                         *
      *    *-----------------------------------------------------------*
       let-arc-cli-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cli-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice cliente a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-cli-cod    =    zero
                     go to let-arc-cli-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-let-arc-cli-cod    to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-cli-400.
       let-arc-cli-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-cli-rag-soc       to   w-let-arc-cli-rag      .
           move      rf-cli-via-cli       to   w-let-arc-cli-via      .
           move      rf-cli-loc-cli       to   w-let-arc-cli-loc      .
           move      rf-cli-cod-cge       to   w-let-arc-cli-cge      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-cli-999.
       let-arc-cli-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-cli-flg      .
           move      all   "."            to   w-let-arc-cli-rag      .
           go to     let-arc-cli-600.
       let-arc-cli-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cli-rag      .
       let-arc-cli-600.
           move      spaces               to   w-let-arc-cli-via      .
           move      spaces               to   w-let-arc-cli-loc      .
           move      zero                 to   w-let-arc-cli-cge      .
       let-arc-cli-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio dipendenza cliente in [dcc]      *
      *    *-----------------------------------------------------------*
       let-arc-dcc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice cliente a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-cod    =    zero
                     go to let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a spaces, solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-dpz    =    spaces and
                     w-let-arc-dcc-tle    =    "D"
                     go to let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a "*   ", solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-dpz    =    "*   " and
                     w-let-arc-dcc-tle    =    "D"
                     go to let-arc-dcc-450.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-let-arc-dcc-cod    to   rf-dcc-cod-cli         .
           move      w-let-arc-dcc-dpz    to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcc-400.
       let-arc-dcc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcc-rag-soc       to   w-let-arc-dcc-rag      .
           move      rf-dcc-via-dcc       to   w-let-arc-dcc-via      .
           move      rf-dcc-loc-dcc       to   w-let-arc-dcc-loc      .
           move      rf-dcc-cod-abi       to   w-let-arc-dcc-abi      .
           move      rf-dcc-cod-cab       to   w-let-arc-dcc-cab      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcc-999.
       let-arc-dcc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcc-flg      .
           move      all   "."            to   w-let-arc-dcc-rag      .
           go to     let-arc-dcc-600.
       let-arc-dcc-450.
      *              *-------------------------------------------------*
      *              * Normalizzazione per codice dipendenza "*   "    *
      *              *-------------------------------------------------*
           move      "Sia la sede che tutte le dipendenze     "
                                          to   w-let-arc-dcc-rag      .
           go to     let-arc-dcc-600.
       let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-rag      .
       let-arc-dcc-600.
           move      spaces               to   w-let-arc-dcc-via      .
           move      spaces               to   w-let-arc-dcc-loc      .
           move      zero                 to   w-let-arc-dcc-abi      .
           move      zero                 to   w-let-arc-dcc-cab      .
       let-arc-dcc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [axi]                         *
      *    *-----------------------------------------------------------*
       let-arc-axi-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axi-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice istituto a zero                  *
      *              *-------------------------------------------------*
           if        w-let-arc-axi-cod    =    zero
                     go to let-arc-axi-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODABI"             to   f-key                  .
           move      w-let-arc-axi-cod    to   rf-axi-cod-abi         .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-axi-400.
       let-arc-axi-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-axi-den-abi       to   w-let-arc-axi-den      .
           move      rf-axi-cir-itb       to   w-let-arc-axi-cib      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-axi-999.
       let-arc-axi-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-axi-flg      .
           move      all   "."            to   w-let-arc-axi-den      .
           go to     let-arc-axi-600.
       let-arc-axi-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axi-den      .
       let-arc-axi-600.
           move      spaces               to   w-let-arc-axi-cib      .
       let-arc-axi-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [axs]                         *
      *    *-----------------------------------------------------------*
       let-arc-axs-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axs-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice istituto a zero                  *
      *              *-------------------------------------------------*
           if        w-let-arc-axs-abi    =    zero
                     go to let-arc-axs-500.
      *              *-------------------------------------------------*
      *              * Test se codice agenzia a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-axs-cab    =    zero
                     go to let-arc-axs-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "ABICAB"             to   f-key                  .
           move      w-let-arc-axs-abi    to   rf-axs-cod-abi         .
           move      w-let-arc-axs-cab    to   rf-axs-cod-cab         .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-axs-400.
       let-arc-axs-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-axs-den-spt       to   w-let-arc-axs-den      .
           move      rf-axs-via-spt       to   w-let-arc-axs-via      .
           move      rf-axs-loc-spt       to   w-let-arc-axs-loc      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-axs-999.
       let-arc-axs-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-axs-flg      .
           move      all   "."            to   w-let-arc-axs-den      .
           go to     let-arc-axs-600.
       let-arc-axs-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axs-den      .
       let-arc-axs-600.
           move      spaces               to   w-let-arc-axs-via      .
           move      spaces               to   w-let-arc-axs-loc      .
       let-arc-axs-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [axc]                         *
      *    *-----------------------------------------------------------*
       let-arc-axc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice circuito a spaces                *
      *              *-------------------------------------------------*
           if        w-let-arc-axc-cod    =    spaces
                     go to let-arc-axc-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCIB    "         to   f-key                  .
           move      w-let-arc-axc-cod    to   rf-axc-cod-cib         .
           move      "pgm/abi/fls/ioc/obj/iofaxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-axc-400.
       let-arc-axc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-axc-des-cib       to   w-let-arc-axc-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-axc-999.
       let-arc-axc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-axc-flg      .
           move      all   "."            to   w-let-arc-axc-des      .
           go to     let-arc-axc-999.
       let-arc-axc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axc-des      .
       let-arc-axc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [cbp]                         *
      *    *-----------------------------------------------------------*
       let-arc-cbp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cbp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spaces                         *
      *              *-------------------------------------------------*
           if        w-let-arc-cbp-cod    =    spaces
                     go to let-arc-cbp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCBP    "         to   f-key                  .
           move      w-let-arc-cbp-tip    to   rf-cbp-tip-cbp         .
           move      w-let-arc-cbp-cod    to   rf-cbp-cod-cbp         .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-cbp-400.
       let-arc-cbp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-cbp-des-cbp       to   w-let-arc-cbp-des      .
           move      rf-cbp-stc-csc       to   w-let-arc-cbp-csc      .
           move      rf-cbp-stc-csa       to   w-let-arc-cbp-csa      .
           move      rf-cbp-abi-ban       to   w-let-arc-cbp-abi      .
           move      rf-cbp-cab-ban       to   w-let-arc-cbp-cab      .
           move      rf-cbp-sgl-ccb       to   w-let-arc-cbp-ccb      .
           move      rf-cbp-stc-cco       to   w-let-arc-cbp-cco      .
           move      rf-cbp-stc-bba       to   w-let-arc-cbp-bba      .
           move      rf-cbp-stc-bbp       to   w-let-arc-cbp-bbp      .
           move      rf-cbp-stc-psm       to   w-let-arc-cbp-psm      .
           move      rf-cbp-stc-psi       to   w-let-arc-cbp-psi      .
           move      rf-cbp-stc-pdi       to   w-let-arc-cbp-pdi      .
           move      rf-cbp-stc-psc       to   w-let-arc-cbp-psc      .
           move      rf-cbp-stc-anv       to   w-let-arc-cbp-anv      .
           move      rf-cbp-stc-dfp       to   w-let-arc-cbp-dfp      .
           move      rf-cbp-stc-dfa       to   w-let-arc-cbp-dfa      .
           move      rf-cbp-stc-onb       to   w-let-arc-cbp-onb      .
           move      rf-cbp-stc-inb       to   w-let-arc-cbp-inb      .
           move      rf-cbp-sgl-ccp       to   w-let-arc-cbp-ccp      .
           move      rf-cbp-stc-bpa       to   w-let-arc-cbp-bpa      .
           move      rf-cbp-stc-bpp       to   w-let-arc-cbp-bpp      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-cbp-999.
       let-arc-cbp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-cbp-flg      .
           move      all   "."            to   w-let-arc-cbp-des      .
           go to     let-arc-cbp-600.
       let-arc-cbp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cbp-des      .
       let-arc-cbp-600.
           move      zero                 to   w-let-arc-cbp-csc      .
           move      zero                 to   w-let-arc-cbp-csa      .
           move      zero                 to   w-let-arc-cbp-abi      .
           move      zero                 to   w-let-arc-cbp-cab      .
           move      spaces               to   w-let-arc-cbp-ccb      .
           move      zero                 to   w-let-arc-cbp-cco      .
           move      zero                 to   w-let-arc-cbp-bba      .
           move      zero                 to   w-let-arc-cbp-bbp      .
           move      zero                 to   w-let-arc-cbp-psm      .
           move      zero                 to   w-let-arc-cbp-psi      .
           move      zero                 to   w-let-arc-cbp-pdi      .
           move      zero                 to   w-let-arc-cbp-psc      .
           move      zero                 to   w-let-arc-cbp-anv      .
           move      zero                 to   w-let-arc-cbp-dfp      .
           move      zero                 to   w-let-arc-cbp-dfa      .
           move      zero                 to   w-let-arc-cbp-onb      .
           move      zero                 to   w-let-arc-cbp-inb      .
           move      spaces               to   w-let-arc-cbp-ccp      .
           move      zero                 to   w-let-arc-cbp-bpa      .
           move      zero                 to   w-let-arc-cbp-bpp      .
       let-arc-cbp-999.
           exit.

      *    *===========================================================*
      *    * Find su archivio [ddp]                                    *
      *    *-----------------------------------------------------------*
       fnd-arc-ddp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di selezione               *
      *              *-------------------------------------------------*
           move      "N"                  to   w-fnd-arc-ddp-sel      .
       fnd-arc-ddp-050.
      *              *-------------------------------------------------*
      *              * Se programma di interrogazione gia' attivo :    *
      *              * uscita senza alcuna azione                      *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pgep3010"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to fnd-arc-ddp-999.
       fnd-arc-ddp-100.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'tip-int' per il  *
      *              * livello successivo per il tipo di interrogazio- *
      *              * ne                                              *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "tip-int"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      10                   to   s-car                  .
           move      "INTDDP    "         to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-ddp-150.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'tip-ddp' per il  *
      *              * livello successivo per il tipo di distinta      *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "tip-ddp"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      02                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      w-fnd-arc-ddp-tip    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-ddp-175.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'sel-ddp' per il  *
      *              * livello successivo per il tipo selezione su di- *
      *              * stinte                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore a zero : no scrittura             *
      *                  *---------------------------------------------*
           if        w-fnd-arc-ddp-sld    =    zero
                     go to fnd-arc-ddp-200.
      *                  *---------------------------------------------*
      *                  * Scrittura effettiva                         *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "sel-ddp"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      02                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      w-fnd-arc-ddp-sld    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-ddp-200.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'snx-slc' per il  *
      *              * livello successivo per l'ammissibilita' del ta- *
      *              * sto Slct                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non ammesso : no scrittura               *
      *                  *---------------------------------------------*
           if        w-fnd-arc-ddp-sns    not  = "S"
                     go to fnd-arc-ddp-250.
      *                  *---------------------------------------------*
      *                  * Scrittura effettiva                         *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "snx-slc"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      01                   to   s-car                  .
           move      "S"                  to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-ddp-250.
      *              *-------------------------------------------------*
      *              * Richiamo del programma di interrogazione        *
      *              *-------------------------------------------------*
           move      "pgm/gep/prg/obj/pgep3010"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
       fnd-arc-ddp-300.
      *              *-------------------------------------------------*
      *              * Cancellazione del programma di interrogazione   *
      *              *-------------------------------------------------*
           cancel    s-pat                                            .
       fnd-arc-ddp-350.
      *              *-------------------------------------------------*
      *              * Determinazione selezione avvenuta               *
      *              *-------------------------------------------------*
       fnd-arc-ddp-355.
      *                  *---------------------------------------------*
      *                  * Se non era ammessa la selezioone : uscita   *
      *                  *---------------------------------------------*
           if        w-fnd-arc-ddp-sns    not  = "S"
                     go to fnd-arc-ddp-999.
       fnd-arc-ddp-360.
      *                  *---------------------------------------------*
      *                  * Lettura variabile di i.p.c. 'num-ddp' dal   *
      *                  * livello successivo per numero distinta se-  *
      *                  * lezionato                                   *
      *                  *---------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "num-ddp"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito della let-  *
      *                  * tura                                        *
      *                  *---------------------------------------------*
           if        s-ves                =    spaces
                     go to fnd-arc-ddp-365
           else      go to fnd-arc-ddp-370.
       fnd-arc-ddp-365.
      *                  *---------------------------------------------*
      *                  * Se variabile esistente                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di selezione avvenuta              *
      *                      *-----------------------------------------*
           move      spaces               to   w-fnd-arc-ddp-sel      .
      *                      *-----------------------------------------*
      *                      * Numero distinta selezionata             *
      *                      *-----------------------------------------*
           move      s-num                to   w-fnd-arc-ddp-num      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     fnd-arc-ddp-999.
       fnd-arc-ddp-370.
      *                  *---------------------------------------------*
      *                  * Se variabile non esistente                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     fnd-arc-ddp-999.
       fnd-arc-ddp-999.
           exit.

      *    *===========================================================*
      *    * Espansione su archivio [ddp]                              *
      *    *-----------------------------------------------------------*
       esp-arc-ddp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di selezione               *
      *              *-------------------------------------------------*
           move      "N"                  to   w-esp-arc-ddp-sel      .
       esp-arc-ddp-050.
      *              *-------------------------------------------------*
      *              * Se programma di espansione gia' attivo : uscita *
      *              * senza alcuna azione                             *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pgep3010"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to esp-arc-ddp-999.
       esp-arc-ddp-100.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'tip-int' per il  *
      *              * livello successivo per il tipo di interrogazio- *
      *              * ne                                              *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "tip-int"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      10                   to   s-car                  .
           move      "ESPDDP    "         to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       esp-arc-ddp-150.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'num-ddp' per il  *
      *              * livello successivo per il numero distinta su    *
      *              * cui eseguire l'espansione                       *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-ddp"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      11                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      w-esp-arc-ddp-num    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       esp-arc-ddp-200.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'snx-slc' per il  *
      *              * livello successivo per l'ammissibilita' del ta- *
      *              * sto Slct                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non ammesso : no scrittura               *
      *                  *---------------------------------------------*
           if        w-esp-arc-ddp-sns    not  = "S"
                     go to esp-arc-ddp-250.
      *                  *---------------------------------------------*
      *                  * Scrittura effettiva                         *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "snx-slc"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      01                   to   s-car                  .
           move      "S"                  to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       esp-arc-ddp-250.
      *              *-------------------------------------------------*
      *              * Richiamo del programma di interrogazione        *
      *              *-------------------------------------------------*
           move      "pgm/gep/prg/obj/pgep3010"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
       esp-arc-ddp-300.
      *              *-------------------------------------------------*
      *              * Cancellazione del programma di interrogazione   *
      *              *-------------------------------------------------*
           cancel    s-pat                                            .
       esp-arc-ddp-350.
      *              *-------------------------------------------------*
      *              * Determinazione selezione avvenuta               *
      *              *-------------------------------------------------*
       esp-arc-ddp-355.
      *                  *---------------------------------------------*
      *                  * Se non era ammessa la selezioone : uscita   *
      *                  *---------------------------------------------*
           if        w-esp-arc-ddp-sns    not  = "S"
                     go to esp-arc-ddp-999.
       esp-arc-ddp-360.
      *                  *---------------------------------------------*
      *                  * Lettura variabile di i.p.c. 'num-ddp' dal   *
      *                  * livello successivo per numero distinta se-  *
      *                  * lezionato                                   *
      *                  *---------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "num-ddp"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito della let-  *
      *                  * tura                                        *
      *                  *---------------------------------------------*
           if        s-ves                =    spaces
                     go to esp-arc-ddp-365
           else      go to esp-arc-ddp-370.
       esp-arc-ddp-365.
      *                  *---------------------------------------------*
      *                  * Se variabile esistente                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di selezione avvenuta              *
      *                      *-----------------------------------------*
           move      spaces               to   w-esp-arc-ddp-sel      .
      *                      *-----------------------------------------*
      *                      * Numero distinta selezionata             *
      *                      *-----------------------------------------*
           move      s-num                to   w-esp-arc-ddp-num      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     esp-arc-ddp-999.
       esp-arc-ddp-370.
      *                  *---------------------------------------------*
      *                  * Se variabile non esistente                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     esp-arc-ddp-999.
       esp-arc-ddp-999.
           exit.

      *    *===========================================================*
      *    * Espansione su archivio [sdb]                              *
      *    *-----------------------------------------------------------*
       esp-arc-sdb-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di selezione               *
      *              *-------------------------------------------------*
           move      "N"                  to   w-esp-arc-sdb-sel      .
       esp-arc-sdb-050.
      *              *-------------------------------------------------*
      *              * Se programma di espansione gia' attivo : uscita *
      *              * senza alcuna azione                             *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pgep3010"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to esp-arc-sdb-999.
       esp-arc-sdb-100.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'tip-int' per il  *
      *              * livello successivo per il tipo di interrogazio- *
      *              * ne                                              *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "tip-int"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      10                   to   s-car                  .
           move      "ESPSDB    "         to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       esp-arc-sdb-150.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'num-sdb' per il  *
      *              * livello successivo per il numero scadenza su    *
      *              * cui eseguire l'espansione                       *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-sdb"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      11                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      w-esp-arc-sdb-num    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       esp-arc-sdb-200.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'snx-slc' per il  *
      *              * livello successivo per l'ammissibilita' del ta- *
      *              * sto Slct                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non ammesso : no scrittura               *
      *                  *---------------------------------------------*
           if        w-esp-arc-sdb-sns    not  = "S"
                     go to esp-arc-sdb-250.
      *                  *---------------------------------------------*
      *                  * Scrittura effettiva                         *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "snx-slc"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      01                   to   s-car                  .
           move      "S"                  to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       esp-arc-sdb-250.
      *              *-------------------------------------------------*
      *              * Richiamo del programma di interrogazione        *
      *              *-------------------------------------------------*
           move      "pgm/gep/prg/obj/pgep3010"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
       esp-arc-sdb-300.
      *              *-------------------------------------------------*
      *              * Cancellazione del programma di interrogazione   *
      *              *-------------------------------------------------*
           cancel    s-pat                                            .
       esp-arc-sdb-350.
      *              *-------------------------------------------------*
      *              * Determinazione selezione avvenuta               *
      *              *-------------------------------------------------*
       esp-arc-sdb-355.
      *                  *---------------------------------------------*
      *                  * Se non era ammessa la selezioone : uscita   *
      *                  *---------------------------------------------*
           if        w-esp-arc-sdb-sns    not  = "S"
                     go to esp-arc-sdb-999.
       esp-arc-sdb-360.
      *                  *---------------------------------------------*
      *                  * Lettura variabile di i.p.c. 'num-sdb' dal   *
      *                  * livello successivo per numero scadenza se-  *
      *                  * lezionato                                   *
      *                  *---------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "num-sdb"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito della let-  *
      *                  * tura                                        *
      *                  *---------------------------------------------*
           if        s-ves                =    spaces
                     go to esp-arc-sdb-365
           else      go to esp-arc-sdb-370.
       esp-arc-sdb-365.
      *                  *---------------------------------------------*
      *                  * Se variabile esistente                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di selezione avvenuta              *
      *                      *-----------------------------------------*
           move      spaces               to   w-esp-arc-sdb-sel      .
      *                      *-----------------------------------------*
      *                      * Numero scadenza selezionata             *
      *                      *-----------------------------------------*
           move      s-num                to   w-esp-arc-sdb-num      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     esp-arc-sdb-999.
       esp-arc-sdb-370.
      *                  *---------------------------------------------*
      *                  * Se variabile non esistente                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     esp-arc-sdb-999.
       esp-arc-sdb-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione di una stampa, in foreground, inclusa in un    *
      *    * programma non dedicato alla sola stampa                   *
      *    *                                                           *
      *    * Prerequisiti :                                            *
      *    *                                                           *
      *    * - Se la stampa prevede un sort, devono esistere :         *
      *    *                                                           *
      *    *   - L'Input-Output Section per il file [srt]              *
      *    *   - La File Section per il file [srt] con il suo record   *
      *    *                                                           *
      *    * - In ogni caso devono esistere in Working-Storage :       *
      *    *                                                           *
      *    *   - L'area di comunicazione per modulo 'mpslct'           *
      *    *   - L'area di comunicazione per modulo 'mbckgx'           *
      *    *   - L'area di comunicazione per modulo 'mmessg'           *
      *    *   - L'area di comunicazione per modulo 'mprint'           *
      *    *                                                           *
      *    *   - La work-area di controllo sub-funzione di stampa      *
      *    *   - La work-area per controllo rotture di livello         *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       stp-frg-inc-000.
      *              *-------------------------------------------------*
      *              * Flag di stampa effettivamente eseguita a : No   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-stp-frg-inc-flg      .
      *              *-------------------------------------------------*
      *              * Open files per sub-funzione di stampa, con u-   *
      *              * scita in caso di errore                         *
      *              *-------------------------------------------------*
           perform   opn-fls-stp-000      thru opn-fls-stp-999        .
           if        w-stp-opn-fls-stp    not  = spaces
                     go to stp-frg-inc-800.
      *              *-------------------------------------------------*
      *              * Preparazione defaults per parametri di selezio- *
      *              * ne stampa                                       *
      *              *-------------------------------------------------*
           perform   pre-prm-stp-000      thru pre-prm-stp-999        .
      *              *-------------------------------------------------*
      *              * Selezione parametri stampa, con uscita in caso  *
      *              * di mancata selezione                            *
      *              *-------------------------------------------------*
           perform   sel-prm-stp-000      thru sel-prm-stp-999        .
           if        w-stp-sel-prm-stp    not  = spaces
                     go to stp-frg-inc-800.
      *              *-------------------------------------------------*
      *              * Inizializzazione rullino messaggi di foreground *
      *              * con uscita in caso di errore                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
            if       m-rsc                not  = spaces
                     go to stp-frg-inc-800.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa, con u-   *
      *              * scita in caso di errore                         *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-stp-let-sel-stp    not  = spaces
                     go to stp-frg-inc-800.
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-srt-stp-000      thru exe-srt-stp-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito           *
      *              *-------------------------------------------------*
           if        w-stp-exe-srt-stp    =    spaces
                     go to stp-frg-inc-400
           else      go to stp-frg-inc-500.
       stp-frg-inc-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     stp-frg-inc-600.
       stp-frg-inc-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     stp-frg-inc-600.
       stp-frg-inc-600.
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       stp-frg-inc-900.
      *              *-------------------------------------------------*
      *              * Visualizzazione eventuali errori di esecuzione  *
      *              *-------------------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "F"                  to   b-tfe                  .
           move      i-ide-des            to   b-chr                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
           cancel    "swd/mod/prg/obj/mbckgv"                         .
       stp-frg-inc-800.
      *              *-------------------------------------------------*
      *              * Close files per sub-funzione di stampa          *
      *              *-------------------------------------------------*
           perform   cls-fls-stp-000      thru cls-fls-stp-999        .
       stp-frg-inc-999.
           exit.

      *    *===========================================================*
      *    *  Selezione parametri stampa, per sub-funzione di stampa   *
      *    *-----------------------------------------------------------*
       sel-prm-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-sel-prm-stp      .
      *              *-------------------------------------------------*
      *              * Preparazione parametri per richiamo selezione   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Informazioni generali da segreteria         *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Codice azienda                          *
      *                      *-----------------------------------------*
           move      s-azi                to   r-env-cod-azi          .
      *                      *-----------------------------------------*
      *                      * Codice terminale                        *
      *                      *-----------------------------------------*
           move      s-ter                to   r-env-cod-ter          .
      *                      *-----------------------------------------*
      *                      * Codice utente                           *
      *                      *-----------------------------------------*
           move      s-ute                to   r-env-cod-ute          .
      *                      *-----------------------------------------*
      *                      * Date and time da segreteria             *
      *                      *-----------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Date and time                           *
      *                      *-----------------------------------------*
           move      s-sdt                to   r-env-dat-tim          .
      *                  *---------------------------------------------*
      *                  * Informazioni da identificazione programma   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Sistema applicativo                     *
      *                      *-----------------------------------------*
           move      i-ide-sap            to   r-ide-sis-app          .
      *                      *-----------------------------------------*
      *                      * Area gestionale                         *
      *                      *-----------------------------------------*
           move      i-ide-arg            to   r-ide-are-ges          .
      *                      *-----------------------------------------*
      *                      * Settore gestionale                      *
      *                      *-----------------------------------------*
           move      i-ide-set            to   r-ide-set-ges          .
      *                      *-----------------------------------------*
      *                      * Fase gestionale                         *
      *                      *-----------------------------------------*
           move      i-ide-fas            to   r-ide-fas-ges          .
      *                  *---------------------------------------------*
      *                  * Informazioni da preparazione param. stampa  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flags di tipo selezione                 *
      *                      *-----------------------------------------*
           move      w-stp-stp-tip-sel    to   r-fix-tip-sel          .
      *                      *-----------------------------------------*
      *                      * Codice stampante                        *
      *                      *-----------------------------------------*
           move      w-stp-stp-cod-stp    to   r-fix-cod-stp          .
      *                      *-----------------------------------------*
      *                      * Tipo di stampa                          *
      *                      *-----------------------------------------*
           move      w-stp-stp-tip-sta    to   r-fix-tip-sta          .
      *                      *-----------------------------------------*
      *                      * Codice modulo                           *
      *                      *-----------------------------------------*
           move      w-stp-stp-cod-mod    to   r-fix-cod-mod          .
      *                      *-----------------------------------------*
      *                      * Tipo modulo                             *
      *                      *-----------------------------------------*
           move      w-stp-stp-tip-mod    to   r-fix-tip-mod          .
      *                      *-----------------------------------------*
      *                      * Ampiezza linea di stampa in caratteri   *
      *                      *-----------------------------------------*
           move      w-stp-stp-amp-lin    to   r-fix-amp-lin          .
      *                      *-----------------------------------------*
      *                      * Top margin in linee                     *
      *                      *-----------------------------------------*
           move      w-stp-stp-top-lin    to   r-fix-top-lin          .
      *                      *-----------------------------------------*
      *                      * Numero linee di stampa minimo           *
      *                      *-----------------------------------------*
           move      w-stp-stp-lin-min    to   r-fix-lin-min          .
      *                      *-----------------------------------------*
      *                      * Bottom margin in linee                  *
      *                      *-----------------------------------------*
           move      w-stp-stp-bot-lin    to   r-fix-bot-lin          .
      *                      *-----------------------------------------*
      *                      * Ampiezza caratteri                      *
      *                      *-----------------------------------------*
           move      w-stp-stp-amp-car    to   r-fix-amp-car          .
      *                      *-----------------------------------------*
      *                      * Altezza interlinea                      *
      *                      *-----------------------------------------*
           move      w-stp-stp-alt-int    to   r-fix-alt-int          .
      *                      *-----------------------------------------*
      *                      * Area riservata per espansioni future    *
      *                      *-----------------------------------------*
           move      w-stp-stp-esp-fut    to   r-fix-esp-fut          .
      *                      *-----------------------------------------*
      *                      * Area riservata per funzioni speciali    *
      *                      *-----------------------------------------*
           move      w-stp-stp-fnz-spc    to   r-fix-fnz-spc          .
      *              *-------------------------------------------------*
      *              * Richiamo modulo di selezione stampa             *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mpslct"
                                         using r                      .
           cancel    "swd/mod/prg/obj/mpslct"                         .
      *              *-------------------------------------------------*
      *              * Status di uscita                                *
      *              *-------------------------------------------------*
           if        r-rsc                not  = spaces
                     move  "#"            to   w-stp-sel-prm-stp      .
       sel-prm-stp-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria, per  *
      *    *sub-funzione di stampa                                     *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-stp-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-stp-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-stp-stu-num-seg    to   w-stp-stu-pnt-stu      .
           multiply  80                   by   w-stp-stu-pnt-stu      .
           subtract  79                   from w-stp-stu-pnt-stu      .
           move      w-stp-stu-pnt-stu    to   w-stp-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-stp-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-stp-stu-pnt-stu    not  = w-stp-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program, per sub-funzione di stampa       *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-mrk-uno      .
           move      spaces               to   w-stp-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-stp-prn-flg-sub    not  = spaces
                     move   spaces        to   w-stp-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-stp-prn-sav-l05      .
           move      w-rot-l04            to   w-stp-prn-sav-l04      .
           move      w-rot-l03            to   w-stp-prn-sav-l03      .
           move      w-rot-l02            to   w-stp-prn-sav-l02      .
           move      w-rot-l01            to   w-stp-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-stp-prn-flg-sub    not  = spaces
                     move   spaces        to   w-stp-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-stp-prn-flg-sub    not  = spaces
                     move   spaces        to   w-stp-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-stp-prn-flg-sub    not  = spaces
                     move   spaces        to   w-stp-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-stp-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se primo passaggio                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Begin                                       *
      *                  *---------------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                  *---------------------------------------------*
      *                  * Marker di Begin eseguito                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-stp-prn-mrk-beg      .
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-stp-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-stp-prn-sav-rot      .
           move      w-stp-prn-sav-l05    to   w-rot-l05              .
           move      w-stp-prn-sav-l04    to   w-rot-l04              .
           move      w-stp-prn-sav-l03    to   w-rot-l03              .
           move      w-stp-prn-sav-l02    to   w-rot-l02              .
           move      w-stp-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-stp-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-stp-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-stp-prn-sav-rot      .
           move      w-stp-prn-sav-l04    to   w-rot-l04              .
           move      w-stp-prn-sav-l03    to   w-rot-l03              .
           move      w-stp-prn-sav-l02    to   w-rot-l02              .
           move      w-stp-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-stp-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-stp-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-stp-prn-sav-rot      .
           move      w-stp-prn-sav-l03    to   w-rot-l03              .
           move      w-stp-prn-sav-l02    to   w-rot-l02              .
           move      w-stp-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-stp-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-stp-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-stp-prn-sav-rot      .
           move      w-stp-prn-sav-l02    to   w-rot-l02              .
           move      w-stp-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-stp-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-stp-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-stp-prn-sav-rot      .
           move      w-stp-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-stp-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Flag di stampa effettivamente eseguita a : Si'  *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-frg-inc-flg      .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-stp-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-stp-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elabo-  *
      *              * rare                                            *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-stp-tit-des-azi      .
           move      40                   to   w-stp-tit-ctr-azi      .
       int-pag-std-100.
           if        w-stp-tit-chr-azi
                    (w-stp-tit-ctr-azi)   =    spaces
                     if     w-stp-tit-ctr-azi
                                          >    1
                            subtract  1   from w-stp-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-stp-tit-ctr-tit      .
       int-pag-std-200.
           if        w-stp-tit-chr-tit
                    (w-stp-tit-ctr-tit)   =    spaces
                     if     w-stp-tit-ctr-tit
                                          >    1
                            subtract  1   from w-stp-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-stp-tit-pos-tit      .
           subtract  w-stp-tit-ctr-tit    from w-stp-tit-pos-tit      .
           divide    2                    into w-stp-tit-pos-tit      .
           add       1                    to   w-stp-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-stp-tit-num-pag    =    zero
                     move  4              to   w-stp-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-stp-tit-ctr-wrk      .
           inspect   w-stp-tit-num-pag
                                      tallying w-stp-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-stp-tit-ctr-wrk    from 27
                                        giving w-stp-tit-ctr-dep      .
           subtract  w-stp-tit-ctr-wrk    from 5
                                        giving w-stp-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-stp-tit-pos-dep      .
           subtract  w-stp-tit-ctr-dep    from w-stp-tit-pos-dep      .
           add       1                    to   w-stp-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-stp-tit-ctr-azi    to   w-stp-tit-ctr-wrk      .
           add       2                    to   w-stp-tit-ctr-wrk      .
           if        w-stp-tit-ctr-wrk    not  < w-stp-tit-pos-tit
                     move  2              to   w-stp-tit-num-lin
                     go to int-pag-std-500.
           move      w-stp-tit-pos-tit    to   w-stp-tit-ctr-wrk      .
           add       w-stp-tit-ctr-tit    to   w-stp-tit-ctr-wrk      .
           add       1                    to   w-stp-tit-ctr-wrk      .
           if        w-stp-tit-ctr-wrk    not  < w-stp-tit-pos-dep
                     move  2              to   w-stp-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-stp-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-stp-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-stp-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-stp-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-stp-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-stp-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-tit-pos-tit    to   p-pos                  .
           move      w-stp-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-stp-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-stp-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-stp-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-stp-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-stp-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-tit-pos-tit    to   p-pos                  .
           move      w-stp-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Open files per sub-funzione di stampa                     *
      *    *-----------------------------------------------------------*
       opn-fls-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-opn-fls-stp      .
       opn-fls-stp-999.
           exit.

      *    *===========================================================*
      *    * Close files per sub-funzione di stampa                    *
      *    *-----------------------------------------------------------*
       cls-fls-stp-000.
       cls-fls-stp-999.
           exit.

      *    *===========================================================*
      *    * Preparazione parametri per selezione stampa               *
      *    *-----------------------------------------------------------*
       pre-prm-stp-000.
      *              *-------------------------------------------------*
      *              * Flags di tipo selezione                         *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-stp-tip-sel      .
      *              *-------------------------------------------------*
      *              * Codice stampante                                *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-stp-cod-stp      .
      *              *-------------------------------------------------*
      *              * Tipo di stampa                                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-stp-tip-sta      .
      *              *-------------------------------------------------*
      *              * Codice modulo                                   *
      *              *-------------------------------------------------*
           move      "ricban  "           to   w-stp-stp-cod-mod      .
      *              *-------------------------------------------------*
      *              * Tipo modulo                                     *
      *              *   - L : Libero                                  *
      *              *   - T : Tipografico                             *
      *              *-------------------------------------------------*
           move      "T"                  to   w-stp-stp-tip-mod      .
      *              *-------------------------------------------------*
      *              * Ampiezza linea di stampa in caratteri           *
      *              *-------------------------------------------------*
           move      100                  to   w-stp-stp-amp-lin      .
      *              *-------------------------------------------------*
      *              * Top margin in linee                             *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-stp-top-lin      .
      *              *-------------------------------------------------*
      *              * Numero linee di stampa minimo                   *
      *              *-------------------------------------------------*
           move      24                   to   w-stp-stp-lin-min      .
      *              *-------------------------------------------------*
      *              * Bottom margin in linee                          *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-stp-bot-lin      .
      *              *-------------------------------------------------*
      *              * Ampiezza caratteri                              *
      *              *-------------------------------------------------*
           move      12                   to   w-stp-stp-amp-car      .
      *              *-------------------------------------------------*
      *              * Altezza interlinea                              *
      *              *-------------------------------------------------*
           move      06                   to   w-stp-stp-alt-int      .
      *              *-------------------------------------------------*
      *              * Area riservata per espansioni future            *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-stp-esp-fut      .
      *              *-------------------------------------------------*
      *              * Area riservata per espansioni speciali          *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-stp-fnz-spc      .
       pre-prm-stp-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare per sub-funzione di stampa    *
      *    *-----------------------------------------------------------*
       exe-srt-stp-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : No                    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-exe-srt-stp      .
       exe-srt-stp-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort per sub-funzione di stampa       *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Normalizzazione flag per controllo ciclo stampa *
      *              * standard                                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-sta-eff-flg-uno      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessun effetto a fronte distinta da stampare !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Test su flag per controllo ciclo stampa stan-   *
      *              * dard                                            *
      *              *-------------------------------------------------*
           if        w-sta-eff-flg-uno    =    spaces
                     move  "#"            to   w-sta-eff-flg-uno
           else      move  "#"            to   w-stp-prn-flg-sub      .
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Salvataggio area w-rig                          *
      *              *-------------------------------------------------*
           move      w-rig                to   w-sav-wrk-rig          .
      *              *-------------------------------------------------*
      *              * Salvataggio area catena                         *
      *              *-------------------------------------------------*
           move      w-cat-rig            to   w-sav-cat-rig          .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni portafoglio S.I.A.    *
      *              *-------------------------------------------------*
           perform   prs-gep-sia-000      thru prs-gep-sia-999        .
      *              *-------------------------------------------------*
      *              * Caricamento iniziale tabella per calcolo spese  *
      *              * bollo                                           *
      *              *-------------------------------------------------*
           perform   spe-bol-loa-000      thru spe-bol-loa-999        .
       prn-liv-det-100.
      *              *-------------------------------------------------*
      *              * Ciclo di stampa per ogni scadenza               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Start su catena per primo movimento         *
      *                  *---------------------------------------------*
           move      "ST"                 to   w-cat-rig-ope          .
           move      1                    to   w-cat-rig-num          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
       prn-liv-det-200.
      *                  *---------------------------------------------*
      *                  * Lettura sequenziale catena                  *
      *                  *---------------------------------------------*
           move      "RN"                 to   w-cat-rig-ope          .
           perform   cll-sub-cat-000      thru cll-sub-cat-999        .
      *                  *---------------------------------------------*
      *                  * Se fine catena : a fine stampa              *
      *                  *---------------------------------------------*
           if        w-cat-rig-exs        not  = spaces
                     go to prn-liv-det-600.
      *                  *---------------------------------------------*
      *                  * Incremento numero effetti letti             *
      *                  *---------------------------------------------*
           add       1                    to   w-sta-eff-tot-let      .
      *                  *---------------------------------------------*
      *                  * Movimento da buffer catena a w-rig          *
      *                  *---------------------------------------------*
           move      w-cat-rig-buf        to   w-rig                  .
       prn-liv-det-300.
      *                  *---------------------------------------------*
      *                  * Selezione su scadenza letta                 *
      *                  *---------------------------------------------*
       prn-liv-det-310.
      *                      *-----------------------------------------*
      *                      * Se la scadenza letta non e' ne' una ri- *
      *                      * cevuta bancaria, ne' una tratta non si  *
      *                      * esegue la stampa, e si incrementa il    *
      *                      * numero di effetti non stampati          *
      *                      *-----------------------------------------*
           if        w-rig-tip-sdb (1)    not  = 09 and
                     w-rig-tip-sdb (1)    not  = 10
                     add   1              to   w-sta-eff-tot-nst
                     go to prn-liv-det-200.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del tipo di sele-  *
      *                      * zione effetti da stampare               *
      *                      *-----------------------------------------*
           if        w-tes-sce-tse (1)    =    02
                     go to prn-liv-det-320
           else      go to prn-liv-det-330.
       prn-liv-det-320.
      *                      *-----------------------------------------*
      *                      * Se tipo di selezione effetti da stampa- *
      *                      * re manuale                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se la scadenza e' stata selezionata *
      *                          * per la stampa si va' a stamparla,   *
      *                          * altrimenti non la si seleziona e si *
      *                          * incrementa il numero di effetti non *
      *                          * stampati                            *
      *                          *-------------------------------------*
           if        w-rig-sce-sns (1)    =    "S"
                     go to prn-liv-det-400
           else      add   1              to   w-sta-eff-tot-nst
                     go to prn-liv-det-200.
       prn-liv-det-330.
      *                      *-----------------------------------------*
      *                      * Se tipo di selezione effetti da stampa- *
      *                      * re non manuale                          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se stampa delle sole scadenze mai   *
      *                          * stampate finora e flag/contatore    *
      *                          * per le stampe eseguite sulla sca-   *
      *                          * denza diverso da zero : non si se-  *
      *                          * leziona la scadenza e si incremen-  *
      *                          * ta il numero di effetti non stam-   *
      *                          * pati                                *
      *                          *-------------------------------------*
           if        w-tes-sce-tse (1)    =    01 and
                     w-rig-flc-stp (1)    not  = zero
                     add   1              to   w-sta-eff-tot-nst
                     go to prn-liv-det-200.
      *                          *-------------------------------------*
      *                          * Se la scadenza e' di tipo tale per  *
      *                          * cui e' stata richiesta la stampa si *
      *                          * va' a stamparla, altrimenti non la  *
      *                          * si seleziona e si incrementa il     *
      *                          * numero di effetti non stampati      *
      *                          *-------------------------------------*
           if        w-rig-tip-sdb (1)    =    09  and
                     w-tes-sce-srb (1)    =    "S"
                     go to prn-liv-det-400.
           if        w-rig-tip-sdb (1)    =    10  and
                     w-tes-sce-str (1)    =    "S"
                     go to prn-liv-det-400.
           add       1                    to   w-sta-eff-tot-nst      .
           go to     prn-liv-det-200.
       prn-liv-det-400.
      *                  *---------------------------------------------*
      *                  * Stampa effetto selezionato                  *
      *                  *---------------------------------------------*
           perform   sta-eff-sel-000      thru sta-eff-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se flag di interruzione stampa in On : u-   *
      *                  * scita                                       *
      *                  *---------------------------------------------*
           if        w-stp-prn-flg-int    not  = spaces
                     go to prn-liv-det-600.
      *                  *---------------------------------------------*
      *                  * Se effetto mai stampato finora si incre-    *
      *                  * menta il numero di effetti stampati per la  *
      *                  * prima volta, altrimenti si incrementa il    *
      *                  * numero di effetti ristampati                *
      *                  *---------------------------------------------*
           if        w-rig-flc-stp (1)    =    zero
                     add   1              to   w-sta-eff-tot-stp
           else      add   1              to   w-sta-eff-tot-ris      .
      *                  *---------------------------------------------*
      *                  * Aggiornamento flag/contatore di stampa su   *
      *                  * effetto selezionato e stampato              *
      *                  *---------------------------------------------*
           perform   agg-eff-sel-000      thru agg-eff-sel-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo per riga successiva                 *
      *                  *---------------------------------------------*
           go to     prn-liv-det-200.
       prn-liv-det-600.
      *              *-------------------------------------------------*
      *              * Ripristino area w-rig                           *
      *              *-------------------------------------------------*
           move      w-sav-wrk-rig        to   w-rig                  .
      *              *-------------------------------------------------*
      *              * Ripristino area catena                          *
      *              *-------------------------------------------------*
           move      w-sav-cat-rig        to   w-cat-rig              .
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Stampa effetto selezionato                                *
      *    *-----------------------------------------------------------*
       sta-eff-sel-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo effetto           *
      *              *-------------------------------------------------*
           if        w-rig-tip-sdb (1)    =    09
                     go to sta-eff-sel-200
           else if   w-rig-tip-sdb (1)    =    10
                     go to sta-eff-sel-400
           else      go to sta-eff-sel-600.
       sta-eff-sel-200.
      *              *-------------------------------------------------*
      *              * Se tipo effetto : 09                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Stampa ricevuta bancaria                    *
      *                  *---------------------------------------------*
           perform   sta-eff-rbx-000      thru sta-eff-rbx-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     sta-eff-sel-999.
       sta-eff-sel-400.
      *              *-------------------------------------------------*
      *              * Se tipo effetto : 10                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Stampa tratta                               *
      *                  *---------------------------------------------*
           perform   sta-eff-trx-000      thru sta-eff-trx-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     sta-eff-sel-999.
       sta-eff-sel-600.
      *              *-------------------------------------------------*
      *              * Se tipo effetto ne' 09 ne' 10                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna stampa                  *
      *                  *---------------------------------------------*
           go to     sta-eff-sel-999.
       sta-eff-sel-999.
           exit.

      *    *===========================================================*
      *    * Stampa ricevuta bancaria                                  *
      *    *-----------------------------------------------------------*
       sta-eff-rbx-000.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Se errore di i-o su stampa : uscita con flag di *
      *              * interruzione forzata                            *
      *              *-------------------------------------------------*
           if        p-rsc                not  = spaces
                     move  "#"            to   w-stp-prn-flg-int
                     go to sta-eff-rbx-999.
       sta-eff-rbx-100.
      *              *-------------------------------------------------*
      *              * Nostra intestazione                             *
      *              *-------------------------------------------------*
       sta-eff-rbx-110.
      *                  *---------------------------------------------*
      *                  * Se non ne e' stata richiesta la stampa la   *
      *                  * si omette                                   *
      *                  *---------------------------------------------*
           if        w-tes-sce-sni (1)    not  = "S"
                     go to sta-eff-rbx-200.
       sta-eff-rbx-120.
      *                  *---------------------------------------------*
      *                  * Dati S.I.A. : parte 1                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      03                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      24                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      006                  to   p-pos                  .
           move      w-prs-sia-daz-001    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-130.
      *                  *---------------------------------------------*
      *                  * Dati S.I.A. : parte 2                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      05                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      24                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      006                  to   p-pos                  .
           move      w-prs-sia-daz-002    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-140.
      *                  *---------------------------------------------*
      *                  * Dati S.I.A. : parte 3                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      07                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      24                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      006                  to   p-pos                  .
           move      w-prs-sia-daz-003    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-150.
      *                  *---------------------------------------------*
      *                  * Dati S.I.A. : parte 4                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      09                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      24                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      006                  to   p-pos                  .
           move      w-prs-sia-daz-004    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-200.
      *              *-------------------------------------------------*
      *              * Data scadenza                                   *
      *              *-------------------------------------------------*
       sta-eff-rbx-210.
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale fisso              *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      03                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-220.
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           if        w-rig-dts-sdb (1)    =    zero
                     go to sta-eff-rbx-222
           else      go to sta-eff-rbx-224.
       sta-eff-rbx-222.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      067                  to   p-pos                  .
           move      " A vista"           to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           go to     sta-eff-rbx-250.
       sta-eff-rbx-224.
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      067                  to   p-pos                  .
           move      w-rig-dts-sdb (1)    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           go to     sta-eff-rbx-250.
       sta-eff-rbx-250.
      *              *-------------------------------------------------*
      *              * Importo scadenza                                *
      *              *-------------------------------------------------*
       sta-eff-rbx-260.
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale fisso              *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      03                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-270.
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
       sta-eff-rbx-272.
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      w-rig-imp-sdb (1)    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-274.
      *                      *-----------------------------------------*
      *                      * Caratteri di sicurezza iniziali         *
      *                      *-----------------------------------------*
           inspect   p-edt   replacing leading spaces
                                          by   "="                    .
       sta-eff-rbx-276.
      *                      *-----------------------------------------*
      *                      * Stampa effettiva                        *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      085                  to   p-pos                  .
           move      p-edt                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-278.
      *                  *---------------------------------------------*
      *                  * Caratteri di sicurezza finali               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      099                  to   p-pos                  .
           move      "="                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-300.
      *              *-------------------------------------------------*
      *              * Importo in lettere                              *
      *              *-------------------------------------------------*
       sta-eff-rbx-310.
      *                  *---------------------------------------------*
      *                  * Decodifica importo scadenza in lettere con  *
      *                  * bufferizzazione in area definita per i due  *
      *                  * tronconi, da 43 e da 66 caratteri           *
      *                  *---------------------------------------------*
           move      w-rig-imp-sdb (1)    to   w-cif-let-imp          .
           perform   cif-let-imp-000      thru cif-let-imp-999        .
           move      w-cif-let-let        to   w-sta-eff-cfl          .
       sta-eff-rbx-320.
      *                  *---------------------------------------------*
      *                  * 1. troncone                                 *
      *                  *---------------------------------------------*
       sta-eff-rbx-322.
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      06                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-324.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      43                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      058                  to   p-pos                  .
           move      w-sta-eff-cfl-001    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-326.
      *                      *-----------------------------------------*
      *                      * Se secondo troncone a non-spaces si po- *
      *                      * ne il carattere di continuazione al po- *
      *                      * sto dell'ultimo carattere               *
      *                      *-----------------------------------------*
           if        w-sta-eff-cfl-002    =    spaces
                     go to sta-eff-rbx-330.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      100                  to   p-pos                  .
           move      "-"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-330.
      *                  *---------------------------------------------*
      *                  * 2. troncone                                 *
      *                  *---------------------------------------------*
       sta-eff-rbx-332.
      *                      *-----------------------------------------*
      *                      * Se completamente a spaces non lo si     *
      *                      * stampa                                  *
      *                      *-----------------------------------------*
           if        w-sta-eff-cfl-002    =    spaces
                     go to sta-eff-rbx-350.
       sta-eff-rbx-334.
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      07                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-336.
      *                      *-----------------------------------------*
      *                      * Stampa ultimo carattere del troncone 1. *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      035                  to   p-pos                  .
           move      w-sta-eff-cfl-043    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-338.
      *                      *-----------------------------------------*
      *                      * Stampa 2. troncone                      *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      65                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      036                  to   p-pos                  .
           move      w-sta-eff-cfl-002    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-350.
      *              *-------------------------------------------------*
      *              * Banca di presentazione                          *
      *              *-------------------------------------------------*
       sta-eff-rbx-360.
      *                  *---------------------------------------------*
      *                  * Se non ne e' stata richiesta la stampa la   *
      *                  * si omette                                   *
      *                  *---------------------------------------------*
           if        w-tes-sce-sbp (1)    not  = "S"
                     go to sta-eff-rbx-400.
       sta-eff-rbx-370.
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale fisso              *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      09                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      050                  to   p-pos                  .
           move      w-tes-cod-cbp-des (1)
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-400.
      *              *-------------------------------------------------*
      *              * Documento di riferimento                        *
      *              *-------------------------------------------------*
       sta-eff-rbx-410.
      *                  *---------------------------------------------*
      *                  * Se non c'e' la data del documento di rife-  *
      *                  * rimento : nessun valore per il documento di *
      *                  * riferimento                                 *
      *                  *---------------------------------------------*
           if        w-rig-dat-ddr (1)    =    zero
                     go to sta-eff-rbx-500.
      *                  *---------------------------------------------*
      *                  * Se il documento di riferimento non e' una   *
      *                  * fattura : nessun valore per il documento di *
      *                  * riferimento                                 *
      *                  *---------------------------------------------*
           if        w-rig-tip-ddr (1)    not  = 01
                     go to sta-eff-rbx-500.
       sta-eff-rbx-420.
      *                  *---------------------------------------------*
      *                  * Se la scadenza e' stata emessa sicuramente  *
      *                  * a saldo fattura si annulla la dicitura 'In  *
      *                  * conto', in caso contrario si annulla la di- *
      *                  * citura 'A saldo'.                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test di controllo                       *
      *                      *-----------------------------------------*
           if        w-rig-imp-ddr (1)    =    w-rig-imp-sdb (1)
                     go to sta-eff-rbx-425
           else      go to sta-eff-rbx-430.
       sta-eff-rbx-425.
      *                      *-----------------------------------------*
      *                      * Annullamento dicitura 'In conto', in    *
      *                      * quanto scadenza a saldo                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale fisso      *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      11                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      035                  to   p-pos                  .
           move      "xxxxx"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Continuazione                       *
      *                          *-------------------------------------*
           go to     sta-eff-rbx-440.
       sta-eff-rbx-430.
      *                      *-----------------------------------------*
      *                      * Annullamento dicitura 'A saldo', in     *
      *                      * quanto scadenza in conto                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale fisso      *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      10                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      035                  to   p-pos                  .
           move      "xxxxx"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Continuazione                       *
      *                          *-------------------------------------*
           go to     sta-eff-rbx-440.
       sta-eff-rbx-440.
      *                  *---------------------------------------------*
      *                  * Literal fissi                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      11                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      044                  to   p-pos                  .
           move      "a"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      054                  to   p-pos                  .
           move      "a"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-450.
      *                  *---------------------------------------------*
      *                  * Numero documento di riferimento             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      11                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      058                  to   p-pos                  .
           move      w-rig-num-ddr (1)    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-460.
      *                  *---------------------------------------------*
      *                  * Data documento di riferimento               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      11                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      075                  to   p-pos                  .
           move      w-rig-dat-ddr (1)    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-470.
      *                  *---------------------------------------------*
      *                  * Importo documento di riferimento            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      11                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      spaces               to   p-sgn                  .
           if        w-rig-imp-ddr (1)    >    999999999 or
                     w-rig-imp-ddr (1)    <   -999999999
                     move  "<"            to   p-edm
           else      move  "<G"           to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      090                  to   p-pos                  .
           move      w-rig-imp-ddr (1)    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-500.
      *              *-------------------------------------------------*
      *              * Riferimenti interni                             *
      *              *-------------------------------------------------*
       sta-eff-rbx-510.
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale fisso              *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      12                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-520.
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
       sta-eff-rbx-522.
      *                      *-----------------------------------------*
      *                      * Editing numero scadenza                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "P"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      "<"                  to   p-edm                  .
           move      w-rig-num-sdb (1)    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-sta-eff-rif-nse      .
       sta-eff-rbx-524.
      *                      *-----------------------------------------*
      *                      * Calcolo spese bollo                     *
      *                      *-----------------------------------------*
           move      w-rig-tip-sdb (1)    to   w-spe-bol-tip-sdb      .
           move      w-rig-imp-sdb (1)    to   w-spe-bol-imp-sdb      .
           perform   spe-bol-sdb-000      thru spe-bol-sdb-999        .
       sta-eff-rbx-526.
      *                      *-----------------------------------------*
      *                      * Editing spese bollo                     *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-spe-bol-spe-bol    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-sta-eff-rif-sbe      .
       sta-eff-rbx-528.
      *                      *-----------------------------------------*
      *                      * Preparazione area per riferimenti com-  *
      *                      * pleta                                   *
      *                      *-----------------------------------------*
           if        w-sta-eff-rif-sbe    =    spaces
                     go to sta-eff-rbx-530
           else      go to sta-eff-rbx-532.
       sta-eff-rbx-530.
           string    "Ns.rif.:"
                                delimited by   size
                     w-sta-eff-rif-nse
                                delimited by   spaces
                                          into w-sta-eff-rif-com      .
           go to     sta-eff-rbx-534.
       sta-eff-rbx-532.
           string    "Ns.rif.:"
                                delimited by   size
                     w-sta-eff-rif-nse
                                delimited by   spaces
                     "-"
                                delimited by   size
                     w-sta-eff-rif-sbe
                                delimited by   spaces
                                          into w-sta-eff-rif-com      .
           go to     sta-eff-rbx-534.
       sta-eff-rbx-534.
      *                      *-----------------------------------------*
      *                      * Stampa riferimenti completi             *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      035                  to   p-pos                  .
           move      w-sta-eff-rif-com    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-600.
      *              *-------------------------------------------------*
      *              * Codice e denominazione ABI                      *
      *              *-------------------------------------------------*
       sta-eff-rbx-610.
      *                  *---------------------------------------------*
      *                  * Se codice ABI a zero : nessun valore ABI    *
      *                  *---------------------------------------------*
           if        w-rig-abi-app (1)    =    zero
                     go to sta-eff-rbx-700.
       sta-eff-rbx-620.
      *                  *---------------------------------------------*
      *                  * Codice ABI                                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      15                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa codice ABI                       *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      004                  to   p-pos                  .
           move      w-rig-abi-app (1)    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa due punti di indicazione         *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      010                  to   p-pos                  .
           move      ":"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-630.
      *                  *---------------------------------------------*
      *                  * Denominazione ABI                           *
      *                  *---------------------------------------------*
       sta-eff-rbx-640.
      *                      *-----------------------------------------*
      *                      * Lettura codice ABI in archivio istituti *
      *                      * di credito                              *
      *                      *-----------------------------------------*
           move      w-rig-abi-app (1)    to   w-let-arc-axi-cod      .
           perform   let-arc-axi-000      thru let-arc-axi-999        .
      *                      *-----------------------------------------*
      *                      * Se record non esistente : no denomina-  *
      *                      * zione ABI                               *
      *                      *-----------------------------------------*
           if        w-let-arc-axi-flg    not  = spaces
                     go to sta-eff-rbx-700.
      *                      *-----------------------------------------*
      *                      * Denominazione in area di comodo per ri- *
      *                      * definizione in due parti di 20 caratte- *
      *                      * ri ciascuna                             *
      *                      *-----------------------------------------*
           move      w-let-arc-axi-den    to   w-sta-eff-abi          .
       sta-eff-rbx-650.
      *                      *-----------------------------------------*
      *                      * Prima parte della denominazione per il  *
      *                      * codice ABI                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale fisso      *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      15                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      012                  to   p-pos                  .
           move      w-sta-eff-abi-001    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-660.
      *                      *-----------------------------------------*
      *                      * Seconda parte della denominazione per   *
      *                      * il codice ABI                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale fisso      *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      16                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      012                  to   p-pos                  .
           move      w-sta-eff-abi-002    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-700.
      *              *-------------------------------------------------*
      *              * Codice e denominazione CAB                      *
      *              *-------------------------------------------------*
       sta-eff-rbx-710.
      *                  *---------------------------------------------*
      *                  * Se codice ABI a zero : nessun valore CAB    *
      *                  *---------------------------------------------*
           if        w-rig-abi-app (1)    =    zero
                     go to sta-eff-rbx-800.
      *                  *---------------------------------------------*
      *                  * Se codice CAB a zero : nessun valore CAB    *
      *                  *---------------------------------------------*
           if        w-rig-cab-app (1)    =    zero
                     go to sta-eff-rbx-800.
       sta-eff-rbx-720.
      *                  *---------------------------------------------*
      *                  * Codice CAB                                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      17                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa codice CAB                       *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      004                  to   p-pos                  .
           move      w-rig-cab-app (1)    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa due punti di indicazione         *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      010                  to   p-pos                  .
           move      ":"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-730.
      *                  *---------------------------------------------*
      *                  * Denominazione CAB                           *
      *                  *---------------------------------------------*
       sta-eff-rbx-740.
      *                      *-----------------------------------------*
      *                      * Lettura codice CAB in archivio sportel- *
      *                      * li degli istituti di credito            *
      *                      *-----------------------------------------*
           move      w-rig-abi-app (1)    to   w-let-arc-axs-abi      .
           move      w-rig-cab-app (1)    to   w-let-arc-axs-cab      .
           perform   let-arc-axs-000      thru let-arc-axs-999        .
      *                      *-----------------------------------------*
      *                      * Se record non esistente : no denomina-  *
      *                      * zione CAB, ne' localita'                *
      *                      *-----------------------------------------*
           if        w-let-arc-axs-flg    not  = spaces
                     go to sta-eff-rbx-800.
      *                      *-----------------------------------------*
      *                      * Denominazione in area di comodo per ri- *
      *                      * definizione in due parti di 20 caratte- *
      *                      * ri ciascuna                             *
      *                      *-----------------------------------------*
           move      w-let-arc-axs-den    to   w-sta-eff-cab          .
       sta-eff-rbx-750.
      *                      *-----------------------------------------*
      *                      * Prima parte della denominazione per il  *
      *                      * codice CAB                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale fisso      *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      17                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      012                  to   p-pos                  .
           move      w-sta-eff-cab-001    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-760.
      *                      *-----------------------------------------*
      *                      * Seconda parte della denominazione per   *
      *                      * il codice CAB                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale fisso      *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      18                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      012                  to   p-pos                  .
           move      w-sta-eff-cab-002    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-770.
      *                      *-----------------------------------------*
      *                      * Localita' per il codice CAB             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale fisso      *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      19                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      28                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      004                  to   p-pos                  .
           move      w-let-arc-axs-loc    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-800.
      *              *-------------------------------------------------*
      *              * Generalita' del debitore                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione e bufferizzazione generali-  *
      *                  * ta' del debitore per l'inoltro              *
      *                  *---------------------------------------------*
           perform   det-gdd-inl-000      thru det-gdd-inl-999        .
       sta-eff-rbx-810.
      *                  *---------------------------------------------*
      *                  * Ragione sociale                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      15                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      040                  to   p-pos                  .
           move      w-sta-eff-deb-rag    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-820.
      *                  *---------------------------------------------*
      *                  * Indirizzo                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      16                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      040                  to   p-pos                  .
           move      w-sta-eff-deb-via    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-830.
      *                  *---------------------------------------------*
      *                  * Localita'                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      19                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      040                  to   p-pos                  .
           move      w-sta-eff-deb-loc    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-eff-rbx-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     sta-eff-rbx-999.
       sta-eff-rbx-999.
           exit.

      *    *===========================================================*
      *    * Stampa tratta                                             *
      *    *-----------------------------------------------------------*
       sta-eff-trx-000.
      *              *-------------------------------------------------*
      *              * Richiamo della stessa routine di stampa che si  *
      *              * esegue per la ricevuta bancaria                 *
      *              *-------------------------------------------------*
           perform   sta-eff-rbx-000      thru sta-eff-rbx-999        .
       sta-eff-trx-999.
           exit.

      *    *===========================================================*
      *    * Determinazione e bufferizzazione generalita' del debitore *
      *    * per l'inoltro                                             *
      *    *-----------------------------------------------------------*
       det-gdd-inl-000.
      *              *-------------------------------------------------*
      *              * Altrimenti si devia a seconda del tipo di inol- *
      *              * tro per la scadenza                             *
      *              *-------------------------------------------------*
           if        w-rig-inl-sdb (1)    =    01
                     go to det-gdd-inl-200
           else if   w-rig-inl-sdb (1)    =    02
                     go to det-gdd-inl-400
           else if   w-rig-inl-sdb (1)    =    03
                     go to det-gdd-inl-600
           else      go to det-gdd-inl-400.
       det-gdd-inl-200.
      *              *-------------------------------------------------*
      *              * Se inoltro alla sede commerciale                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se il tipo debitore indica che non si trat- *
      *                  * ta di un cliente : a lettura da anagrafica  *
      *                  * cliente contabile                           *
      *                  *---------------------------------------------*
           if        w-rig-tip-dbt (1)    >    01
                     go to det-gdd-inl-400.
      *                  *---------------------------------------------*
      *                  * Se codice debitore a zero : a lettura da    *
      *                  * anagrafica cliente contabile                *
      *                  *---------------------------------------------*
           if        w-rig-cod-dbt (1)    =    zero
                     go to det-gdd-inl-400.
      *                  *---------------------------------------------*
      *                  * Lettura da anagrafica cliente commerciale   *
      *                  * per la sede                                 *
      *                  *---------------------------------------------*
           move      "C"                  to   w-let-arc-dcc-tle      .
           move      w-rig-cod-dbt (1)    to   w-let-arc-dcc-cod      .
           move      spaces               to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                  *---------------------------------------------*
      *                  * Se record non trovato : a lettura da ana-   *
      *                  * grafica cliente contabile                   *
      *                  *---------------------------------------------*
           if        w-let-arc-dcc-flg    not  = spaces
                     go to det-gdd-inl-400.
      *                  *---------------------------------------------*
      *                  * Se record trovato                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Spostamento dati                        *
      *                      *-----------------------------------------*
           move      w-let-arc-dcc-rag    to   w-sta-eff-deb-rag      .
           move      w-let-arc-dcc-via    to   w-sta-eff-deb-via      .
           move      w-let-arc-dcc-loc    to   w-sta-eff-deb-loc      .
      *                      *-----------------------------------------*
      *                      * A uscita                                *
      *                      *-----------------------------------------*
           go to     det-gdd-inl-900.
       det-gdd-inl-400.
      *              *-------------------------------------------------*
      *              * Se inoltro alla sede legale                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura da anagrafica cliente contabile     *
      *                  *---------------------------------------------*
           move      w-rig-tip-dbt (1)    to   w-let-arc-dbt-tip      .
           move      w-rig-cod-dbt (1)    to   w-let-arc-dbt-cod      .
           perform   let-arc-dbt-000      thru let-arc-dbt-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se record trovato op-  *
      *                  * pure no                                     *
      *                  *---------------------------------------------*
           if        w-let-arc-dbt-flg    =    spaces
                     go to det-gdd-inl-420
           else      go to det-gdd-inl-440.
       det-gdd-inl-420.
      *                  *---------------------------------------------*
      *                  * Se record trovato                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Spostamento dati                        *
      *                      *-----------------------------------------*
           move      w-let-arc-dbt-rag    to   w-sta-eff-deb-rag      .
           move      w-let-arc-dbt-via    to   w-sta-eff-deb-via      .
           move      w-let-arc-dbt-loc    to   w-sta-eff-deb-loc      .
      *                      *-----------------------------------------*
      *                      * A uscita                                *
      *                      *-----------------------------------------*
           go to     det-gdd-inl-900.
       det-gdd-inl-440.
      *                  *---------------------------------------------*
      *                  * Se record non trovato                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Riempimento con puntini                 *
      *                      *-----------------------------------------*
           move      all   "."            to   w-sta-eff-deb-rag      .
           move      all   "."            to   w-sta-eff-deb-via      .
           move      all   "."            to   w-sta-eff-deb-loc      .
      *                      *-----------------------------------------*
      *                      * A uscita                                *
      *                      *-----------------------------------------*
           go to     det-gdd-inl-900.
       det-gdd-inl-600.
      *              *-------------------------------------------------*
      *              * Se inoltro alla dipendenza                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se il tipo debitore indica che non si trat- *
      *                  * ta di un cliente : a lettura da anagrafica  *
      *                  * cliente contabile                           *
      *                  *---------------------------------------------*
           if        w-rig-tip-dbt (1)    >    01
                     go to det-gdd-inl-400.
      *                  *---------------------------------------------*
      *                  * Se codice debitore a zero : a lettura da    *
      *                  * anagrafica cliente commerciale              *
      *                  *---------------------------------------------*
           if        w-rig-cod-dbt (1)    =    zero
                     go to det-gdd-inl-200.
      *                  *---------------------------------------------*
      *                  * Se codice dipendenza a spaces : a lettura   *
      *                  * anagrafica cliente commerciale              *
      *                  *---------------------------------------------*
           if        w-rig-dpz-dbt (1)    =    spaces
                     go to det-gdd-inl-200.
      *                  *---------------------------------------------*
      *                  * Lettura da anagrafica cliente commerciale   *
      *                  * per la dipendenza                           *
      *                  *---------------------------------------------*
           move      "D"                  to   w-let-arc-dcc-tle      .
           move      w-rig-cod-dbt (1)    to   w-let-arc-dcc-cod      .
           move      w-rig-dpz-dbt (1)    to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                  *---------------------------------------------*
      *                  * Se record non trovato : a lettura da ana-   *
      *                  * grafica cliente commerciale                 *
      *                  *---------------------------------------------*
           if        w-let-arc-dcc-flg    not  = spaces
                     go to det-gdd-inl-200.
      *                  *---------------------------------------------*
      *                  * Se record trovato                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Spostamento dati                        *
      *                      *-----------------------------------------*
           move      w-let-arc-dcc-rag    to   w-sta-eff-deb-rag      .
           move      w-let-arc-dcc-via    to   w-sta-eff-deb-via      .
           move      w-let-arc-dcc-loc    to   w-sta-eff-deb-loc      .
      *                      *-----------------------------------------*
      *                      * A uscita                                *
      *                      *-----------------------------------------*
           go to     det-gdd-inl-900.
       det-gdd-inl-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-gdd-inl-999.
       det-gdd-inl-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento flag/contatore di stampa su effetto sele-   *
      *    * zionato                                                   *
      *    *-----------------------------------------------------------*
       agg-eff-sel-000.
      *              *-------------------------------------------------*
      *              * Lettura record [sdb] con lock                   *
      *              *-------------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "NUMSDB    "         to   f-key                  .
           move      w-rig-num-sdb (1)    to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to agg-eff-sel-200.
       agg-eff-sel-100.
      *              *-------------------------------------------------*
      *              * Se record [sdb] non esistente                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcun aggiornamento            *
      *                  *---------------------------------------------*
           go to     agg-eff-sel-999.
       agg-eff-sel-200.
      *              *-------------------------------------------------*
      *              * Se record [sdb] esistente                       *
      *              *-------------------------------------------------*
       agg-eff-sel-220.
      *                  *---------------------------------------------*
      *                  * Flag/contatore di stampa su carta eseguita  *
      *                  * per la scadenza                             *
      *                  *---------------------------------------------*
           if        rf-sdb-flc-stp       <    99
                     add    1             to   rf-sdb-flc-stp         .
      *                  *---------------------------------------------*
      *                  * Aggiornamento data chiusura scadenza        *
      *                  *---------------------------------------------*
           perform   det-dat-chs-000      thru det-dat-chs-999        .
       agg-eff-sel-240.
      *                  *---------------------------------------------*
      *                  * Update record [sdb]                         *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
       agg-eff-sel-260.
      *                  *---------------------------------------------*
      *                  * Unlock record [sdb]                         *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
       agg-eff-sel-280.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     agg-eff-sel-999.
       agg-eff-sel-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazioni portafoglio S.I.A.              *
      *    *-----------------------------------------------------------*
       prs-gep-sia-000.
      *              *-------------------------------------------------*
      *              * Lettura record personalizzazioni                *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODGEP    "         to   f-key                  .
           move      10                   to   rf-gep-tip-gep         .
           move      "SIA       "         to   rf-gep-cod-gep         .
           move      "pgm/gep/fls/ioc/obj/iofgep"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gep                 .
      *              *-------------------------------------------------*
      *              * Deviazione secondo l'esito della lettura        *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to prs-gep-sia-200
           else      go to prs-gep-sia-400.
       prs-gep-sia-200.
      *              *-------------------------------------------------*
      *              * Se record personalizzazioni esistente           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Dati record in area per ridefinizione delle *
      *                  * personalizzazioni portafoglio S.I.A.        *
      *                  *---------------------------------------------*
           move      rf-gep-dat-rec       to   w-prs-sia-dat-rec      .
      *                  *---------------------------------------------*
      *                  * Eventuali normalizzazioni                   *
      *                  *---------------------------------------------*
           if        w-prs-sia-cda-sia    not  numeric
                     move  zero           to   w-prs-sia-cda-sia      .
           if        w-prs-sia-num-aut    not  numeric
                     move  zero           to   w-prs-sia-num-aut      .
           if        w-prs-sia-dat-aut    not  numeric
                     move  zero           to   w-prs-sia-dat-aut      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prs-gep-sia-999.
       prs-gep-sia-400.
      *              *-------------------------------------------------*
      *              * Se record personalizzazioni non esistente       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione area per ridefinizione del- *
      *                  * le personalizzazioni portafoglio S.I.A.     *
      *                  *---------------------------------------------*
           move      spaces               to   w-prs-sia-daz-001      .
           move      spaces               to   w-prs-sia-daz-002      .
           move      spaces               to   w-prs-sia-daz-003      .
           move      spaces               to   w-prs-sia-daz-004      .
           move      spaces               to   w-prs-sia-fir-emi      .
           move      zero                 to   w-prs-sia-cda-sia      .
           move      spaces               to   w-prs-sia-cor-ndg      .
           move      spaces               to   w-prs-sia-pvc-aut      .
           move      zero                 to   w-prs-sia-num-aut      .
           move      zero                 to   w-prs-sia-dat-aut      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prs-gep-sia-999.
       prs-gep-sia-999.
           exit.

      *    *===========================================================*
      *    * Caricamento iniziale tabella per calcolo spese bollo su   *
      *    * effetti                                                   *
      *    *-----------------------------------------------------------*
       spe-bol-loa-000.
      *              *-------------------------------------------------*
      *              * Open file [zsb]                                 *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofzsb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zsb                 .
       spe-bol-loa-100.
      *              *-------------------------------------------------*
      *              * Caricamento tabella                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione indice per tabella spese   *
      *                  * bollo per tipo scadenza                     *
      *                  *---------------------------------------------*
           move      zero                 to   w-spe-bol-inx-pag      .
       spe-bol-loa-200.
      *                  *---------------------------------------------*
      *                  * Incremento indice per tabella spese bollo   *
      *                  * per tipo scadenza                           *
      *                  *---------------------------------------------*
           add       1                    to   w-spe-bol-inx-pag      .
      *                  *---------------------------------------------*
      *                  * Se oltre il valore massimo : fine carica-   *
      *                  * mento                                       *
      *                  *---------------------------------------------*
           if        w-spe-bol-inx-pag    >    3
                     go to spe-bol-loa-900.
       spe-bol-loa-300.
      *                  *---------------------------------------------*
      *                  * Lettura tabella spese bollo relativa al ti- *
      *                  * po di pagamento corrispondente all'indice   *
      *                  * su tabella                                  *
      *                  *                                             *
      *                  * Indice 01 : Tipo pagamento 09 : Ric. Banc.  *
      *                  * Indice 02 : Tipo pagamento 10 : Tratte      *
      *                  * Indice 03 : Tipo pagamento 11 : Paghero'    *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "TIPPAG    "         to   f-key                  .
           if        w-spe-bol-inx-pag    =    01
                     move  09             to   rf-zsb-tip-pag
           else if   w-spe-bol-inx-pag    =    02
                     move  10             to   rf-zsb-tip-pag
           else if   w-spe-bol-inx-pag    =    03
                     move  11             to   rf-zsb-tip-pag
           else      move  zero           to   rf-zsb-tip-pag         .
           move      "pgm/gep/fls/ioc/obj/iofzsb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zsb                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito della let-  *
      *                  * tura                                        *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to spe-bol-loa-500.
       spe-bol-loa-400.
      *                  *---------------------------------------------*
      *                  * Se record non esistente                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record tabella          *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofzsb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zsb                 .
      *                      *-----------------------------------------*
      *                      * Segnale di elemento non esistente       *
      *                      *-----------------------------------------*
           move      "N"                  to   w-spe-bol-snx-ele
                                              (w-spe-bol-inx-pag)     .
      *                      *-----------------------------------------*
      *                      * A bufferizzazione elemento              *
      *                      *-----------------------------------------*
           go to     spe-bol-loa-600.
       spe-bol-loa-500.
      *                  *---------------------------------------------*
      *                  * Se record esistente                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Segnale di elemento esistente           *
      *                      *-----------------------------------------*
           move      "S"                  to   w-spe-bol-snx-ele
                                              (w-spe-bol-inx-pag)     .
      *                      *-----------------------------------------*
      *                      * A bufferizzazione elemento              *
      *                      *-----------------------------------------*
           go to     spe-bol-loa-600.
       spe-bol-loa-600.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione elemento                    *
      *                  *---------------------------------------------*
       spe-bol-loa-620.
      *                      *-----------------------------------------*
      *                      * Tipo di automatismo per calcolo spesa   *
      *                      *-----------------------------------------*
           move      rf-zsb-tau-spb       to   w-spe-bol-tau-spb
                                              (w-spe-bol-inx-pag)     .
       spe-bol-loa-640.
      *                      *-----------------------------------------*
      *                      * Percentuale per la determinazione delle *
      *                      * spese bollo                             *
      *                      *-----------------------------------------*
           move      rf-zsb-per-spb       to   w-spe-bol-per-spb
                                              (w-spe-bol-inx-pag)     .
       spe-bol-loa-660.
      *                      *-----------------------------------------*
      *                      * Tabella scaglioni                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Inizializzazione indice 1..10       *
      *                          *-------------------------------------*
           move      zero                 to   w-spe-bol-inx-scg      .
       spe-bol-loa-665.
      *                          *-------------------------------------*
      *                          * Incremento indice 1..10             *
      *                          *-------------------------------------*
           add       1                    to   w-spe-bol-inx-scg      .
      *                          *-------------------------------------*
      *                          * Se oltre il massimo : fine scaglio- *
      *                          * ni                                  *
      *                          *-------------------------------------*
           if        w-spe-bol-inx-scg    >    10
                     go to spe-bol-loa-700.
       spe-bol-loa-670.
      *                          *-------------------------------------*
      *                          * Elemento dello scaglione            *
      *                          *-------------------------------------*
       spe-bol-loa-672.
      *                              *---------------------------------*
      *                              * Scaglione                       *
      *                              *---------------------------------*
           move      rf-zsb-tbe-scg
                    (w-spe-bol-inx-scg)   to   w-spe-bol-tbe-scg
                                              (w-spe-bol-inx-pag,
                                               w-spe-bol-inx-scg)     .
       spe-bol-loa-674.
      *                              *---------------------------------*
      *                              * Ammontare sullo scaglione       *
      *                              *---------------------------------*
           move      rf-zsb-tbe-asc
                    (w-spe-bol-inx-scg)   to   w-spe-bol-tbe-asc
                                              (w-spe-bol-inx-pag,
                                               w-spe-bol-inx-scg)     .
       spe-bol-loa-676.
      *                              *---------------------------------*
      *                              * Percentuale sullo scaglione     *
      *                              *---------------------------------*
           move      rf-zsb-tbe-psc
                    (w-spe-bol-inx-scg)   to   w-spe-bol-tbe-psc
                                              (w-spe-bol-inx-pag,
                                               w-spe-bol-inx-scg)     .
       spe-bol-loa-680.
      *                          *-------------------------------------*
      *                          * Ad elemento successivo per lo sca-  *
      *                          * glione                              *
      *                          *-------------------------------------*
           go to     spe-bol-loa-665.
       spe-bol-loa-700.
      *                      *-----------------------------------------*
      *                      * Tetto di esenzione per la spesa         *
      *                      *-----------------------------------------*
           move      rf-zsb-tet-spb       to   w-spe-bol-tet-spb
                                              (w-spe-bol-inx-pag)     .
       spe-bol-loa-720.
      *                      *-----------------------------------------*
      *                      * Valore minimo per la spesa              *
      *                      *-----------------------------------------*
           move      rf-zsb-min-spb       to   w-spe-bol-min-spb
                                              (w-spe-bol-inx-pag)     .
       spe-bol-loa-740.
      *                      *-----------------------------------------*
      *                      * Valore massimo per la spesa             *
      *                      *-----------------------------------------*
           move      rf-zsb-max-spb       to   w-spe-bol-max-spb
                                              (w-spe-bol-inx-pag)     .
       spe-bol-loa-760.
      *                      *-----------------------------------------*
      *                      * Tipo di arrotondamento                  *
      *                      *-----------------------------------------*
           move      rf-zsb-tar-spb       to   w-spe-bol-tar-spb
                                              (w-spe-bol-inx-pag)     .
       spe-bol-loa-780.
      *                      *-----------------------------------------*
      *                      * Valore di arrotondamento                *
      *                      *-----------------------------------------*
           move      rf-zsb-var-spb       to   w-spe-bol-var-spb
                                              (w-spe-bol-inx-pag)     .
       spe-bol-loa-800.
      *                  *---------------------------------------------*
      *                  * Riciclo su elemento di tabella successivo   *
      *                  *---------------------------------------------*
           go to     spe-bol-loa-200.
       spe-bol-loa-900.
      *              *-------------------------------------------------*
      *              * Close file [zsb]                                *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofzsb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zsb                 .
       spe-bol-loa-999.
           exit.

      *    *===========================================================*
      *    * Calcolo totale spese bollo su effetti                     *
      *    *                                                           *
      *    * Input  : w-spe-bol-tip-sdb = tipo scadenza                *
      *    *                              - 01 Ricevuta bancaria       *
      *    *                              - 02 Tratta                  *
      *    *                              - 03 Paghero'                *
      *    *           w-spe-bol-imp-sdb = importo scadenza            *
      *    *                                                           *
      *    * Output : w-spe-bol-spe-bol = importo spese bolle          *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       spe-bol-sdb-000.
      *              *-------------------------------------------------*
      *              * Azzeramento importo spese bollo calcolate       *
      *              *-------------------------------------------------*
           move      zero                 to   w-spe-bol-spe-bol      .
      *              *-------------------------------------------------*
      *              * Se importo scadenza non superiore a zero : u-   *
      *              * scita con importo spese bollo calcolate a zero  *
      *              *-------------------------------------------------*
           if        w-spe-bol-imp-sdb    not  > zero
                     go to spe-bol-sdb-999.
      *              *-------------------------------------------------*
      *              * Determinazione indice per il tipo pagamento su  *
      *              * tabella spese bollo per tipo scadenza           *
      *              *-------------------------------------------------*
           if        w-spe-bol-tip-sdb    =    09
                     move  01             to   w-spe-bol-inx-pag
           else if   w-spe-bol-tip-sdb    =    10
                     move  02             to   w-spe-bol-inx-pag
           else if   w-spe-bol-tip-sdb    =    11
                     move  03             to   w-spe-bol-inx-pag
           else      move  zero           to   w-spe-bol-inx-pag      .
      *              *-------------------------------------------------*
      *              * Se indice non determinabile : uscita con impor- *
      *              * to spese bollo calcolate a zero                 *
      *              *-------------------------------------------------*
           if        w-spe-bol-inx-pag    =    zero
                     go to spe-bol-sdb-999.
      *              *-------------------------------------------------*
      *              * Se elemento non esistente in tabella : uscita   *
      *              * con importo spese bollo calcolate a zero        *
      *              *-------------------------------------------------*
           if        w-spe-bol-snx-ele
                    (w-spe-bol-inx-pag)   not  = "S"
                     go to spe-bol-sdb-999.
      *              *-------------------------------------------------*
      *              * Se l'importo scadenza non e' maggiore del tetto *
      *              * di esenzione : uscita con importo spese bollo   *
      *              * calcolate a zero                                *
      *              *-------------------------------------------------*
           if        w-spe-bol-imp-sdb    not  > w-spe-bol-tet-spb
                                                (w-spe-bol-inx-pag)
                     go to spe-bol-sdb-999.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di automatismo, *
      *              * e se tipo di automatismo non riconosciuto : u-  *
      *              * scita con importo spese bollo calcolate a zero  *
      *              *-------------------------------------------------*
           if        w-spe-bol-tau-spb
                    (w-spe-bol-inx-pag)   =    01
                     go to spe-bol-sdb-100
           else if   w-spe-bol-tau-spb
                    (w-spe-bol-inx-pag)   =    02
                     go to spe-bol-sdb-200
           else if   w-spe-bol-tau-spb
                    (w-spe-bol-inx-pag)   =    03
                     go to spe-bol-sdb-300
           else      go to spe-bol-sdb-999.
       spe-bol-sdb-100.
      *              *-------------------------------------------------*
      *              * Se tipo di automatismo 01 : in percentuale sul  *
      *              * totale scadenza                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione importo spese bollo          *
      *                  *---------------------------------------------*
           multiply  w-spe-bol-per-spb
                    (w-spe-bol-inx-pag)   by   w-spe-bol-imp-sdb
                                        giving w-spe-bol-wrk-s01      .
           divide    100                  into w-spe-bol-wrk-s01
                                        giving w-spe-bol-spe-bol
                                                         rounded      .
      *                  *---------------------------------------------*
      *                  * Ad arrotondamenti                           *
      *                  *---------------------------------------------*
           go to     spe-bol-sdb-500.
       spe-bol-sdb-200.
      *              *-------------------------------------------------*
      *              * Se tipo di automatismo 02 : a scaglioni         *
      *              *-------------------------------------------------*
       spe-bol-sdb-220.
      *                  *---------------------------------------------*
      *                  * Ricerca importo scadenza tra gli scaglioni, *
      *                  * se non trovato : uscita con importo spese   *
      *                  * bollo calcolate a zero                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-spe-bol-inx-scg      .
       spe-bol-sdb-225.
           add       1                    to   w-spe-bol-inx-scg      .
           if        w-spe-bol-inx-scg    >    10
                     go to spe-bol-sdb-999.
           if        w-spe-bol-tbe-scg
                    (w-spe-bol-inx-pag,
                     w-spe-bol-inx-scg)   =    zero
                     go to spe-bol-sdb-225.
           if        w-spe-bol-imp-sdb    >    w-spe-bol-tbe-scg
                                              (w-spe-bol-inx-pag,
                                               w-spe-bol-inx-scg)
                     go to spe-bol-sdb-225.
       spe-bol-sdb-240.
      *                  *---------------------------------------------*
      *                  * Se scaglione trovato si pone l'ammontare    *
      *                  * per lo scaglione come importo spese cal-    *
      *                  * colate                                      *
      *                  *---------------------------------------------*
           move      w-spe-bol-tbe-asc
                    (w-spe-bol-inx-pag,
                     w-spe-bol-inx-scg)   to   w-spe-bol-spe-bol      .
      *                  *---------------------------------------------*
      *                  * E poi ad arrotondamenti                     *
      *                  *---------------------------------------------*
           go to     spe-bol-sdb-500.
       spe-bol-sdb-300.
      *              *-------------------------------------------------*
      *              * Se tipo di automatismo 03 : a scaglioni con     *
      *              *                             percentuale sul-    *
      *              *                             l'eccedenza         *
      *              *-------------------------------------------------*
       spe-bol-sdb-310.
      *                  *---------------------------------------------*
      *                  * Inizializzazione comodo per imponibile spe- *
      *                  * sa decrescente                              *
      *                  *---------------------------------------------*
           move      w-spe-bol-imp-sdb    to   w-spe-bol-ibl-t03      .
      *                  *---------------------------------------------*
      *                  * Inizializzazione indice per scansione della *
      *                  * tabella degli scaglioni                     *
      *                  *---------------------------------------------*
           move      zero                 to   w-spe-bol-inx-scg      .
       spe-bol-sdb-320.
      *                  *---------------------------------------------*
      *                  * Incremento indice per scansione della ta-   *
      *                  * bella degli scaglioni                       *
      *                  *---------------------------------------------*
           add       1                    to   w-spe-bol-inx-scg      .
      *                  *---------------------------------------------*
      *                  * Se fine tabella : ad arrotondamenti         *
      *                  *---------------------------------------------*
           if        w-spe-bol-inx-scg    >    10
                     go to spe-bol-sdb-500.
      *                  *---------------------------------------------*
      *                  * Se scaglione a zero : lo si ignora          *
      *                  *---------------------------------------------*
           if        w-spe-bol-tbe-scg
                    (w-spe-bol-inx-pag,
                     w-spe-bol-inx-scg)   =    zero
                     go to spe-bol-sdb-320.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del confronto tra l'-  *
      *                  * importo scaglione e l'importo del residuo   *
      *                  * decrescente                                 *
      *                  *---------------------------------------------*
           if        w-spe-bol-tbe-scg
                    (w-spe-bol-inx-pag,
                     w-spe-bol-inx-scg)   <    w-spe-bol-ibl-t03
                     go to spe-bol-sdb-330
           else if   w-spe-bol-tbe-scg
                    (w-spe-bol-inx-pag,
                     w-spe-bol-inx-scg)   =    w-spe-bol-ibl-t03
                     go to spe-bol-sdb-340
           else      go to spe-bol-sdb-350.
       spe-bol-sdb-330.
      *                  *---------------------------------------------*
      *                  * Se l'importo scaglione e' minore del resi-  *
      *                  * duo imponibile decrescente                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Calcolo quota spesa bollo relativa allo *
      *                      * scaglione                               *
      *                      *-----------------------------------------*
           multiply  w-spe-bol-tbe-psc
                    (w-spe-bol-inx-pag,
                     w-spe-bol-inx-scg)   by   w-spe-bol-tbe-scg
                                              (w-spe-bol-inx-pag,
                                               w-spe-bol-inx-scg)
                                        giving w-spe-bol-wrk-s01
                                                         rounded      .
           divide    100                  into w-spe-bol-wrk-s01
                                        giving w-spe-bol-wrk-s02
                                                         rounded      .
      *                      *-----------------------------------------*
      *                      * Aggiornamento importo spese bollo cal-  *
      *                      * colate                                  *
      *                      *-----------------------------------------*
           add       w-spe-bol-wrk-s02    to   w-spe-bol-spe-bol      .
      *                      *-----------------------------------------*
      *                      * Aggiornamento importo residuo decre-    *
      *                      * scente                                  *
      *                      *-----------------------------------------*
           subtract  w-spe-bol-tbe-scg
                    (w-spe-bol-inx-pag,
                     w-spe-bol-inx-scg)   from w-spe-bol-ibl-t03      .
      *                      *-----------------------------------------*
      *                      * Riciclo a scaglione successivo          *
      *                      *-----------------------------------------*
           go to     spe-bol-sdb-320.
       spe-bol-sdb-340.
      *                  *---------------------------------------------*
      *                  * Se l'importo scaglione e' uguale al resi-   *
      *                  * duo imponibile decrescente                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Calcolo quota spesa bollo relativa allo *
      *                      * scaglione                               *
      *                      *-----------------------------------------*
           multiply  w-spe-bol-tbe-psc
                    (w-spe-bol-inx-pag,
                     w-spe-bol-inx-scg)   by   w-spe-bol-tbe-scg
                                              (w-spe-bol-inx-pag,
                                               w-spe-bol-inx-scg)
                                        giving w-spe-bol-wrk-s01
                                                         rounded      .
           divide    100                  into w-spe-bol-wrk-s01
                                        giving w-spe-bol-wrk-s02
                                                         rounded      .
      *                      *-----------------------------------------*
      *                      * Aggiornamento importo spese bollo cal-  *
      *                      * colate                                  *
      *                      *-----------------------------------------*
           add       w-spe-bol-wrk-s02    to   w-spe-bol-spe-bol      .
      *                      *-----------------------------------------*
      *                      * Aggiornamento importo residuo decre-    *
      *                      * scente                                  *
      *                      *-----------------------------------------*
           move      zero                 to   w-spe-bol-ibl-t03      .
      *                      *-----------------------------------------*
      *                      * Ad arrotondamenti                       *
      *                      *-----------------------------------------*
           go to     spe-bol-sdb-500.
       spe-bol-sdb-350.
      *                  *---------------------------------------------*
      *                  * Se l'importo scaglione e' maggiore del re-  *
      *                  * siduo imponibile decrescente                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Calcolo quota spesa bollo relativa al   *
      *                      * residuo decrescente                     *
      *                      *-----------------------------------------*
           multiply  w-spe-bol-tbe-psc
                    (w-spe-bol-inx-pag,
                     w-spe-bol-inx-scg)   by   w-spe-bol-ibl-t03
                                        giving w-spe-bol-wrk-s01
                                                         rounded      .
           divide    100                  into w-spe-bol-wrk-s01
                                        giving w-spe-bol-wrk-s02
                                                         rounded      .
      *                      *-----------------------------------------*
      *                      * Aggiornamento importo spese bollo cal-  *
      *                      * colate                                  *
      *                      *-----------------------------------------*
           add       w-spe-bol-wrk-s02    to   w-spe-bol-spe-bol      .
      *                      *-----------------------------------------*
      *                      * Aggiornamento importo residuo decre-    *
      *                      * scente                                  *
      *                      *-----------------------------------------*
           move      zero                 to   w-spe-bol-ibl-t03      .
      *                      *-----------------------------------------*
      *                      * Ad arrotondamenti                       *
      *                      *-----------------------------------------*
           go to     spe-bol-sdb-500.
       spe-bol-sdb-500.
      *              *-------------------------------------------------*
      *              * Arrotondamenti finali                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se importo spesa a zero : nessun arrotonda- *
      *                  * mento                                       *
      *                  *---------------------------------------------*
           if        w-spe-bol-spe-bol    =    zero
                     go to spe-bol-sdb-900.
       spe-bol-sdb-550.
      *                  *---------------------------------------------*
      *                  * Su valore minimo per l'importo spesa        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se valore minimo per l'importo spesa a  *
      *                      * zero : nessuna azione                   *
      *                      *-----------------------------------------*
           if        w-spe-bol-min-spb
                    (w-spe-bol-inx-pag)   =    zero
                     go to spe-bol-sdb-600.
      *                      *-----------------------------------------*
      *                      * Se l'importo spesa bollo sin qui calco- *
      *                      * lato e' inferiore all'importo minimo :  *
      *                      * si forza il valore minimo               *
      *                      *-----------------------------------------*
           if        w-spe-bol-spe-bol    <    w-spe-bol-min-spb
                                              (w-spe-bol-inx-pag)
                     move  w-spe-bol-min-spb
                          (w-spe-bol-inx-pag)
                                          to   w-spe-bol-spe-bol      .
       spe-bol-sdb-600.
      *                  *---------------------------------------------*
      *                  * Su valore massimo per l'importo spesa       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se valore massimo per l'importo spesa a *
      *                      * zero : nessuna azione                   *
      *                      *-----------------------------------------*
           if        w-spe-bol-max-spb
                    (w-spe-bol-inx-pag)   =    zero
                     go to spe-bol-sdb-650.
      *                      *-----------------------------------------*
      *                      * Se l'importo spesa bollo sin qui calco- *
      *                      * lato e' superiore all'importo massimo : *
      *                      * si forza il valore massimo              *
      *                      *-----------------------------------------*
           if        w-spe-bol-spe-bol    >    w-spe-bol-max-spb
                                              (w-spe-bol-inx-pag)
                     move  w-spe-bol-max-spb
                          (w-spe-bol-inx-pag)
                                          to   w-spe-bol-spe-bol      .
       spe-bol-sdb-650.
      *                  *---------------------------------------------*
      *                  * Arrotondamento vero e proprio               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se valore di arrotondamento a zero : no *
      *                      * arrotondamento                          *
      *                      *-----------------------------------------*
           if        w-spe-bol-var-spb
                    (w-spe-bol-inx-pag)   =    zero
                     go to spe-bol-sdb-900.
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione del tipo arro-   *
      *                      * tondamento                              *
      *                      *-----------------------------------------*
           go to     spe-bol-sdb-700
                     spe-bol-sdb-750
                     spe-bol-sdb-800
                     spe-bol-sdb-850
                                depending on   w-spe-bol-tar-spb
                                              (w-spe-bol-inx-pag)     .
      *                      *-----------------------------------------*
      *                      * Se tipo arrotondamento zero, o non ri-  *
      *                      * conosciuto : nessuna azione             *
      *                      *-----------------------------------------*
           go to     spe-bol-sdb-900.
       spe-bol-sdb-700.
      *                      *-----------------------------------------*
      *                      * Se tipo arrotondamento 01 : Al valore   *
      *                      * superiore                               *
      *                      *-----------------------------------------*
           add       w-spe-bol-var-spb
                    (w-spe-bol-inx-pag)   to   w-spe-bol-spe-bol      .
           subtract  1                    from w-spe-bol-spe-bol      .
           divide    w-spe-bol-var-spb
                    (w-spe-bol-inx-pag)   into w-spe-bol-spe-bol      .
           multiply  w-spe-bol-var-spb
                    (w-spe-bol-inx-pag)   by   w-spe-bol-spe-bol      .
           go to     spe-bol-sdb-900.
       spe-bol-sdb-750.
      *                      *-----------------------------------------*
      *                      * Se tipo arrotondamento 01 : Al valore   *
      *                      * inferiore                               *
      *                      *-----------------------------------------*
           divide    w-spe-bol-var-spb
                    (w-spe-bol-inx-pag)   into w-spe-bol-spe-bol      .
           multiply  w-spe-bol-var-spb
                    (w-spe-bol-inx-pag)   by   w-spe-bol-spe-bol      .
           go to     spe-bol-sdb-900.
       spe-bol-sdb-800.
      *                      *-----------------------------------------*
      *                      * Se tipo arrotondamento 01 : Di tipo     *
      *                      * commerciale                             *
      *                      *-----------------------------------------*
           divide    w-spe-bol-var-spb
                    (w-spe-bol-inx-pag)   into w-spe-bol-spe-bol
                                                         rounded      .
           multiply  w-spe-bol-var-spb
                    (w-spe-bol-inx-pag)   by   w-spe-bol-spe-bol      .
           go to     spe-bol-sdb-900.
       spe-bol-sdb-850.
      *                      *-----------------------------------------*
      *                      * Se tipo arrotondamento 01 : Di tipo     *
      *                      * statale                                 *
      *                      *-----------------------------------------*
           divide    2                    into w-spe-bol-var-spb
                                              (w-spe-bol-inx-pag)
                                        giving w-spe-bol-wrk-s01      .
           add       w-spe-bol-wrk-s01    to   w-spe-bol-var-spb
                                              (w-spe-bol-inx-pag)     .
           subtract  1                    from w-spe-bol-var-spb
                                              (w-spe-bol-inx-pag)     .
           divide    w-spe-bol-var-spb
                    (w-spe-bol-inx-pag)   into w-spe-bol-spe-bol      .
           multiply  w-spe-bol-var-spb
                    (w-spe-bol-inx-pag)   by   w-spe-bol-spe-bol      .
           go to     spe-bol-sdb-900.
       spe-bol-sdb-900.
      *                  *---------------------------------------------*
      *                  * Fine arrotondamenti : uscita                *
      *                  *---------------------------------------------*
           go to     spe-bol-sdb-999.
       spe-bol-sdb-999.
           exit.

      *    *===========================================================*
      *    * Routine di decodifica da cifre a lettere                  *
      *    *                                                           *
      *    * Input  : Si entra con il campo 'w-cif-let-imp' contenente *
      *    *          il numero da decodificare; questo deve essere al *
      *    *          massimo di 9 cifre senza segno;                  *
      *    *                                                           *
      *    * Output : Si esce con il campo 'w-cif-let-let' contenente  *
      *    *          la decodifica eseguita; questo campo consta al   *
      *    *          massimo di 'w-cif-let-tmx' caratteri; nel caso   *
      *    *          che non fossero sufficienti il campo lettere     *
      *    *          contiene il numero editato (allineato a sinistra)*
      *    *          con la maschera : "*ZZZ.ZZZ.ZZZ*"; nel caso che  *
      *    *          entro 'w-cif-let-tmx' caratteri non sia possibile*
      *    *          sviluppare la decodifica completa le ultime tre  *
      *    *          cifre vengono riportate numericamente, altrimenti*
      *    *          anch'esse vengono decodificate.                  *
      *    *          Se il numero viene editato con la maschera di cui*
      *    *          sopra il flag 'w-cif-let-flg' viene posto = a"#" *
      *    *                                                           *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wciflet0.cps"                   .
      *    *===========================================================*
      *    * Determinazione status scadenza                            *
      *    *-----------------------------------------------------------*
       det-dat-chs-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione data scadenza chiusa a : Aper- *
      *              * ta                                              *
      *              *-------------------------------------------------*
           move      9999999              to   rf-sdb-dat-chs         .
       det-dat-chs-020.
      *              *-------------------------------------------------*
      *              * Controllo su : Insoluto                         *
      *              *-------------------------------------------------*
           if        rf-sdb-dtr-isp       =    zero
                     go to det-dat-chs-040.
      *                  *---------------------------------------------*
      *                  * Se la scadenza e' stata riscossa : oltre    *
      *                  *---------------------------------------------*
           if        rf-sdb-num-ris       not  = zero
                     go to det-dat-chs-040.
      *                  *---------------------------------------------*
      *                  * Se a fronte dell'insoluto non e' stata e-   *
      *                  * messa una nuova scadenza, essa e' da inten- *
      *                  * dersi ancora aperta                         *
      *                  *---------------------------------------------*
           if        rf-sdb-ens-isp       =    02   and
                     rf-sdb-nns-isp       =    zero
                     go to det-dat-chs-999.
      *                  *---------------------------------------------*
      *                  * Memorizzazione data chiusura scadenza       *
      *                  *---------------------------------------------*
           move      rf-sdb-dtr-isp       to   rf-sdb-dat-chs         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-dat-chs-999.
       det-dat-chs-040.
      *              *-------------------------------------------------*
      *              * Controllo su : Presunto buon esito              *
      *              *-------------------------------------------------*
           if        rf-sdb-dtr-pbe       =     zero
                     go to det-dat-chs-060.
      *                  *---------------------------------------------*
      *                  * Memorizzazione data chiusura scadenza       *
      *                  *---------------------------------------------*
           move      rf-sdb-dtr-pbe       to   rf-sdb-dat-chs         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-dat-chs-999.
       det-dat-chs-060.
      *              *-------------------------------------------------*
      *              * Controllo su : Presunto buon esito              *
      *              *-------------------------------------------------*
           if        rf-sdb-dtr-nbe       =     zero
                     go to det-dat-chs-080.
      *                  *---------------------------------------------*
      *                  * Memorizzazione data chiusura scadenza       *
      *                  *---------------------------------------------*
           move      rf-sdb-dtr-nbe       to   rf-sdb-dat-chs         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-dat-chs-999.
       det-dat-chs-080.
      *              *-------------------------------------------------*
      *              * Controllo su : Accredito scadenza al dopo in-   *
      *              *                casso                            *
      *              *-------------------------------------------------*
           if        rf-sdb-dtr-acs       =     zero
                     go to det-dat-chs-100.
      *                  *---------------------------------------------*
      *                  * Memorizzazione data chiusura scadenza       *
      *                  *---------------------------------------------*
           move      rf-sdb-dtr-acs       to   rf-sdb-dat-chs         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-dat-chs-999.
       det-dat-chs-100.
      *              *-------------------------------------------------*
      *              * Controllo su : Richiamo della scadenza presen-  *
      *              *                tata                             *
      *              *-------------------------------------------------*
           if        rf-sdb-dtr-rsp       =     zero
                     go to det-dat-chs-120.
      *                  *---------------------------------------------*
      *                  * Memorizzazione data chiusura scadenza       *
      *                  *---------------------------------------------*
           move      rf-sdb-dtr-rsp       to   rf-sdb-dat-chs         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-dat-chs-999.
       det-dat-chs-120.
      *              *-------------------------------------------------*
      *              * Controllo su : Inclusione in distinta           *
      *              *-------------------------------------------------*
           if        rf-sdb-num-ddp       =     zero
                     go to det-dat-chs-140.
      *                  *---------------------------------------------*
      *                  * Nessuna azione                              *
      *                  *---------------------------------------------*
           go to     det-dat-chs-140.
       det-dat-chs-140.
      *              *-------------------------------------------------*
      *              * Controllo su : Riscossione                      *
      *              *-------------------------------------------------*
           if        rf-sdb-dtr-ris       =     zero
                     go to det-dat-chs-160.
      *                  *---------------------------------------------*
      *                  * Memorizzazione data chiusura scadenza       *
      *                  *---------------------------------------------*
           move      rf-sdb-dtr-ris       to   rf-sdb-dat-chs         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-dat-chs-999.
       det-dat-chs-160.
      *              *-------------------------------------------------*
      *              * Controllo su : Storno                           *
      *              *-------------------------------------------------*
           if        rf-sdb-dtr-sto       =     zero
                     go to det-dat-chs-180.
      *                  *---------------------------------------------*
      *                  * Memorizzazione data chiusura scadenza       *
      *                  *---------------------------------------------*
           move      rf-sdb-dtr-sto       to   rf-sdb-dat-chs         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-dat-chs-999.
       det-dat-chs-180.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-dat-chs-999.
       det-dat-chs-999.
           exit.

