       Identification division.
       Program-Id.                                 pgep5501           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    gep                 *
      *                                Settore:    glo                 *
      *                                   Fase:    gep550              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 22/04/94    *
      *                       Ultima revisione:    Ndk del 30/04/10    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione stampa per il programma gep550   *
      *                                                                *
      *                    Situazione esposizione globale crediti      *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     d-K-b-Snc-PD .
       Object-Computer.     d-K-b-Snc-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Data scadenza per sort                            *
      *            *---------------------------------------------------*
               10  srt-dts-srt            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Status scadenza per sort                          *
      *            * - 01 : Scaduta                                    *
      *            * - 02 : A vista                                    *
      *            * - 03 : A scadere                                  *
      *            *---------------------------------------------------*
               10  srt-sts-srt            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Data scadenza effettiva contenuta nel file [sdb]  *
      *            *---------------------------------------------------*
               10  srt-dts-eff            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale cliente in uppercase              *
      *            *---------------------------------------------------*
               10  srt-rag-key            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice cliente                                    *
      *            *---------------------------------------------------*
               10  srt-cod-cli            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Dipendenza del cliente                            *
      *            *---------------------------------------------------*
               10  srt-dpz-cli            pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Numero scadenza                                   *
      *            *---------------------------------------------------*
               10  srt-num-sdb            pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Tipo scadenza                                     *
      *            *---------------------------------------------------*
               10  srt-tip-sdb            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Segnale Si/No dilazione concordata                *
      *            *---------------------------------------------------*
               10  srt-snx-dlc            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale Si/No contrassegno                        *
      *            *---------------------------------------------------*
               10  srt-snx-cts            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Sigla ultima operazione effettuata                *
      *            *---------------------------------------------------*
               10  srt-sgl-uop            pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Importo scadenza                                  *
      *            *---------------------------------------------------*
               10  srt-imp-sdb            pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale cliente                           *
      *            *---------------------------------------------------*
               10  srt-rag-soc            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Numero documento di riferimento                   *
      *            *---------------------------------------------------*
               10  srt-num-ddr            pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Data documento di riferimento                     *
      *            *---------------------------------------------------*
               10  srt-dat-ddr            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Importo documento di riferimento                  *
      *            *---------------------------------------------------*
               10  srt-imp-ddr            pic s9(11)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "gep"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "glo"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "gep550"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pgep5501"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     " SITUAZIONE ESPOSIZIONE GLOBALE CREDITI "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records logici                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [sdb]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfsdb"                          .
      *        *-------------------------------------------------------*
      *        * [ddp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfddp"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .

      *    *===========================================================*
      *    * Record per le richieste                                   *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Data base per calcolo mesi                            *
      *        *-------------------------------------------------------*
           05  rr-dat-bcm                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Tipi scadenza da includere                            *
      *        * - 01 : Tutti                                          *
      *        * - 02 : A scelta                                       *
      *        * - 03 : Rimesse dir. e Bonifici                        *
      *        * - 04 : Scadenze elettroniche                          *
      *        * - 05 : Ricevute banc. e Tratte                        *
      *        * - 06 : Solo Rimesse dirette                           *
      *        * - 07 : Solo Incassi elettronici                       *
      *        * - 08 : Solo Ri.Ba.                                    *
      *        * - 09 : Solo Conferme d'Ordine                         *
      *        * - 10 : Solo M.Av.                                     *
      *        * - 11 : Solo R.I.D.                                    *
      *        * - 12 : Solo Bonifici bancari                          *
      *        * - 13 : Solo C/C postali                               *
      *        * - 14 : Solo Ricevute bancarie                         *
      *        * - 15 : Solo Tratte                                    *
      *        * - 16 : Solo Paghero' cambiari                         *
      *        *-------------------------------------------------------*
           05  rr-tip-scd                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Si/No inclusione per tipo scadenza :                  *
      *        * - 01 : Rimesse dirette                                *
      *        * - 02 : Dilazioni concordate                           *
      *        * - 03 : Incassi elettronici                            *
      *        * - 04 : Ri.Ba.                                         *
      *        * - 05 : Conferme d'Ordine                              *
      *        * - 06 : M.Av.                                          *
      *        * - 07 : R.I.D.                                         *
      *        * - 08 : Bonifici bancari                               *
      *        * - 09 : C/C postali                                    *
      *        * - 10 : Ricevute bancarie                              *
      *        * - 11 : Tratte                                         *
      *        * - 12 : Paghero' cambiari                              *
      *        *-------------------------------------------------------*
           05  rr-sce-tsc.
               10  rr-snx-tsc occurs 12   pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Data scadenza iniziale                                *
      *        *-------------------------------------------------------*
           05  rr-dat-sci                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Data scadenza finale                                  *
      *        *-------------------------------------------------------*
           05  rr-dat-scf                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Si/No anche scadenze a vista                          *
      *        *-------------------------------------------------------*
           05  rr-snx-scv                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Selezione su status scadenze                          *
      *        * - 01 : Sia a scadere che scadute                      *
      *        * - 02 : Solo quelle a scadere                          *
      *        * - 03 : Solo quelle scadute                            *
      *        *-------------------------------------------------------*
           05  rr-sts-scd                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Selezione su status effetti                           *
      *        * - 01 : Tutti                                          *
      *        * - 02 : Solo quelli in portafoglio                     *
      *        * - 03 : Solo quelli in circolazione                    *
      *        * - 04 : Solo quelli insoluti                           *
      *        *-------------------------------------------------------*
           05  rr-sts-eff                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Tipo evidenziazione                                   *
      *        * - 01 : Sia la lista che il riepilogo finale           *
      *        * - 02 : Solo la lista delle scadenze                   *
      *        * - 03 : Solo il riepilogo finale                       *
      *        *-------------------------------------------------------*
           05  rr-tip-evd                 pic  9(02)                  .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
      *            *---------------------------------------------------*
      *            * Secolo/Anno scadenza                              *
      *            *---------------------------------------------------*
               10  w-rot-l01-saa-sdb      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Mese scadenza                                     *
      *            *---------------------------------------------------*
               10  w-rot-l01-mes-sdb      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Status scadenza                                   *
      *            * - 01 : Scaduta                                    *
      *            * - 02 : A vista                                    *
      *            * - 03 : A scadere                                  *
      *            *---------------------------------------------------*
               10  w-rot-l01-sts-scd      pic  9(02)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcc.
               10  w-let-arc-dcc-flg      pic  x(01)                  .
               10  w-let-arc-dcc-cli      pic  9(07)                  .
               10  w-let-arc-dcc-dpz      pic  x(04)                  .
               10  w-let-arc-dcc-rsu      pic  x(40)                  .
               10  w-let-arc-dcc-rag      pic  x(40)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per determinazione status scadenza con riferi-   *
      *        * mento ad una certa data                               *
      *        *-------------------------------------------------------*
           05  w-det-srd-sdb.
      *            *---------------------------------------------------*
      *            * Data di riferimento per la determinazione         *
      *            *---------------------------------------------------*
               10  w-det-srd-sdb-drd      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Status determinato                                *
      *            * - Spaces : Status non determinabile               *
      *            * - A      : Scadenza ancora aperta                 *
      *            * - C      : Scadenza ormai chiusa                  *
      *            * - N      : Scadenza non ancora inserita alla data *
      *            *            di riferimento per la determinazione   *
      *            *---------------------------------------------------*
               10  w-det-srd-sdb-sts      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Sigla ultima operazione eseguita sulla scadenza   *
      *            * - Spaces : Nessuna                                *
      *            * - EMI    : Emissione                              *
      *            * - SSC    : Storno                                 *
      *            * - RIS    : Riscossione                            *
      *            * - PAG    : Pagamento                              *
      *            * - CMP    : Compensazione                          *
      *            * - COM    : Composizione distinta                  *
      *            * - PRE    : Presentazione distinta                 *
      *            * - ACT    : Accettazione distinta                  *
      *            * - ACD    : Accredito distinta                     *
      *            * - RSP    : Richiamo della scadenza presentata     *
      *            * - ACS    : Accredito scadenza al dopo incasso     *
      *            * - NBE    : Notizia di buon esito sulla scadenza   *
      *            * - PBE    : Presunto buon esito sulla scadenza     *
      *            * - ISP    : Insoluto sulla scadenza presentata     *
      *            *---------------------------------------------------*
               10  w-det-srd-sdb-suo      pic  x(03)                  .

      *    *===========================================================*
      *    * Work per subroutine prn-ini-lr1-000/999                   *
      *    *-----------------------------------------------------------*
       01  w-prn-ini-lr1.
           05  w-prn-ini-lr1-x40          pic  x(40)                  .
           05  w-prn-ini-lr1-pnt          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutine azz-tot-rie-000/999                   *
      *    *-----------------------------------------------------------*
       01  w-azz-tot-rie.
           05  w-azz-tot-rie-c01          pic  9(03)                  .
           05  w-azz-tot-rie-c02          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutine agg-tot-rie-000/999                   *
      *    *-----------------------------------------------------------*
       01  w-agg-tot-rie.
      *        *-------------------------------------------------------*
      *        * Tipo aggiornamento effettuato                         *
      *        * - 01 : Prospetto 'Scaduto'                            *
      *        * - 02 : Prospetto 'Insoluti'                           *
      *        * - 03 : Prospetto 'A Scadere'                          *
      *        * - 04 : Prospetto 'Circolante'                         *
      *        *-------------------------------------------------------*
           05  w-agg-tot-rie-tae          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Indice per tipo scadenza                              *
      *        *-------------------------------------------------------*
           05  w-agg-tot-rie-its          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Puntatore su tabella                                  *
      *        *-------------------------------------------------------*
           05  w-agg-tot-rie-inx          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutine stp-tot-gen-000/999                   *
      *    *-----------------------------------------------------------*
       01  w-stp-tot-gen.
           05  w-stp-tot-gen-c01          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutine stp-tot-sca-000/999                   *
      *    *-----------------------------------------------------------*
       01  w-stp-tot-sca.
           05  w-stp-tot-sca-x14          pic  x(14)                  .
           05  w-stp-tot-sca-c01          pic  9(03)                  .
           05  w-stp-tot-sca-c02          pic  9(03)                  .
           05  w-stp-tot-sca-pnt          pic  9(03)                  .
           05  w-stp-tot-sca-inx          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutine stp-tot-isp-000/999                   *
      *    *-----------------------------------------------------------*
       01  w-stp-tot-isp.
           05  w-stp-tot-isp-adb          pic  9(03)                  .
           05  w-stp-tot-isp-mdb          pic  9(02)                  .
           05  w-stp-tot-isp-x14          pic  x(14)                  .
           05  w-stp-tot-isp-c01          pic  9(03)                  .
           05  w-stp-tot-isp-c02          pic  9(03)                  .
           05  w-stp-tot-isp-pnt          pic  9(03)                  .
           05  w-stp-tot-isp-inx          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutine stp-tot-asc-000/999                   *
      *    *-----------------------------------------------------------*
       01  w-stp-tot-asc.
           05  w-stp-tot-asc-x14          pic  x(14)                  .
           05  w-stp-tot-asc-c01          pic  9(03)                  .
           05  w-stp-tot-asc-c02          pic  9(03)                  .
           05  w-stp-tot-asc-pnt          pic  9(03)                  .
           05  w-stp-tot-asc-inx          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutine stp-tot-cir-000/999                   *
      *    *-----------------------------------------------------------*
       01  w-stp-tot-cir.
           05  w-stp-tot-cir-adb          pic  9(03)                  .
           05  w-stp-tot-cir-mdb          pic  9(02)                  .
           05  w-stp-tot-cir-x14          pic  x(14)                  .
           05  w-stp-tot-cir-c01          pic  9(03)                  .
           05  w-stp-tot-cir-c02          pic  9(03)                  .
           05  w-stp-tot-cir-pnt          pic  9(03)                  .
           05  w-stp-tot-cir-inx          pic  9(03)                  .

      *    *===========================================================*
      *    * Work area per stampa                                      *
      *    *-----------------------------------------------------------*
       01  w-stp.
      *        *-------------------------------------------------------*
      *        * Per stampa importi in valuta base                     *
      *        *-------------------------------------------------------*
           05  w-stp-imp-vlb.
      *            *---------------------------------------------------*
      *            * Valore da stampare                                *
      *            *---------------------------------------------------*
               10  w-stp-imp-vlb-val      pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Posizione di stampa                               *
      *            *---------------------------------------------------*
               10  w-stp-imp-vlb-pos      pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutine int-pag-sta-000/999                   *
      *    *-----------------------------------------------------------*
       01  w-int-pag-sta.
      *        *-------------------------------------------------------*
      *        * Flag per intestazione pagina                          *
      *        * - spaces : intestazione normale                       *     
      *        * - L      : stampa titolo 'lista scadenze'             *     
      *        * - R      : stampa titolo 'riepilogo'                  *     
      *        *-------------------------------------------------------*
           05  w-int-pag-sta-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per totali                                      *
      *    *-----------------------------------------------------------*
       01  w-tot.
      *        *-------------------------------------------------------*
      *        * Totali per prospetto generale                         *
      *        *-------------------------------------------------------*
           05  w-tot-pge.
               10  w-tot-pge-tsc          pic s9(11)                  .
               10  w-tot-pge-tin          pic s9(11)                  .
               10  w-tot-pge-tvi          pic s9(11)                  .
               10  w-tot-pge-tas          pic s9(11)                  .
               10  w-tot-pge-tci          pic s9(11)                  .
               10  w-tot-pge-tot          pic s9(11)                  .
               10  w-tot-pge-tbl.
                   15  w-tot-pge-vts occurs 12.
                       20  w-tot-pge-sca  pic s9(11)                  .
                       20  w-tot-pge-isp  pic s9(11)                  .
                       20  w-tot-pge-vis  pic s9(11)                  .
                       20  w-tot-pge-asc  pic s9(11)                  .
                       20  w-tot-pge-cir  pic s9(11)                  .
                       20  w-tot-pge-tts  pic s9(11)                  .
               10  w-tot-pge-i01          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Totali per prospetto mensile 'Scaduto'                *
      *        *-------------------------------------------------------*
           05  w-tot-pms.
               10  w-tot-pms-tbl.
                   15  w-tot-pms-vpm occurs 08.
                       20  w-tot-pms-saa
                                          pic  9(03)                  .
                       20  w-tot-pms-mes
                                          pic  9(02)                  .
                       20  w-tot-pms-imp  occurs 12
                                          pic s9(11)                  .
                       20  w-tot-pms-tme  pic s9(11)                  .                              
               10  w-tot-pms-inx          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Tabella di lavoro per prospetto mensile 'Scaduto' *
      *            *---------------------------------------------------*
               10  w-tot-pms-wtb.
                   15  w-tot-pms-wpm occurs 100.
                       20  w-tot-pms-wsa
                                          pic  9(03)                  .
                       20  w-tot-pms-wms
                                          pic  9(02)                  .
                       20  w-tot-pms-wim  occurs 12
                                          pic s9(11)                  .
                       20  w-tot-pms-wtm  pic s9(11)                  .
               10  w-tot-pms-wix          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Totali per prospetto mensile 'Insoluti'               *
      *        *-------------------------------------------------------*
           05  w-tot-pmi.
               10  w-tot-pmi-tbl.
                   15  w-tot-pmi-vpm occurs 08.
                       20  w-tot-pmi-saa
                                          pic  9(03)                  .
                       20  w-tot-pmi-mes
                                          pic  9(02)                  .
                       20  w-tot-pmi-imp  occurs 12
                                          pic s9(11)                  .
                       20  w-tot-pmi-tme  pic s9(11)                  .                              
               10  w-tot-pmi-inx          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Tabella di lavoro per prospetto mensile 'Insolu-  *
      *            * ti'                                               *
      *            *---------------------------------------------------*
               10  w-tot-pmi-wtb.
                   15  w-tot-pmi-wpm occurs 100.
                       20  w-tot-pmi-wsa
                                          pic  9(03)                  .
                       20  w-tot-pmi-wms
                                          pic  9(02)                  .
                       20  w-tot-pmi-wim  occurs 12
                                          pic s9(11)                  .
                       20  w-tot-pmi-wtm  pic s9(11)                  .                              
               10  w-tot-pmi-wix          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Totali per prospetto mensile 'A scadere'              *
      *        *-------------------------------------------------------*
           05  w-tot-pma.
               10  w-tot-pma-tbl.
                   15  w-tot-pma-vpm occurs 08.
                       20  w-tot-pma-saa
                                          pic  9(03)                  .
                       20  w-tot-pma-mes
                                          pic  9(02)                  .
                       20  w-tot-pma-imp  occurs 12
                                          pic s9(11)                  .
                       20  w-tot-pma-tme  pic s9(11)                  .                              
               10  w-tot-pma-inx          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Totali per prospetto mensile 'Circolante'             *
      *        *-------------------------------------------------------*
           05  w-tot-pmc.
               10  w-tot-pmc-tbl.
                   15  w-tot-pmc-vpm occurs 08.
                       20  w-tot-pmc-saa
                                          pic  9(03)                  .
                       20  w-tot-pmc-mes
                                          pic  9(02)                  .
                       20  w-tot-pmc-imp  occurs 12
                                          pic s9(11)                  .
                       20  w-tot-pmc-tme  pic s9(11)                  .                              
               10  w-tot-pmc-inx          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Tabella di lavoro per prospetto mensile 'Circo-   *
      *            * lante'                                            *
      *            *---------------------------------------------------*
               10  w-tot-pmc-wtb.
                   15  w-tot-pmc-wpm occurs 100.
                       20  w-tot-pmc-wsa
                                          pic  9(03)                  .
                       20  w-tot-pmc-wms
                                          pic  9(02)                  .
                       20  w-tot-pmc-wim  occurs 12
                                          pic s9(11)                  .
                       20  w-tot-pmc-wtm  pic s9(11)                  .                              
               10  w-tot-pmc-wix          pic  9(03)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-cnt-tit-des-azi      .
           move      40                   to   w-cnt-tit-ctr-azi      .
       int-pag-std-100.
           if        w-cnt-tit-chr-azi
                    (w-cnt-tit-ctr-azi)   =    spaces
                     if     w-cnt-tit-ctr-azi
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-cnt-tit-ctr-tit      .
       int-pag-std-200.
           if        w-cnt-tit-chr-tit
                    (w-cnt-tit-ctr-tit)   =    spaces
                     if     w-cnt-tit-ctr-tit
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-tit      .
           subtract  w-cnt-tit-ctr-tit    from w-cnt-tit-pos-tit      .
           divide    2                    into w-cnt-tit-pos-tit      .
           add       1                    to   w-cnt-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    =    zero
                     move  4              to   w-cnt-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-cnt-tit-ctr-wrk      .
           inspect   w-cnt-tit-num-pag
                                      tallying w-cnt-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-cnt-tit-ctr-wrk    from 27
                                        giving w-cnt-tit-ctr-dep      .
           subtract  w-cnt-tit-ctr-wrk    from 5
                                        giving w-cnt-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-dep      .
           subtract  w-cnt-tit-ctr-dep    from w-cnt-tit-pos-dep      .
           add       1                    to   w-cnt-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-cnt-tit-ctr-azi    to   w-cnt-tit-ctr-wrk      .
           add       2                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-tit
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      w-cnt-tit-pos-tit    to   w-cnt-tit-ctr-wrk      .
           add       w-cnt-tit-ctr-tit    to   w-cnt-tit-ctr-wrk      .
           add       1                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-dep
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-cnt-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-cnt-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-cnt-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-cnt-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : Si'                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort                                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   prn-rou-pri-000
                                          thru prn-rou-pri-999        .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [sdb]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * [ddp]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofddp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ddp                 .
      *                  *---------------------------------------------*
      *                  * [dcc]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
       stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Start su file [sdb] per data chiusura           *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "GT"                 to   f-cfr                  .
           move      "DATCHS    "         to   f-key                  .
           move      rr-dat-bcm           to   rf-sdb-dat-chs         .
           move      zero                 to   rf-sdb-num-sdb         .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-500.
       stp-srt-inp-120.
      *              *-------------------------------------------------*
      *              * Read Next su file [sdb]                         *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-500.
       stp-srt-inp-130.
      *              *-------------------------------------------------*
      *              * Selezioni sul record                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo debitore                       *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-dbt       not  = 01
                     go to stp-srt-inp-120.
      *                  *---------------------------------------------*
      *                  * Test se tipo scadenza compreso tra quelli   *
      *                  * richiesti                                   *
      *                  *---------------------------------------------*
           if       (rf-sdb-tip-sdb       =    01   and
                     rf-sdb-snx-dlc       =    "N"    ) and
                     rr-snx-tsc (01)      =    "S"
                     go to stp-srt-inp-140
           else if  (rf-sdb-tip-sdb       =    01   and
                     rf-sdb-snx-dlc       =    "S"    ) and
                     rr-snx-tsc (02)      =    "S"
                     go to stp-srt-inp-140
           else if   rf-sdb-tip-sdb       =    02 and
                     rr-snx-tsc (03)      =    "S"
                     go to stp-srt-inp-140
           else if   rf-sdb-tip-sdb       =    03 and
                     rr-snx-tsc (04)      =    "S"
                     go to stp-srt-inp-140
           else if   rf-sdb-tip-sdb       =    04 and
                     rr-snx-tsc (05)      =    "S"
                     go to stp-srt-inp-140
           else if   rf-sdb-tip-sdb       =    05 and
                     rr-snx-tsc (06)      =    "S"
                     go to stp-srt-inp-140
           else if   rf-sdb-tip-sdb       =    06 and
                     rr-snx-tsc (07)      =    "S"
                     go to stp-srt-inp-140
           else if   rf-sdb-tip-sdb       =    07 and
                     rr-snx-tsc (08)      =    "S"
                     go to stp-srt-inp-140
           else if   rf-sdb-tip-sdb       =    08 and
                     rr-snx-tsc (09)      =    "S"
                     go to stp-srt-inp-140
           else if   rf-sdb-tip-sdb       =    09 and
                     rr-snx-tsc (10)      =    "S"
                     go to stp-srt-inp-140
           else if   rf-sdb-tip-sdb       =    10 and
                     rr-snx-tsc (11)      =    "S"
                     go to stp-srt-inp-140
           else if   rf-sdb-tip-sdb       =    11 and
                     rr-snx-tsc (12)      =    "S"
                     go to stp-srt-inp-140
           else      go to stp-srt-inp-120.
       stp-srt-inp-140.
      *                  *---------------------------------------------*
      *                  * Test su data scadenza                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda che sia scadenza a *
      *                      * vista o no                              *
      *                      *-----------------------------------------*
           if        rf-sdb-dts-sdb       =    zero
                     go to stp-srt-inp-142
           else      go to stp-srt-inp-144.
       stp-srt-inp-142.
      *                      *-----------------------------------------*
      *                      * Se scadenza a vista                     *
      *                      *-----------------------------------------*
           if        rr-snx-scv           not  = "S"
                     go to stp-srt-inp-120.
           go to     stp-srt-inp-300.
       stp-srt-inp-144.
      *                      *-----------------------------------------*
      *                      * Se scadenza non a vista                 *
      *                      *-----------------------------------------*
           if        rf-sdb-dts-sdb       <    rr-dat-sci or
                     rf-sdb-dts-sdb       >    rr-dat-scf
                     go to stp-srt-inp-120.
           go to     stp-srt-inp-300.
       stp-srt-inp-300.
      *              *-------------------------------------------------*
      *              * Selezione su status scadenza                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione status scadenza              *
      *                  *---------------------------------------------*
           move      rr-dat-bcm           to   w-det-srd-sdb-drd      .
           perform   det-srd-sdb-000      thru det-srd-sdb-999        .
      *                  *---------------------------------------------*
      *                  * Test se scadenza ancora aperta              *
      *                  *---------------------------------------------*
           if        w-det-srd-sdb-sts    not  = "A"
                     go to stp-srt-inp-120.
      *                  *---------------------------------------------*
      *                  * Test su tipo scadenza                       *
      *                  *---------------------------------------------*
           if        rf-sdb-tip-sdb       not  = 01 and
                     rf-sdb-tip-sdb       not  = 07 and
                     rf-sdb-tip-sdb       not  = 08
                     go to stp-srt-inp-350.
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione della selezione su   *
      *                  * status scadenze                             *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-301
                     stp-srt-inp-302
                     stp-srt-inp-303
                     depending            on   rr-sts-scd             .
       stp-srt-inp-301.
      *                  *---------------------------------------------*
      *                  * Scadenze sia a scadere che scadute          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nessuna selezione                       *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-400.
       stp-srt-inp-302.
      *                  *---------------------------------------------*
      *                  * Solo quelle a scadere                       *
      *                  *---------------------------------------------*
           if        rf-sdb-dts-sdb       not  >  rr-dat-bcm
                     go to stp-srt-inp-120.
           go to     stp-srt-inp-400.
       stp-srt-inp-303.
      *                  *---------------------------------------------*
      *                  * Solo quelle scadute                         *
      *                  *---------------------------------------------*
           if        rf-sdb-dts-sdb       >    rr-dat-bcm
                     go to stp-srt-inp-120.
           go to     stp-srt-inp-400.
       stp-srt-inp-350.
      *              *-------------------------------------------------*
      *              * Selezione su status effetti                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione della selezione su   *
      *                  * status effetti                              *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-351
                     stp-srt-inp-352
                     stp-srt-inp-353
                     stp-srt-inp-354
                     depending            on   rr-sts-eff             .
       stp-srt-inp-351.
      *                  *---------------------------------------------*
      *                  * Tutti gli effetti                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nessuna selezione                       *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-400.
       stp-srt-inp-352.
      *                  *---------------------------------------------*
      *                  * Solo effetti in portafoglio                 *
      *                  *---------------------------------------------*
           if        w-det-srd-sdb-suo    =    "PRE" or
                     w-det-srd-sdb-suo    =    "ACT" or
                     w-det-srd-sdb-suo    =    "ACD"
                     go to stp-srt-inp-120.
           go to     stp-srt-inp-400.
       stp-srt-inp-353.
      *                  *---------------------------------------------*
      *                  * Solo effetti in circolazione                *
      *                  *---------------------------------------------*
           if        w-det-srd-sdb-suo    not  = "PRE" and
                     w-det-srd-sdb-suo    not  = "ACT" and
                     w-det-srd-sdb-suo    not  = "ACD"
                     go to stp-srt-inp-120.
           go to     stp-srt-inp-400.
       stp-srt-inp-354.
      *                  *---------------------------------------------*
      *                  * Solo effetti insoluti                       *
      *                  *---------------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to stp-srt-inp-120.
           go to     stp-srt-inp-400.
       stp-srt-inp-400.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcc]                      *
      *                  *---------------------------------------------*
           move      rf-sdb-cod-dbt       to   w-let-arc-dcc-cli      .
           move      spaces               to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                  *---------------------------------------------*
      *                  * Composizione record di Sort                 *
      *                  *---------------------------------------------*
           if        rf-sdb-dts-sdb       =    zero
                     move  rr-dat-bcm     to   srt-dts-srt
           else      move  rf-sdb-dts-sdb to   srt-dts-srt            .
           if        rf-sdb-dts-sdb       =    zero
                     move  02             to   srt-sts-srt
           else if   rf-sdb-dts-sdb       not  > rr-dat-bcm
                     move  01             to   srt-sts-srt
           else      move  03             to   srt-sts-srt            .
           move      rf-sdb-dts-sdb       to   srt-dts-eff            .
           move      w-let-arc-dcc-rsu    to   srt-rag-key            .
           move      rf-sdb-cod-dbt       to   srt-cod-cli            .
           move      rf-sdb-dpz-dbt       to   srt-dpz-cli            .
           move      rf-sdb-num-sdb       to   srt-num-sdb            .
           move      rf-sdb-tip-sdb       to   srt-tip-sdb            .
           move      rf-sdb-snx-dlc       to   srt-snx-dlc            .
           move      rf-sdb-snx-cts       to   srt-snx-cts            .
           move      w-det-srd-sdb-suo    to   srt-sgl-uop            .
           move      rf-sdb-imp-sdb       to   srt-imp-sdb            .
           move      w-let-arc-dcc-rag    to   srt-rag-soc            .
           move      rf-sdb-num-ddr       to   srt-num-ddr            .
           move      rf-sdb-dat-ddr       to   srt-dat-ddr            .
           move      rf-sdb-imp-ddr       to   srt-imp-ddr            .
      *                  *---------------------------------------------*
      *                  * Rilascio del record al Sort                 *
      *                  *---------------------------------------------*
           release   srt-rec                                          .
      *                  *---------------------------------------------*
      *                  * Riciclo su Read Next [sdb]                  *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-120.
       stp-srt-inp-500.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [sdb]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofsdb"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sdb                 .
      *                  *---------------------------------------------*
      *                  * [ddp]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofddp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ddp                 .
      *                  *---------------------------------------------*
      *                  * [dcc]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessuna registrazione entro i limiti assegnati !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-prn-flg-sub
                            go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
      *              *-------------------------------------------------*
      *              * Mese e anno scadenza                            *
      *              *-------------------------------------------------*
           move      srt-dts-srt          to   s-dat                  .
           move      s-saa                to   w-rot-l01-saa-sdb      .
           move      s-mes                to   w-rot-l01-mes-sdb      .
      *              *-------------------------------------------------*
      *              * Status scadenza                                 *
      *              *-------------------------------------------------*
           move      srt-sts-srt          to   w-rot-l01-sts-scd      .
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Azzeramento totali per riepilogo                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da effettuare                       *
      *                  *---------------------------------------------*
           if        rr-tip-evd           =    02
                     go to prn-ini-cic-100.
      *                  *---------------------------------------------*
      *                  * Richiamo routine                            *
      *                  *---------------------------------------------*
           perform   azz-tot-rie-000      thru azz-tot-rie-999        .
       prn-ini-cic-100.
      *              *-------------------------------------------------*
      *              * Intestazione foglio                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da effettuare                       *
      *                  *---------------------------------------------*
           if        rr-tip-evd           =    03
                     go to prn-ini-cic-999.
      *                  *---------------------------------------------*
      *                  * Flag di intestazione pagina                 *
      *                  *---------------------------------------------*
           move      "L"                  to   w-int-pag-sta-flg      .
      *                  *---------------------------------------------*
      *                  * Esecuzione                                  *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Stampa totali di riepilogo                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da effettuare                       *
      *                  *---------------------------------------------*
           if        rr-tip-evd           =    02
                     go to prn-fin-cic-999.
      *                  *---------------------------------------------*
      *                  * Flag di intestazione pagina                 *
      *                  *---------------------------------------------*
           move      "R"                  to   w-int-pag-sta-flg      .
      *                  *---------------------------------------------*
      *                  * Intestazione nuovo foglio                   *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-fin-cic-999.
      *                  *---------------------------------------------*
      *                  * Richiamo routine di stampa riepilogo        *
      *                  *---------------------------------------------*
           perform   stp-tot-rie-000      thru stp-tot-rie-999        .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr1-100.
      *              *-------------------------------------------------*
      *              * Stampa intestazione mese                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da effettuare                       *
      *                  *---------------------------------------------*
           if        rr-tip-evd           =    03
                     go to prn-ini-lr1-999.
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    4
                     go to prn-ini-lr1-200.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
       prn-ini-lr1-200.
      *                  *---------------------------------------------*
      *                  * Interlinea subordinata                      *
      *                  *---------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       02
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr1-220.
      *                  *---------------------------------------------*
      *                  * Composizione stringa per scadenze a vista   *
      *                  *---------------------------------------------*
           if        w-rot-l01-sts-scd    not  = 02
                     go to prn-ini-lr1-240.
           move      "Scadenze a vista"   to   w-prn-ini-lr1-x40      .
           go to     prn-ini-lr1-300.
       prn-ini-lr1-240.
      *                  *---------------------------------------------*
      *                  * Composizione stringa per mesi scaduti o a   *
      *                  * scadere                                     *
      *                  *---------------------------------------------*
           move      spaces               to   w-prn-ini-lr1-x40      .
           move      1                    to   w-prn-ini-lr1-pnt      .
      *                      *-----------------------------------------*
      *                      * Literal del mese, da segreteria         *
      *                      *-----------------------------------------*
           move      "LM"                 to   s-ope                  .
           move      "E"                  to   s-tip                  .
           move      w-rot-l01-mes-sdb    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Mese                                    *
      *                      *-----------------------------------------*
           string   s-alf       delimited by   spaces
                                          into w-prn-ini-lr1-x40
                                  with pointer w-prn-ini-lr1-pnt      .
      *                      *-----------------------------------------*
      *                      * Anno                                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Editing anno                        *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-rot-l01-saa-sdb    to   p-num                  .
           add       1900                 to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * String                              *
      *                          *-------------------------------------*
           string    " "        delimited by   size
                     p-edt      delimited by   spaces
                                          into w-prn-ini-lr1-x40
                                  with pointer w-prn-ini-lr1-pnt      .
      *                      *-----------------------------------------*
      *                      * Literal per scaduto o a scadere         *
      *                      *-----------------------------------------*
           if        w-rot-l01-sts-scd    =    01
                     go to prn-ini-lr1-260
           else      go to prn-ini-lr1-280.
       prn-ini-lr1-260.
      *                      *-----------------------------------------*
      *                      * Se scaduto                              *
      *                      *-----------------------------------------*
           string    " - Scaduto"
                                delimited by   size
                                          into w-prn-ini-lr1-x40
                                  with pointer w-prn-ini-lr1-pnt      .
           go to     prn-ini-lr1-300.
       prn-ini-lr1-280.
      *                      *-----------------------------------------*
      *                      * Se a scadere                            *
      *                      *-----------------------------------------*
           string    " - A scadere"
                                delimited by   size
                                          into w-prn-ini-lr1-x40
                                  with pointer w-prn-ini-lr1-pnt      .
           go to     prn-ini-lr1-300.
       prn-ini-lr1-300.
      *                  *---------------------------------------------*
      *                  * Stampa stringa composta                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      009                  to   p-pos                  .
           move      w-prn-ini-lr1-x40    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea vuota                            *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Aggiornamento totali per riepilogo              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da effettuare                       *
      *                  *---------------------------------------------*
           if        rr-tip-evd           =    02
                     go to prn-liv-det-050.
      *                  *---------------------------------------------*
      *                  * Richiamo routine                            *
      *                  *---------------------------------------------*
           perform   agg-tot-rie-000      thru agg-tot-rie-999        .
       prn-liv-det-050.
      *              *-------------------------------------------------*
      *              * Stampa riga di dettaglio                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da effettuare                       *
      *                  *---------------------------------------------*
           if        rr-tip-evd           =    03
                     go to prn-liv-det-999.
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    1
                     go to prn-liv-det-100.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
       prn-liv-det-100.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Numero scadenza                         *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "P"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      srt-num-sdb          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Tipo scadenza                           *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      015                  to   p-pos                  .
      *
           if        srt-tip-sdb          =    01    and
                     srt-snx-dlc          =    "S"
                     move  "DC  "         to   p-alf
           else if   srt-tip-sdb          =    01    and
                     srt-snx-cts          =    "S"
                     move  "CT  "         to   p-alf
           else if   srt-tip-sdb          =    01    and
                     srt-snx-dlc          not  = "S" and
                     srt-snx-cts          not  = "S"
                     move  "RD  "         to   p-alf
           else if   srt-tip-sdb          =    02
                     move  "IE  "         to   p-alf
           else if   srt-tip-sdb          =    03
                     move  "RIBA"         to   p-alf
           else if   srt-tip-sdb          =    04
                     move  "CDO "         to   p-alf
           else if   srt-tip-sdb          =    05
                     move  "MAV "         to   p-alf
           else if   srt-tip-sdb          =    06
                     move  "RID "         to   p-alf
           else if   srt-tip-sdb          =    07
                     move  "BB  "         to   p-alf
           else if   srt-tip-sdb          =    08
                     move  "CCP "         to   p-alf
           else if   srt-tip-sdb          =    09
                     move  "RB  "         to   p-alf
           else if   srt-tip-sdb          =    10
                     move  "TR  "         to   p-alf
           else if   srt-tip-sdb          =    11
                     move  "PC  "         to   p-alf
           else      move  spaces         to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Data scadenza                           *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      022                  to   p-pos                  .
           move      srt-dts-eff          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Importo scadenza                        *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           if        srt-imp-sdb          >    999999999
                     move  11             to   p-car
                     move  spaces         to   p-edm
           else      move  09             to   p-car
                     move  "G"            to   p-edm                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           if        w-agg-tot-rie-tae    =    01
                     move  030            to   p-pos
           else if   w-agg-tot-rie-tae    =    02
                     move  042            to   p-pos
           else if   w-agg-tot-rie-tae    =    03
                     move  054            to   p-pos
           else if   w-agg-tot-rie-tae    =    04
                     move  066            to   p-pos                  .
           move      srt-imp-sdb          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Codice cliente                          *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      080                  to   p-pos                  .
           move      srt-cod-cli          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Dipendenza del cliente                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      088                  to   p-pos                  .
           move      srt-dpz-cli          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Ragione sociale cliente                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      093                  to   p-pos                  .
           move      srt-rag-soc          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri intestazione standard    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing data base calcolo mesi              *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      "<"                  to   p-edm                  .
           move      rr-dat-bcm           to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Composizione titolo                         *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-tit-des-tit      .
           string    "SITUAZIONE ESPOSIZIONE GLOBALE CREDITI AL "
                                delimited by   size
                     p-edt      delimited by   spaces
                                          into w-cnt-tit-des-tit      .
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-cnt-tit-dat-stp      .
           move      p-pag                to   w-cnt-tit-num-pag      .
           add       1                    to   w-cnt-tit-num-pag      .
      *              *-------------------------------------------------*
      *              * Intestazione standard                           *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per interruzione forzata          *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-sta-999.
      *              *-------------------------------------------------*
      *              * Eventuale titolo centrale                       *
      *              *-------------------------------------------------*
           if        w-int-pag-sta-flg    =    spaces
                     go to int-pag-sta-100.
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      26                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      054                  to   p-pos                  .
           if        w-int-pag-sta-flg    =    "L"
                     move  "-- Lista delle scadenze --"
                                          to   p-alf
           else if   w-int-pag-sta-flg    =    "R"
                     move  "      -- Riepilogo --     "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-100.
      *              *-------------------------------------------------*
      *              * Se flag intestazione pagina pari a 'R' non si   *
      *              * stampa la fincatura seguente                    *
      *              *-------------------------------------------------*
           if        w-int-pag-sta-flg    =    "R"
                     go to  int-pag-sta-200.
      *              *-------------------------------------------------*
      *              * Fincatura 1                                     *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "          Scadenza                                
      -              "Importo                                           
      -              "  Cliente                       "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura 1                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "----------------------------- --------------------
      -              "---------------------------  ---------------------
      -              "--------------------------------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura 2                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "  Numero      Tipo     Data     Scaduto    Insolut
      -              "o    A scadere   Circolante   Codice Dip.         
      -              "     Ragione sociale            "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura 2                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "----------- -------- -------- ----------- --------
      -              "--- ----------- -----------  ------- ---- --------
      -              "--------------------------------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-200.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di intestazione            *
      *              *-------------------------------------------------*
           move      spaces               to   w-int-pag-sta-flg      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dcc]                         *
      *    *-----------------------------------------------------------*
       let-arc-dcc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codici a zero o spazi                   *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-cli    =    zero
                     go to let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI"             to   f-key                  .
           move      w-let-arc-dcc-cli    to   rf-dcc-cod-cli         .
           move      w-let-arc-dcc-dpz    to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcc-400.
       let-arc-dcc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcc-rag-key       to   w-let-arc-dcc-rsu      .
           move      rf-dcc-rag-soc       to   w-let-arc-dcc-rag      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcc-999.
       let-arc-dcc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcc-flg      .
           move      all   "."            to   w-let-arc-dcc-rag      .
           go to     let-arc-dcc-520.
       let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-rag      .
       let-arc-dcc-520.
           move      spaces               to   w-let-arc-dcc-rsu      .
       let-arc-dcc-999.
           exit.

      *    *===========================================================*
      *    * Determinazione status scadenza                            *
      *    *-----------------------------------------------------------*
       det-srd-sdb-000.
      *              *-------------------------------------------------*
      *              * Determinazione sigla ultima operazione eseguita *
      *              * sulla scadenza                                  *
      *              *-------------------------------------------------*
       det-srd-sdb-025.
      *                  *---------------------------------------------*
      *                  * Normalizzazione iniziale sigla              *
      *                  *---------------------------------------------*
           move      spaces               to   w-det-srd-sdb-suo      .
       det-srd-sdb-050.
      *                  *---------------------------------------------*
      *                  * Se la data di emissione scadenza e' supe-   *
      *                  * riore alla data di riferimento per la de-   *
      *                  * terminazione : uscita con status 'N'        *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-emi       >    w-det-srd-sdb-drd
                     move  "N"            to   w-det-srd-sdb-sts
                     go to det-srd-sdb-999.
       det-srd-sdb-100.
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "EMI"                to   w-det-srd-sdb-suo      .
       det-srd-sdb-125.
      *                  *---------------------------------------------*
      *                  * Storno                                      *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-sto       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-sto       not  = zero
                     move  "SSC"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-150.
      *                  *---------------------------------------------*
      *                  * Riscossione                                 *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-ris       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-ris       not  = zero
                     go to det-srd-sdb-155
           else      go to det-srd-sdb-200.
       det-srd-sdb-155.
      *                      *-----------------------------------------*
      *                      * Determinazione in funizione delle moda- *
      *                      * lita' di riscossione                    *
      *                      *-----------------------------------------*
           if        rf-sdb-mod-ris       =    01 or
                     rf-sdb-mod-ris       =    02 or
                     rf-sdb-mod-ris       =    03 or
                     rf-sdb-mod-ris       =    04
                     move  "RIS"          to   w-det-srd-sdb-suo
           else if   rf-sdb-mod-ris       =    21 or
                     rf-sdb-mod-ris       =    22 or
                     rf-sdb-mod-ris       =    23 or
                     rf-sdb-mod-ris       =    24
                     move  "PAG"          to   w-det-srd-sdb-suo
           else if   rf-sdb-mod-ris       =    50
                     move  "CMP"          to   w-det-srd-sdb-suo      .
           go to     det-srd-sdb-800.
       det-srd-sdb-200.
      *                  *---------------------------------------------*
      *                  * Richiamo della scadenza presentata          *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-rsp       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-rsp       not  = zero
                     move  "RSP"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-225.
      *                  *---------------------------------------------*
      *                  * Accredito scadenza al dopo incasso          *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-acs       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-acs       not  = zero
                     move  "ACS"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-250.
      *                  *---------------------------------------------*
      *                  * Notizia di buon esito sulla scadenza        *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-nbe       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-nbe       not  = zero
                     move  "NBE"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-275.
      *                  *---------------------------------------------*
      *                  * Presunto buon esito sulla scadenza          *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-pbe       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-pbe       not  = zero
                     move  "PBE"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-300.
      *                  *---------------------------------------------*
      *                  * Insoluto sulla scadenza presentata          *
      *                  *---------------------------------------------*
           if        rf-sdb-dtr-isp       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-isp       not  = zero
                     move  "ISP"          to   w-det-srd-sdb-suo
                     go to det-srd-sdb-800.
       det-srd-sdb-400.
      *                  *---------------------------------------------*
      *                  * Operazioni relative alla distinta di pre-   *
      *                  * sentazione                                  *
      *                  *---------------------------------------------*
       det-srd-sdb-425.
      *                      *-----------------------------------------*
      *                      * Se la scadenza non porta un numero di-  *
      *                      * stinta si escludono tutti i controlli   *
      *                      * sulle operazioni relative alla distinta *
      *                      * di presentazione                        *
      *                      *-----------------------------------------*
           if        rf-sdb-num-ddp       =    zero
                     go to det-srd-sdb-625.
       det-srd-sdb-450.
      *                      *-----------------------------------------*
      *                      * Lettura distinta di presentazione       *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMDDP    "         to   f-key                  .
           move      rf-sdb-num-ddp       to   rf-ddp-num-ddp         .
           move      "pgm/gep/fls/ioc/obj/iofddp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ddp                 .
       det-srd-sdb-475.
      *                      *-----------------------------------------*
      *                      * Se distinta di presentazione non esi-   *
      *                      * stente in archivio distinte si escludo- *
      *                      * no tutti i controlli sulle operazioni   *
      *                      * relative alla distinta di presentazione *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-srd-sdb-625.
       det-srd-sdb-500.
      *                      *-----------------------------------------*
      *                      * Se la data di composizione distinta e'  *
      *                      * superiore alla data di riferimento per  *
      *                      * la determinazione si escludono tutti i  *
      *                      * controlli sulle operazioni relative al- *
      *                      * la distinta di presentazione            *
      *                      *-----------------------------------------*
           if        rf-ddp-dtr-com       >    w-det-srd-sdb-drd
                     go to det-srd-sdb-625.
       det-srd-sdb-525.
      *                      *-----------------------------------------*
      *                      * Composizione distinta                   *
      *                      *-----------------------------------------*
           move      "COM"                to   w-det-srd-sdb-suo      .
       det-srd-sdb-550.
      *                      *-----------------------------------------*
      *                      * Presentazione distinta                  *
      *                      *-----------------------------------------*
           if        rf-ddp-dtr-pre       not  > w-det-srd-sdb-drd and
                     rf-ddp-dtr-pre       not  = zero
                     move  "PRE"          to   w-det-srd-sdb-suo      .
       det-srd-sdb-575.
      *                      *-----------------------------------------*
      *                      * Accettazione distinta                   *
      *                      *-----------------------------------------*
           if        rf-ddp-dtr-act       not  > w-det-srd-sdb-drd and
                     rf-ddp-dtr-act       not  = zero
                     move  "ACT"          to   w-det-srd-sdb-suo      .
       det-srd-sdb-600.
      *                      *-----------------------------------------*
      *                      * Accredito distinta                      *
      *                      *-----------------------------------------*
           if        rf-ddp-dtr-acd       not  > w-det-srd-sdb-drd and
                     rf-ddp-dtr-acd       not  = zero
                     move  "ACD"          to   w-det-srd-sdb-suo      .
       det-srd-sdb-625.
      *                      *-----------------------------------------*
      *                      * Fine controlli su operazioni relative   *
      *                      * alla distinta di presentazione          *
      *                      *-----------------------------------------*
           go to     det-srd-sdb-800.
       det-srd-sdb-800.
      *              *-------------------------------------------------*
      *              * Determinazione dello status della scadenza in   *
      *              * funzione della sigla dell'ultima operazione e-  *
      *              * seguita sulla scadenza                          *
      *              *-------------------------------------------------*
           if        w-det-srd-sdb-suo    =    "EMI" or
                     w-det-srd-sdb-suo    =    "COM" or
                     w-det-srd-sdb-suo    =    "PRE" or
                     w-det-srd-sdb-suo    =    "ACT" or
                     w-det-srd-sdb-suo    =    "ACD"
                     move  "A"            to   w-det-srd-sdb-sts
           else if   w-det-srd-sdb-suo    =    "SSC" or
                     w-det-srd-sdb-suo    =    "RIS" or
                     w-det-srd-sdb-suo    =    "PAG" or
                     w-det-srd-sdb-suo    =    "CMP" or
                     w-det-srd-sdb-suo    =    "RSP" or
                     w-det-srd-sdb-suo    =    "ACS" or
                     w-det-srd-sdb-suo    =    "NBE" or
                     w-det-srd-sdb-suo    =    "PBE" or
                     w-det-srd-sdb-suo    =    "ISP"
                     move  "C"            to   w-det-srd-sdb-sts
           else      move  spaces         to   w-det-srd-sdb-sts      .
      *                  *---------------------------------------------*
      *                  * Eventuale aggiustamento in caso di insoluto *
      *                  *---------------------------------------------*
           if        w-det-srd-sdb-suo    not  = "ISP"
                     go to det-srd-sdb-999.
      *                      *-----------------------------------------*
      *                      * Se la scadenza e' comunque stata ri-    *
      *                      * scossa : tutto inalterato               *
      *                      *-----------------------------------------*
           if        rf-sdb-dtr-ris       not  > w-det-srd-sdb-drd and
                     rf-sdb-dtr-ris       not  = zero
                     go to det-srd-sdb-999.
      *                      *-----------------------------------------*
      *                      * Se a fronte dell'insoluto non e' stata  *
      *                      * emessa una nuova scadenza, essa e' da   *
      *                      * intendersi ancora aperta                *
      *                      *-----------------------------------------*
           if        rf-sdb-ens-isp       =    02   and
                     rf-sdb-nns-isp       =    zero
                     move  "A"            to   w-det-srd-sdb-sts      .
       det-srd-sdb-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali per riepilogo                          *
      *    *-----------------------------------------------------------*
       azz-tot-rie-000.
      *              *-------------------------------------------------*
      *              * Per prospetto generale                          *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-pge-tsc          .
           move      zero                 to   w-tot-pge-tin          .
           move      zero                 to   w-tot-pge-tvi          .
           move      zero                 to   w-tot-pge-tas          .
           move      zero                 to   w-tot-pge-tci          .
           move      zero                 to   w-tot-pge-tot          .
           move      zero                 to   w-azz-tot-rie-c01      .
       azz-tot-rie-020.
           add       1                    to   w-azz-tot-rie-c01      .
           if        w-azz-tot-rie-c01    >    12
                     go to azz-tot-rie-100.
           move      zero                 to   w-tot-pge-sca
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-tot-pge-isp
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-tot-pge-vis
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-tot-pge-asc
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-tot-pge-cir
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-tot-pge-tts
                                              (w-azz-tot-rie-c01)     .
           go to     azz-tot-rie-020.
       azz-tot-rie-100.
      *              *-------------------------------------------------*
      *              * Per prospetto mensile 'Scaduto'                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-azz-tot-rie-c01      .
       azz-tot-rie-120.
           add       1                    to   w-azz-tot-rie-c01      .
           if        w-azz-tot-rie-c01    >    8
                     go to azz-tot-rie-180.
           move      zero                 to   w-tot-pms-saa
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-tot-pms-mes
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-azz-tot-rie-c02      .
       azz-tot-rie-140.
           add       1                    to   w-azz-tot-rie-c02      .
           if        w-azz-tot-rie-c02    >    12
                     go to azz-tot-rie-160.
           move      zero                 to   w-tot-pms-imp
                                              (w-azz-tot-rie-c01
                                               w-azz-tot-rie-c02)     .
           go to     azz-tot-rie-140.
       azz-tot-rie-160.
           move      zero                 to   w-tot-pms-tme
                                              (w-azz-tot-rie-c01)     .
           go to     azz-tot-rie-120.
       azz-tot-rie-180.
           move      zero                 to   w-tot-pms-inx          .
       azz-tot-rie-200.
      *              *-------------------------------------------------*
      *              * Per prospetto mensile 'Insoluto'                *
      *              *-------------------------------------------------*
           move      zero                 to   w-azz-tot-rie-c01      .
       azz-tot-rie-220.
           add       1                    to   w-azz-tot-rie-c01      .
           if        w-azz-tot-rie-c01    >    8
                     go to azz-tot-rie-280.
           move      zero                 to   w-tot-pmi-saa
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-tot-pmi-mes
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-azz-tot-rie-c02      .
       azz-tot-rie-240.
           add       1                    to   w-azz-tot-rie-c02      .
           if        w-azz-tot-rie-c02    >    12
                     go to azz-tot-rie-260.
           move      zero                 to   w-tot-pmi-imp
                                              (w-azz-tot-rie-c01
                                               w-azz-tot-rie-c02)     .
           go to     azz-tot-rie-240.
       azz-tot-rie-260.
           move      zero                 to   w-tot-pmi-tme
                                              (w-azz-tot-rie-c01)     .
           go to     azz-tot-rie-220.
       azz-tot-rie-280.
           move      zero                 to   w-tot-pmi-inx          .
       azz-tot-rie-300.
      *              *-------------------------------------------------*
      *              * Per prospetto mensile 'A scadere'               *
      *              *-------------------------------------------------*
           move      zero                 to   w-azz-tot-rie-c01      .
       azz-tot-rie-320.
           add       1                    to   w-azz-tot-rie-c01      .
           if        w-azz-tot-rie-c01    >    8
                     go to azz-tot-rie-380.
           move      zero                 to   w-tot-pma-saa
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-tot-pma-mes
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-azz-tot-rie-c02      .
       azz-tot-rie-340.
           add       1                    to   w-azz-tot-rie-c02      .
           if        w-azz-tot-rie-c02    >    12
                     go to azz-tot-rie-360.
           move      zero                 to   w-tot-pma-imp
                                              (w-azz-tot-rie-c01
                                               w-azz-tot-rie-c02)     .
           go to     azz-tot-rie-340.
       azz-tot-rie-360.
           move      zero                 to   w-tot-pma-tme
                                              (w-azz-tot-rie-c01)     .
           go to     azz-tot-rie-320.
       azz-tot-rie-380.
           move      zero                 to   w-tot-pma-inx          .
       azz-tot-rie-400.
      *              *-------------------------------------------------*
      *              * Per prospetto mensile 'Circolante'              *
      *              *-------------------------------------------------*
           move      zero                 to   w-azz-tot-rie-c01      .
       azz-tot-rie-420.
           add       1                    to   w-azz-tot-rie-c01      .
           if        w-azz-tot-rie-c01    >    8
                     go to azz-tot-rie-480.
           move      zero                 to   w-tot-pmc-saa
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-tot-pmc-mes
                                              (w-azz-tot-rie-c01)     .
           move      zero                 to   w-azz-tot-rie-c02      .
       azz-tot-rie-440.
           add       1                    to   w-azz-tot-rie-c02      .
           if        w-azz-tot-rie-c02    >    12
                     go to azz-tot-rie-460.
           move      zero                 to   w-tot-pmc-imp
                                              (w-azz-tot-rie-c01
                                               w-azz-tot-rie-c02)     .
           go to     azz-tot-rie-440.
       azz-tot-rie-460.
           move      zero                 to   w-tot-pmc-tme
                                              (w-azz-tot-rie-c01)     .
           go to     azz-tot-rie-420.
       azz-tot-rie-480.
           move      zero                 to   w-tot-pmc-inx          .
       azz-tot-rie-500.
      *              *-------------------------------------------------*
      *              * Indici per tabelle di lavoro                    *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-pms-wix          .
           move      zero                 to   w-tot-pmi-wix          .
           move      zero                 to   w-tot-pmc-wix          .
       azz-tot-rie-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento totali per riepilogo                        *
      *    *-----------------------------------------------------------*
       agg-tot-rie-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo aggiornamento effettuato   *
      *              *-------------------------------------------------*
           move      zero                 to   w-agg-tot-rie-tae      .
      *              *-------------------------------------------------*
      *              * Determinazione indice per tabella tipi scadenza *
      *              *-------------------------------------------------*
           if        srt-tip-sdb          =    01 and
                     srt-snx-dlc          =    "N"
                     move  01             to   w-agg-tot-rie-its
           else if   srt-tip-sdb          =    01 and
                     srt-snx-dlc          =    "S"
                     move  02             to   w-agg-tot-rie-its
           else if   srt-tip-sdb          =    02
                     move  03             to   w-agg-tot-rie-its
           else if   srt-tip-sdb          =    03
                     move  04             to   w-agg-tot-rie-its
           else if   srt-tip-sdb          =    04
                     move  05             to   w-agg-tot-rie-its
           else if   srt-tip-sdb          =    05
                     move  06             to   w-agg-tot-rie-its
           else if   srt-tip-sdb          =    06
                     move  07             to   w-agg-tot-rie-its
           else if   srt-tip-sdb          =    07
                     move  08             to   w-agg-tot-rie-its
           else if   srt-tip-sdb          =    08
                     move  09             to   w-agg-tot-rie-its
           else if   srt-tip-sdb          =    09
                     move  10             to   w-agg-tot-rie-its
           else if   srt-tip-sdb          =    10
                     move  11             to   w-agg-tot-rie-its
           else if   srt-tip-sdb          =    11
                     move  12             to   w-agg-tot-rie-its      .
      *              *-------------------------------------------------*
      *              * Aggiornamento totale per tipo scadenza          *
      *              *-------------------------------------------------*
           add       srt-imp-sdb          to   w-tot-pge-tts
                                              (w-agg-tot-rie-its)     .
      *              *-------------------------------------------------*
      *              * Aggiornamento totale generale                   *
      *              *-------------------------------------------------*
           add       srt-imp-sdb          to   w-tot-pge-tot          .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo scadenza        *
      *              *-------------------------------------------------*
           if        srt-tip-sdb          =    01 or
                     srt-tip-sdb          =    07 or
                     srt-tip-sdb          =    08
                     go to agg-tot-rie-100
           else      go to agg-tot-rie-200.
       agg-tot-rie-100.
      *              *-------------------------------------------------*
      *              * Se Rimesse dirette, Bonfici o C/C postali       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dello status per sort  *
      *                  *---------------------------------------------*
           if        srt-sts-srt          =    01
                     go to agg-tot-rie-110
           else if   srt-sts-srt          =    02
                     go to agg-tot-rie-120
           else if   srt-sts-srt          =    03
                     go to agg-tot-rie-130.
       agg-tot-rie-110.
      *                  *---------------------------------------------*
      *                  * Status scadenza : Scaduta                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento totali per prospetto ge-  *
      *                      * nerale                                  *
      *                      *-----------------------------------------*
           add       srt-imp-sdb          to   w-tot-pge-sca
                                              (w-agg-tot-rie-its)     .
           add       srt-imp-sdb          to   w-tot-pge-tsc          .
      *                      *-----------------------------------------*
      *                      * Aggiornamento totali per prospetto      *
      *                      * 'Scaduto'                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Ciclo di scansione tabella di lavo- *
      *                          * ro per verficare se il periodo e'   *
      *                          * gia' memorizzato                    *
      *                          *-------------------------------------*
           move      zero                 to   w-agg-tot-rie-inx      .
       agg-tot-rie-112.
           add       1                    to   w-agg-tot-rie-inx      .
           if        w-agg-tot-rie-inx    >    w-tot-pms-wix
                     go to agg-tot-rie-116.
           if        w-rot-l01-saa-sdb    =    w-tot-pms-wsa
                                              (w-agg-tot-rie-inx) and
                     w-rot-l01-mes-sdb    =    w-tot-pms-wms
                                              (w-agg-tot-rie-inx)
                     go to agg-tot-rie-114
           else      go to agg-tot-rie-112.
       agg-tot-rie-114.
      *                          *-------------------------------------*
      *                          * Se periodo trovato : ad aggiorna-   *
      *                          * mento importi                       *
      *                          *-------------------------------------*
           go to     agg-tot-rie-118.
       agg-tot-rie-116.
      *                          *-------------------------------------*
      *                          * Se periodo non trovato : memorizza- *
      *                          * zione nuovo elemento                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Incremento indice per tabella   *
      *                              * di lavoro totali mensili        *
      *                              *---------------------------------*
           if        w-tot-pms-wix        not  = 100
                     add  1               to   w-tot-pms-wix          .
      *                              *---------------------------------*
      *                              * Bufferizzazione secolo/anno     *
      *                              *---------------------------------*
           move      w-rot-l01-saa-sdb    to   w-tot-pms-wsa
                                              (w-tot-pms-wix)         .
      *                              *---------------------------------*
      *                              * Bufferizzazione mese            *
      *                              *---------------------------------*
           move      w-rot-l01-mes-sdb    to   w-tot-pms-wms
                                              (w-tot-pms-wix)         .
      *                              *---------------------------------*
      *                              * Normalizzazione importi per me- *
      *                              * se                              *
      *                              *---------------------------------*
           move      zero                 to   w-tot-pms-wim
                                              (w-tot-pms-wix, 01)     .
           move      zero                 to   w-tot-pms-wim
                                              (w-tot-pms-wix, 02)     .
           move      zero                 to   w-tot-pms-wim
                                              (w-tot-pms-wix, 03)     .
           move      zero                 to   w-tot-pms-wim
                                              (w-tot-pms-wix, 04)     .
           move      zero                 to   w-tot-pms-wim
                                              (w-tot-pms-wix, 05)     .
           move      zero                 to   w-tot-pms-wim
                                              (w-tot-pms-wix, 06)     .
           move      zero                 to   w-tot-pms-wim
                                              (w-tot-pms-wix, 07)     .
           move      zero                 to   w-tot-pms-wim
                                              (w-tot-pms-wix, 08)     .
           move      zero                 to   w-tot-pms-wim
                                              (w-tot-pms-wix, 09)     .
           move      zero                 to   w-tot-pms-wim
                                              (w-tot-pms-wix, 10)     .
           move      zero                 to   w-tot-pms-wim
                                              (w-tot-pms-wix, 11)     .
           move      zero                 to   w-tot-pms-wim
                                              (w-tot-pms-wix, 12)     .
      *                              *---------------------------------*
      *                              * Normalizzazione totale mese     *
      *                              *---------------------------------*
           move      zero                 to   w-tot-pms-wtm
                                              (w-tot-pms-wix)         .
      *                              *---------------------------------*
      *                              * Forzatura indice di lavoro      *
      *                              *---------------------------------*
           move      w-tot-pms-wix        to   w-agg-tot-rie-inx      .
      *                              *---------------------------------*
      *                              * Ad aggiornamento importi        *
      *                              *---------------------------------*
           go to     agg-tot-rie-118.
       agg-tot-rie-118.
      *                          *-------------------------------------*
      *                          * Aggiornamento importi               *
      *                          *-------------------------------------*
           add       srt-imp-sdb          to   w-tot-pms-wim
                                              (w-agg-tot-rie-inx
                                               w-agg-tot-rie-its)     .
           add       srt-imp-sdb          to   w-tot-pms-wtm
                                              (w-agg-tot-rie-inx)     .
      *                       *----------------------------------------*
      *                       * Determinazione tipo aggiornamento      *
      *                       *----------------------------------------*
           move      01                   to   w-agg-tot-rie-tae      .
      *                       *----------------------------------------*
      *                       * Uscita                                 *
      *                       *----------------------------------------*
           go to     agg-tot-rie-999.
       agg-tot-rie-120.
      *                  *---------------------------------------------*
      *                  * Status scadenza : A vista                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento totali per prospetto ge-  *
      *                      * nerale                                  *
      *                      *-----------------------------------------*
           add       srt-imp-sdb          to   w-tot-pge-vis
                                              (w-agg-tot-rie-its)     .
           add       srt-imp-sdb          to   w-tot-pge-tvi          .
      *                       *----------------------------------------*
      *                       * Determinazione tipo aggiornamento      *
      *                       *----------------------------------------*
           move      01                   to   w-agg-tot-rie-tae      .
      *                       *----------------------------------------*
      *                       * Uscita                                 *
      *                       *----------------------------------------*
           go to     agg-tot-rie-999.
       agg-tot-rie-130.
      *                  *---------------------------------------------*
      *                  * Status scadenza : A scadere                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento totali per prospetto ge-  *
      *                      * nerale                                  *
      *                      *-----------------------------------------*
           add       srt-imp-sdb          to   w-tot-pge-asc
                                              (w-agg-tot-rie-its)     .
           add       srt-imp-sdb          to   w-tot-pge-tas          .
      *                      *-----------------------------------------*
      *                      * Aggiornamento totali per prospetto      *
      *                      * 'A Scadere'                             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Ciclo di scansione tabella di lavo- *
      *                          * ro per verficare se il periodo e'   *
      *                          * gia' memorizzato                    *
      *                          *-------------------------------------*
           move      zero                 to   w-agg-tot-rie-inx      .
       agg-tot-rie-132.
           add       1                    to   w-agg-tot-rie-inx      .
           if        w-agg-tot-rie-inx    >    w-tot-pma-inx
                     go to agg-tot-rie-136.
           if        w-rot-l01-saa-sdb    =    w-tot-pma-saa
                                              (w-agg-tot-rie-inx) and
                     w-rot-l01-mes-sdb    =    w-tot-pma-mes
                                              (w-agg-tot-rie-inx)
                     go to agg-tot-rie-134
           else      go to agg-tot-rie-132.
       agg-tot-rie-134.
      *                          *-------------------------------------*
      *                          * Se periodo trovato : ad aggiorna-   *
      *                          * mento importi                       *
      *                          *-------------------------------------*
           go to     agg-tot-rie-138.
       agg-tot-rie-136.
      *                          *-------------------------------------*
      *                          * Se periodo non trovato : memorizza- *
      *                          * zione nuovo elemento                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Incremento indice per tabella   *
      *                              * di lavoro totali mensili        *
      *                              *---------------------------------*
           if        w-tot-pma-inx        not  = 8
                     add  1               to   w-tot-pma-inx          .
      *                              *---------------------------------*
      *                              * Bufferizzazione secolo/anno     *
      *                              *---------------------------------*
           move      w-rot-l01-saa-sdb    to   w-tot-pma-saa
                                              (w-tot-pma-inx)         .
      *                              *---------------------------------*
      *                              * Bufferizzazione mese            *
      *                              *---------------------------------*
           move      w-rot-l01-mes-sdb    to   w-tot-pma-mes
                                              (w-tot-pma-inx)         .
      *                              *---------------------------------*
      *                              * Forzatura indice di lavoro      *
      *                              *---------------------------------*
           move      w-tot-pma-inx        to   w-agg-tot-rie-inx      .
      *                              *---------------------------------*
      *                              * Ad aggiornamento importi        *
      *                              *---------------------------------*
           go to     agg-tot-rie-138.
       agg-tot-rie-138.
      *                          *-------------------------------------*
      *                          * Aggiornamento importi               *
      *                          *-------------------------------------*
           add       srt-imp-sdb          to   w-tot-pma-imp
                                              (w-agg-tot-rie-inx
                                               w-agg-tot-rie-its)     .
           add       srt-imp-sdb          to   w-tot-pma-tme
                                              (w-agg-tot-rie-inx)     .
      *                       *----------------------------------------*
      *                       * Determinazione tipo aggiornamento      *
      *                       *----------------------------------------*
           move      03                   to   w-agg-tot-rie-tae      .
      *                       *----------------------------------------*
      *                       * Uscita                                 *
      *                       *----------------------------------------*
           go to     agg-tot-rie-999.
       agg-tot-rie-200.
      *              *-------------------------------------------------*
      *              * Se altri tipi scadenza                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione della sigla ultima   *
      *                  * operazione effettuata sulla scadenza        *
      *                  *---------------------------------------------*
           if        srt-sgl-uop          =    "PRE" or
                     srt-sgl-uop          =    "ACT" or
                     srt-sgl-uop          =    "ACD"
                     go to agg-tot-rie-210
           else if   srt-sgl-uop          =    "ISP"
                     go to agg-tot-rie-220
           else      go to agg-tot-rie-230.
       agg-tot-rie-210.
      *                  *---------------------------------------------*
      *                  * Se sigla ultima operazione                  *
      *                  * - Presentazione                             *
      *                  * - Accettazione da parte della banca         *
      *                  * - Accredito                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento totali per prospetto ge-  *
      *                      * nerale                                  *
      *                      *-----------------------------------------*
           add       srt-imp-sdb          to   w-tot-pge-cir
                                              (w-agg-tot-rie-its)     .
           add       srt-imp-sdb          to   w-tot-pge-tci          .
      *                      *-----------------------------------------*
      *                      * Aggiornamento totali per prospetto      *
      *                      * 'Circolante'                            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Ciclo di scansione tabella di lavo- *
      *                          * ro per verficare se il periodo e'   *
      *                          * gia' memorizzato                    *
      *                          *-------------------------------------*
           move      zero                 to   w-agg-tot-rie-inx      .
       agg-tot-rie-212.
           add       1                    to   w-agg-tot-rie-inx      .
           if        w-agg-tot-rie-inx    >    w-tot-pmc-wix
                     go to agg-tot-rie-216.
           if        w-rot-l01-saa-sdb    =    w-tot-pmc-wsa
                                              (w-agg-tot-rie-inx) and
                     w-rot-l01-mes-sdb    =    w-tot-pmc-wms
                                              (w-agg-tot-rie-inx)
                     go to agg-tot-rie-214
           else      go to agg-tot-rie-212.
       agg-tot-rie-214.
      *                          *-------------------------------------*
      *                          * Se periodo trovato : ad aggiorna-   *
      *                          * mento importi                       *
      *                          *-------------------------------------*
           go to     agg-tot-rie-218.
       agg-tot-rie-216.
      *                          *-------------------------------------*
      *                          * Se periodo non trovato : memorizza- *
      *                          * zione nuovo elemento                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Incremento indice per tabella   *
      *                              * di lavoro totali mensili        *
      *                              *---------------------------------*
           if        w-tot-pmc-wix        not  = 100
                     add  1               to   w-tot-pmc-wix          .
      *                              *---------------------------------*
      *                              * Bufferizzazione secolo/anno     *
      *                              *---------------------------------*
           move      w-rot-l01-saa-sdb    to   w-tot-pmc-wsa
                                              (w-tot-pmc-wix)         .
      *                              *---------------------------------*
      *                              * Bufferizzazione mese            *
      *                              *---------------------------------*
           move      w-rot-l01-mes-sdb    to   w-tot-pmc-wms
                                              (w-tot-pmc-wix)         .
      *                              *---------------------------------*
      *                              * Normalizzazione importi per me- *
      *                              * se                              *
      *                              *---------------------------------*
           move      zero                 to   w-tot-pmc-wim
                                              (w-tot-pmc-wix, 01)     .
           move      zero                 to   w-tot-pmc-wim
                                              (w-tot-pmc-wix, 02)     .
           move      zero                 to   w-tot-pmc-wim
                                              (w-tot-pmc-wix, 03)     .
           move      zero                 to   w-tot-pmc-wim
                                              (w-tot-pmc-wix, 04)     .
           move      zero                 to   w-tot-pmc-wim
                                              (w-tot-pmc-wix, 05)     .
           move      zero                 to   w-tot-pmc-wim
                                              (w-tot-pmc-wix, 06)     .
           move      zero                 to   w-tot-pmc-wim
                                              (w-tot-pmc-wix, 07)     .
           move      zero                 to   w-tot-pmc-wim
                                              (w-tot-pmc-wix, 08)     .
           move      zero                 to   w-tot-pmc-wim
                                              (w-tot-pmc-wix, 09)     .
           move      zero                 to   w-tot-pmc-wim
                                              (w-tot-pmc-wix, 10)     .
           move      zero                 to   w-tot-pmc-wim
                                              (w-tot-pmc-wix, 11)     .
           move      zero                 to   w-tot-pmc-wim
                                              (w-tot-pmc-wix, 12)     .
      *                              *---------------------------------*
      *                              * Normalizzazione totale mese     *
      *                              *---------------------------------*
           move      zero                 to   w-tot-pmc-wtm
                                              (w-tot-pmc-wix)         .
      *                              *---------------------------------*
      *                              * Forzatura indice di lavoro      *
      *                              *---------------------------------*
           move      w-tot-pmc-wix        to   w-agg-tot-rie-inx      .
      *                              *---------------------------------*
      *                              * Ad aggiornamento importi        *
      *                              *---------------------------------*
           go to     agg-tot-rie-218.
       agg-tot-rie-218.
      *                          *-------------------------------------*
      *                          * Aggiornamento importi               *
      *                          *-------------------------------------*
           add       srt-imp-sdb          to   w-tot-pmc-wim
                                              (w-agg-tot-rie-inx
                                               w-agg-tot-rie-its)     .
           add       srt-imp-sdb          to   w-tot-pmc-wtm
                                              (w-agg-tot-rie-inx)     .
      *                       *----------------------------------------*
      *                       * Determinazione tipo aggiornamento      *
      *                       *----------------------------------------*
           move      04                   to   w-agg-tot-rie-tae      .
      *                       *----------------------------------------*
      *                       * Uscita                                 *
      *                       *----------------------------------------*
           go to     agg-tot-rie-999.
       agg-tot-rie-220.
      *                  *---------------------------------------------*
      *                  * Se sigla ultima operazione                  *
      *                  * - Insoluto                                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento totali per prospetto ge-  *
      *                      * nerale                                  *
      *                      *-----------------------------------------*
           add       srt-imp-sdb          to   w-tot-pge-isp
                                              (w-agg-tot-rie-its)     .
           add       srt-imp-sdb          to   w-tot-pge-tin          .
      *                      *-----------------------------------------*
      *                      * Aggiornamento totali per prospetto      *
      *                      * 'Insoluti'                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Ciclo di scansione tabella di lavo- *
      *                          * ro per verficare se il periodo e'   *
      *                          * gia' memorizzato                    *
      *                          *-------------------------------------*
           move      zero                 to   w-agg-tot-rie-inx      .
       agg-tot-rie-222.
           add       1                    to   w-agg-tot-rie-inx      .
           if        w-agg-tot-rie-inx    >    w-tot-pmi-wix
                     go to agg-tot-rie-226.
           if        w-rot-l01-saa-sdb    =    w-tot-pmi-wsa
                                              (w-agg-tot-rie-inx) and
                     w-rot-l01-mes-sdb    =    w-tot-pmi-wms
                                              (w-agg-tot-rie-inx)
                     go to agg-tot-rie-224
           else      go to agg-tot-rie-222.
       agg-tot-rie-224.
      *                          *-------------------------------------*
      *                          * Se periodo trovato : ad aggiorna-   *
      *                          * mento importi                       *
      *                          *-------------------------------------*
           go to     agg-tot-rie-228.
       agg-tot-rie-226.
      *                          *-------------------------------------*
      *                          * Se periodo non trovato : memorizza- *
      *                          * zione nuovo elemento                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Incremento indice per tabella   *
      *                              * di lavoro totali mensili        *
      *                              *---------------------------------*
           if        w-tot-pmi-wix        not  = 100
                     add  1               to   w-tot-pmi-wix          .
      *                              *---------------------------------*
      *                              * Bufferizzazione secolo/anno     *
      *                              *---------------------------------*
           move      w-rot-l01-saa-sdb    to   w-tot-pmi-wsa
                                              (w-tot-pmi-wix)         .
      *                              *---------------------------------*
      *                              * Bufferizzazione mese            *
      *                              *---------------------------------*
           move      w-rot-l01-mes-sdb    to   w-tot-pmi-wms
                                              (w-tot-pmi-wix)         .
      *                              *---------------------------------*
      *                              * Normalizzazione importi per me- *
      *                              * se                              *
      *                              *---------------------------------*
           move      zero                 to   w-tot-pmi-wim
                                              (w-tot-pmi-wix, 01)     .
           move      zero                 to   w-tot-pmi-wim
                                              (w-tot-pmi-wix, 02)     .
           move      zero                 to   w-tot-pmi-wim
                                              (w-tot-pmi-wix, 03)     .
           move      zero                 to   w-tot-pmi-wim
                                              (w-tot-pmi-wix, 04)     .
           move      zero                 to   w-tot-pmi-wim
                                              (w-tot-pmi-wix, 05)     .
           move      zero                 to   w-tot-pmi-wim
                                              (w-tot-pmi-wix, 06)     .
           move      zero                 to   w-tot-pmi-wim
                                              (w-tot-pmi-wix, 07)     .
           move      zero                 to   w-tot-pmi-wim
                                              (w-tot-pmi-wix, 08)     .
           move      zero                 to   w-tot-pmi-wim
                                              (w-tot-pmi-wix, 09)     .
           move      zero                 to   w-tot-pmi-wim
                                              (w-tot-pmi-wix, 10)     .
           move      zero                 to   w-tot-pmi-wim
                                              (w-tot-pmi-wix, 11)     .
           move      zero                 to   w-tot-pmi-wim
                                              (w-tot-pmi-wix, 12)     .
      *                              *---------------------------------*
      *                              * Normalizzazione totale mese     *
      *                              *---------------------------------*
           move      zero                 to   w-tot-pmi-wtm
                                              (w-tot-pmi-wix)         .
      *                              *---------------------------------*
      *                              * Forzatura indice di lavoro      *
      *                              *---------------------------------*
           move      w-tot-pmi-wix        to   w-agg-tot-rie-inx      .
      *                              *---------------------------------*
      *                              * Ad aggiornamento importi        *
      *                              *---------------------------------*
           go to     agg-tot-rie-228.
       agg-tot-rie-228.
      *                          *-------------------------------------*
      *                          * Aggiornamento importi               *
      *                          *-------------------------------------*
           add       srt-imp-sdb          to   w-tot-pmi-wim
                                              (w-agg-tot-rie-inx
                                               w-agg-tot-rie-its)     .
           add       srt-imp-sdb          to   w-tot-pmi-wtm
                                              (w-agg-tot-rie-inx)     .
      *                       *----------------------------------------*
      *                       * Determinazione tipo aggiornamento      *
      *                       *----------------------------------------*
           move      02                   to   w-agg-tot-rie-tae      .
      *                       *----------------------------------------*
      *                       * Uscita                                 *
      *                       *----------------------------------------*
           go to     agg-tot-rie-999.
       agg-tot-rie-230.
      *                  *---------------------------------------------*
      *                  * Se altra sigla ultima operazione, cioe'     *
      *                  * scadenza in portafoglio                     *
      *                  *---------------------------------------------*
      *                       *----------------------------------------*
      *                       * Stesso trattamento che per Rimesse di- *
      *                       * rette, Bonifici o C/c postali          *
      *                       *----------------------------------------*
           go to     agg-tot-rie-100.
       agg-tot-rie-999.
           exit.

      *    *===========================================================*
      *    * Routine di stampa riepilogo                               *
      *    *-----------------------------------------------------------*
       stp-tot-rie-000.
      *              *-------------------------------------------------*
      *              * Flag di intestazione pagina                     *
      *              *-------------------------------------------------*
           move      "R"                  to   w-int-pag-sta-flg      .
      *              *-------------------------------------------------*
      *              * Prospetto generale                              *
      *              *-------------------------------------------------*
           perform   stp-tot-gen-000      thru stp-tot-gen-999        .
      *              *-------------------------------------------------*
      *              * Prospetto mensile 'Scaduto'                     *
      *              *-------------------------------------------------*
           perform   stp-tot-sca-000      thru stp-tot-sca-999        .
      *              *-------------------------------------------------*
      *              * Prospetto mensile 'Insoluti'                    *
      *              *-------------------------------------------------*
           perform   stp-tot-isp-000      thru stp-tot-isp-999        .
      *              *-------------------------------------------------*
      *              * Prospetto mensile 'A scadere'                   *
      *              *-------------------------------------------------*
           perform   stp-tot-asc-000      thru stp-tot-asc-999        .
      *              *-------------------------------------------------*
      *              * Prospetto mensile 'Circolante'                  *
      *              *-------------------------------------------------*
           perform   stp-tot-cir-000      thru stp-tot-cir-999        .
       stp-tot-rie-999.
           exit.

      *    *===========================================================*
      *    * Stampa prospetto totali generali                          *
      *    *-----------------------------------------------------------*
       stp-tot-gen-000.
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Prospetto generale" to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 2 Interlinee                                *
      *                  *---------------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      02                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Tipo scad.       Scaduto       Insoluto        A v
      -              "ista       A scadere     Circolante       Totale  
      -              "                                "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "-----------  -------------- -------------- -------
      -              "------- -------------- -------------- ------------
      -              "--                              "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Ciclo per ciascun tipo scadenza                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-tot-gen-c01      .
       stp-tot-gen-100.
           add       1                    to   w-stp-tot-gen-c01      .
           if        w-stp-tot-gen-c01    >    12
                     go to stp-tot-gen-200.
      *                  *---------------------------------------------*
      *                  * Test se tipo scadenza da stampare           *
      *                  *---------------------------------------------*
           if        w-tot-pge-sca
                    (w-stp-tot-gen-c01)   =    zero and
                     w-tot-pge-isp
                    (w-stp-tot-gen-c01)   =    zero and
                     w-tot-pge-vis
                    (w-stp-tot-gen-c01)   =    zero and
                     w-tot-pge-asc
                    (w-stp-tot-gen-c01)   =    zero and
                     w-tot-pge-cir
                    (w-stp-tot-gen-c01)   =    zero
                     go to stp-tot-gen-100.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Tipo scadenza                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           if        w-stp-tot-gen-c01    =    01
                     move  "RD  "         to   p-alf
           else if   w-stp-tot-gen-c01    =    02
                     move  "DC  "         to   p-alf
           else if   w-stp-tot-gen-c01    =    03
                     move  "IE  "         to   p-alf
           else if   w-stp-tot-gen-c01    =    04
                     move  "RIBA"         to   p-alf
           else if   w-stp-tot-gen-c01    =    05
                     move  "CDO "         to   p-alf
           else if   w-stp-tot-gen-c01    =    06
                     move  "MAV "         to   p-alf
           else if   w-stp-tot-gen-c01    =    07
                     move  "RID "         to   p-alf
           else if   w-stp-tot-gen-c01    =    08
                     move  "BB  "         to   p-alf
           else if   w-stp-tot-gen-c01    =    09
                     move  "CCP "         to   p-alf
           else if   w-stp-tot-gen-c01    =    10
                     move  "RB  "         to   p-alf
           else if   w-stp-tot-gen-c01    =    11
                     move  "TR  "         to   p-alf
           else if   w-stp-tot-gen-c01    =    12
                     move  "PC  "         to   p-alf
           else      move  spaces         to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Scaduto                                     *
      *                  *---------------------------------------------*
           move      w-tot-pge-sca
                    (w-stp-tot-gen-c01)   to   w-stp-imp-vlb-val      .
           move      013                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Insoluto                                    *
      *                  *---------------------------------------------*
           move      w-tot-pge-isp
                    (w-stp-tot-gen-c01)   to   w-stp-imp-vlb-val      .
           move      028                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * A vista                                     *
      *                  *---------------------------------------------*
           move      w-tot-pge-vis
                    (w-stp-tot-gen-c01)   to   w-stp-imp-vlb-val      .
           move      043                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * A scadere                                   *
      *                  *---------------------------------------------*
           move      w-tot-pge-asc
                    (w-stp-tot-gen-c01)   to   w-stp-imp-vlb-val      .
           move      058                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Circolante                                  *
      *                  *---------------------------------------------*
           move      w-tot-pge-cir
                    (w-stp-tot-gen-c01)   to   w-stp-imp-vlb-val      .
           move      073                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Totale per tipo scadenza                    *
      *                  *---------------------------------------------*
           move      w-tot-pge-tts
                    (w-stp-tot-gen-c01)   to   w-stp-imp-vlb-val      .
           move      088                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     stp-tot-gen-100.
       stp-tot-gen-200.
      *              *-------------------------------------------------*
      *              * Trattini per totale finale                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "-----------  -------------- -------------- -------
      -              "------- -------------- -------------- ------------
      -              "--                              "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Totali finali                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal                                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Totale"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Scaduto                                     *
      *                  *---------------------------------------------*
           move      w-tot-pge-tsc        to   w-stp-imp-vlb-val      .
           move      013                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Insoluto                                    *
      *                  *---------------------------------------------*
           move      w-tot-pge-tin        to   w-stp-imp-vlb-val      .
           move      028                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * A vista                                     *
      *                  *---------------------------------------------*
           move      w-tot-pge-tvi        to   w-stp-imp-vlb-val      .
           move      043                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * A scadere                                   *
      *                  *---------------------------------------------*
           move      w-tot-pge-tas        to   w-stp-imp-vlb-val      .
           move      058                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Circolante                                  *
      *                  *---------------------------------------------*
           move      w-tot-pge-tci        to   w-stp-imp-vlb-val      .
           move      073                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Totale generale                             *
      *                  *---------------------------------------------*
           move      w-tot-pge-tot        to   w-stp-imp-vlb-val      .
           move      088                  to   w-stp-imp-vlb-pos      .
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
       stp-tot-gen-999.
           exit.

      *    *===========================================================*
      *    * Stampa prospetto mensile 'Scaduto'                        *
      *    *-----------------------------------------------------------*
       stp-tot-sca-000.
      *              *-------------------------------------------------*
      *              * Test se da stampare                             *
      *              *-------------------------------------------------*
           if        w-tot-pms-wix        =    zero
                     go to stp-tot-sca-999.
       stp-tot-sca-100.
      *              *-------------------------------------------------*
      *              * Composizione tabella definitiva                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-pms-inx          .
       stp-tot-sca-120.
           add       1                    to   w-tot-pms-inx          .
           if        w-tot-pms-inx        >    8
                     move  8              to   w-tot-pms-inx
                     go to stp-tot-sca-140.
           move      w-tot-pms-wsa
                    (w-tot-pms-wix)       to   w-tot-pms-saa
                                              (w-tot-pms-inx)         .
           move      w-tot-pms-wms
                    (w-tot-pms-wix)       to   w-tot-pms-mes
                                              (w-tot-pms-inx)         .
       stp-tot-sca-140.
           move      zero                 to   w-stp-tot-sca-c01      .
       stp-tot-sca-160.
           add       1                    to   w-stp-tot-sca-c01      .
           if        w-stp-tot-sca-c01    >    12
                     go to stp-tot-sca-170.
           add       w-tot-pms-wim
                    (w-tot-pms-wix,
                     w-stp-tot-sca-c01)   to   w-tot-pms-imp
                                              (w-tot-pms-inx,
                                               w-stp-tot-sca-c01)     .
           go to     stp-tot-sca-160.
       stp-tot-sca-170.
           add       w-tot-pms-wtm
                    (w-tot-pms-wix)       to   w-tot-pms-tme
                                              (w-tot-pms-inx)         .
           subtract  1                    from w-tot-pms-wix          .
           if        w-tot-pms-wix        =    zero
                     go to stp-tot-sca-180.
           go to     stp-tot-sca-120.
       stp-tot-sca-180.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      w-tot-pms-inx        to   w-stp-tot-sca-c01      .
           add       9                    to   w-stp-tot-sca-c01      .
           if        p-res                >    w-stp-tot-sca-c01
                     go to stp-tot-sca-190.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to stp-tot-sca-999.
       stp-tot-sca-190.
      *              *-------------------------------------------------*
      *              * 3 Interlinee                                    *
      *              *-------------------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      03                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Prospetto 'Scaduto' mensile"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tot-sca-200.
      *              *-------------------------------------------------*
      *              * 2 Interlinee                                    *
      *              *-------------------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      02                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tot-sca-300.
      *              *-------------------------------------------------*
      *              * Fincatura                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal iniziale                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Tipo scad. "        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione mesi bufferizzati in ta- *
      *                  * bella totali                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-sca-c01      .
       stp-tot-sca-320.
           add       1                    to   w-stp-tot-sca-c01      .
           if        w-stp-tot-sca-c01    >    w-tot-pms-inx
                     go to stp-tot-sca-360.
      *                      *-----------------------------------------*
      *                      * Composizione stringa per mese           *
      *                      *-----------------------------------------*
           move      spaces               to   w-stp-tot-sca-x14      .
           move      1                    to   w-stp-tot-sca-pnt      .
      *                          *-------------------------------------*
      *                          * Se ultimo periodo possibile         *
      *                          *-------------------------------------*
           if        w-stp-tot-sca-c01    not  = 8
                     go to stp-tot-sca-330.
           string    "Preced."  delimited by   size
                                          into w-stp-tot-sca-x14
                                  with pointer w-stp-tot-sca-pnt      .
           go to     stp-tot-sca-340.
       stp-tot-sca-330.
      *                          *-------------------------------------*
      *                          * Indice per mese                     *
      *                          *-------------------------------------*
           move      w-tot-pms-mes
                    (w-stp-tot-sca-c01)   to   w-stp-tot-sca-inx      .
      *                          *-------------------------------------*
      *                          * Literal del mese, da segreteria     *
      *                          *-------------------------------------*
           move      "LM"                 to   s-ope                  .
           move      "E"                  to   s-tip                  .
           move      w-stp-tot-sca-inx    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                          *-------------------------------------*
      *                          * Mese                                *
      *                          *-------------------------------------*
           string    s-alf      delimited by   spaces
                                          into w-stp-tot-sca-x14
                                  with pointer w-stp-tot-sca-pnt      .
      *                          *-------------------------------------*
      *                          * Anno                                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing anno                    *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-tot-pms-saa
                    (w-stp-tot-sca-c01)   to   p-num                  .
           add       1900                 to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * String                          *
      *                              *---------------------------------*
           string    " "        delimited by   size
                     p-edt      delimited by   spaces
                                          into w-stp-tot-sca-x14
                                  with pointer w-stp-tot-sca-pnt      .
       stp-tot-sca-340.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           multiply  w-stp-tot-sca-c01    by   14
                                        giving p-pos                  .
           add       w-stp-tot-sca-c01    to   p-pos                  .
           subtract  1                    from p-pos                  .
           subtract  w-stp-tot-sca-pnt    from 14
                                        giving w-stp-tot-sca-inx      .
           divide    2                    into w-stp-tot-sca-inx      .
           add       w-stp-tot-sca-inx    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-stp-tot-sca-x14    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     stp-tot-sca-320.
       stp-tot-sca-360.
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Per tipo scadenza                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "-----------"        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione mesi bufferizzati in ta- *
      *                  * bella totali                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-sca-c01      .
       stp-tot-sca-380.
           add       1                    to   w-stp-tot-sca-c01      .
           if        w-stp-tot-sca-c01    >    w-tot-pms-inx
                     go to stp-tot-sca-400.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           multiply  w-stp-tot-sca-c01    by   14
                                        giving p-pos                  .
           add       w-stp-tot-sca-c01    to   p-pos                  .
           subtract  1                    from p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     stp-tot-sca-380.
       stp-tot-sca-400.
      *              *-------------------------------------------------*
      *              * Ciclo per ciascun tipo scadenza                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-tot-sca-c01      .
       stp-tot-sca-420.
           add       1                    to   w-stp-tot-sca-c01      .
           if        w-stp-tot-sca-c01    >    12
                     go to stp-tot-sca-500.
      *                  *---------------------------------------------*
      *                  * Test se tipo scadenza da stampare           *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-sca-c02      .
       stp-tot-sca-422.
           add       1                    to   w-stp-tot-sca-c02      .
           if        w-stp-tot-sca-c02    >    w-tot-pms-inx
                     go to stp-tot-sca-420.
           if        w-tot-pms-imp
                    (w-stp-tot-sca-c02
                     w-stp-tot-sca-c01)   not  = zero
                     go to stp-tot-sca-430.
           go to     stp-tot-sca-422.
       stp-tot-sca-430.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo per ciascun mese                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-sca-c02      .
       stp-tot-sca-440.
           add       1                    to   w-stp-tot-sca-c02      .
           if        w-stp-tot-sca-c02    >    w-tot-pms-inx
                     go to stp-tot-sca-460.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           if        w-stp-tot-sca-c01    =    01
                     move  "RD  "         to   p-alf
           else if   w-stp-tot-sca-c01    =    02
                     move  "DC  "         to   p-alf
           else if   w-stp-tot-sca-c01    =    03
                     move  "IE  "         to   p-alf
           else if   w-stp-tot-sca-c01    =    04
                     move  "RIBA"         to   p-alf
           else if   w-stp-tot-sca-c01    =    05
                     move  "CDO "         to   p-alf
           else if   w-stp-tot-sca-c01    =    06
                     move  "MAV "         to   p-alf
           else if   w-stp-tot-sca-c01    =    07
                     move  "RID "         to   p-alf
           else if   w-stp-tot-sca-c01    =    08
                     move  "BB  "         to   p-alf
           else if   w-stp-tot-sca-c01    =    09
                     move  "CCP "         to   p-alf
           else if   w-stp-tot-sca-c01    =    10
                     move  "RB  "         to   p-alf
           else if   w-stp-tot-sca-c01    =    11
                     move  "TR  "         to   p-alf
           else if   w-stp-tot-sca-c01    =    12
                     move  "PC  "         to   p-alf
           else      move  spaces         to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Totale per tipo scadenza nel mese           *
      *                  *---------------------------------------------*
           move      w-tot-pms-imp
                    (w-stp-tot-sca-c02
                     w-stp-tot-sca-c01)   to   w-stp-imp-vlb-val      .
      *
           multiply  w-stp-tot-sca-c02    by   2
                                        giving w-stp-imp-vlb-pos      .
           subtract  2                    from w-stp-imp-vlb-pos      .
           multiply  w-stp-tot-sca-c02    by   13
                                        giving w-stp-tot-sca-inx      .
           add       w-stp-tot-sca-inx    to   w-stp-imp-vlb-pos      .
      *
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     stp-tot-sca-440.
       stp-tot-sca-460.
      *                  *---------------------------------------------*
      *                  * Riciclo su prossimo tipo scadenza           *
      *                  *---------------------------------------------*
           go to     stp-tot-sca-420.
       stp-tot-sca-500.
      *              *-------------------------------------------------*
      *              * Trattini per totale finale                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione mesi bufferizzati in ta- *
      *                  * bella totali                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-sca-c01      .
       stp-tot-sca-520.
           add       1                    to   w-stp-tot-sca-c01      .
           if        w-stp-tot-sca-c01    >    w-tot-pms-inx
                     go to stp-tot-sca-600.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           multiply  w-stp-tot-sca-c01    by   14
                                        giving p-pos                  .
           add       w-stp-tot-sca-c01    to   p-pos                  .
           subtract  1                    from p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     stp-tot-sca-520.
       stp-tot-sca-600.
      *              *-------------------------------------------------*
      *              * Totali finali                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal                                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Totale"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo per ciascun mese                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-sca-c02      .
       stp-tot-sca-620.
           add       1                    to   w-stp-tot-sca-c02      .
           if        w-stp-tot-sca-c02    >    8
                     go to stp-tot-sca-640.
      *                  *---------------------------------------------*
      *                  * Totale per tipo scadenza nel mese           *
      *                  *---------------------------------------------*
           move      w-tot-pms-tme
                    (w-stp-tot-sca-c02)   to   w-stp-imp-vlb-val      .
      *
           multiply  w-stp-tot-sca-c02    by   2
                                        giving w-stp-imp-vlb-pos      .
           subtract  2                    from w-stp-imp-vlb-pos      .
           multiply  w-stp-tot-sca-c02    by   13
                                        giving w-stp-tot-sca-inx      .
           add       w-stp-tot-sca-inx    to   w-stp-imp-vlb-pos      .
      *
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     stp-tot-sca-620.
       stp-tot-sca-640.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
       stp-tot-sca-999.
           exit.

      *    *===========================================================*
      *    * Stampa prospetto mensile 'Insoluti'                       *
      *    *-----------------------------------------------------------*
       stp-tot-isp-000.
      *              *-------------------------------------------------*
      *              * Test se da stampare                             *
      *              *-------------------------------------------------*
           if        w-tot-pmi-wix        =    zero
                     go to stp-tot-isp-999.
       stp-tot-isp-100.
      *              *-------------------------------------------------*
      *              * Composizione tabella definitiva                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione mese e anno relativi alla    *
      *                  * data base calcolo mesi                      *
      *                  *---------------------------------------------*
           move      rr-dat-bcm           to   s-dat                  .
           move      s-saa                to   w-stp-tot-isp-adb      .
           move      s-mes                to   w-stp-tot-isp-mdb      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione a ritroso tabella di la- *
      *                  * voro                                        *
      *                  *---------------------------------------------*
           move      zero                 to   w-tot-pmi-inx          .
       stp-tot-isp-120.
      *                      *-----------------------------------------*
      *                      * Confronto mese/anno dell'elemento con   *
      *                      * mese/anno della data base               *
      *                      *-----------------------------------------*
           if        w-tot-pmi-wsa
                    (w-tot-pmi-wix)       >    w-stp-tot-isp-adb and
                     w-tot-pmi-wms
                    (w-tot-pmi-wix)       >    w-stp-tot-isp-mdb
                     go to stp-tot-isp-121
           else      go to stp-tot-isp-130.
       stp-tot-isp-121.
      *                      *-----------------------------------------*
      *                      * Se maggiori di quelli della data base   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Aggiornamento primo elemento della  *
      *                          * tabella                             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Deviazione a seconda che il     *
      *                              * primo elemento sia gia' stato   *
      *                              * utilizzato o meno               *
      *                              *---------------------------------*
           if        w-tot-pmi-inx        =    zero
                     go to stp-tot-isp-122
           else      go to stp-tot-isp-124.
       stp-tot-isp-122.
      *                              *---------------------------------*
      *                              * Se primo elemento vuoto         *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Aggiornamento elemento      *
      *                                  *-----------------------------*
           move      w-tot-pmi-wsa
                    (w-tot-pmi-wix)       to   w-tot-pmi-saa (1)      .
           move      w-tot-pmi-wms
                    (w-tot-pmi-wix)       to   w-tot-pmi-mes (1)      .
      *                                  *-----------------------------*
      *                                  * Aggiornamento indice effet- *
      *                                  * tivo                        *
      *                                  *-----------------------------*
           move      1                    to   w-tot-pmi-inx          .
      *                                  *-----------------------------*
      *                                  * Ad aggiornamento importi    *
      *                                  *-----------------------------*
           go to     stp-tot-isp-140.
       stp-tot-isp-124.
      *                              *---------------------------------*
      *                              * Se primo elemento gia' utiliz-  *
      *                              * zato                            *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Normalizzazione mese/anno   *
      *                                  * dell'elemento               *
      *                                  *-----------------------------*
           move      zero                 to   w-tot-pmi-saa (1)      .
           move      zero                 to   w-tot-pmi-mes (1)      .
      *                                  *-----------------------------*
      *                                  * Ad aggiornamento importi    *
      *                                  *-----------------------------*
           go to     stp-tot-isp-140.
       stp-tot-isp-130.
      *                      *-----------------------------------------*
      *                      * Se minori o uguali a quelli della da-   *
      *                      * ta base                                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Aggiornamento indice effettivo      *
      *                          *-------------------------------------*
           add       1                    to   w-tot-pmi-inx          .
           if        w-tot-pmi-inx        >    8
                     move  8              to   w-tot-pmi-inx
                     go to stp-tot-isp-140.
      *                          *-------------------------------------*
      *                          * Memorizzazione nuovo elemento       *
      *                          *-------------------------------------*
           move      w-tot-pmi-wsa
                    (w-tot-pmi-wix)       to   w-tot-pmi-saa
                                              (w-tot-pmi-inx)         .
           move      w-tot-pmi-wms
                    (w-tot-pmi-wix)       to   w-tot-pmi-mes
                                              (w-tot-pmi-inx)         .
      *                          *-------------------------------------*
      *                          * Ad aggiornamento importi            *
      *                          *-------------------------------------*
           go to     stp-tot-isp-140.
       stp-tot-isp-140.
      *                      *-----------------------------------------*
      *                      * Aggiornamento importi                   *
      *                      *-----------------------------------------*
           move      zero                 to   w-stp-tot-isp-c01      .
       stp-tot-isp-160.
           add       1                    to   w-stp-tot-isp-c01      .
           if        w-stp-tot-isp-c01    >    12
                     go to stp-tot-isp-170.
           add       w-tot-pmi-wim
                    (w-tot-pmi-wix,
                     w-stp-tot-isp-c01)   to   w-tot-pmi-imp
                                              (w-tot-pmi-inx,
                                               w-stp-tot-isp-c01)     .
           go to     stp-tot-isp-160.
       stp-tot-isp-170.
           add       w-tot-pmi-wtm
                    (w-tot-pmi-wix)       to   w-tot-pmi-tme
                                              (w-tot-pmi-inx)         .
      *                      *-----------------------------------------*
      *                      * Decremento indice di lavoro             *
      *                      *-----------------------------------------*
           subtract  1                    from w-tot-pmi-wix          .
           if        w-tot-pmi-wix        =    zero
                     go to stp-tot-isp-180.
      *                      *-----------------------------------------*
      *                      * Riciclo su scansione tabella di lavoro  *
      *                      *-----------------------------------------*
           go to     stp-tot-isp-120.
       stp-tot-isp-180.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      w-tot-pmi-inx        to   w-stp-tot-isp-c01      .
           add       9                    to   w-stp-tot-isp-c01      .
           if        p-res                >    w-stp-tot-isp-c01
                     go to stp-tot-isp-190.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to stp-tot-isp-999.
       stp-tot-isp-190.
      *              *-------------------------------------------------*
      *              * 3 Interlinee                                    *
      *              *-------------------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      03                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Prospetto 'Insoluti' mensile"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tot-isp-200.
      *              *-------------------------------------------------*
      *              * 2 Interlinee                                    *
      *              *-------------------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      02                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tot-isp-300.
      *              *-------------------------------------------------*
      *              * Fincatura                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal iniziale                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Tipo scad. "        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione mesi bufferizzati in ta- *
      *                  * bella totali                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-isp-c01      .
       stp-tot-isp-320.
           add       1                    to   w-stp-tot-isp-c01      .
           if        w-stp-tot-isp-c01    >    w-tot-pmi-inx
                     go to stp-tot-isp-360.
      *                      *-----------------------------------------*
      *                      * Composizione stringa per mese           *
      *                      *-----------------------------------------*
           move      spaces               to   w-stp-tot-isp-x14      .
           move      1                    to   w-stp-tot-isp-pnt      .
      *                          *-------------------------------------*
      *                          * Se primo periodo                    *
      *                          *-------------------------------------*
           if        w-stp-tot-isp-c01    not  = 1
                     go to stp-tot-isp-325.
           if        w-tot-pmi-mes
                    (w-stp-tot-isp-c01)   not  = zero and
                     w-tot-pmi-saa
                    (w-stp-tot-isp-c01)   not  = zero
                     go to stp-tot-isp-325.
           string    "Succes."  delimited by   size
                                          into w-stp-tot-isp-x14
                                  with pointer w-stp-tot-isp-pnt      .
           go to     stp-tot-isp-340.
       stp-tot-isp-325.
      *                          *-------------------------------------*
      *                          * Se ultimo periodo possibile         *
      *                          *-------------------------------------*
           if        w-stp-tot-isp-c01    not  = 8
                     go to stp-tot-isp-330.
           string    "Preced."  delimited by   size
                                          into w-stp-tot-isp-x14
                                  with pointer w-stp-tot-isp-pnt      .
           go to     stp-tot-isp-340.
       stp-tot-isp-330.
      *                          *-------------------------------------*
      *                          * Indice per mese                     *
      *                          *-------------------------------------*
           move      w-tot-pmi-mes
                    (w-stp-tot-isp-c01)   to   w-stp-tot-isp-inx      .
      *                          *-------------------------------------*
      *                          * Literal del mese, da segreteria     *
      *                          *-------------------------------------*
           move      "LM"                 to   s-ope                  .
           move      "E"                  to   s-tip                  .
           move      w-stp-tot-isp-inx    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                          *-------------------------------------*
      *                          * Mese                                *
      *                          *-------------------------------------*
           string    s-alf      delimited by   spaces
                                          into w-stp-tot-isp-x14
                                  with pointer w-stp-tot-isp-pnt      .
      *                          *-------------------------------------*
      *                          * Anno                                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing anno                    *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-tot-pmi-saa
                    (w-stp-tot-isp-c01)   to   p-num                  .
           add       1900                 to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * String                          *
      *                              *---------------------------------*
           string    " "        delimited by   size
                     p-edt      delimited by   spaces
                                          into w-stp-tot-isp-x14
                                  with pointer w-stp-tot-isp-pnt      .
       stp-tot-isp-340.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           multiply  w-stp-tot-isp-c01    by   14
                                        giving p-pos                  .
           add       w-stp-tot-isp-c01    to   p-pos                  .
           subtract  1                    from p-pos                  .
           subtract  w-stp-tot-isp-pnt    from 14
                                        giving w-stp-tot-isp-inx      .
           divide    2                    into w-stp-tot-isp-inx      .
           add       w-stp-tot-isp-inx    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-stp-tot-isp-x14    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     stp-tot-isp-320.
       stp-tot-isp-360.
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Per tipo scadenza                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "-----------"        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione mesi bufferizzati in ta- *
      *                  * bella totali                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-isp-c01      .
       stp-tot-isp-380.
           add       1                    to   w-stp-tot-isp-c01      .
           if        w-stp-tot-isp-c01    >    w-tot-pmi-inx
                     go to stp-tot-isp-400.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           multiply  w-stp-tot-isp-c01    by   14
                                        giving p-pos                  .
           add       w-stp-tot-isp-c01    to   p-pos                  .
           subtract  1                    from p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     stp-tot-isp-380.
       stp-tot-isp-400.
      *              *-------------------------------------------------*
      *              * Ciclo per ciascun tipo scadenza                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-tot-isp-c01      .
       stp-tot-isp-420.
           add       1                    to   w-stp-tot-isp-c01      .
           if        w-stp-tot-isp-c01    >    12
                     go to stp-tot-isp-500.
      *                  *---------------------------------------------*
      *                  * Test se tipo scadenza da stampare           *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-isp-c02      .
       stp-tot-isp-422.
           add       1                    to   w-stp-tot-isp-c02      .
           if        w-stp-tot-isp-c02    >    w-tot-pmi-inx
                     go to stp-tot-isp-420.
           if        w-tot-pmi-imp
                    (w-stp-tot-isp-c02
                     w-stp-tot-isp-c01)   not  = zero
                     go to stp-tot-isp-430.
           go to     stp-tot-isp-422.
       stp-tot-isp-430.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo per ciascun mese                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-isp-c02      .
       stp-tot-isp-440.
           add       1                    to   w-stp-tot-isp-c02      .
           if        w-stp-tot-isp-c02    >    w-tot-pmi-inx
                     go to stp-tot-isp-460.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           if        w-stp-tot-isp-c01    =    01
                     move  "RD  "         to   p-alf
           else if   w-stp-tot-isp-c01    =    02
                     move  "DC  "         to   p-alf
           else if   w-stp-tot-isp-c01    =    03
                     move  "IE  ."        to   p-alf
           else if   w-stp-tot-isp-c01    =    04
                     move  "RIBA"         to   p-alf
           else if   w-stp-tot-isp-c01    =    05
                     move  "CDO "         to   p-alf
           else if   w-stp-tot-isp-c01    =    06
                     move  "MAV "         to   p-alf
           else if   w-stp-tot-isp-c01    =    07
                     move  "RID "         to   p-alf
           else if   w-stp-tot-isp-c01    =    08
                     move  "BB  "         to   p-alf
           else if   w-stp-tot-isp-c01    =    09
                     move  "CCP "         to   p-alf
           else if   w-stp-tot-isp-c01    =    10
                     move  "RB  "         to   p-alf
           else if   w-stp-tot-isp-c01    =    11
                     move  "TR  "         to   p-alf
           else if   w-stp-tot-isp-c01    =    12
                     move  "PC  "         to   p-alf
           else      move  spaces         to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Totale per tipo scadenza nel mese           *
      *                  *---------------------------------------------*
           move      w-tot-pmi-imp
                    (w-stp-tot-isp-c02
                     w-stp-tot-isp-c01)   to   w-stp-imp-vlb-val      .
      *
           multiply  w-stp-tot-isp-c02    by   2
                                        giving w-stp-imp-vlb-pos      .
           subtract  2                    from w-stp-imp-vlb-pos      .
           multiply  w-stp-tot-isp-c02    by   13
                                        giving w-stp-tot-isp-inx      .
           add       w-stp-tot-isp-inx    to   w-stp-imp-vlb-pos      .
      *
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     stp-tot-isp-440.
       stp-tot-isp-460.
      *                  *---------------------------------------------*
      *                  * Riciclo su prossimo tipo scadenza           *
      *                  *---------------------------------------------*
           go to     stp-tot-isp-420.
       stp-tot-isp-500.
      *              *-------------------------------------------------*
      *              * Trattini per totale finale                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione mesi bufferizzati in ta- *
      *                  * bella totali                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-isp-c01      .
       stp-tot-isp-520.
           add       1                    to   w-stp-tot-isp-c01      .
           if        w-stp-tot-isp-c01    >    w-tot-pmi-inx
                     go to stp-tot-isp-600.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           multiply  w-stp-tot-isp-c01    by   14
                                        giving p-pos                  .
           add       w-stp-tot-isp-c01    to   p-pos                  .
           subtract  1                    from p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     stp-tot-isp-520.
       stp-tot-isp-600.
      *              *-------------------------------------------------*
      *              * Totali finali                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal                                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Totale"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo per ciascun mese                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-isp-c02      .
       stp-tot-isp-620.
           add       1                    to   w-stp-tot-isp-c02      .
           if        w-stp-tot-isp-c02    >    8
                     go to stp-tot-isp-640.
      *                  *---------------------------------------------*
      *                  * Totale per tipo scadenza nel mese           *
      *                  *---------------------------------------------*
           move      w-tot-pmi-tme
                    (w-stp-tot-isp-c02)   to   w-stp-imp-vlb-val      .
      *
           multiply  w-stp-tot-isp-c02    by   2
                                        giving w-stp-imp-vlb-pos      .
           subtract  2                    from w-stp-imp-vlb-pos      .
           multiply  w-stp-tot-isp-c02    by   13
                                        giving w-stp-tot-isp-inx      .
           add       w-stp-tot-isp-inx    to   w-stp-imp-vlb-pos      .
      *
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     stp-tot-isp-620.
       stp-tot-isp-640.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
       stp-tot-isp-999.
           exit.

      *    *===========================================================*
      *    * Stampa prospetto mensile 'A Scadere'                      *
      *    *-----------------------------------------------------------*
       stp-tot-asc-000.
      *              *-------------------------------------------------*
      *              * Test se da stampare                             *
      *              *-------------------------------------------------*
           if        w-tot-pma-inx        =    zero
                     go to stp-tot-asc-999.
       stp-tot-asc-100.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      w-tot-pma-inx        to   w-stp-tot-asc-c01      .
           add       9                    to   w-stp-tot-asc-c01      .
           if        p-res                >    w-stp-tot-asc-c01
                     go to stp-tot-asc-190.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to stp-tot-asc-999.
       stp-tot-asc-190.
      *              *-------------------------------------------------*
      *              * 3 Interlinee                                    *
      *              *-------------------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      03                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Prospetto 'A Scadere' mensile"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tot-asc-200.
      *              *-------------------------------------------------*
      *              * 2 Interlinee                                    *
      *              *-------------------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      02                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tot-asc-300.
      *              *-------------------------------------------------*
      *              * Fincatura                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal iniziale                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Tipo scad. "        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione mesi bufferizzati in ta- *
      *                  * bella totali                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-asc-c01      .
       stp-tot-asc-320.
           add       1                    to   w-stp-tot-asc-c01      .
           if        w-stp-tot-asc-c01    >    w-tot-pma-inx
                     go to stp-tot-asc-360.
      *                      *-----------------------------------------*
      *                      * Composizione stringa per mese           *
      *                      *-----------------------------------------*
           move      spaces               to   w-stp-tot-asc-x14      .
           move      1                    to   w-stp-tot-asc-pnt      .
      *                          *-------------------------------------*
      *                          * Se ultimo periodo possibile         *
      *                          *-------------------------------------*
           if        w-stp-tot-asc-c01    not  = 8
                     go to stp-tot-asc-330.
           string    "Succes."  delimited by   size
                                          into w-stp-tot-asc-x14
                                  with pointer w-stp-tot-asc-pnt      .
           go to     stp-tot-asc-340.
       stp-tot-asc-330.
      *                          *-------------------------------------*
      *                          * Indice per mese                     *
      *                          *-------------------------------------*
           move      w-tot-pma-mes
                    (w-stp-tot-asc-c01)   to   w-stp-tot-asc-inx      .
      *                          *-------------------------------------*
      *                          * Literal del mese, da segreteria     *
      *                          *-------------------------------------*
           move      "LM"                 to   s-ope                  .
           move      "E"                  to   s-tip                  .
           move      w-stp-tot-asc-inx    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                          *-------------------------------------*
      *                          * Mese                                *
      *                          *-------------------------------------*
           string    s-alf      delimited by   spaces
                                          into w-stp-tot-asc-x14
                                  with pointer w-stp-tot-asc-pnt      .
      *                          *-------------------------------------*
      *                          * Anno                                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing anno                    *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-tot-pma-saa
                    (w-stp-tot-asc-c01)   to   p-num                  .
           add       1900                 to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * String                          *
      *                              *---------------------------------*
           string    " "        delimited by   size
                     p-edt      delimited by   spaces
                                          into w-stp-tot-asc-x14
                                  with pointer w-stp-tot-asc-pnt      .
       stp-tot-asc-340.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           multiply  w-stp-tot-asc-c01    by   14
                                        giving p-pos                  .
           add       w-stp-tot-asc-c01    to   p-pos                  .
           subtract  1                    from p-pos                  .
           subtract  w-stp-tot-asc-pnt    from 14
                                        giving w-stp-tot-asc-inx      .
           divide    2                    into w-stp-tot-asc-inx      .
           add       w-stp-tot-asc-inx    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-stp-tot-asc-x14    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     stp-tot-asc-320.
       stp-tot-asc-360.
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Per tipo scadenza                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "-----------"        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione mesi bufferizzati in ta- *
      *                  * bella totali                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-asc-c01      .
       stp-tot-asc-380.
           add       1                    to   w-stp-tot-asc-c01      .
           if        w-stp-tot-asc-c01    >    w-tot-pma-inx
                     go to stp-tot-asc-400.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           multiply  w-stp-tot-asc-c01    by   14
                                        giving p-pos                  .
           add       w-stp-tot-asc-c01    to   p-pos                  .
           subtract  1                    from p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     stp-tot-asc-380.
       stp-tot-asc-400.
      *              *-------------------------------------------------*
      *              * Ciclo per ciascun tipo scadenza                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-tot-asc-c01      .
       stp-tot-asc-420.
           add       1                    to   w-stp-tot-asc-c01      .
           if        w-stp-tot-asc-c01    >    12
                     go to stp-tot-asc-500.
      *                  *---------------------------------------------*
      *                  * Test se tipo scadenza da stampare           *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-asc-c02      .
       stp-tot-asc-422.
           add       1                    to   w-stp-tot-asc-c02      .
           if        w-stp-tot-asc-c02    >    w-tot-pma-inx
                     go to stp-tot-asc-420.
           if        w-tot-pma-imp
                    (w-stp-tot-asc-c02
                     w-stp-tot-asc-c01)   not  = zero
                     go to stp-tot-asc-430.
           go to     stp-tot-asc-422.
       stp-tot-asc-430.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo per ciascun mese                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-asc-c02      .
       stp-tot-asc-440.
           add       1                    to   w-stp-tot-asc-c02      .
           if        w-stp-tot-asc-c02    >    w-tot-pma-inx
                     go to stp-tot-asc-460.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           if        w-stp-tot-asc-c01    =    01
                     move  "RD  "         to   p-alf
           else if   w-stp-tot-asc-c01    =    02
                     move  "DC  "         to   p-alf
           else if   w-stp-tot-asc-c01    =    03
                     move  "IE  "         to   p-alf
           else if   w-stp-tot-asc-c01    =    04
                     move  "RIBA"         to   p-alf
           else if   w-stp-tot-asc-c01    =    05
                     move  "CDO "         to   p-alf
           else if   w-stp-tot-asc-c01    =    06
                     move  "MAV "         to   p-alf
           else if   w-stp-tot-asc-c01    =    07
                     move  "RID "         to   p-alf
           else if   w-stp-tot-asc-c01    =    08
                     move  "BB  "         to   p-alf
           else if   w-stp-tot-asc-c01    =    09
                     move  "CCP "         to   p-alf
           else if   w-stp-tot-asc-c01    =    10
                     move  "RB  "         to   p-alf
           else if   w-stp-tot-asc-c01    =    11
                     move  "TR  "         to   p-alf
           else if   w-stp-tot-asc-c01    =    12
                     move  "PC  "         to   p-alf
           else      move  spaces         to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Totale per tipo scadenza nel mese           *
      *                  *---------------------------------------------*
           move      w-tot-pma-imp
                    (w-stp-tot-asc-c02
                     w-stp-tot-asc-c01)   to   w-stp-imp-vlb-val      .
      *
           multiply  w-stp-tot-asc-c02    by   2
                                        giving w-stp-imp-vlb-pos      .
           subtract  2                    from w-stp-imp-vlb-pos      .
           multiply  w-stp-tot-asc-c02    by   13
                                        giving w-stp-tot-asc-inx      .
           add       w-stp-tot-asc-inx    to   w-stp-imp-vlb-pos      .
      *
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     stp-tot-asc-440.
       stp-tot-asc-460.
      *                  *---------------------------------------------*
      *                  * Riciclo su prossimo tipo scadenza           *
      *                  *---------------------------------------------*
           go to     stp-tot-asc-420.
       stp-tot-asc-500.
      *              *-------------------------------------------------*
      *              * Trattini per totale finale                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione mesi bufferizzati in ta- *
      *                  * bella totali                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-asc-c01      .
       stp-tot-asc-520.
           add       1                    to   w-stp-tot-asc-c01      .
           if        w-stp-tot-asc-c01    >    w-tot-pma-inx
                     go to stp-tot-asc-600.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           multiply  w-stp-tot-asc-c01    by   14
                                        giving p-pos                  .
           add       w-stp-tot-asc-c01    to   p-pos                  .
           subtract  1                    from p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     stp-tot-asc-520.
       stp-tot-asc-600.
      *              *-------------------------------------------------*
      *              * Totali finali                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal                                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Totale"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo per ciascun mese                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-asc-c02      .
       stp-tot-asc-620.
           add       1                    to   w-stp-tot-asc-c02      .
           if        w-stp-tot-asc-c02    >    8
                     go to stp-tot-asc-640.
      *                  *---------------------------------------------*
      *                  * Totale per tipo scadenza nel mese           *
      *                  *---------------------------------------------*
           move      w-tot-pma-tme
                    (w-stp-tot-asc-c02)   to   w-stp-imp-vlb-val      .
      *
           multiply  w-stp-tot-asc-c02    by   2
                                        giving w-stp-imp-vlb-pos      .
           subtract  2                    from w-stp-imp-vlb-pos      .
           multiply  w-stp-tot-asc-c02    by   13
                                        giving w-stp-tot-asc-inx      .
           add       w-stp-tot-asc-inx    to   w-stp-imp-vlb-pos      .
      *
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     stp-tot-asc-620.
       stp-tot-asc-640.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
       stp-tot-asc-999.
           exit.

      *    *===========================================================*
      *    * Stampa prospetto mensile 'Circolante'                     *
      *    *-----------------------------------------------------------*
       stp-tot-cir-000.
      *              *-------------------------------------------------*
      *              * Test se da stampare                             *
      *              *-------------------------------------------------*
           if        w-tot-pmc-wix        =    zero
                     go to stp-tot-cir-999.
       stp-tot-cir-100.
      *              *-------------------------------------------------*
      *              * Composizione tabella definitiva                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione mese e anno relativi alla    *
      *                  * data base calcolo mesi                      *
      *                  *---------------------------------------------*
           move      rr-dat-bcm           to   s-dat                  .
           move      s-saa                to   w-stp-tot-cir-adb      .
           move      s-mes                to   w-stp-tot-cir-mdb      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione tabella di lavoro        *
      *                  *---------------------------------------------*
           move      zero                 to   w-tot-pmc-inx          .
           move      zero                 to   w-stp-tot-cir-c01      .
       stp-tot-cir-120.
           add       1                    to   w-stp-tot-cir-c01      .
           if        w-stp-tot-cir-c01    >    w-tot-pmc-wix
                     go to stp-tot-cir-180.
      *                      *-----------------------------------------*
      *                      * Confronto mese/anno dell'elemento con   *
      *                      * mese/anno della data base               *
      *                      *-----------------------------------------*
           if        w-tot-pmc-wsa
                    (w-stp-tot-cir-c01)   <    w-stp-tot-cir-adb and
                     w-tot-pmc-wms
                    (w-stp-tot-cir-c01)   <    w-stp-tot-cir-mdb
                     go to stp-tot-cir-121
           else      go to stp-tot-cir-130.
       stp-tot-cir-121.
      *                      *-----------------------------------------*
      *                      * Se minori di quelli della data base     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Aggiornamento primo elemento della  *
      *                          * tabella                             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Deviazione a seconda che il     *
      *                              * primo elemento sia gia' stato   *
      *                              * utilizzato o meno               *
      *                              *---------------------------------*
           if        w-tot-pmc-inx        =    zero
                     go to stp-tot-cir-122
           else      go to stp-tot-cir-124.
       stp-tot-cir-122.
      *                              *---------------------------------*
      *                              * Se primo elemento vuoto         *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Aggiornamento elemento      *
      *                                  *-----------------------------*
           move      w-tot-pmc-wsa
                    (w-stp-tot-cir-c01)   to   w-tot-pmc-saa (1)      .
           move      w-tot-pmc-wms
                    (w-stp-tot-cir-c01)   to   w-tot-pmc-mes (1)      .
      *                                  *-----------------------------*
      *                                  * Aggiornamento indice effet- *
      *                                  * tivo                        *
      *                                  *-----------------------------*
           move      1                    to   w-tot-pmc-inx          .
      *                                  *-----------------------------*
      *                                  * Ad aggiornamento importi    *
      *                                  *-----------------------------*
           go to     stp-tot-cir-140.
       stp-tot-cir-124.
      *                              *---------------------------------*
      *                              * Se primo elemento gia' utiliz-  *
      *                              * zato                            *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Normalizzazione mese/anno   *
      *                                  * dell'elemento               *
      *                                  *-----------------------------*
           move      zero                 to   w-tot-pmc-saa (1)      .
           move      zero                 to   w-tot-pmc-mes (1)      .
      *                                  *-----------------------------*
      *                                  * Ad aggiornamento importi    *
      *                                  *-----------------------------*
           go to     stp-tot-cir-140.
       stp-tot-cir-130.
      *                      *-----------------------------------------*
      *                      * Se maggiori o uguali a quelli della da- *
      *                      * ta base                                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Aggiornamento indice effettivo      *
      *                          *-------------------------------------*
           add       1                    to   w-tot-pmc-inx          .
           if        w-tot-pmc-inx        >    8
                     move  8              to   w-tot-pmc-inx
                     go to stp-tot-cir-140.
      *                          *-------------------------------------*
      *                          * Memorizzazione nuovo elemento       *
      *                          *-------------------------------------*
           move      w-tot-pmc-wsa
                    (w-stp-tot-cir-c01)   to   w-tot-pmc-saa
                                              (w-tot-pmc-inx)         .
           move      w-tot-pmc-wms
                    (w-stp-tot-cir-c01)   to   w-tot-pmc-mes
                                              (w-tot-pmc-inx)         .
      *                          *-------------------------------------*
      *                          * Ad aggiornamento importi            *
      *                          *-------------------------------------*
           go to     stp-tot-cir-140.
       stp-tot-cir-140.
      *                      *-----------------------------------------*
      *                      * Aggiornamento importi                   *
      *                      *-----------------------------------------*
           move      zero                 to   w-stp-tot-cir-c02      .
       stp-tot-cir-160.
           add       1                    to   w-stp-tot-cir-c02      .
           if        w-stp-tot-cir-c02    >    12
                     go to stp-tot-cir-170.
           add       w-tot-pmc-wim
                    (w-stp-tot-cir-c01,
                     w-stp-tot-cir-c02)   to   w-tot-pmc-imp
                                              (w-tot-pmc-inx,
                                               w-stp-tot-cir-c02)     .
           go to     stp-tot-cir-160.
       stp-tot-cir-170.
           add       w-tot-pmc-wtm
                    (w-stp-tot-cir-c01)   to   w-tot-pmc-tme
                                              (w-tot-pmc-inx)         .
      *                      *-----------------------------------------*
      *                      * Riciclo su scansione tabella di lavoro  *
      *                      *-----------------------------------------*
           go to     stp-tot-cir-120.
       stp-tot-cir-180.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      w-tot-pmc-inx        to   w-stp-tot-cir-c01      .
           add       9                    to   w-stp-tot-cir-c01      .
           if        p-res                >    w-stp-tot-cir-c01
                     go to stp-tot-cir-190.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to stp-tot-cir-999.
       stp-tot-cir-190.
      *              *-------------------------------------------------*
      *              * 3 Interlinee                                    *
      *              *-------------------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      03                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Prospetto 'In Circolazione' mensile"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tot-cir-200.
      *              *-------------------------------------------------*
      *              * 2 Interlinee                                    *
      *              *-------------------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      02                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tot-cir-300.
      *              *-------------------------------------------------*
      *              * Fincatura                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal iniziale                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Tipo scad. "        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione mesi bufferizzati in ta- *
      *                  * bella totali                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-cir-c01      .
       stp-tot-cir-320.
           add       1                    to   w-stp-tot-cir-c01      .
           if        w-stp-tot-cir-c01    >    w-tot-pmc-inx
                     go to stp-tot-cir-360.
      *                      *-----------------------------------------*
      *                      * Composizione stringa per mese           *
      *                      *-----------------------------------------*
           move      spaces               to   w-stp-tot-cir-x14      .
           move      1                    to   w-stp-tot-cir-pnt      .
      *                          *-------------------------------------*
      *                          * Se primo periodo                    *
      *                          *-------------------------------------*
           if        w-stp-tot-cir-c01    not  = 1
                     go to stp-tot-cir-325.
           if        w-tot-pmc-mes
                    (w-stp-tot-cir-c01)   not  = zero and
                     w-tot-pmc-saa
                    (w-stp-tot-cir-c01)   not  = zero
                     go to stp-tot-cir-325.
           string    "Preced."  delimited by   size
                                          into w-stp-tot-cir-x14
                                  with pointer w-stp-tot-cir-pnt      .
           go to     stp-tot-cir-340.
       stp-tot-cir-325.
      *                          *-------------------------------------*
      *                          * Se ultimo periodo possibile         *
      *                          *-------------------------------------*
           if        w-stp-tot-cir-c01    not  = 8
                     go to stp-tot-cir-330.
           string    "Succes."  delimited by   size
                                          into w-stp-tot-cir-x14
                                  with pointer w-stp-tot-cir-pnt      .
           go to     stp-tot-cir-340.
       stp-tot-cir-330.
      *                          *-------------------------------------*
      *                          * Indice per mese                     *
      *                          *-------------------------------------*
           move      w-tot-pmc-mes
                    (w-stp-tot-cir-c01)   to   w-stp-tot-cir-inx      .
      *                          *-------------------------------------*
      *                          * Literal del mese, da segreteria     *
      *                          *-------------------------------------*
           move      "LM"                 to   s-ope                  .
           move      "E"                  to   s-tip                  .
           move      w-stp-tot-cir-inx    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                          *-------------------------------------*
      *                          * Mese                                *
      *                          *-------------------------------------*
           string    s-alf      delimited by   spaces
                                          into w-stp-tot-cir-x14
                                  with pointer w-stp-tot-cir-pnt      .
      *                          *-------------------------------------*
      *                          * Anno                                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing anno                    *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-tot-pmc-saa
                    (w-stp-tot-cir-c01)   to   p-num                  .
           add       1900                 to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * String                          *
      *                              *---------------------------------*
           string    " "        delimited by   size
                     p-edt      delimited by   spaces
                                          into w-stp-tot-cir-x14
                                  with pointer w-stp-tot-cir-pnt      .
       stp-tot-cir-340.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           multiply  w-stp-tot-cir-c01    by   14
                                        giving p-pos                  .
           add       w-stp-tot-cir-c01    to   p-pos                  .
           subtract  1                    from p-pos                  .
           subtract  w-stp-tot-cir-pnt    from 14
                                        giving w-stp-tot-cir-inx      .
           divide    2                    into w-stp-tot-cir-inx      .
           add       w-stp-tot-cir-inx    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-stp-tot-cir-x14    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     stp-tot-cir-320.
       stp-tot-cir-360.
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Per tipo scadenza                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "-----------"        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione mesi bufferizzati in ta- *
      *                  * bella totali                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-cir-c01      .
       stp-tot-cir-380.
           add       1                    to   w-stp-tot-cir-c01      .
           if        w-stp-tot-cir-c01    >    w-tot-pmc-inx
                     go to stp-tot-cir-400.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           multiply  w-stp-tot-cir-c01    by   14
                                        giving p-pos                  .
           add       w-stp-tot-cir-c01    to   p-pos                  .
           subtract  1                    from p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     stp-tot-cir-380.
       stp-tot-cir-400.
      *              *-------------------------------------------------*
      *              * Ciclo per ciascun tipo scadenza                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-tot-cir-c01      .
       stp-tot-cir-420.
           add       1                    to   w-stp-tot-cir-c01      .
           if        w-stp-tot-cir-c01    >    12
                     go to stp-tot-cir-500.
      *                  *---------------------------------------------*
      *                  * Test se tipo scadenza da stampare           *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-cir-c02      .
       stp-tot-cir-422.
           add       1                    to   w-stp-tot-cir-c02      .
           if        w-stp-tot-cir-c02    >    w-tot-pmc-inx
                     go to stp-tot-cir-420.
           if        w-tot-pmc-imp
                    (w-stp-tot-cir-c02
                     w-stp-tot-cir-c01)   not  = zero
                     go to stp-tot-cir-430.
           go to     stp-tot-cir-422.
       stp-tot-cir-430.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo per ciascun mese                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-cir-c02      .
       stp-tot-cir-440.
           add       1                    to   w-stp-tot-cir-c02      .
           if        w-stp-tot-cir-c02    >    w-tot-pmc-inx
                     go to stp-tot-cir-460.
      *                  *---------------------------------------------*
      *                  * Tipo scadenza                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           if        w-stp-tot-cir-c01    =    01
                     move  "RD  "         to   p-alf
           else if   w-stp-tot-cir-c01    =    02
                     move  "DC  "         to   p-alf
           else if   w-stp-tot-cir-c01    =    03
                     move  "IE  "         to   p-alf
           else if   w-stp-tot-cir-c01    =    04
                     move  "RIBA"         to   p-alf
           else if   w-stp-tot-cir-c01    =    05
                     move  "CDO "         to   p-alf
           else if   w-stp-tot-cir-c01    =    06
                     move  "MAV "         to   p-alf
           else if   w-stp-tot-cir-c01    =    07
                     move  "RID "         to   p-alf
           else if   w-stp-tot-cir-c01    =    08
                     move  "BB  "         to   p-alf
           else if   w-stp-tot-cir-c01    =    09
                     move  "CCP "         to   p-alf
           else if   w-stp-tot-cir-c01    =    10
                     move  "RB  "         to   p-alf
           else if   w-stp-tot-cir-c01    =    11
                     move  "TR  "         to   p-alf
           else if   w-stp-tot-cir-c01    =    12
                     move  "PC  "         to   p-alf
           else      move  spaces         to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Totale per tipo scadenza nel mese           *
      *                  *---------------------------------------------*
           move      w-tot-pmc-imp
                    (w-stp-tot-cir-c02
                     w-stp-tot-cir-c01)   to   w-stp-imp-vlb-val      .
      *
           multiply  w-stp-tot-cir-c02    by   2
                                        giving w-stp-imp-vlb-pos      .
           subtract  2                    from w-stp-imp-vlb-pos      .
           multiply  w-stp-tot-cir-c02    by   13
                                        giving w-stp-tot-cir-inx      .
           add       w-stp-tot-cir-inx    to   w-stp-imp-vlb-pos      .
      *
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     stp-tot-cir-440.
       stp-tot-cir-460.
      *                  *---------------------------------------------*
      *                  * Riciclo su prossimo tipo scadenza           *
      *                  *---------------------------------------------*
           go to     stp-tot-cir-420.
       stp-tot-cir-500.
      *              *-------------------------------------------------*
      *              * Trattini per totale finale                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione mesi bufferizzati in ta- *
      *                  * bella totali                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-cir-c01      .
       stp-tot-cir-520.
           add       1                    to   w-stp-tot-cir-c01      .
           if        w-stp-tot-cir-c01    >    w-tot-pmc-inx
                     go to stp-tot-cir-600.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           multiply  w-stp-tot-cir-c01    by   14
                                        giving p-pos                  .
           add       w-stp-tot-cir-c01    to   p-pos                  .
           subtract  1                    from p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     stp-tot-cir-520.
       stp-tot-cir-600.
      *              *-------------------------------------------------*
      *              * Totali finali                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal                                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Totale"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ciclo per ciascun mese                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-tot-cir-c02      .
       stp-tot-cir-620.
           add       1                    to   w-stp-tot-cir-c02      .
           if        w-stp-tot-cir-c02    >    8
                     go to stp-tot-cir-640.
      *                  *---------------------------------------------*
      *                  * Totale per tipo scadenza nel mese           *
      *                  *---------------------------------------------*
           move      w-tot-pmc-tme
                    (w-stp-tot-cir-c02)   to   w-stp-imp-vlb-val      .
      *
           multiply  w-stp-tot-cir-c02    by   2
                                        giving w-stp-imp-vlb-pos      .
           subtract  2                    from w-stp-imp-vlb-pos      .
           multiply  w-stp-tot-cir-c02    by   13
                                        giving w-stp-tot-cir-inx      .
           add       w-stp-tot-cir-inx    to   w-stp-imp-vlb-pos      .
      *
           perform   stp-imp-vlb-000      thru stp-imp-vlb-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     stp-tot-cir-620.
       stp-tot-cir-640.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
       stp-tot-cir-999.
           exit.

      *    *===========================================================*
      *    * Subroutine per stampa importo in valuta base              *
      *    *-----------------------------------------------------------*
       stp-imp-vlb-000.
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-imp-vlb-pos    to   p-pos                  .
           move      "GB"                 to   p-edm                  .
           move      w-stp-imp-vlb-val    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
        stp-imp-vlb-999.
           exit.

