       Identification division.
       Program-Id.                                 pscf8101           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    nob                 *
      *                        Area gestionale:    aut                 *
      *                                Settore:    sqz                 *
      *                                   Fase:    scf810              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 07/04/21    *
      *                       Ultima revisione:    NdK del 07/04/21    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione stampa per il programma scf810   *
      *                                                                *
      *                    Creazione movimenti di contabilita' genera- *
      *                    le e scadenze fornitori da file XML         *
      *                                                                *
      *                    SU MISURA PER ELETTRA - 'ABB'               *
      *                                                                *
      *                    ___ DA IMPLEMENTARE ___                     *
      *                    ___ VEDI 'pele4001' ___                     *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      *    *===========================================================*
      *    * File Control [kk0]                                        *
      *    *-----------------------------------------------------------*
           select  optional  kk0   assign to disk           f-kk0-pat
                             organization is indexed
                             access mode  is dynamic
                             record key   is kk0-key
                             file status  is                f-kk0-sts .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Progressivo di caricamento                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .

      *    *===========================================================*
      *    * File Description [kk0]                                    *
      *    *-----------------------------------------------------------*
       fd  kk0       label record standard                            .

      *    *===========================================================*
      *    * Record file di appoggio [kk0]                             *
      *    *-----------------------------------------------------------*
       01  kk0-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  kk0-key.
      *            *---------------------------------------------------*
      *            * Progressivo relativo                              *
      *            *---------------------------------------------------*
               10  kk0-prg-rel            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Nome file XML                                     *
      *            *---------------------------------------------------*
               10  kk0-nom-xml            pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  kk0-dat.
      *            *---------------------------------------------------*
      *            * Tipo record                                       *
      *            *                                                   *
      *            * 'T' - Testata                                     *
      *            * 'R' - Riga                                        *
      *            * 'P' - Piede                                       *
      *            *---------------------------------------------------*
               10  kk0-tip-rec            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo elemento                                     *
      *            *---------------------------------------------------*
               10  kk0-tip-ele            pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Tag Elemento                                      *
      *            *---------------------------------------------------*
               10  kk0-tag-ele            pic  x(26)                  .
      *            *---------------------------------------------------*
      *            * Valore Elemento                                   *
      *            *---------------------------------------------------*
               10  kk0-val-ele            pic  x(40)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * File area per [kk0]                                       *
      *    *-----------------------------------------------------------*
       01  f-kk0.
           05  f-kk0-nam                  pic  x(04)                  .
           05  f-kk0-pat                  pic  x(40)                  .
           05  f-kk0-sts                  pic  x(02)                  .

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "ele"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "scf"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "imp"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "scf810"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pscf8101"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "IMPORTAZIONE FATTURE ELETTRONICHE 'ABB' "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/g"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mopsys" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records logici                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [asz]                                                 *
      *        *-------------------------------------------------------*
           copy      "nob/aut/fls/rec/rfasz"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [yfp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfyfp"                          .
      *        *-------------------------------------------------------*
      *        * [zpg]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfzpg"                          .
      *        *-------------------------------------------------------*
      *        * [sfs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/fls/rec/rfsfs"                          .
      *        *-------------------------------------------------------*
      *        * [sff]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/fls/rec/rfsff"                          .
      *        *-------------------------------------------------------*
      *        * [pdc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfpdc"                          .
      *        *-------------------------------------------------------*
      *        * [zci]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfzci"                          .
      *        *-------------------------------------------------------*
      *        * [prtivf]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/num/rec/rnprtivf"                       .
      *        *-------------------------------------------------------*
      *        * [sfsnum]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/num/rec/rnsfsnum"                       .
      *        *-------------------------------------------------------*
      *        * [sffnum]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/num/rec/rnsffnum"                       .

      *    *===========================================================*
      *    * Work-area richieste per stampa                            *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Data registrazione contabile                          *
      *        *-------------------------------------------------------*
           05  rr-dat-reg                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Tipo esecuzione                                       *
      *        *                                                       *
      *        * - 01 : Prova                                          *
      *        * - 02 : Definitivo, con generazione movimenti          *
      *        *-------------------------------------------------------*
           05  rr-tip-exe                 pic  9(02)                  .

      *    *===========================================================*
      *    * Work area per contatori ed indici                         *
      *    *-----------------------------------------------------------*
       01  w-cix.
      *        *-------------------------------------------------------*
      *        * Contatore numero righe scansionate                    *
      *        *-------------------------------------------------------*
           05  w-cix-num-rig              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Contatore numero righe scritte                        *
      *        *-------------------------------------------------------*
           05  w-cix-wrt-rig              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Contatore numero righe errate                         *
      *        *-------------------------------------------------------*
           05  w-cix-err-rig              pic  9(05)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [fnt]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-fnt.
               10  w-let-arc-fnt-flg      pic  x(01)                  .
               10  w-let-arc-fnt-cod      pic  9(07)                  .
               10  w-let-arc-fnt-rag      pic  x(40)                  .
               10  w-let-arc-fnt-via      pic  x(30)                  .
               10  w-let-arc-fnt-loc      pic  x(30)                  .
               10  w-let-arc-fnt-stc      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcf]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcf.
               10  w-let-arc-dcf-flg      pic  x(01)                  .
               10  w-let-arc-dcf-tle      pic  x(01)                  .
               10  w-let-arc-dcf-cod      pic  9(07)                  .
               10  w-let-arc-dcf-dpz      pic  x(04)                  .
               10  w-let-arc-dcf-rag      pic  x(40)                  .
               10  w-let-arc-dcf-via      pic  x(40)                  .
               10  w-let-arc-dcf-loc      pic  x(40)                  .
               10  w-let-arc-dcf-abi      pic  9(05)                  .
               10  w-let-arc-dcf-cab      pic  9(05)                  .
               10  w-let-arc-dcf-ccc      pic  x(12)                  .
               10  w-let-arc-dcf-ccp      pic  x(12)                  .
               10  w-let-arc-dcf-ban      pic  x(10)                  .
               10  w-let-arc-dcf-vlt      pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [yfp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-yfp.
               10  w-let-arc-yfp-flg      pic  x(01)                  .
               10  w-let-arc-yfp-cod      pic  9(07)                  .
               10  w-let-arc-yfp-des      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [pdc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-pdc.
               10  w-let-arc-pdc-flg      pic  x(01)                  .
               10  w-let-arc-pdc-cod      pic  9(07)                  .
               10  w-let-arc-pdc-des      pic  x(40)                  .

      *    *===========================================================*
      *    * Work per Let su archivio [zci]                            *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/larczci0.ltw"                   .

      *    *===========================================================*
      *    * Work per subroutines di editing codice iva                *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/wedtzci0.wkl"                   .

      *    *===========================================================*
      *    * Work area di bufferizzazione                              *
      *    *-----------------------------------------------------------*
       01  w-buf.
      *        *-------------------------------------------------------*
      *        * Work per bufferizzazione anagrafica da stampare       *
      *        *-------------------------------------------------------*
           05  w-buf-ana-stp.
               10  w-buf-ana-stp-rs1      pic  x(40)                  .
               10  w-buf-ana-stp-rs2      pic  x(40)                  .
               10  w-buf-ana-stp-via      pic  x(40)                  .
               10  w-buf-ana-stp-loc      pic  x(40)                  .
               10  w-buf-ana-stp-int      pic  x(30)                  .
      *        *-------------------------------------------------------*
      *        * Work per bufferizzazione defaults                     *
      *        *-------------------------------------------------------*
           05  w-buf-rig-def.
               10  w-buf-rig-def-fop      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per bufferizzazione riga di tipo 'LT'            *
      *        *-------------------------------------------------------*
           05  w-buf-rig-rlt.
               10  w-buf-rig-rlt-fnt      pic  9(07)                  .
               10  w-buf-rig-rlt-dpz      pic  9(02)                  .
               10  w-buf-rig-rlt-ddo      pic  9(07)                  .
               10  w-buf-rig-rlt-dsc      pic  9(07)                  .
               10  w-buf-rig-rlt-ndo      pic  x(10)                  .
               10  w-buf-rig-rlt-ndn      pic  9(06)                  .
               10  w-buf-rig-rlt-ngi      pic  9(02)                  .
               10  w-buf-rig-rlt-qta      pic  9(08)v9(02)            .
               10  w-buf-rig-rlt-pun      pic s9(13)v9(04)            .
               10  w-buf-rig-rlt-ibl      pic s9(11)                  .
               10  w-buf-rig-rlt-imp      pic s9(11)                  .
               10  w-buf-rig-rlt-itr      pic s9(11)                  .
               10  w-buf-rig-rlt-iva      pic  9(05)                  .
               10  w-buf-rig-rlt-ctp      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per bufferizzazione riga di tipo 'CC'            *
      *        *-------------------------------------------------------*
           05  w-buf-rig-rcc.
               10  w-buf-rig-rcc-qta      pic  9(08)v9(02)            .
               10  w-buf-rig-rcc-pun      pic s9(13)v9(04)            .
               10  w-buf-rig-rcc-ibl      pic s9(11)                  .
               10  w-buf-rig-rcc-imp      pic s9(11)                  .
               10  w-buf-rig-rcc-itr      pic s9(11)                  .
               10  w-buf-rig-rcc-iva      pic  9(05)                  .
               10  w-buf-rig-rcc-mol      pic  9(05)                  .
               10  w-buf-rig-rcc-ibq      pic s9(11)                  .

      *    *===========================================================*
      *    * Work area per messaggi di errore                          *
      *    *-----------------------------------------------------------*
       01  w-msg.
      *        *-------------------------------------------------------*
      *        * Work per messaggi di errore a livello dettaglio       *
      *        *-------------------------------------------------------*
           05  w-msg-liv-det.
               10  w-msg-liv-det-err      pic  x(01)                  .
               10  w-msg-liv-det-msg      pic  x(80)                  .
               10  w-msg-liv-det-ctr      pic  x(05)                  .

      *    *===========================================================*
      *    * Work per subroutines di numerazioni progressive           *
      *    *-----------------------------------------------------------*
       01  w-num.
      *        *-------------------------------------------------------*
      *        * Work per Num [prtivf]                                 *
      *        *-------------------------------------------------------*
           05  w-num-prt-ivf.
               10  w-num-prt-ivf-dat      pic  9(07)                  .
               10  w-num-prt-ivf-ngi      pic  9(02)                  .
               10  w-num-prt-ivf-prt      pic  9(07)                  .
               10  w-num-prt-ivf-dec      pic  9(07)                  .
               10  w-num-prt-ivf-inc      pic  9(07)                  .
               10  w-num-prt-ivf-flg      pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di attribuzione numero scadenza for- *
      *    * nitori                                                    *
      *    *-----------------------------------------------------------*
       01  w-sfs-num.
           05  w-sfs-num-scl-ann          pic  9(03)                  .
           05  w-sfs-num-num-scf          pic  9(11)                  .
           05  w-sfs-num-r01-scf redefines
               w-sfs-num-num-scf.
               10  w-sfs-num-r01-saa      pic  9(03)                  .
               10  w-sfs-num-r01-num      pic  9(08)                  .
           05  w-sfs-num-val-pre          pic  9(08)                  .
           05  w-sfs-num-val-pos          pic  9(08)                  .

      *    *===========================================================*
      *    * Work per subroutines di attribuzione numero operazione di *
      *    * registrazione fattura fornitore                           *
      *    *-----------------------------------------------------------*
       01  w-sff-num.
           05  w-sff-num-scl-ann          pic  9(03)                  .
           05  w-sff-num-num-ftf          pic  9(11)                  .
           05  w-sff-num-r01-pgf redefines
               w-sff-num-num-ftf.
               10  w-sff-num-r01-saa      pic  9(03)                  .
               10  w-sff-num-r01-num      pic  9(08)                  .
           05  w-sff-num-val-pre          pic  9(08)                  .
           05  w-sff-num-val-pos          pic  9(08)                  .

      *    *===========================================================*
      *    * Area di comunicazione per movimento di contabilita'       *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/pcge300z.pgl"                   .

      *    *===========================================================*
      *    * Work per scrittura movimenti                              *
      *    *-----------------------------------------------------------*
       01  w-wrt-mov.
      *        *-------------------------------------------------------*
      *        * Work per scrittura movimenti di registrazione scaden- *
      *        * ze fornitori                                          *
      *        *-------------------------------------------------------*
           05  w-wrt-mov-rsf.
      *            *---------------------------------------------------*
      *            * Numero delle scadenze da generare                 *
      *            *---------------------------------------------------*
               10  w-wrt-mov-rsf-wdg      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero delle scadenze generate                    *
      *            *---------------------------------------------------*
               10  w-wrt-mov-rsf-wsg      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Comodo per codici di pagamento                    *
      *            *---------------------------------------------------*
               10  w-wrt-mov-rsf-wcp      pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di presenza anagrafica commerciale del for-  *
      *            * nitore                                            *
      *            *---------------------------------------------------*
               10  w-wrt-mov-rsf-wff      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per scrittura movimenti di registrazione fatture *
      *        * fornitori                                             *
      *        *-------------------------------------------------------*
           05  w-wrt-mov-sff.
      *            *---------------------------------------------------*
      *            * Protocollo                                        *
      *            *---------------------------------------------------*
               10  w-wrt-mov-sff-prt      pic  9(11)                  .

      *    *===========================================================*
      *    * Work per valori trattati a livello dettaglio              *
      *    *-----------------------------------------------------------*
       01  w-prn-liv-det.
      *        *-------------------------------------------------------*
      *        * Rottura su numero fattura                             *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-rnf          pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Data                                                  *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-dat.
               10  w-prn-liv-det-daa      pic  9(02)                  .
               10  w-prn-liv-det-dmm      pic  9(02)                  .
               10  w-prn-liv-det-dgg      pic  9(02)                  .
           05  w-prn-liv-det-ddo          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Imposta                                               *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-imp          pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Importo ivato                                         *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-tot          pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Importo totale documento                              *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-tdo          pic s9(13)                  .
      *        *-------------------------------------------------------*
      *        * Protocolli CGE                                        *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-cge          pic  9(07)                  .
           05  w-prn-liv-det-pif          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Numero scadenza                                       *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-scf          pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Contatore scadenze generate                           *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-nsg          pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area referenze                                       *
      *    *-----------------------------------------------------------*
       01  w-ref.
      *        *-------------------------------------------------------*
      *        * Sottoconto 'iva acquisti'                             *
      *        *-------------------------------------------------------*
           05  w-ref-iva-acq              pic  9(07)                  .

      *    *===========================================================*
      *    * Work per subroutine cmp-rec-sff-000/999                   *
      *    *-----------------------------------------------------------*
       01  w-cmp-rec-sff.
           05  w-cmp-rec-sff-ctr          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per calcolo tabella scadenze                         *
      *    *-----------------------------------------------------------*
           copy      "pgm/fat/prg/cpy/dtblscd0.dtw"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione imposta in base  *
      *    * ad un imponibile                                          *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/dimpiva0.dtl"                   .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/werrbox0.cpw"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  filler                 pic  x(01)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
       pre-exe-pgm-100.
      *              *-------------------------------------------------*
      *              * Lettura referenze                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Sottoconto 'iva acquisti'                   *
      *                  *---------------------------------------------*
           move      "R:"                 to   s-ope                  .
           move      "pgm/cge/mov/cge300[iva-acq]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-num          to   w-ref-iva-acq
           else      move  zero           to   w-ref-iva-acq          .
      *                  *---------------------------------------------*
      *                  * Se referenza non trovata : uscita dal pro-  *
      *                  * gramma per errore                           *
      *                  *---------------------------------------------*
           if        w-ref-iva-acq        not  = zero
                     go to pre-exe-pgm-999.
      *                  *---------------------------------------------*
      *                  * Status di uscita                            *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-exe-pgm      .
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Referenze non trovate : programma non eseguibile !
      -              " "                  to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-exe-pgm-999.
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [yfp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
      *              *-------------------------------------------------*
      *              * [zpg]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofzpg"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpg                 .
      *              *-------------------------------------------------*
      *              * [sfs]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
      *              *-------------------------------------------------*
      *              * [sff]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsff"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sff                 .
      *              *-------------------------------------------------*
      *              * [pdc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofpdc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdc                 .
      *              *-------------------------------------------------*
      *              * [zci]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *              *-------------------------------------------------*
      *              * [prtivf]                                        *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
      *              *-------------------------------------------------*
      *              * [sfsnum]                                        *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *              *-------------------------------------------------*
      *              * [sffnum]                                        *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insffnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sff-num             .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione imposta           *
      *              *-------------------------------------------------*
           move      "OP"                 to   d-imp-iva-tip-ope      .
           move      "pgm/cge/prg/obj/dimpiva0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-imp-iva              .
       prn-opn-fls-900.
      *              *-------------------------------------------------*
      *              * Open programma di generazione automatica movi-  *
      *              * menti di CGE                                    *
      *              *-------------------------------------------------*
           move      "OP"                 to   l-cge-300-tip-ope      .
           perform   cll-300-zet-000      thru cll-300-zet-999        .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Chiusura del file in input                      *
      *              *-------------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo utilizzato                 *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mcvinp"                         .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [yfp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
      *              *-------------------------------------------------*
      *              * [zpg]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofzpg"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpg                 .
      *              *-------------------------------------------------*
      *              * [sfs]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
      *              *-------------------------------------------------*
      *              * [sff]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsff"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sff                 .
      *              *-------------------------------------------------*
      *              * [pdc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofpdc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdc                 .
      *              *-------------------------------------------------*
      *              * [zci]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *              *-------------------------------------------------*
      *              * [prtivf]                                        *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
      *              *-------------------------------------------------*
      *              * [sfsnum]                                        *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *              *-------------------------------------------------*
      *              * [sffnum]                                        *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insffnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sff-num             .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione imposta          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-imp-iva-tip-ope      .
           move      "pgm/cge/prg/obj/dimpiva0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-imp-iva              .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-imp-iva-tip-ope      .
           move      "pgm/cge/prg/obj/dimpiva0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-imp-iva              .
           if        d-imp-iva-exi-sts    not  = spaces
                     go to prn-cls-fls-900.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/cge/prg/obj/dimpiva0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       prn-cls-fls-900.
      *              *-------------------------------------------------*
      *              * Close programma di generazione automatica movi- *
      *              * menti di CGE                                    *
      *              *-------------------------------------------------*
           move      "CL"                 to   l-cge-300-tip-ope      .
           perform   cll-300-zet-000      thru cll-300-zet-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione programma di generazione automa-  *
      *              * tica movimenti di CGE                           *
      *              *-------------------------------------------------*
           move      "C?"                 to   l-cge-300-tip-ope      .
           perform   cll-300-zet-000      thru cll-300-zet-999        .
           if        l-cge-300-exi-sts    not  = spaces
                     go to prn-cls-fls-999.
           cancel    s-pat                                            .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : No                    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-exe-rou-srt      .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Creazione lista e importazione fatture XML      *
      *              *-------------------------------------------------*
           perform   prn-str-ini-imp-000  thru prn-str-ini-imp-999    .
      *              *-------------------------------------------------*
      *              * Scansione della lista generata                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-slg-000  thru prn-str-ini-slg-999    .
           
           
           
      *              *-------------------------------------------------*
      *              * Normalizzazione contatori                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-cix-num-rig          .
           move      zero                 to   w-cix-wrt-rig          .
           move      zero                 to   w-cix-err-rig          .
      *              *-------------------------------------------------*
      *              * Normalizzazione comodo per rottura nr. fattura  *
      *              *-------------------------------------------------*
           move      spaces               to   w-prn-liv-det-rnf      .
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di errore                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-msg-liv-det-err      .
      *              *-------------------------------------------------*
      *              * Apertura del file in input                      *
      *              *-------------------------------------------------*
           move      "OI"                 to   g-ope                  .
           move      "asz "               to   g-nam                  .
           move      rr-pth-inp           to   g-pat                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se Open errata                              *
      *                  *---------------------------------------------*
           if        g-sts                not  = e-not-err
                     move  "#"            to   w-cnt-prn-flg-sub      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *                                                           *
      *    * Subroutine di creazione lista e importazione fatture XML  *
      *    *-----------------------------------------------------------*
       prn-str-ini-imp-000.
      *              *-------------------------------------------------*
      *              * Prompt per esecuzione                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Recupero dati ................: in corso"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      
      *              *-------------------------------------------------*
      *              * Richiesta informazioni generali segreteria      *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo apposito script per estrarre i dati    *
      *              * dal file 'xml'                                  *
      *              *-------------------------------------------------*
           move      spaces               to   o-shs                  .
      *
           string    "t_xml_scf_dir "  
                                delimited by   size
                     s-ute      delimited by   spaces
                     " "        delimited by   size
                     s-azi      delimited by   spaces
                                          into o-shs                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo 'mopsys'                    *
      *              *-------------------------------------------------*
           move      "SH"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Prompt per compressione eseguita                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Recupero dati ................: ESEGUITO"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       prn-str-ini-imp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-str-ini-imp-999.
       prn-str-ini-imp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *                                                           *
      *    * Subroutine di scansione della lista generata              *
      *    *-----------------------------------------------------------*
       prn-str-ini-slg-000.
      *              *-------------------------------------------------*
      *              * Prompt per esecuzione                           *
      *              *-------------------------------------------------*


       prn-str-ini-slg-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-str-ini-slg-999.
       prn-str-ini-slg-999.
           exit.





______*





      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessun elemento da sottoporre ad elaborazione !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file in input               *
      *              *-------------------------------------------------*
           move      "GN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se fine file                                *
      *                  *---------------------------------------------*
           if        g-sts                not  = e-not-err
                     move  "#"            to   w-cnt-prn-flg-sub      .
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Bufferizzazione linea letta                     *
      *              *-------------------------------------------------*
           move      g-rec                to   rf-asz                 .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Test se flag di errore attivo                   *
      *              *-------------------------------------------------*
           if        w-msg-liv-det-err    not  = spaces
                     go to prn-fin-cic-100.
      *              *-------------------------------------------------*
      *              * Incremento contatore righe scritte              *
      *              *-------------------------------------------------*
           add       1                    to   w-cix-wrt-rig          .
      *              *-------------------------------------------------*
      *              * Scrittura movimenti                             *
      *              *-------------------------------------------------*
           perform   scr-mov-fil-000      thru scr-mov-fil-999        .
       prn-fin-cic-100.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Test su contatore righe errate                  *
      *              *-------------------------------------------------*
           if        w-cix-err-rig        =    zero and
                     w-cix-wrt-rig        =    zero
                     go to prn-fin-cic-999.
      *              *-------------------------------------------------*
      *              * Editing contatore righe scritte                 *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-cix-wrt-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-msg-liv-det-ctr      .
       prn-fin-cic-200.
      *              *-------------------------------------------------*
      *              * Messaggio di fine esecuzione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * 1. riga                                     *
      *                  *---------------------------------------------*
           move      all "-"              to   w-msg-liv-det-msg      .
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * 2. riga                                     *
      *                  *---------------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Totale documenti registrati regolarmente : "
                                delimited by   size
                     p-edt      delimited by   spaces
                                          into w-msg-liv-det-msg      .
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Editing contatore righe errate              *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-cix-err-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-msg-liv-det-ctr      .
      *                  *---------------------------------------------*
      *                  * 3. riga                                     *
      *                  *---------------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Totale documenti con errori : "
                                delimited by   size
                     p-edt      delimited by   spaces
                                          into w-msg-liv-det-msg      .
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * 4. riga                                     *
      *                  *---------------------------------------------*
           move      all "-"              to   w-msg-liv-det-msg      .
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Test di rottura su numero documento             *
      *              *-------------------------------------------------*
           if        w-prn-liv-det-rnf    =    spaces
                     go to prn-liv-det-010.
           if        rf-asz-num-doc       =    w-prn-liv-det-rnf
                     go to prn-liv-det-020.
      *              *-------------------------------------------------*
      *              * Test se flag di errore attivo                   *
      *              *-------------------------------------------------*
           if        w-msg-liv-det-err    not  = spaces
                     go to prn-liv-det-010.
       prn-liv-det-005.
      *              *-------------------------------------------------*
      *              * Test se flag di errore attivo                   *
      *              *-------------------------------------------------*
           if        w-msg-liv-det-err    not  = spaces
                     go to prn-liv-det-010.
      *              *-------------------------------------------------*
      *              * Incremento contatore righe scritte              *
      *              *-------------------------------------------------*
           add       1                    to   w-cix-wrt-rig          .
      *              *-------------------------------------------------*
      *              * Scrittura movimenti                             *
      *              *-------------------------------------------------*
           perform   scr-mov-fil-000      thru scr-mov-fil-999        .
       prn-liv-det-010.
      *              *-------------------------------------------------*
      *              * Aggiornamento comodo per rottura nr. fattura    *
      *              *-------------------------------------------------*
           move      rf-asz-num-doc       to   w-prn-liv-det-rnf      .
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazioni preliminari record '1'      *
      *                  *---------------------------------------------*
           move      zero                 to   w-buf-rig-rlt-fnt      .
           move      zero                 to   w-buf-rig-rlt-dpz      .
           move      zero                 to   w-buf-rig-rlt-ddo      .
           move      zero                 to   w-buf-rig-rlt-dsc      .
           move      spaces               to   w-buf-rig-rlt-ndo      .
           move      zero                 to   w-buf-rig-rlt-ndn      .
           move      zero                 to   w-buf-rig-rlt-ngi      .
           move      zero                 to   w-buf-rig-rlt-qta      .
           move      zero                 to   w-buf-rig-rlt-pun      .
           move      zero                 to   w-buf-rig-rlt-ibl      .
           move      zero                 to   w-buf-rig-rlt-imp      .
           move      zero                 to   w-buf-rig-rlt-itr      .
           move      zero                 to   w-buf-rig-rlt-iva      .
           move      zero                 to   w-buf-rig-rlt-ctp      .
      *                  *---------------------------------------------*
      *                  * Normalizzazioni preliminari record 'Q'      *
      *                  *---------------------------------------------*
           move      zero                 to   w-buf-rig-rcc-qta      .
           move      zero                 to   w-buf-rig-rcc-pun      .
           move      zero                 to   w-buf-rig-rcc-ibl      .
           move      zero                 to   w-buf-rig-rcc-imp      .
           move      zero                 to   w-buf-rig-rcc-itr      .
           move      zero                 to   w-buf-rig-rcc-iva      .
           move      zero                 to   w-buf-rig-rcc-mol      .
           move      zero                 to   w-buf-rig-rcc-ibq      .
       prn-liv-det-020.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Normalizzazione messaggio di errore             *
      *              *-------------------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
      *              *-------------------------------------------------*
      *              * Incremento contatore righe scansionate          *
      *              *-------------------------------------------------*
           add       1                    to   w-cix-num-rig          .
      *              *-------------------------------------------------*
      *              * Editing contatore righe scansionate             *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-cix-num-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-msg-liv-det-ctr      .
       prn-liv-det-050.
      *              *-------------------------------------------------*
      *              * Preparazione defaults                           *
      *              *-------------------------------------------------*
           move      0001152              to   w-buf-rig-def-fop      .
       prn-liv-det-100.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di riga         *
      *              *-------------------------------------------------*
           if        rf-asz-tip-rig       =    "LT"
                     go to prn-liv-det-200
           else if   rf-asz-tip-rig       =    "CC"
                     go to prn-liv-det-300
           else      go to prn-liv-det-900.
       prn-liv-det-200.
      *              *-------------------------------------------------*
      *              * Subroutine per riga di tipo : 'LT'              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine                                  *
      *                  *---------------------------------------------*
           perform   prn-liv-det-rlt-000  thru prn-liv-det-rlt-999    .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-800.
       prn-liv-det-300.
      *              *-------------------------------------------------*
      *              * Subroutine per riga di tipo : 'CC'              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se flag di errore attivo               *
      *                  *---------------------------------------------*
           if        w-msg-liv-det-err    not  = spaces
                     go to prn-liv-det-390.
      *                  *---------------------------------------------*
      *                  * Subroutine                                  *
      *                  *---------------------------------------------*
           perform   prn-liv-det-rcc-000  thru prn-liv-det-rcc-999    .
       prn-liv-det-390.
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-800.
       prn-liv-det-800.
      *              *-------------------------------------------------*
      *              * Test se esecuzione di prova                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rr-tip-exe           not  = 01
                     go to prn-liv-det-900.
      *                  *---------------------------------------------*
      *                  * Editing codice fornitore                    *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-buf-rig-rlt-fnt    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (2)      .
      *                  *---------------------------------------------*
      *                  * Editing imponibile                          *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<BG"                to   p-edm                  .
           move      w-buf-rig-rlt-ibl    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (6)      .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      06                   to   w-all-str-num          .
           move      "Fornitore      :"   to   w-all-str-cat (1)      .
           move      "- Fattura :"        to   w-all-str-cat (3)      .
           move      w-buf-rig-rlt-ndo    to   w-all-str-cat (4)      .
           move      "- Imponibile :"     to   w-all-str-cat (5)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                  *---------------------------------------------*
      *                  * Rullino messaggi                            *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-all-str-alf        to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-900.
       prn-liv-det-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Riga di tipo : 'LT' = inizio documento                    *
      *    *-----------------------------------------------------------*
       prn-liv-det-rlt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di errore                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-msg-liv-det-err      .
       prn-liv-det-rlt-050.
      *              *-------------------------------------------------*
      *              * Assestamenti preliminari                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice fornitore                            *
      *                  *---------------------------------------------*
           move      rf-asz-cod-fnt       to   w-buf-rig-rlt-fnt      .
      *                  *---------------------------------------------*
      *                  * Codice dipendenza                           *
      *                  *---------------------------------------------*
           move      rf-asz-cod-dpz       to   w-buf-rig-rlt-dpz      .
      *                  *---------------------------------------------*
      *                  * Data documento                              *
      *                  *---------------------------------------------*
           subtract  19000000             from rf-asz-dat-doc
                                        giving w-buf-rig-rlt-ddo      .
      *                  *---------------------------------------------*
      *                  * Data scadenza                               *
      *                  *---------------------------------------------*
           subtract  19000000             from rf-asz-dat-scd
                                        giving w-buf-rig-rlt-dsc      .
      *                  *---------------------------------------------*
      *                  * Numero documento                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Conversione                             *
      *                      *-----------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      06                   to   v-car                  .
           move      rf-asz-num-doc (3:6) to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-buf-rig-rlt-ndn      .
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-buf-rig-rlt-ndn    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-buf-rig-rlt-ndo      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      10                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      p-edt                to   w-all-str-cat (1)      .
           move      "/"                  to   w-all-str-cat (2)      .
           move      rf-asz-num-doc (1:2) to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-buf-rig-rlt-ndo      .
      *                  *---------------------------------------------*
      *                  * Numero giornale Iva acquisti                *
      *                  *                                             *
      *                  * Nobili : Viene dedotto dal 3' carattere del *
      *                  *          campo 'numero document'.           *
      *                  *---------------------------------------------*
           if        rf-asz-num-doc (3:1) =    "0"
                     move  00             to   w-buf-rig-rlt-ngi
           else if   rf-asz-num-doc (3:1) =    "1"
                     move  01             to   w-buf-rig-rlt-ngi
           else      move  00             to   w-buf-rig-rlt-ngi      .
      *                  *---------------------------------------------*
      *                  * Quantita'                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Conversione                             *
      *                      *-----------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      12                   to   v-car                  .
           move      rf-asz-qta-rig       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-buf-rig-rlt-qta      .
           divide    w-buf-rig-rcc-mol    into w-buf-rig-rcc-qta      .
           divide    100                  into w-buf-rig-rlt-qta      .
      *                  *---------------------------------------------*
      *                  * Importo unitario                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Conversione                             *
      *                      *-----------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      16                   to   v-car                  .
           move      rf-asz-imp-rig       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-buf-rig-rlt-pun      .
           divide    100000000            into w-buf-rig-rlt-pun      .
      *                      *-----------------------------------------*
      *                      * Calcolo imponibile                      *
      *                      *-----------------------------------------*
           multiply  w-buf-rig-rlt-pun    by   w-buf-rig-rlt-qta
                                        giving w-buf-rig-rlt-ibl      .
      *                  *---------------------------------------------*
      *                  * Iva                                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Conversione                             *
      *                      *-----------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      05                   to   v-car                  .
           move      rf-asz-ali-iva       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-buf-rig-rlt-iva      .
      *                  *---------------------------------------------*
      *                  * Contropartita acquisti                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Conversione                             *
      *                      *-----------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      12                   to   v-car                  .
           move      rf-asz-ctp-acq       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-buf-rig-rlt-ctp      .
       prn-liv-det-rlt-100.
      *              *-------------------------------------------------*
      *              * Controlli preliminari                           *
      *              *-------------------------------------------------*
       prn-liv-det-rlt-110.
      *                  *---------------------------------------------*
      *                  * Su codice fornitore                         *
      *                  *---------------------------------------------*
           if        w-buf-rig-rlt-fnt    not  = zero
                     go to prn-liv-det-rlt-120.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Codice fornitore a zero !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-rlt-900.
       prn-liv-det-rlt-120.
      *                  *---------------------------------------------*
      *                  * Su codice Iva                               *
      *                  *---------------------------------------------*
           if        w-buf-rig-rlt-iva    not  = zero
                     go to prn-liv-det-rlt-130.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Codice Iva a zero !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-rlt-900.
       prn-liv-det-rlt-130.
      *                  *---------------------------------------------*
      *                  * Su Imponibile Iva                           *
      *                  *---------------------------------------------*
           if        w-buf-rig-rlt-ibl    not  = zero
                     go to prn-liv-det-rlt-140.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Imponibile Iva a zero !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-rlt-900.
       prn-liv-det-rlt-140.
      *                  *---------------------------------------------*
      *                  * Su Contropartita acquisti                   *
      *                  *---------------------------------------------*
           if        w-buf-rig-rlt-ctp    not  = zero
                     go to prn-liv-det-rlt-150.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Contropartita acquisti a zero !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-rlt-900.
       prn-liv-det-rlt-150.
      *                  *---------------------------------------------*
      *                  * Su estremi registrazione : se fattura gia'  *
      *                  * registrata                                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Operazione di controllo su 'cge'        *
      *                      *-----------------------------------------*
           move      "CN"                 to   l-cge-300-tip-ope      .
           move      "F"                  to   l-cge-300-tip-arc      .
           move      w-buf-rig-rlt-fnt    to   l-cge-300-cod-arc      .
           move      w-buf-rig-rlt-ddo    to   l-cge-300-dat-doc      .
           move      w-buf-rig-rlt-ndo    to   l-cge-300-num-doc      .
           move      zero                 to   l-cge-300-num-prt      .
           move      "pgm/cge/prg/obj/pcge300z"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using l-cge-300              .
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        l-cge-300-exi-sts    =    spaces
                     go to prn-liv-det-rlt-200.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Fattura gia' registrata - NR: "
                                delimited by   size
                     w-buf-rig-rlt-ndo                                
                                delimited by   spaces
                     " !"                                
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-rlt-900.
       prn-liv-det-rlt-200.
      *              *-------------------------------------------------*
      *              * Test di esistenza dei valori in archivio        *
      *              *-------------------------------------------------*
       prn-liv-det-rlt-210.
      *                  *---------------------------------------------*
      *                  * Su codice fornitore contabile               *
      *                  *---------------------------------------------*
           move      w-buf-rig-rlt-fnt    to   w-let-arc-fnt-cod      .
           perform   let-arc-fnt-000      thru let-arc-fnt-999        .
           if        w-let-arc-fnt-flg    =    spaces
                     go to prn-liv-det-rlt-215.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Anagrafica contabile Fornitore non tro
      -              "vata !"   delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-rlt-900.
       prn-liv-det-rlt-215.
      *                  *---------------------------------------------*
      *                  * Su codice fornitore commerciale             *
      *                  *---------------------------------------------*
           move      "C"                  to   w-let-arc-dcf-tle      .
           move      w-buf-rig-rlt-fnt    to   w-let-arc-dcf-cod      .
           move      spaces               to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
           if        w-let-arc-dcf-flg    =    spaces
                     go to prn-liv-det-rlt-220.
      *                      *-----------------------------------------*
      *                      * Messaggio di avviso                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : Nota   - Anagrafica commerciale Fornitore non t
      -              "rovata !" delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Scrittura del messaggio di avviso       *
      *                      *-----------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-liv-det-rlt-220.
      *                  *---------------------------------------------*
      *                  * Su codice Iva                               *
      *                  *---------------------------------------------*
           move      w-buf-rig-rlt-iva    to   w-let-arc-zci-cod      .
           perform   let-arc-zci-000      thru let-arc-zci-999        .
           if        w-let-arc-zci-flg    =    spaces
                     go to prn-liv-det-rlt-240.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Codice Iva non trovato in tabella !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-rlt-900.
       prn-liv-det-rlt-240.
      *                  *---------------------------------------------*
      *                  * Su Contropartita acquisti                   *
      *                  *---------------------------------------------*
           move      w-buf-rig-rlt-ctp    to   w-let-arc-pdc-cod      .
           perform   let-arc-pdc-000      thru let-arc-pdc-999        .
           if        w-let-arc-pdc-flg    =    spaces
                     go to prn-liv-det-rlt-250.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Contropartita acquisti non trovata !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-rlt-900.
       prn-liv-det-rlt-250.
      *                  *---------------------------------------------*
      *                  * Su codice di pagamento                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se controllo da effettuare         *
      *                      *-----------------------------------------*
           if        w-buf-rig-def-fop    =    zero
                     go to prn-liv-det-rlt-300.
      *                      *-----------------------------------------*
      *                      * Lettura archivio [yfp]                  *
      *                      *-----------------------------------------*
           move      w-buf-rig-def-fop    to   w-let-arc-yfp-cod      .
           perform   let-arc-yfp-000      thru let-arc-yfp-999        .
           if        w-let-arc-yfp-flg    =    spaces
                     go to prn-liv-det-rlt-300.
      *                      *-----------------------------------------*
      *                      * Forzatura del valore                    *
      *                      *-----------------------------------------*
           move      0001152              to   w-buf-rig-def-fop      .
       prn-liv-det-rlt-300.
      *              *-------------------------------------------------*
      *              * Altri controlli                                 *
      *              *-------------------------------------------------*
       prn-liv-det-rlt-310.
      *                  *---------------------------------------------*
      *                  * Test se presente la data documento          *
      *                  *---------------------------------------------*
           if        w-buf-rig-rlt-ddo    =    zero
                     go to prn-liv-det-rlt-320.
      *                  *---------------------------------------------*
      *                  * Controllo data                              *
      *                  *---------------------------------------------*
           move      w-buf-rig-rlt-ddo    to   w-prn-liv-det-ddo      .
           move      "CD"                 to   s-ope                  .
           move      w-prn-liv-det-ddo    to   s-dat                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-sts                =    spaces
                     go to prn-liv-det-rlt-320.
      *                      *-----------------------------------------*
      *                      * Messaggio di avviso                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : Nota   - Data con formato non corretto !" 
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Scrittura del messaggio di avviso       *
      *                      *-----------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                      *-----------------------------------------*
      *                      * Normalizzazione della data              *
      *                      *-----------------------------------------*
           move      zero                 to   w-buf-rig-rlt-ddo      .
       prn-liv-det-rlt-320.
      *                  *---------------------------------------------*
      *                  * Normalizzazione valori per i calcoli        *
      *                  *---------------------------------------------*
           move      zero                 to   w-prn-liv-det-imp      .
           move      zero                 to   w-prn-liv-det-tot      .
      *                  *---------------------------------------------*
      *                  * Calcolo dell'Iva                            *
      *                  *---------------------------------------------*
           if        w-buf-rig-rlt-iva    >    100
                     go to prn-liv-det-rlt-340.
      *
           if        w-buf-rig-rcc-ibl    =    zero
                     move  w-buf-rig-rcc-ibq
                                          to   w-buf-rig-rcc-ibl      .
      *
           move      w-buf-rig-rlt-ibl    to   d-imp-iva-ibl-iva      .
           move      w-buf-rig-rlt-iva    to   d-imp-iva-cod-iva      .
           perform   det-imp-iva-000      thru det-imp-iva-999        .
           move      d-imp-iva-ims-iva    to   w-prn-liv-det-imp      .
       prn-liv-det-rlt-340.
           move      w-prn-liv-det-imp    to   w-buf-rig-rlt-imp      .
      *                  *---------------------------------------------*
      *                  * Calcolo dell'importo con Iva                *
      *                  *---------------------------------------------*
           move      w-buf-rig-rlt-ibl    to   w-prn-liv-det-tot      .
           add       w-buf-rig-rlt-imp    to   w-prn-liv-det-tot      .
           move      w-prn-liv-det-tot    to   w-buf-rig-rlt-itr      .
       prn-liv-det-rlt-800.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-rlt-999.
       prn-liv-det-rlt-900.
      *              *-------------------------------------------------*
      *              * Uscita con errore                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore righe errate           *
      *                  *---------------------------------------------*
           add       1                    to   w-cix-err-rig          .
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Flag di errore                              *
      *                  *---------------------------------------------*
           move      "#"                  to   w-msg-liv-det-err      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-liv-det-rlt-999.
       prn-liv-det-rlt-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Riga di tipo : 'CC'                                       *
      *    *-----------------------------------------------------------*
       prn-liv-det-rcc-000.
      *              *-------------------------------------------------*
      *              * Assestamenti preliminari                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Moltiplicatore                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Conversione                             *
      *                      *-----------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      03                   to   v-car                  .
           move      rf-asz-uni-mol       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-buf-rig-rcc-mol      .
      *                  *---------------------------------------------*
      *                  * Quantita'                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Conversione                             *
      *                      *-----------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      12                   to   v-car                  .
           move      rf-asz-qta-rig       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-buf-rig-rcc-qta      .
           divide    w-buf-rig-rcc-mol    into w-buf-rig-rcc-qta      .
      *                  *---------------------------------------------*
      *                  * Importo unitario                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Conversione                             *
      *                      *-----------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      16                   to   v-car                  .
           move      rf-asz-imp-rig       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-buf-rig-rcc-pun      .
           divide    10000                into w-buf-rig-rcc-pun      .
      *                      *-----------------------------------------*
      *                      * Calcolo imponibile                      *
      *                      *-----------------------------------------*
           multiply  w-buf-rig-rcc-pun    by   w-buf-rig-rcc-qta
                                        giving w-buf-rig-rcc-ibl      .
      *                  *---------------------------------------------*
      *                  * Iva                                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Conversione                             *
      *                      *-----------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      05                   to   v-car                  .
           move      rf-asz-ali-iva       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-buf-rig-rcc-iva      .
      *                  *---------------------------------------------*
      *                  * Imponibile se non calcolato                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su imponibile calcolato            *
      *                      *-----------------------------------------*
           if        w-buf-rig-rcc-ibl    not  = zero
                     go to prn-liv-det-rcc-100.
      *                      *-----------------------------------------*
      *                      * Conversione                             *
      *                      *-----------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      12                   to   v-car                  .
           move      rf-asz-ibl-rig       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-buf-rig-rcc-ibq      .
______*    divide    100                  into w-buf-rig-rcc-ibq      .
       prn-liv-det-rcc-100.
      *              *-------------------------------------------------*
      *              * Controlli preliminari                           *
      *              *-------------------------------------------------*
       prn-liv-det-rcc-110.
      *                  *---------------------------------------------*
      *                  * Su codice fornitore                         *
      *                  *---------------------------------------------*
           if        rf-asz-cod-fnt       =    w-buf-rig-rlt-fnt
                     go to prn-liv-det-rcc-120.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Codice fornitore fuori sequenza !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-rcc-900.
       prn-liv-det-rcc-120.
       prn-liv-det-rcc-300.
      *              *-------------------------------------------------*
      *              * Altri controlli                                 *
      *              *-------------------------------------------------*
       prn-liv-det-rcc-320.
      *                  *---------------------------------------------*
      *                  * Normalizzazione valori per i calcoli        *
      *                  *---------------------------------------------*
           move      zero                 to   w-prn-liv-det-imp      .
           move      zero                 to   w-prn-liv-det-tot      .
      *                  *---------------------------------------------*
      *                  * Calcolo dell'Iva                            *
      *                  *---------------------------------------------*
           if        w-buf-rig-rcc-iva    >    100
                     go to prn-liv-det-rcc-340.
      *
           if        w-buf-rig-rcc-ibl    =    zero
                     move  w-buf-rig-rcc-ibq
                                          to   w-buf-rig-rcc-ibl      .
      *
           move      w-buf-rig-rcc-ibl    to   d-imp-iva-ibl-iva      .
           move      w-buf-rig-rcc-iva    to   d-imp-iva-cod-iva      .
           perform   det-imp-iva-000      thru det-imp-iva-999        .
           move      d-imp-iva-ims-iva    to   w-prn-liv-det-imp      .
       prn-liv-det-rcc-340.
           move      w-prn-liv-det-imp    to   w-buf-rig-rcc-imp      .
      *                  *---------------------------------------------*
      *                  * Calcolo dell'importo con Iva                *
      *                  *---------------------------------------------*
           move      w-buf-rig-rcc-ibl    to   w-prn-liv-det-tot      .
           add       w-buf-rig-rcc-imp    to   w-prn-liv-det-tot      .
           move      w-prn-liv-det-tot    to   w-buf-rig-rcc-itr      .
       prn-liv-det-rcc-800.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-rcc-999.
       prn-liv-det-rcc-900.
      *              *-------------------------------------------------*
      *              * Uscita con errore                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore righe errate           *
      *                  *---------------------------------------------*
           add       1                    to   w-cix-err-rig          .
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Flag di errore                              *
      *                  *---------------------------------------------*
           move      "#"                  to   w-msg-liv-det-err      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-liv-det-rcc-999.
       prn-liv-det-rcc-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [fnt]                         *
      *    *-----------------------------------------------------------*
       let-arc-fnt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice fornitore a zero                 *
      *              *-------------------------------------------------*
           if        w-let-arc-fnt-cod    =    zero
                     go to let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT"             to   f-key                  .
           move      w-let-arc-fnt-cod    to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-fnt-400.
       let-arc-fnt-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-fnt-rag-soc       to   w-let-arc-fnt-rag      .
           move      rf-fnt-via-fnt       to   w-let-arc-fnt-via      .
           move      rf-fnt-loc-fnt       to   w-let-arc-fnt-loc      .
           move      rf-fnt-cod-cge       to   w-let-arc-fnt-stc      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-fnt-999.
       let-arc-fnt-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-fnt-flg      .
           move      all   "."            to   w-let-arc-fnt-rag      .
           move      all   "."            to   w-let-arc-fnt-via      .
           move      all   "."            to   w-let-arc-fnt-loc      .
           go to     let-arc-fnt-999.
       let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-rag      .
           move      spaces               to   w-let-arc-fnt-via      .
           move      spaces               to   w-let-arc-fnt-loc      .
           move      zero                 to   w-let-arc-fnt-stc      .
       let-arc-fnt-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio dipendenza fornitore in [dcf]    *
      *    *-----------------------------------------------------------*
       let-arc-dcf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcf-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice fornitore a zero                 *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-cod    =    zero
                     go to let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a spaces, solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-dpz    =    spaces and
                     w-let-arc-dcf-tle    =    "D"
                     go to let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a "*   ", solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-dpz    =    "*   " and
                     w-let-arc-dcf-tle    =    "D"
                     go to let-arc-dcf-450.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      w-let-arc-dcf-cod    to   rf-dcf-cod-fnt         .
           move      w-let-arc-dcf-dpz    to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcf-400.
       let-arc-dcf-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcf-rag-soc       to   w-let-arc-dcf-rag      .
           move      rf-dcf-via-dcf       to   w-let-arc-dcf-via      .
           move      rf-dcf-loc-dcf       to   w-let-arc-dcf-loc      .
           move      rf-dcf-cod-abi       to   w-let-arc-dcf-abi      .
           move      rf-dcf-cod-cab       to   w-let-arc-dcf-cab      .
           move      rf-dcf-ccc-app       to   w-let-arc-dcf-ccc      .
           move      rf-dcf-ccp-app       to   w-let-arc-dcf-ccp      .
           if        w-let-arc-dcf-tle    =    "D"
                     move  spaces         to   w-let-arc-dcf-ban
           else      move  rf-dcf-nos-ban to   w-let-arc-dcf-ban
           move      rf-dcf-cod-vlt       to   w-let-arc-dcf-vlt      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcf-999.
       let-arc-dcf-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcf-flg      .
           move      all   "."            to   w-let-arc-dcf-rag      .
           go to     let-arc-dcf-600.
       let-arc-dcf-450.
      *              *-------------------------------------------------*
      *              * Normalizzazione per codice dipendenza "*   "    *
      *              *-------------------------------------------------*
           move      "Sia la sede che tutte le dipendenze     "
                                          to   w-let-arc-dcf-rag      .
           go to     let-arc-dcf-600.
       let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcf-rag      .
       let-arc-dcf-600.
           move      spaces               to   w-let-arc-dcf-via      .
           move      spaces               to   w-let-arc-dcf-loc      .
           move      zero                 to   w-let-arc-dcf-abi      .
           move      zero                 to   w-let-arc-dcf-cab      .
           move      zero                 to   w-let-arc-dcf-ccc      .
           move      spaces               to   w-let-arc-dcf-ccp      .
           move      spaces               to   w-let-arc-dcf-ban      .
           move      spaces               to   w-let-arc-dcf-vlt      .
       let-arc-dcf-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [yfp]                         *
      *    *-----------------------------------------------------------*
       let-arc-yfp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-yfp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice istituto a zero                  *
      *              *-------------------------------------------------*
           if        w-let-arc-yfp-cod    =    zero
                     go to let-arc-yfp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFOP"             to   f-key                  .
           move      w-let-arc-yfp-cod    to   rf-yfp-cod-fop         .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-yfp-400.
       let-arc-yfp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-yfp-des-fop       to   w-let-arc-yfp-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-yfp-999.
       let-arc-yfp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-yfp-flg      .
           move      all   "."            to   w-let-arc-yfp-des      .
           go to     let-arc-yfp-999.
       let-arc-yfp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-yfp-des      .
       let-arc-yfp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [pdc]                         *
      *    *-----------------------------------------------------------*
       let-arc-pdc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-pdc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice sottoconto a zero                *
      *              *-------------------------------------------------*
           if        w-let-arc-pdc-cod    =    zero
                     go to let-arc-pdc-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODPDC"             to   f-key                  .
           move      w-let-arc-pdc-cod    to   rf-pdc-cod-pdc         .
           move      "pgm/cge/fls/ioc/obj/iofpdc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-pdc-400.
       let-arc-pdc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-pdc-des-pdc       to   w-let-arc-pdc-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-pdc-999.
       let-arc-pdc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-pdc-flg      .
           move      all   "."            to   w-let-arc-pdc-des      .
           go to     let-arc-pdc-999.
       let-arc-pdc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-pdc-des      .
       let-arc-pdc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [zci]                         *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/larczci0.lts"                   .

      *    *===========================================================*
      *    * Scrittura movimento di CGE                                *
      *    *-----------------------------------------------------------*
       wrt-mov-cge-000.
      *              *-------------------------------------------------*
      *              * Attribuzione nuovo protocollo iva fornitori     *
      *              *-------------------------------------------------*
           move      w-buf-rig-rlt-ddo    to   w-num-prt-ivf-dat      .
           move      w-buf-rig-rlt-ngi    to   w-num-prt-ivf-ngi      .
           perform   att-prt-ivf-000      thru att-prt-ivf-999        .
           move      w-num-prt-ivf-prt    to   w-prn-liv-det-pif      .
      *              *-------------------------------------------------*
      *              * Normalizzazione link-area testata e riga movi-  *
      *              * mento per programma di generazione movimenti di *
      *              * CGE                                             *
      *              *-------------------------------------------------*
           move      "NO"                 to   l-cge-300-tip-ope      .
      *                  *---------------------------------------------*
      *                  * Chiamata modulo '300z'                      *
      *                  *---------------------------------------------*
           perform   cll-300-zet-000      thru cll-300-zet-999        .
      *              *-------------------------------------------------*
      *              * Richiesta numero protocollo                     *
      *              *-------------------------------------------------*
           move      "NP"                 to   l-cge-300-tip-ope      .
           move      w-buf-rig-rlt-ddo    to   l-cge-300-dat-reg      .
      *                  *---------------------------------------------*
      *                  * Chiamata modulo '300z'                      *
      *                  *---------------------------------------------*
           perform   cll-300-zet-000      thru cll-300-zet-999        .
      *                  *---------------------------------------------*
      *                  * Numero attribuito in campo di comodo        *
      *                  *---------------------------------------------*
           move      l-cge-300-num-prt    to   w-prn-liv-det-cge      .
      *              *-------------------------------------------------*
      *              * Scrittura testata e prima riga movimento : riga *
      *              * 'fornitore'                                     *
      *              *-------------------------------------------------*
           move      "WP"                 to   l-cge-300-tip-ope      .
           move      w-buf-rig-rlt-ddo    to   l-cge-300-dat-reg      .
           move      w-prn-liv-det-cge    to   l-cge-300-num-prt      .
      *                  *---------------------------------------------*
      *                  * Forzatura del valore per la causale conta-  *
      *                  * bile                                        *
      *                  *---------------------------------------------*
           move      510                  to   l-cge-300-cod-cau      .
           move      "Vs. fattura"        to   l-cge-300-des-cau      .
           move      "N"                  to   l-cge-300-snx-dts      .
           move      zero                 to   l-cge-300-dat-sca      .
           move      w-prn-liv-det-ddo    to   l-cge-300-dat-doc      .
           move      w-buf-rig-rlt-ndo    to   l-cge-300-num-doc      .
           move      w-buf-rig-rlt-ngi    to   l-cge-300-cod-num      .
           move      w-prn-liv-det-pif    to   l-cge-300-prt-iva      .
           move      zero                 to   l-cge-300-cod-pdc      .
           move      "F"                  to   l-cge-300-tip-arc      .
           move      w-buf-rig-rlt-fnt    to   l-cge-300-cod-arc      .
           move      spaces               to   l-cge-300-com-rig      .
           move      w-prn-liv-det-ddo    to   l-cge-300-dat-rif      .
           move      w-buf-rig-rlt-ndo    to   l-cge-300-num-rif      .
           move      "A"                  to   l-cge-300-dar-ave      .
      *
           move      w-buf-rig-rlt-ibl    to   l-cge-300-ibl-iva (1)  .
           move      w-buf-rig-rlt-iva    to   l-cge-300-cod-iva (1)  .
           move      w-buf-rig-rlt-imp    to   l-cge-300-imp-iva (1)  .
      *
           move      w-buf-rig-rcc-ibl    to   l-cge-300-ibl-iva (2)  .
           move      w-buf-rig-rcc-iva    to   l-cge-300-cod-iva (2)  .
           move      w-buf-rig-rcc-imp    to   l-cge-300-imp-iva (2)  .
      *                  *---------------------------------------------*
      *                  * Eventuale compattamento                     *
      *                  *---------------------------------------------*
           if        w-buf-rig-rlt-ibl    =    zero and
                     w-buf-rig-rlt-iva    =    zero and
                     w-buf-rig-rlt-imp    =    zero
                     move  w-buf-rig-rcc-ibl
                                          to   l-cge-300-ibl-iva (2)
                     move  w-buf-rig-rcc-iva
                                          to   l-cge-300-cod-iva (2)
                     move  w-buf-rig-rcc-imp
                                          to   l-cge-300-imp-iva (2)
                     move  zero           to   l-cge-300-ibl-iva (3)
                     move  zero           to   l-cge-300-cod-iva (3)
                     move  zero           to   l-cge-300-imp-iva (3)  .
      *                  *---------------------------------------------*
      *                  * Importo movimento                           *
      *                  *---------------------------------------------*
           move      w-buf-rig-rlt-itr    to   l-cge-300-imp-mov      .
           add       w-buf-rig-rcc-itr    to   l-cge-300-imp-mov      .
           move      l-cge-300-imp-mov    to   w-prn-liv-det-tdo      .
      *                  *---------------------------------------------*
      *                  * Chiamata modulo '300z'                      *
      *                  *---------------------------------------------*
           perform   cll-300-zet-000      thru cll-300-zet-999        .
       wrt-mov-cge-100.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento : 'iva acquisti'       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione link-area sola riga         *
      *                  *---------------------------------------------*
           move      "N+"                 to   l-cge-300-tip-ope      .
           perform   cll-300-zet-000      thru cll-300-zet-999        .
      *                  *---------------------------------------------*
      *                  * Scrittura sola riga                         *
      *                  *---------------------------------------------*
           move      "W+"                 to   l-cge-300-tip-ope      .
           move      w-ref-iva-acq        to   l-cge-300-cod-pdc      .
           move      "G"                  to   l-cge-300-tip-arc      .
           move      zero                 to   l-cge-300-cod-arc      .
           move      spaces               to   l-cge-300-com-rig      .
           move      zero                 to   l-cge-300-dat-rif      .
           move      spaces               to   l-cge-300-num-rif      .
           move      "D"                  to   l-cge-300-dar-ave      .
           move      w-buf-rig-rlt-imp    to   l-cge-300-imp-mov      .
           add       w-buf-rig-rcc-imp    to   l-cge-300-imp-mov      .
      *                  *---------------------------------------------*
      *                  * Chiamata modulo '300z'                      *
      *                  *---------------------------------------------*
           perform   cll-300-zet-000      thru cll-300-zet-999        .
       wrt-mov-cge-200.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento : 'contropartita       *
      *              *                             acquisti'           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione link-area sola riga         *
      *                  *---------------------------------------------*
           move      "N+"                 to   l-cge-300-tip-ope      .
           perform   cll-300-zet-000      thru cll-300-zet-999        .
      *                  *---------------------------------------------*
      *                  * Scrittura sola riga                         *
      *                  *---------------------------------------------*
           move      "W+"                 to   l-cge-300-tip-ope      .
           move      w-buf-rig-rlt-ctp    to   l-cge-300-cod-pdc      .
           move      "G"                  to   l-cge-300-tip-arc      .
           move      zero                 to   l-cge-300-cod-arc      .
           move      spaces               to   l-cge-300-com-rig      .
           move      zero                 to   l-cge-300-dat-rif      .
           move      spaces               to   l-cge-300-num-rif      .
           move      "D"                  to   l-cge-300-dar-ave      .
           move      w-buf-rig-rlt-ibl    to   l-cge-300-imp-mov      .
           add       w-buf-rig-rcc-ibl    to   l-cge-300-imp-mov      .
      *                  *---------------------------------------------*
      *                  * Chiamata modulo '300z'                      *
      *                  *---------------------------------------------*
           perform   cll-300-zet-000      thru cll-300-zet-999        .
       wrt-mov-cge-300.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento : riga 'T'             *
      *              *-------------------------------------------------*
       wrt-mov-cge-900.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     wrt-mov-cge-999.
       wrt-mov-cge-999.
           exit.

      *    *===========================================================*
      *    * Generazione scadenze fornitori a fronte fattura           *
      *    *-----------------------------------------------------------*
       wrt-mov-rsf-000.
      *              *-------------------------------------------------*
      *              * Letture preliminari                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di presenza anagrafica *
      *                  * commerciale del fornitore                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-wrt-mov-rsf-wff      .
       wrt-mov-rsf-010.
      *                  *---------------------------------------------*
      *                  * Normalizzazione anagrafica fornitore        *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                  *---------------------------------------------*
      *                  * Anagrafica fornitore                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      w-buf-rig-rlt-fnt    to   rf-dcf-cod-fnt         .
           move      spaces               to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                      *-----------------------------------------*
      *                      * Se record non trovato : flag di non     *
      *                      * trovato                                 *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-wrt-mov-rsf-wff      .
       wrt-mov-rsf-020.
      *                  *---------------------------------------------*
      *                  * Forma di pagamento                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se a zero : forzatura del valore        *
      *                      *-----------------------------------------*
           if        w-buf-rig-def-fop    =    zero
                     move  0001152        to   w-buf-rig-def-fop      .
      *                      *-----------------------------------------*
      *                      * Lettura per codice                      *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFOP"             to   f-key                  .
           move      w-buf-rig-def-fop    to   rf-yfp-cod-fop         .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
      *                          *-------------------------------------*
      *                          * Se record non trovato : uscita      *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to wrt-mov-rsf-900.
       wrt-mov-rsf-030.
      *              *-------------------------------------------------*
      *              * Determinazione castelletto scadenze da generare *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Forma di pagamento                          *
      *                  *---------------------------------------------*
           move      w-buf-rig-def-fop    to   w-clc-tbl-scd-fdp      .
      *                  *---------------------------------------------*
      *                  * Data documento per calcolo scadenze         *
      *                  *---------------------------------------------*
           move      w-buf-rig-rlt-ddo    to   w-clc-tbl-scd-ddo      .
      *                  *---------------------------------------------*
      *                  * Totale imponibile in valuta base            *
      *                  *---------------------------------------------*
           move      w-buf-rig-rlt-itr    to   w-clc-tbl-scd-ibl      .
           add       w-buf-rig-rcc-itr    to   w-clc-tbl-scd-ibl      .
      *                  *---------------------------------------------*
      *                  * Totale imposta in valuta base               *
      *                  *---------------------------------------------*
______*    move      w-prn-liv-det-imp    to   w-clc-tbl-scd-iva      .
           move      zero                 to   w-clc-tbl-scd-iva      .
      *                  *---------------------------------------------*
      *                  * Quota a forfait                             *
      *                  *---------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-qaf      .
      *                  *---------------------------------------------*
      *                  * Acconto                                     *
      *                  *---------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-acc      .
      *                  *---------------------------------------------*
      *                  * Data scadenza manuale                       *
      *                  *---------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-ddp      .
      *                  *---------------------------------------------*
      *                  * Ciclo per tre codici pagamento              *
      *                  *---------------------------------------------*
           move      zero                 to   w-wrt-mov-rsf-wcp      .
       wrt-mov-rsf-040.
           add       1                    to   w-wrt-mov-rsf-wcp      .
           if        w-wrt-mov-rsf-wcp    >    3
                     go to wrt-mov-rsf-050.
      *                      *-----------------------------------------*
      *                      * Codice di pagamento                     *
      *                      *-----------------------------------------*
           move      rf-yfp-cod-pag
                    (w-wrt-mov-rsf-wcp)   to   w-clc-tbl-scd-cdp
                                              (w-wrt-mov-rsf-wcp)     .
      *                      *-----------------------------------------*
      *                      * Tipo ammontare                          *
      *                      *-----------------------------------------*
           move      rf-yfp-tip-amm
                    (w-wrt-mov-rsf-wcp)   to   w-clc-tbl-scd-tam
                                              (w-wrt-mov-rsf-wcp)     .
      *                      *-----------------------------------------*
      *                      * Percentuale per il tipo ammontare       *
      *                      *-----------------------------------------*
           move      rf-yfp-per-toi
                    (w-wrt-mov-rsf-wcp)   to   w-clc-tbl-scd-pti
                                              (w-wrt-mov-rsf-wcp)     .
      *                      *-----------------------------------------*
      *                      * Si/No diminuzione dell'acconto          *
      *                      *-----------------------------------------*
           move      rf-yfp-dim-act
                    (w-wrt-mov-rsf-wcp)   to   w-clc-tbl-scd-dda
                                              (w-wrt-mov-rsf-wcp)     .
       wrt-mov-rsf-045.
      *                      *-----------------------------------------*
      *                      * Lettura codice di pagamento             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione record [zpg]        *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofzpg"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpg                 .
      *                          *-------------------------------------*
      *                          * Lettura record [zpg]                *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODPAG"             to   f-key                  .
           move      rf-yfp-cod-pag
                    (w-wrt-mov-rsf-wcp)   to   rf-zpg-cod-pag         .
           move      "pgm/gep/fls/ioc/obj/iofzpg"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpg                 .
      *                          *-------------------------------------*
      *                          * Bufferizzazione valori letti        *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Tipo pagamento                  *
      *                              *---------------------------------*
           move      rf-zpg-tip-pag       to   w-clc-tbl-scd-tpg
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Numero scadenze                 *
      *                              *---------------------------------*
           move      rf-zpg-num-sca       to   w-clc-tbl-scd-nsp
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Decorrenza prima scadenza       *
      *                              *---------------------------------*
           move      rf-zpg-dec-prs       to   w-clc-tbl-scd-dps
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Mese della data prefissata      *
      *                              *---------------------------------*
           move      rf-zpg-dap-mes       to   w-clc-tbl-scd-dpm
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Giorno della data prefissata    *
      *                              *---------------------------------*
           move      rf-zpg-dap-gio       to   w-clc-tbl-scd-dpg
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Giorni di intervallo            *
      *                              *---------------------------------*
           move      rf-zpg-ggg-int       to   w-clc-tbl-scd-gdi
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Tipo di scadenza nel mese       *
      *                              *---------------------------------*
           move      rf-zpg-tip-scm       to   w-clc-tbl-scd-tsm
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Giorno fisso di scadenza        *
      *                              *---------------------------------*
           move      rf-zpg-gio-scm       to   w-clc-tbl-scd-gfs
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Causale contabile : forzata a   *
      *                              * zero                            *
      *                              *---------------------------------*
           move      zero                 to   w-clc-tbl-scd-ccp
                                              (w-wrt-mov-rsf-wcp)     .
      *                      *-----------------------------------------*
      *                      * Riciclo a codice pagamento successivo   *
      *                      *-----------------------------------------*
           go to     wrt-mov-rsf-040.
       wrt-mov-rsf-050.
      *                  *---------------------------------------------*
      *                  * Tipo esclusione mesi : forzato a 01, nessun *
      *                  * mese escluso                                *
      *                  *---------------------------------------------*
           move      01                   to   w-clc-tbl-scd-esm      .
      *                  *---------------------------------------------*
      *                  * Valori di esclusione : normalizzati a zero  *
      *                  *---------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-alt      .
           move      zero                 to   w-clc-tbl-scd-e01      .
           move      zero                 to   w-clc-tbl-scd-e02      .
       wrt-mov-rsf-060.
      *              *-------------------------------------------------*
      *              * Richiamo routine di calcolo                     *
      *              *-------------------------------------------------*
           perform   clc-tbl-scd-000      thru clc-tbl-scd-999        .
      *              *-------------------------------------------------*
      *              * Numero scadenze da generare                     *
      *              *-------------------------------------------------*
           move      w-clc-tbl-scd-nts    to   w-wrt-mov-rsf-wdg      .
           move      w-clc-tbl-scd-nts    to   w-prn-liv-det-nsg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione numero scadenze generate        *
      *              *-------------------------------------------------*
           move      zero                 to   w-wrt-mov-rsf-wsg      .
       wrt-mov-rsf-200.
      *              *-------------------------------------------------*
      *              * Ciclo di generazione scadenze fornitori         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento numero scadenze da generare      *
      *                  *---------------------------------------------*
           add       1                    to   w-wrt-mov-rsf-wsg      .
      *                  *---------------------------------------------*
      *                  * Test su numero di scadenze da generare      *
      *                  *---------------------------------------------*
           if        w-wrt-mov-rsf-wsg    >    w-wrt-mov-rsf-wdg
                     go to wrt-mov-rsf-900.
       wrt-mov-rsf-300.
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [sfs]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
       wrt-mov-rsf-400.
      *                  *---------------------------------------------*
      *                  * Composizione record [sfs]                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Dati identificativi                     *
      *                      *-----------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   rf-sfs-ide-dat         .
           move      s-ute                to   rf-sfs-ide-ute         .
           move      s-fas                to   rf-sfs-ide-fas         .
      *                      *-----------------------------------------*
      *                      * Data registrazione movimento            *
      *                      *-----------------------------------------*
           move      w-buf-rig-rlt-ddo    to   rf-sfs-dtr-rgs         .
      *                      *-----------------------------------------*
      *                      * Data registrazione movimento di conta-  *
      *                      * bilita'                                 *
      *                      *-----------------------------------------*
           move      zero                 to   rf-sfs-drc-rgs         .
      *                      *-----------------------------------------*
      *                      * Numero protocollo movimento di contabi- *
      *                      * lita'                                   *
      *                      *-----------------------------------------*
           move      zero                 to   rf-sfs-npc-rgs         .
      *                      *-----------------------------------------*
      *                      * Numero scadenza                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Preparazione secolo ed anno         *
      *                          *-------------------------------------*
           move      w-buf-rig-rlt-ddo    to   s-dat                  .
           move      s-saa                to   w-sfs-num-scl-ann      .
      *                          *-------------------------------------*
      *                          * Richiamo routine di attribuzione    *
      *                          *-------------------------------------*
           perform   att-num-scf-000      thru att-num-scf-999        .
      *                          *-------------------------------------*
      *                          * Numero scadenza                     *
      *                          *-------------------------------------*
           move      w-sfs-num-num-scf    to   rf-sfs-num-scf         .
      *                          *-------------------------------------*
      *                          * Bufferizzazione se e' la prima      *
      *                          *-------------------------------------*
           if        w-wrt-mov-rsf-wsg    =    1
                     move  w-sfs-num-num-scf
                                          to   w-prn-liv-det-scf      .
      *                      *-----------------------------------------*
      *                      * Tipo scadenza                           *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-tds
                    (w-wrt-mov-rsf-wsg)   to   rf-sfs-tip-scf         .
      *                      *-----------------------------------------*
      *                      * Tipo registrazione scadenza             *
      *                      *-----------------------------------------*
           move      01                   to   rf-sfs-trs-scf         .
      *                      *-----------------------------------------*
      *                      * Tipo valuta per la scadenza             *
      *                      *-----------------------------------------*
           move      01                   to   rf-sfs-tvl-scf         .
      *                      *-----------------------------------------*
      *                      * Data di scadenza                        *
      *                      *                                         *
      *                      * NOBILI                                  *
      *                      *-----------------------------------------*
           move      w-buf-rig-rlt-dsc    to   rf-sfs-dts-scf         .
______*    move      w-clc-tbl-scd-dds
______*             (w-wrt-mov-rsf-wsg)   to   rf-sfs-dts-scf         .
      *                      *-----------------------------------------*
      *                      * Codice fornitore                        *
      *                      *-----------------------------------------*
           move      w-buf-rig-rlt-fnt    to   rf-sfs-cod-fnt         .
      *                      *-----------------------------------------*
      *                      * Codice dipendenza del fornitore         *
      *                      *-----------------------------------------*
           move      spaces               to   rf-sfs-dpz-fnt         .
      *                      *-----------------------------------------*
      *                      * Inoltro pagamento al fornitore          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di presenza del forni- *
      *                          * tore commerciale                    *
      *                          *-------------------------------------*
           if        w-wrt-mov-rsf-wff    not  = spaces
                     move  01             to   rf-sfs-inl-scf
           else      move  rf-dcf-inl-pgt to   rf-sfs-inl-scf         .
      *                      *-----------------------------------------*
      *                      * Sigla valuta per la scadenza            *
      *                      *-----------------------------------------*
           move      c-sgl                to   rf-sfs-sgl-vlt         .
      *                      *-----------------------------------------*
      *                      * Numero decimali per la valuta           *
      *                      *-----------------------------------------*
           move      c-dec                to   rf-sfs-dec-vlt         .
      *                      *-----------------------------------------*
      *                      * Tipo di cambio                          *
      *                      *-----------------------------------------*
           move      c-tdc                to   rf-sfs-tdc-vlt         .
      *                      *-----------------------------------------*
      *                      * Coefficiente di cambio                  *
      *                      *-----------------------------------------*
           move      c-cdc                to   rf-sfs-cdc-scf         .
      *                      *-----------------------------------------*
      *                      * Importo scadenza in valuta              *
      *                      *-----------------------------------------*
           move      zero                 to   rf-sfs-iiv-scf         .
      *                      *-----------------------------------------*
      *                      * Importo scadenza                        *
      *                      *                                         *
      *                      * Decurtato della quota : NOBILI          *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-ids
                    (w-wrt-mov-rsf-wsg)   to   rf-sfs-imp-scf         .
      *                      *-----------------------------------------*
      *                      * Data documento di riferimento           *
      *                      *-----------------------------------------*
           move      w-buf-rig-rlt-ddo    to   rf-sfs-dat-ddr         .
      *                      *-----------------------------------------*
      *                      * Numero documento di riferimento         *
      *                      *-----------------------------------------*
           move      w-buf-rig-rlt-ndo    to   rf-sfs-num-ddr         .
      *                      *-----------------------------------------*
      *                      * Tipo documento di riferimento           *
      *                      *-----------------------------------------*
           move      01                   to   rf-sfs-tip-ddr         .
      *                      *-----------------------------------------*
      *                      * Importo documento di riferimento        *
      *                      *-----------------------------------------*
           move      w-buf-rig-rlt-itr    to   rf-sfs-imp-ddr         .
           add       w-buf-rig-rcc-itr    to   rf-sfs-imp-ddr         .
      *                      *-----------------------------------------*
      *                      * Numero rata documento di riferimento    *
      *                      *-----------------------------------------*
           move      w-wrt-mov-rsf-wsg    to   rf-sfs-nra-ddr         .
      *                      *-----------------------------------------*
      *                      * Codice ABI banca fornitore              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di presenza del forni- *
      *                          * tore commerciale                    *
      *                          *-------------------------------------*
           if        w-wrt-mov-rsf-wff    not  = spaces
                     move  zero           to   rf-sfs-abi-fnt
           else      move  rf-dcf-cod-abi to   rf-sfs-abi-fnt         .
      *                      *-----------------------------------------*
      *                      * Codice CAB banca fornitore              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di presenza del forni- *
      *                          * tore commerciale                    *
      *                          *-------------------------------------*
           if        w-wrt-mov-rsf-wff    not  = spaces
                     move  zero           to   rf-sfs-cab-fnt
           else      move  rf-dcf-cod-cab to   rf-sfs-cab-fnt         .
      *                      *-----------------------------------------*
      *                      * Codice banca estera del fornitore       *
      *                      *-----------------------------------------*
           move      zero                 to   rf-sfs-cod-bef         .
      *                      *-----------------------------------------*
      *                      * Codice conto corrente bancario o posta- *
      *                      * le                                      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di presenza del forni- *
      *                          * tore commerciale                    *
      *                          *-------------------------------------*
           if        w-wrt-mov-rsf-wff    not  = spaces
                     move  spaces         to   rf-sfs-ccc-fnt
           else      move  rf-dcf-ccc-app to   rf-sfs-ccc-fnt         .
      *                      *-----------------------------------------*
      *                      * Codice nostra banca di appoggio         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di presenza del forni- *
      *                          * tore commerciale                    *
      *                          *-------------------------------------*
           if        w-wrt-mov-rsf-wff    not  = spaces
                     move  spaces         to   rf-sfs-cbp-nsb
           else      move  rf-dcf-nos-ban to   rf-sfs-cbp-nsb         .
      *                      *-----------------------------------------*
      *                      * Si/No pagamento bloccato per la scaden- *
      *                      * za                                      *
      *                      *-----------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tutti gli altri campi rimangono norma-  *
      *                      * lizzati                                 *
      *                      *-----------------------------------------*
       wrt-mov-rsf-600.
      *                  *---------------------------------------------*
      *                  * Scrittura record [sfs]                      *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
       wrt-mov-rsf-800.
      *                  *---------------------------------------------*
      *                  * Riciclo su prossima scadenza                *
      *                  *---------------------------------------------*
           go to     wrt-mov-rsf-200.
       wrt-mov-rsf-900.
      *              *-------------------------------------------------*
      *              * Eventuale generazione di una scadenza           *
      *              *-------------------------------------------------*
       wrt-mov-rsf-990.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     wrt-mov-rsf-999.
       wrt-mov-rsf-999.
           exit.

      *    *===========================================================*
      *    * Routine di chiamata programma 'pcge300z'                  *
      *    *-----------------------------------------------------------*
       cll-300-zet-000.
           move      "pgm/cge/prg/obj/pcge300z"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using l-cge-300              .
       cll-300-zet-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/werrbox0.cps"                   .

      *    *===========================================================*
      *    * Routine di attribuzione numero protocollo iva fornitori   *
      *    *-----------------------------------------------------------*
       att-prt-ivf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
      *              *-------------------------------------------------*
      *              * Lettura numerazione                             *
      *              *-------------------------------------------------*
           move      w-num-prt-ivf-dat    to   s-dat                  .
           move      s-saa                to   rn-prt-ivf-saa-dtr     .
           move      w-num-prt-ivf-ngi    to   rn-prt-ivf-cod-num     .
           move      "GT"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
           if        f-sts                =    e-not-err
                     go to att-prt-ivf-100.
      *              *-------------------------------------------------*
      *              * Se numerazione non esistente la si crea norma-  *
      *              * lizzata a zero                                  *
      *              *-------------------------------------------------*
           move      zero                 to   rn-prt-ivf-num-prt     .
           move      "PT"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
           go to     att-prt-ivf-000.
       att-prt-ivf-100.
      *              *-------------------------------------------------*
      *              * Se numerazione esistente                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valore originale            *
      *                  *---------------------------------------------*
           move      rn-prt-ivf-num-prt   to   w-num-prt-ivf-dec      .
      *                  *---------------------------------------------*
      *                  * Incremento numero protocollo                *
      *                  *---------------------------------------------*
           add       1                    to   rn-prt-ivf-num-prt     .
           if        rn-prt-ivf-num-prt   =    zero
                     move  1              to   rn-prt-ivf-num-prt     .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione numero protocollo           *
      *                  *---------------------------------------------*
           move      rn-prt-ivf-num-prt   to   w-num-prt-ivf-prt      .
           move      rn-prt-ivf-num-prt   to   w-num-prt-ivf-inc      .
      *                  *---------------------------------------------*
      *                  * Update record                               *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
      *                  *---------------------------------------------*
      *                  * Se errori ripete l'intera operazione        *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to att-prt-ivf-000.
      *                  *---------------------------------------------*
      *                  * Unlock                                      *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
       att-prt-ivf-999.
           exit.

      *    *===========================================================*
      *    * Routine di attribuzione numero scadenza fornitori         *
      *    *-----------------------------------------------------------*
       att-num-scf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *              *-------------------------------------------------*
      *              * Preparazione chiave per lettura tabella numera- *
      *              * zioni [sfsnum]                                  *
      *              *-------------------------------------------------*
           move      w-sfs-num-scl-ann    to   rn-sfs-num-scl-ann     .
      *              *-------------------------------------------------*
      *              * Lettura tabella numerazioni [sfsnum]            *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to att-num-scf-400.
       att-num-scf-200.
      *              *-------------------------------------------------*
      *              * Se record non esistente                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Scrittura record normalizzato               *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *                  *---------------------------------------------*
      *                  * Unlock record                               *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *                  *---------------------------------------------*
      *                  * Ripetizione dell'intera operazione          *
      *                  *---------------------------------------------*
           go to     att-num-scf-000.
       att-num-scf-400.
      *              *-------------------------------------------------*
      *              * Se record esistente                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore pre-incremento           *
      *                  *---------------------------------------------*
           move      rn-sfs-num-num-scf   to   w-sfs-num-num-scf      .
           move      w-sfs-num-r01-num    to   w-sfs-num-val-pre      .
      *                  *---------------------------------------------*
      *                  * Preparazione valore post-incremento         *
      *                  *---------------------------------------------*
           move      w-sfs-num-val-pre    to   w-sfs-num-val-pos      .
           add       1                    to   w-sfs-num-val-pos      .
           if        w-sfs-num-val-pos    =    zero
                     move  1              to   w-sfs-num-val-pos      .
      *                  *---------------------------------------------*
      *                  * Preparazione numero scadenza completo       *
      *                  *---------------------------------------------*
           move      w-sfs-num-scl-ann    to   w-sfs-num-r01-saa      .
           move      w-sfs-num-val-pos    to   w-sfs-num-r01-num      .
      *                  *---------------------------------------------*
      *                  * Aggiornamento numero scadenza               *
      *                  *---------------------------------------------*
           move      w-sfs-num-num-scf    to   rn-sfs-num-num-scf     .
      *                  *---------------------------------------------*
      *                  * Update record                               *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito dell'opera- *
      *                  * zione di update                             *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to att-num-scf-600.
       att-num-scf-500.
      *                  *---------------------------------------------*
      *                  * Se errore in operazione di update           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Unlock record                           *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *                      *-----------------------------------------*
      *                      * Ripetizione dell'intera operazione      *
      *                      *-----------------------------------------*
           go to     att-num-scf-000.
       att-num-scf-600.
      *                  *---------------------------------------------*
      *                  * Se nessun errore in operazione di update    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Unlock record                           *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     att-num-scf-999.
       att-num-scf-999.
           exit.

      *    *===========================================================*
      *    * Calcolo tabella scadenze                                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/fat/prg/cpy/dtblscd0.dts"                   .

      *    *===========================================================*
      *    * Scrittura movimento su file                               *
      *    *-----------------------------------------------------------*
       scr-mov-fil-000.
      *              *-------------------------------------------------*
      *              * Test se esecuzione di prova                     *
      *              *-------------------------------------------------*
           if        rr-tip-exe           not  = 02
                     go to scr-mov-fil-600.
       scr-mov-fil-100.
      *              *-------------------------------------------------*
      *              * Scrittura movimenti contabili                   *
      *              *-------------------------------------------------*
           perform   wrt-mov-cge-000      thru wrt-mov-cge-999        .
      *              *-------------------------------------------------*
      *              * Scrittura movimenti scadenze fornitori          *
      *              *-------------------------------------------------*
           perform   wrt-mov-rsf-000      thru wrt-mov-rsf-999        .
      *              *-------------------------------------------------*
      *              * Write record [sff]                              *
      *              *-------------------------------------------------*
           perform   wrt-rec-sff-000      thru wrt-rec-sff-999        .
       scr-mov-fil-200.
      *              *-------------------------------------------------*
      *              * Messaggio di fattura registrata                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing protocollo                          *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-wrt-mov-sff-prt (04:08)
                                          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Messaggio                                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Fattura : "
                                delimited by   size
                     w-buf-rig-rlt-ndo
                                delimited by   spaces
                     " - registrata regolarmente al protocollo "
                                delimited by   size
                     p-edt      delimited by   spaces
                                          into w-msg-liv-det-msg      .
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     scr-mov-fil-900.
       scr-mov-fil-600.
      *              *-------------------------------------------------*
      *              * Messaggio di fattura di prova                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing protocollo                          *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-wrt-mov-sff-prt (04:08)
                                          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Messaggio                                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Fattura        : "
                                delimited by   size
                     w-buf-rig-rlt-ndo
                                delimited by   spaces
                     " - controllata"
                                delimited by   size
                     p-edt      delimited by   spaces
                                          into w-msg-liv-det-msg      .
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     scr-mov-fil-900.
       scr-mov-fil-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     scr-mov-fil-999.
       scr-mov-fil-999.
           exit.

      *    *===========================================================*
      *    * Composizione record [sff]                                 *
      *    *-----------------------------------------------------------*
       cmp-rec-sff-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsff"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sff                 .
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   rf-sff-ide-dat         .
           move      s-ute                to   rf-sff-ide-ute         .
           move      s-fas                to   rf-sff-ide-fas         .
           move      w-buf-rig-rlt-ddo    to   rf-sff-dtr-ftf         .
           move      w-wrt-mov-sff-prt    to   rf-sff-num-ftf         .
           move      01                   to   rf-sff-tip-ftf         .
           move      01                   to   rf-sff-tpv-ftf         .
           move      w-buf-rig-rlt-fnt    to   rf-sff-cod-fnt         .
           move      spaces               to   rf-sff-dpz-fnt         .
           move      w-buf-rig-rlt-ddo    to   rf-sff-ddo-ftf         .
           move      w-buf-rig-rlt-ndo    to   rf-sff-ndo-ftf         .
           move      c-sgl                to   rf-sff-sgl-vlt         .
           move      c-dec                to   rf-sff-dec-vlt         .
           move      c-tdc                to   rf-sff-tdc-vlt         .
           move      c-cdc                to   rf-sff-cdc-ftf         .
           move      zero                 to   rf-sff-iiv-ftf         .
           move      w-buf-rig-rlt-itr    to   rf-sff-imp-ftf         .
           add       w-buf-rig-rcc-itr    to   rf-sff-imp-ftf         .
           move      01                   to   rf-sff-inl-pgf         .
           move      w-buf-rig-rlt-ctp    to   rf-sff-ctp-acq         .
           move      w-buf-rig-def-fop    to   rf-sff-cod-fop         .
           move      spaces               to   rf-sff-nsb-ftf         .
           move      zero                 to   rf-sff-abi-ftf         .
           move      zero                 to   rf-sff-cab-ftf         .
           move      spaces               to   rf-sff-ccc-ftf         .
           move      spaces               to   rf-sff-ccp-ftf         .
           move      zero                 to   rf-sff-bef-ftf         .
           move      zero                 to   rf-sff-pag-dsm         .
           move      zero                 to   rf-sff-pag-qaf         .
           move      zero                 to   rf-sff-pag-act         .
           move      "Vs. fattura"        to   rf-sff-des-cau         .
           move      w-buf-rig-rlt-ngi    to   rf-sff-num-giv         .
           move      w-prn-liv-det-pif    to   rf-sff-npt-iva         .
           move      zero                 to   w-cmp-rec-sff-ctr      .
       cmp-rec-sff-100.
           add       1                    to   w-cmp-rec-sff-ctr      .
           if        w-cmp-rec-sff-ctr    >    6
                     go to cmp-rec-sff-200.
           go to     cmp-rec-sff-110
                     cmp-rec-sff-120
                     depending            on       w-cmp-rec-sff-ctr  .
       cmp-rec-sff-110.
      *                  *---------------------------------------------*
      *                  * Tipo riga 'LT'                              *
      *                  *---------------------------------------------*
           move      w-buf-rig-rlt-iva    to   rf-sff-iva-cod
                                              (w-cmp-rec-sff-ctr)     .
           move      zero                 to   rf-sff-iva-ibv
                                              (w-cmp-rec-sff-ctr)     .
           move      w-buf-rig-rlt-ibl    to   rf-sff-iva-ibl
                                              (w-cmp-rec-sff-ctr)     .
           move      w-buf-rig-rlt-imp    to   rf-sff-iva-imp
                                              (w-cmp-rec-sff-ctr)     .
           go to     cmp-rec-sff-100.
       cmp-rec-sff-120.
      *                  *---------------------------------------------*
      *                  * Tipo riga 'CC'                              *
      *                  *---------------------------------------------*
           move      w-buf-rig-rcc-iva    to   rf-sff-iva-cod
                                              (w-cmp-rec-sff-ctr)     .
           move      zero                 to   rf-sff-iva-ibv
                                              (w-cmp-rec-sff-ctr)     .
           move      w-buf-rig-rcc-ibl    to   rf-sff-iva-ibl
                                              (w-cmp-rec-sff-ctr)     .
           move      w-buf-rig-rcc-imp    to   rf-sff-iva-imp
                                              (w-cmp-rec-sff-ctr)     .
           go to     cmp-rec-sff-100.
       cmp-rec-sff-200.
      *                  *---------------------------------------------*
      *                  * Eventuale compattamento                     *
      *                  *---------------------------------------------*
           if        w-buf-rig-rcc-ibl    =    zero and
                     w-buf-rig-rcc-iva    =    zero and
                     w-buf-rig-rcc-imp    =    zero
                     move  w-buf-rig-rlt-ibl
                                          to   rf-sff-iva-ibl (2)
                     move  w-buf-rig-rlt-iva
                                          to   rf-sff-iva-cod (2)
                     move  w-buf-rig-rlt-imp
                                          to   rf-sff-iva-imp (2)
                     move  zero           to   rf-sff-iva-ibl (3)
                     move  zero           to   rf-sff-iva-cod (3)
                     move  zero           to   rf-sff-iva-imp (3)     .
       cmp-rec-sff-300.
      *              *-------------------------------------------------*
      *              * Altri valori                                    *
      *              *-------------------------------------------------*
           move      w-buf-rig-rlt-itr    to   rf-sff-iva-tdo         .
           add       w-buf-rig-rcc-itr    to   rf-sff-iva-tdo         .
           move      w-buf-rig-rlt-ddo    to   rf-sff-drg-cge         .
           move      w-prn-liv-det-cge    to   rf-sff-npr-cge         .
           move      01                   to   rf-sff-nrg-cge         .
           move      w-prn-liv-det-scf    to   rf-sff-npr-scf         .
           move      w-prn-liv-det-nsg    to   rf-sff-nrg-scf         .
           move      zero                 to   rf-sff-prt-ffo         .
           move      zero                 to   rf-sff-fcs-uno         .
           move      zero                 to   rf-sff-fcs-due         .
           move      zero                 to   rf-sff-fcs-tre         .
           move      spaces               to   rf-sff-flg-ela         .
           move      spaces               to   rf-sff-flg-pul         .
           move      spaces               to   rf-sff-alx-exp         .
       cmp-rec-sff-999.
           exit.

      *    *===========================================================*
      *    * Scrittura record [sff]                                    *
      *    *-----------------------------------------------------------*
       wrt-rec-sff-000.
      *              *-------------------------------------------------*
      *              * Attribuzione numero progressivo di registrazio- *
      *              * ne fattura fornitore                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione secolo ed anno                 *
      *                  *---------------------------------------------*
           move      w-buf-rig-rlt-ddo    to   s-dat                  .
           move      s-saa                to   w-sff-num-scl-ann      .
      *                  *---------------------------------------------*
      *                  * Richiamo routine di attribuzione            *
      *                  *---------------------------------------------*
           perform   att-sff-num-000      thru att-sff-num-999        .
      *                  *---------------------------------------------*
      *                  * Numero registrazione completo, in formato   *
      *                  * s.aa.nnnnnnnn, in campo di destinazione     *
      *                  *---------------------------------------------*
           move      w-sff-num-num-ftf    to   w-wrt-mov-sff-prt      .
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
           perform   cmp-rec-sff-000      thru cmp-rec-sff-999        .
      *              *-------------------------------------------------*
      *              * Put record                                      *
      *              *-------------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsff"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sff                 .
       wrt-rec-sff-999.
           exit.

      *    *===========================================================*
      *    * Routine di attribuzione numero registrazione fattura for- *
      *    * nitore                                                    *
      *    *-----------------------------------------------------------*
       att-sff-num-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insffnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sff-num             .
      *              *-------------------------------------------------*
      *              * Preparazione chiave per lettura tabella numera- *
      *              * zioni [numddp]                                  *
      *              *-------------------------------------------------*
           move      w-sff-num-scl-ann    to   rn-sff-num-scl-ann     .
      *              *-------------------------------------------------*
      *              * Lettura tabella numerazioni [sffnum]            *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insffnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sff-num             .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to att-sff-num-400.
       att-sff-num-200.
      *              *-------------------------------------------------*
      *              * Se record non esistente                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Scrittura record normalizzato               *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insffnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sff-num             .
      *                  *---------------------------------------------*
      *                  * Unlock record                               *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insffnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sff-num             .
      *                  *---------------------------------------------*
      *                  * Ripetizione dell'intera operazione          *
      *                  *---------------------------------------------*
           go to     att-sff-num-000.
       att-sff-num-400.
      *              *-------------------------------------------------*
      *              * Se record esistente                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore pre-incremento           *
      *                  *---------------------------------------------*
           move      rn-sff-num-num-ftf   to   w-sff-num-num-ftf      .
           move      w-sff-num-r01-num    to   w-sff-num-val-pre      .
      *                  *---------------------------------------------*
      *                  * Preparazione valore post-incremento         *
      *                  *---------------------------------------------*
           move      w-sff-num-val-pre    to   w-sff-num-val-pos      .
           add       1                    to   w-sff-num-val-pos      .
           if        w-sff-num-val-pos    =    zero
                     move  1              to   w-sff-num-val-pos      .
      *                  *---------------------------------------------*
      *                  * Preparazione numero registrazione completo  *
      *                  *---------------------------------------------*
           move      w-sff-num-scl-ann    to   w-sff-num-r01-saa      .
           move      w-sff-num-val-pos    to   w-sff-num-r01-num      .
      *                  *---------------------------------------------*
      *                  * Aggiornamento numero registrazione          *
      *                  *---------------------------------------------*
           move      w-sff-num-num-ftf    to   rn-sff-num-num-ftf     .
      *                  *---------------------------------------------*
      *                  * Update record                               *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insffnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sff-num             .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito dell'opera- *
      *                  * zione di update                             *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to att-sff-num-600.
       att-sff-num-500.
      *                  *---------------------------------------------*
      *                  * Se errore in operazione di update           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Unlock record                           *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insffnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sff-num             .
      *                      *-----------------------------------------*
      *                      * Ripetizione dell'intera operazione      *
      *                      *-----------------------------------------*
           go to     att-sff-num-000.
       att-sff-num-600.
      *                  *---------------------------------------------*
      *                  * Se nessun errore in operazione di update    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Unlock record                           *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insffnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sff-num             .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     att-sff-num-999.
       att-sff-num-999.
           exit.

      *    *===========================================================*
      *    * Determinazione imposta                                    *
      *    *-----------------------------------------------------------*
       det-imp-iva-000.
      *              *-------------------------------------------------*
      *              * Determinazione                                  *
      *              *-------------------------------------------------*
           move      "DI"                 to   d-imp-iva-tip-ope      .
           move      "pgm/cge/prg/obj/dimpiva0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-imp-iva              .
       det-imp-iva-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .
