       Identification Division.
       Program-Id.                                 mcvoju             .
      *================================================================*
      *                                                                *
      * Gestione file line sequential in output per conversioni        *
      *                                                                *
      * N.B.: e' uguale all'interfaccia 'mcvout' ma sopperisce alla    *
      *       carenza strutturale di alcuni campi di 'g'               *
      *                                                                *
      * ============================================================== *
      *                                                                *
      * Tipi operazione previsti :                                     *
      *                                                                *
      *             -------------------------------------------------- *
      *                                                                *
      * Open Out    Open output line sequential file                   *
      *                                                                *
      *             Input  : j-ope = "OO"                              *
      *                                                                *
      *                      j-nam = file name                         *
      *                                                                *
      *                      j-pat = file pathname                     *
      *                                                                *
      *             Output : j-sts = Cobol i-o status                  *
      *                                                                *
      *             -------------------------------------------------- *
      *                                                                *
      * Open Ext    Open extend line sequential file                   *
      *                                                                *
      *             Input  : j-ope = "OE"                              *
      *                                                                *
      *                      j-nam = file name                         *
      *                                                                *
      *                      j-pat = file pathname                     *
      *                                                                *
      *             Output : j-sts = Cobol i-o status                  *
      *                                                                *
      *             -------------------------------------------------- *
      *                                                                *
      * Put Next    Put next record to line sequential file            *
      *                                                                *
      *             Input  : j-ope = "PN"                              *
      *                                                                *
      *                      j-rec = file record                       *
      *                                                                *
      *             Output : j-sts = Cobol i-o status                  *
      *                                                                *
      *             -------------------------------------------------- *
      *                                                                *
      * Close       Close line sequential file                         *
      *                                                                *
      *             Input  : j-ope = "CL"                              *
      *                                                                *
      *             Output : j-sts = Cobol i-o status                  *
      *                                                                *
      *             -------------------------------------------------- *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Work area per il controllo                                *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flag determinazione tipo runtime utilizzato           *
      *        * - Spaces : non determinato                            *
      *        * - #      : determinato                                *
      *        *-------------------------------------------------------*
           05  w-cnt-det-run              pic  x(01) value spaces     .
      *        *-------------------------------------------------------*
      *        * Tipo di runtime utilizzato                            *
      *        * - 00 : Acucobol 85                                    *
      *        * - 01 : Austec RM-Master Cobol 74                      *
      *        * - 00 : Ryan McFarland RM-Cobol 85                     *
      *        *-------------------------------------------------------*
           05  w-cnt-cod-run              pic  9(02) value 00         .
      *        *-------------------------------------------------------*
      *        * Tipo di Open attualmente in corso                     *
      *        * - Spaces : nessuna                                    *
      *        * - O      : open output                                *
      *        * - E      : open extend                                *
      *        *-------------------------------------------------------*
           05  w-cnt-tip-opn              pic  x(01)                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/j"                                  .

      ******************************************************************
       Procedure Division                using j                      .
      ******************************************************************

      *    *===========================================================*
      *    * Main program                                              *
      *    *-----------------------------------------------------------*
       main-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione cobol i-o status di uscita      *
      *              *-------------------------------------------------*
           move      "00"                 to   j-sts                  .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo operazione      *
      *              *-------------------------------------------------*
           if        j-ope                =    "OO"
                     perform opn-out-000  thru opn-out-999
           else if   j-ope                =    "OE"
                     perform opn-ext-000  thru opn-ext-999
           else if   j-ope                =    "PN"
                     perform put-nxt-000  thru put-nxt-999
           else if   j-ope                =    "CL"
                     perform cls-cls-000  thru cls-cls-999            .
       main-999.
           exit      program.

      *    *===========================================================*
      *    * Open output                                               *
      *    *-----------------------------------------------------------*
       opn-out-000.
      *              *-------------------------------------------------*
      *              * Determinazione tipo di runtime utilizzato, se   *
      *              * non gia' determinato                            *
      *              *-------------------------------------------------*
           perform   det-tru-000          thru det-tru-999            .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di runtime      *
      *              *-------------------------------------------------*
           if        w-cnt-cod-run        =    01
                     go to opn-out-400
           else if   w-cnt-cod-run        =    02
                     go to opn-out-600.
       opn-out-200.
      *              *-------------------------------------------------*
      *              * Se : Acucobol 85                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiamo del modulo                         *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mcvoj0"
                                         using j                      .
      *                  *---------------------------------------------*
      *                  * Tipo di Open attualmente in corso           *
      *                  *---------------------------------------------*
           move      "O"                  to   w-cnt-tip-opn          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     opn-out-999.
       opn-out-400.
      *              *-------------------------------------------------*
      *              * Se : Austec RM-Master Cobol 74                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiamo del modulo                         *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mcvj01"
                                         using j                      .
      *                  *---------------------------------------------*
      *                  * Tipo di Open attualmente in corso           *
      *                  *---------------------------------------------*
           move      "O"                  to   w-cnt-tip-opn          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     opn-out-999.
       opn-out-600.
      *              *-------------------------------------------------*
      *              * Se : Ryan McFarland RM-Cobol 85                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiamo del modulo                         *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mcvj02"
                                         using j                      .
      *                  *---------------------------------------------*
      *                  * Tipo di Open attualmente in corso           *
      *                  *---------------------------------------------*
           move      "O"                  to   w-cnt-tip-opn          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     opn-out-999.
       opn-out-999.
           exit.

      *    *===========================================================*
      *    * Open extend                                               *
      *    *-----------------------------------------------------------*
       opn-ext-000.
      *              *-------------------------------------------------*
      *              * Determinazione tipo di runtime utilizzato, se   *
      *              * non gia' determinato                            *
      *              *-------------------------------------------------*
           perform   det-tru-000          thru det-tru-999            .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di runtime      *
      *              *-------------------------------------------------*
           if        w-cnt-cod-run        =    01
                     go to opn-ext-400
           else if   w-cnt-cod-run        =    02
                     go to opn-ext-600.
       opn-ext-200.
      *              *-------------------------------------------------*
      *              * Se : Acucobol 85                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiamo del modulo                         *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mcvoj0"
                                         using j                      .
      *                  *---------------------------------------------*
      *                  * Tipo di Open attualmente in corso           *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tip-opn          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     opn-ext-999.
       opn-ext-400.
      *              *-------------------------------------------------*
      *              * Se : Austec RM-Master Cobol 74                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiamo del modulo                         *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mcvj01"
                                         using j                      .
      *                  *---------------------------------------------*
      *                  * Tipo di Open attualmente in corso           *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tip-opn          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     opn-ext-999.
       opn-ext-600.
      *              *-------------------------------------------------*
      *              * Se : Ryan McFarland RM-Cobol 85                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiamo del modulo                         *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mcvj02"
                                         using j                      .
      *                  *---------------------------------------------*
      *                  * Tipo di Open attualmente in corso           *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tip-opn          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     opn-ext-999.
       opn-ext-999.
           exit.

      *    *===========================================================*
      *    * Put next                                                  *
      *    *-----------------------------------------------------------*
       put-nxt-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di runtime      *
      *              *-------------------------------------------------*
           if        w-cnt-cod-run        =    01
                     go to put-nxt-400
           else if   w-cnt-cod-run        =    02
                     go to put-nxt-600.
       put-nxt-200.
      *              *-------------------------------------------------*
      *              * Se : Acucobol 85                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiamo del modulo                         *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mcvoj0"
                                         using j                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     put-nxt-999.
       put-nxt-400.
      *              *-------------------------------------------------*
      *              * Se : Austec RM-Master Cobol 74                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiamo del modulo                         *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mcvj01"
                                         using j                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     put-nxt-999.
       put-nxt-600.
      *              *-------------------------------------------------*
      *              * Se : Ryan McFarland RM-Cobol 85                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiamo del modulo                         *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mcvj02"
                                         using j                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     put-nxt-999.
       put-nxt-999.
           exit.

      *    *===========================================================*
      *    * Close                                                     *
      *    *-----------------------------------------------------------*
       cls-cls-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di runtime      *
      *              *-------------------------------------------------*
           if        w-cnt-cod-run        =    01
                     go to cls-cls-400
           else if   w-cnt-cod-run        =    02
                     go to cls-cls-600.
       cls-cls-200.
      *              *-------------------------------------------------*
      *              * Se : Acucobol 85                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo Open at-    *
      *                  * tualmente in corso                          *
      *                  *---------------------------------------------*
           if        w-cnt-tip-opn        =    "O"
                     go to cls-cls-240
           else if   w-cnt-tip-opn        =    "E"
                     go to cls-cls-260
           else      go to cls-cls-280.
       cls-cls-240.
      *                  *---------------------------------------------*
      *                  * Se tipo Open attuale : output               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiamo del modulo                     *
      *                      *-----------------------------------------*
           call      "swd/mod/prg/obj/mcvoj0"
                                         using j                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione del modulo                *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mcvoj0"                         .
      *                      *-----------------------------------------*
      *                      * Tipo Open attuale : nessuno             *
      *                      *-----------------------------------------*
           go to     cls-cls-280.
       cls-cls-260.
      *                  *---------------------------------------------*
      *                  * Se tipo Open attuale : extend               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiamo del modulo                     *
      *                      *-----------------------------------------*
           call      "swd/mod/prg/obj/mcvoj0"
                                         using j                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione del modulo                *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mcvoj0"                         .
      *                      *-----------------------------------------*
      *                      * Tipo Open attuale : nessuno             *
      *                      *-----------------------------------------*
           go to     cls-cls-280.
       cls-cls-280.
      *                  *---------------------------------------------*
      *                  * Tipo Open attuale : nessuno                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-tip-opn          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     cls-cls-999.
       cls-cls-400.
      *              *-------------------------------------------------*
      *              * Se : Austec RM-Master Cobol 74                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo Open at-    *
      *                  * tualmente in corso                          *
      *                  *---------------------------------------------*
           if        w-cnt-tip-opn        =    "O"
                     go to cls-cls-440
           else if   w-cnt-tip-opn        =    "E"
                     go to cls-cls-460
           else      go to cls-cls-480.
       cls-cls-440.
      *                  *---------------------------------------------*
      *                  * Se tipo Open attuale : output               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiamo del modulo                     *
      *                      *-----------------------------------------*
           call      "swd/mod/prg/obj/mcvj01"
                                         using j                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione del modulo                *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mcvj01"                         .
      *                      *-----------------------------------------*
      *                      * Tipo Open attuale : nessuno             *
      *                      *-----------------------------------------*
           go to     cls-cls-480.
       cls-cls-460.
      *                  *---------------------------------------------*
      *                  * Se tipo Open attuale : extend               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiamo del modulo                     *
      *                      *-----------------------------------------*
           call      "swd/mod/prg/obj/mcvj01"
                                         using j                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione del modulo                *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mcvj01"                         .
      *                      *-----------------------------------------*
      *                      * Tipo Open attuale : nessuno             *
      *                      *-----------------------------------------*
           go to     cls-cls-480.
       cls-cls-480.
      *                  *---------------------------------------------*
      *                  * Tipo Open attuale : nessuno                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-tip-opn          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     cls-cls-999.
       cls-cls-600.
      *              *-------------------------------------------------*
      *              * Se : Ryan McFarland RM-Cobol 85                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo Open at-    *
      *                  * tualmente in corso                          *
      *                  *---------------------------------------------*
           if        w-cnt-tip-opn        =    "O"
                     go to cls-cls-640
           else if   w-cnt-tip-opn        =    "E"
                     go to cls-cls-660
           else      go to cls-cls-680.
       cls-cls-640.
      *                  *---------------------------------------------*
      *                  * Se tipo Open attuale : output               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiamo del modulo                     *
      *                      *-----------------------------------------*
           call      "swd/mod/prg/obj/mcvj02"
                                         using j                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione del modulo                *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mcvj02"                         .
      *                      *-----------------------------------------*
      *                      * Tipo Open attuale : nessuno             *
      *                      *-----------------------------------------*
           go to     cls-cls-680.
       cls-cls-660.
      *                  *---------------------------------------------*
      *                  * Se tipo Open attuale : extend               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiamo del modulo                     *
      *                      *-----------------------------------------*
           call      "swd/mod/prg/obj/mcvj02"
                                         using j                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione del modulo                *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mcvj02"                         .
      *                      *-----------------------------------------*
      *                      * Tipo Open attuale : nessuno             *
      *                      *-----------------------------------------*
           go to     cls-cls-680.
       cls-cls-680.
      *                  *---------------------------------------------*
      *                  * Tipo Open attuale : nessuno                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-tip-opn          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     cls-cls-999.
       cls-cls-999.
           exit.

      *    *===========================================================*
      *    * Determinazione tipo di runtime utilizzato, se necessario, *
      *    * per chiamata del modulo di segreteria                     *
      *    *-----------------------------------------------------------*
       det-tru-000.
      *              *-------------------------------------------------*
      *              * Se gia' determinato : uscita                    *
      *              *-------------------------------------------------*
           if        w-cnt-det-run        not  = spaces
                     go to det-tru-999.
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per ottenere  *
      *              * il codice del tipo di runtime utilizzato        *
      *              *-------------------------------------------------*
           move      "R?"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Memorizzazione del codice del tipo di runtime   *
      *              * utilizzato                                      *
      *              *-------------------------------------------------*
           move      s-num                to   w-cnt-cod-run          .
      *              *-------------------------------------------------*
      *              * Segnale di determinazione eseguita              *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-det-run          .
       det-tru-999.
           exit.

