       Identification Division.
       Program-Id.                                 mmessg             .
      *================================================================*
      *                                                                *
      *        Modulo per la gestione del rullino messaggi errore      *
      *                                                                *
      * ============================================================== *
      *                                                                *
      * Tipi operazione previsti :                                     *
      *                                                                *
      *             -------------------------------------------------- *
      *                                                                *
      * Open Out    Open output file messaggi per foreground           *
      * Foreground                                                     *
      *             Input  : m-ope = "OF"                              *
      *                                                                *
      *             Output : m-rsc = Cobol i-o status, oppure spaces   *
      *                                                                *
      *             -------------------------------------------------- *
      *                                                                *
      * Open Out    Open output file messaggi per background           *
      * Background                                                     *
      *             Input  : m-ope = "OB"                              *
      *                                                                *
      *             Output : m-rsc = Cobol i-o status, oppure spaces   *
      *                                                                *
      *             -------------------------------------------------- *
      *                                                                *
      * Write       Scrittura messaggio                                *
      *                                                                *
      *             Input  : m-ope = "WR"                              *
      *                                                                *
      *                      m-msg = contenuto del messaggio           *
      *                                                                *
      *             Output : m-rsc = Cobol i-o status, oppure spaces   *
      *                                                                *
      *             -------------------------------------------------- *
      *                                                                *
      * Open In     Open input file messaggi per foreground            *
      * Foreground                                                     *
      *             Input  : m-ope = "IF"                              *
      *                                                                *
      *             Output : m-rsc = Cobol i-o status, oppure spaces   *
      *                                                                *
      *             -------------------------------------------------- *
      *                                                                *
      * Open In     Open input file messaggi per background            *
      * Background                                                     *
      *             Input  : m-ope = "IB"                              *
      *                                                                *
      *             Output : m-rsc = Cobol i-o status, oppure spaces   *
      *                                                                *
      *             -------------------------------------------------- *
      *                                                                *
      * Read        Lettura messaggio                                  *
      *                                                                *
      *             Input  : m-ope = "RD"                              *
      *                                                                *
      *             Output : m-msg = contenuto del messaggio           *
      *                                                                *
      *             Output : m-rsc = Cobol i-o status, oppure spaces   *
      *                                                                *
      *             -------------------------------------------------- *
      *                                                                *
      * Close       Close input file messaggi per foreground           *
      * Input                                                          *
      *             Input  : m-ope = "CI"                              *
      *                                                                *
      *             Output : m-rsc = Cobol i-o status, oppure spaces   *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     d-K-b-Snc-PD .
       Object-Computer.     d-K-b-Snc-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mopsys"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .
       
      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Work area per il controllo                                *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Valore della environment-variable 'V_DKB_PFIX'        *
      *        *-------------------------------------------------------*
           05  w-cnt-env-ppu              pic  x(20) value spaces     .
      *        *-------------------------------------------------------*
      *        * Flag determinazione tipo runtime utilizzato           *
      *        * - Spaces : non determinato                            *
      *        * - #      : determinato                                *
      *        *-------------------------------------------------------*
           05  w-cnt-det-run              pic  x(01) value spaces     .
      *        *-------------------------------------------------------*
      *        * Tipo di runtime utilizzato                            *
      *        * - 00 : Acucobol 85                                    *
      *        * - 01 : Austec RM-Master Cobol 74                      *
      *        * - 02 : Ryan McFarland RM-Cobol 85                     *
      *        *-------------------------------------------------------*
           05  w-cnt-cod-run              pic  9(02) value 00         .
      *        *-------------------------------------------------------*
      *        * Tipo di funzionamento del programma in esecuzione     *
      *        * - F : foreground                                      *
      *        * - B : background                                      *
      *        *-------------------------------------------------------*
           05  w-cnt-tip-fun              pic  x(01) value spaces     .

      *    *===========================================================*
      *    * Area di comunicazione per moduli per rullino messaggi     *
      *    *-----------------------------------------------------------*
       01  x.
      *        *-------------------------------------------------------*
      *        * Tipo operazione                                       *
      *        *-------------------------------------------------------*
           05  x-ope                      pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * File name                                             *
      *        *-------------------------------------------------------*
           05  x-nam                      pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * File pathname                                         *
      *        *-------------------------------------------------------*
           05  x-pat                      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * File status                                           *
      *        *-------------------------------------------------------*
           05  x-sts                      pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * File record                                           *
      *        *-------------------------------------------------------*
           05  x-rec.
               10  x-chr        occurs 80 pic  x(01)                  .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      ******************************************************************
       Procedure Division                using m                      .
      ******************************************************************

      *    *===========================================================*
      *    * Main program                                              *
      *    *-----------------------------------------------------------*
       main-000.
      *              *-------------------------------------------------*
      *              * Open output foreground                          *
      *              *-------------------------------------------------*
           if        m-ope                =    "OF"
                     perform out-frg-000  thru out-frg-999
      *              *-------------------------------------------------*
      *              * Open output background                          *
      *              *-------------------------------------------------*
           else if   m-ope                =    "OB"
                     perform out-bkg-000  thru out-bkg-999
      *              *-------------------------------------------------*
      *              * Write                                           *
      *              *-------------------------------------------------*
           else if   m-ope                =    "WR"
                     perform wrt-wrt-000  thru wrt-wrt-999
      *              *-------------------------------------------------*
      *              * Open input foreground                           *
      *              *-------------------------------------------------*
           else if   m-ope                =    "IF"
                     perform inp-frg-000  thru inp-frg-999
      *              *-------------------------------------------------*
      *              * Open input background                           *
      *              *-------------------------------------------------*
           else if   m-ope                =    "IB"
                     perform inp-bkg-000  thru inp-bkg-999
      *              *-------------------------------------------------*
      *              * Read                                            *
      *              *-------------------------------------------------*
           else if   m-ope                =    "RD"
                     perform rea-rea-000  thru rea-rea-999
      *              *-------------------------------------------------*
      *              * Close input                                     *
      *              *-------------------------------------------------*
           else if   m-ope                =    "CI"
                     perform cls-inp-000  thru cls-inp-999            .
       main-999.
           exit      program.

      *    *===========================================================*
      *    * Open output foreground                                    *
      *    *-----------------------------------------------------------*
       out-frg-000.
      *              *-------------------------------------------------*
      *              * Determinazione valore dell'environment-variable *
      *              * V_DKB_PFIX, se non gia' determinato             *
      *              *-------------------------------------------------*
           perform   det-ppu-000          thru det-ppu-999            .
      *              *-------------------------------------------------*
      *              * Determinazione tipo di runtime utilizzato, se   *
      *              * non gia' determinato                            *
      *              *-------------------------------------------------*
           perform   det-tru-000          thru det-tru-999            .
      *              *-------------------------------------------------*
      *              * Memorizzazione tipo funzionamento foreground    *
      *              *-------------------------------------------------*
           move      "F"                  to   w-cnt-tip-fun          .
      *              *-------------------------------------------------*
      *              * Preparazione name                               *
      *              *-------------------------------------------------*
           move      "msg "               to   x-nam                  .
      *              *-------------------------------------------------*
      *              * Preparazione pathname                           *
      *              *-------------------------------------------------*
           move      "A0"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "tmp"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      spaces               to   o-com                  .
           string    w-cnt-env-ppu
                                delimited by   spaces
                     ".msg"     delimited by   size
                                          into o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A9"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      o-pat                to   x-pat                  .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di runtime      *
      *              *-------------------------------------------------*
           if        w-cnt-cod-run        =    01
                     go to out-frg-400
           else if   w-cnt-cod-run        =    02
                     go to out-frg-600.
       out-frg-200.
      *              *-------------------------------------------------*
      *              * Se : Acucobol 85                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open output                                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to out-frg-220.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       out-frg-220.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to out-frg-240.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       out-frg-240.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     out-frg-999.
       out-frg-400.
      *              *-------------------------------------------------*
      *              * Se : Austec RM-Master Cobol 74                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open output                                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to out-frg-420.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       out-frg-420.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to out-frg-440.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       out-frg-440.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     out-frg-999.
       out-frg-600.
      *              *-------------------------------------------------*
      *              * Se : Ryan McFarland RM-Cobol 85                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open output                                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to out-frg-620.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       out-frg-620.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to out-frg-640.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       out-frg-640.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     out-frg-999.
       out-frg-999.
           exit.

      *    *===========================================================*
      *    * Open output background                                    *
      *    *-----------------------------------------------------------*
       out-bkg-000.
      *              *-------------------------------------------------*
      *              * Determinazione valore dell'environment-variable *
      *              * V_DKB_PFIX se non gia' determinato              *
      *              *-------------------------------------------------*
           perform   det-ppu-000          thru det-ppu-999            .
      *              *-------------------------------------------------*
      *              * Determinazione tipo di runtime utilizzato, se   *
      *              * non gia' determinato                            *
      *              *-------------------------------------------------*
           perform   det-tru-000          thru det-tru-999            .
      *              *-------------------------------------------------*
      *              * Memorizzazione tipo funzionamento background    *
      *              *-------------------------------------------------*
           move      "B"                  to   w-cnt-tip-fun          .
      *              *-------------------------------------------------*
      *              * Preparazione name                               *
      *              *-------------------------------------------------*
           move      "msg "               to   x-nam                  .
      *              *-------------------------------------------------*
      *              * Preparazione pathname                           *
      *              *-------------------------------------------------*
           move      "A0"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "tmp"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      spaces               to   o-com                  .
           string    w-cnt-env-ppu
                                delimited by   spaces
                     ".msb"     delimited by   size
                                          into o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A9"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      o-pat                to   x-pat                  .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di runtime      *
      *              *-------------------------------------------------*
           if        w-cnt-cod-run        =    01
                     go to out-bkg-400
           else if   w-cnt-cod-run        =    02
                     go to out-bkg-600.
       out-bkg-200.
      *              *-------------------------------------------------*
      *              * Se : Acucobol 85                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open output                                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to out-bkg-220.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-bkg-999.
       out-bkg-220.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to out-bkg-240.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-bkg-999.
       out-bkg-240.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     out-bkg-999.
       out-bkg-400.
      *              *-------------------------------------------------*
      *              * Se : Austec RM-Master Cobol 74                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione name                           *
      *                  *---------------------------------------------*
           move      "msg "               to   x-nam                  .
      *                  *---------------------------------------------*
      *                  * Preparazione pathname                       *
      *                  *---------------------------------------------*
           move      "A0"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "tmp"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      spaces               to   o-com                  .
           string    w-cnt-env-ppu
                                delimited by   spaces
                     ".msb"     delimited by   size
                                          into o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A9"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      o-pat                to   x-pat                  .
      *                  *---------------------------------------------*
      *                  * Open output                                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to out-bkg-420.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-bkg-999.
       out-bkg-420.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to out-bkg-440.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-bkg-999.
       out-bkg-440.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     out-bkg-999.
       out-bkg-600.
      *              *-------------------------------------------------*
      *              * Se : Ryan McFarland RM-Cobol 85                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open output                                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to out-bkg-620.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-bkg-999.
       out-bkg-620.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to out-bkg-640.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-bkg-999.
       out-bkg-640.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     out-bkg-999.
       out-bkg-999.
           exit.

      *    *===========================================================*
      *    * Write                                                     *
      *    *-----------------------------------------------------------*
       wrt-wrt-000.
      *              *-------------------------------------------------*
      *              * Se tipo funzionamento foreground                *
      *              *-------------------------------------------------*
           if        w-cnt-tip-fun         =    "F"
                     perform wrt-frg-000  thru wrt-frg-999
      *              *-------------------------------------------------*
      *              * Se tipo funzionamento background                *
      *              *-------------------------------------------------*
           else      perform wrt-bkg-000  thru wrt-bkg-999            .
       wrt-wrt-999.
           exit.

      *    *===========================================================*
      *    * Write foreground                                          *
      *    *-----------------------------------------------------------*
       wrt-frg-000.
      *              *-------------------------------------------------*
      *              * Determinazione valore dell'environment-variable *
      *              * V_DKB_PFIX se non gia' determinato              *
      *              *-------------------------------------------------*
           perform   det-ppu-000          thru det-ppu-999            .
      *              *-------------------------------------------------*
      *              * Determinazione tipo di runtime utilizzato, se   *
      *              * non gia' determinato                            *
      *              *-------------------------------------------------*
           perform   det-tru-000          thru det-tru-999            .
      *              *-------------------------------------------------*
      *              * Preparazione name                               *
      *              *-------------------------------------------------*
           move      "msg "               to   x-nam                  .
      *              *-------------------------------------------------*
      *              * Preparazione pathname                           *
      *              *-------------------------------------------------*
           move      "A0"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "tmp"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      spaces               to   o-com                  .
           string    w-cnt-env-ppu
                                delimited by   spaces
                     ".msg"     delimited by   size
                                          into o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A9"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      o-pat                to   x-pat                  .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di runtime      *
      *              *-------------------------------------------------*
           if        w-cnt-cod-run        =    01
                     go to wrt-frg-400
           else if   w-cnt-cod-run        =    02
                     go to wrt-frg-600.
       wrt-frg-200.
      *              *-------------------------------------------------*
      *              * Se : Acucobol 85                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open extend                                 *
      *                  *---------------------------------------------*
           move      "OE"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-frg-220.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-frg-220.
      *                  *---------------------------------------------*
      *                  * Preparazione record                         *
      *                  *---------------------------------------------*
           move      m-msg                to   x-rec                  .
      *                  *---------------------------------------------*
      *                  * Put next                                    *
      *                  *---------------------------------------------*
           move      "PN"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-frg-240.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-frg-240.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-frg-260.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-frg-260.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     wrt-frg-999.
       wrt-frg-400.
      *              *-------------------------------------------------*
      *              * Se : Austec RM-Master Cobol 74                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open extend                                 *
      *                  *---------------------------------------------*
           move      "OE"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-frg-420.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-frg-420.
      *                  *---------------------------------------------*
      *                  * Preparazione record                         *
      *                  *---------------------------------------------*
           move      m-msg                to   x-rec                  .
      *                  *---------------------------------------------*
      *                  * Put next                                    *
      *                  *---------------------------------------------*
           move      "PN"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-frg-440.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-frg-440.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-frg-460.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-frg-460.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     wrt-frg-999.
       wrt-frg-600.
      *              *-------------------------------------------------*
      *              * Se : Ryan McFarland RM-Cobol 85                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open extend                                 *
      *                  *---------------------------------------------*
           move      "OE"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-frg-620.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-frg-620.
      *                  *---------------------------------------------*
      *                  * Preparazione record                         *
      *                  *---------------------------------------------*
           move      m-msg                to   x-rec                  .
      *                  *---------------------------------------------*
      *                  * Put next                                    *
      *                  *---------------------------------------------*
           move      "PN"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-frg-640.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-frg-640.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-frg-660.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-frg-660.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     wrt-frg-999.
       wrt-frg-999.
           exit.
       
      *    *===========================================================*
      *    * Write background                                          *
      *    *-----------------------------------------------------------*
       wrt-bkg-000.
      *              *-------------------------------------------------*
      *              * Determinazione valore dell'environment-variable *
      *              * V_DKB_PFIX se non gia' determinato              *
      *              *-------------------------------------------------*
           perform   det-ppu-000          thru det-ppu-999            .
      *              *-------------------------------------------------*
      *              * Determinazione tipo di runtime utilizzato, se   *
      *              * non gia' determinato                            *
      *              *-------------------------------------------------*
           perform   det-tru-000          thru det-tru-999            .
      *              *-------------------------------------------------*
      *              * Preparazione name                               *
      *              *-------------------------------------------------*
           move      "msg "               to   x-nam                  .
      *              *-------------------------------------------------*
      *              * Preparazione pathname                           *
      *              *-------------------------------------------------*
           move      "A0"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "tmp"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      spaces               to   o-com                  .
           string    w-cnt-env-ppu
                                delimited by   spaces
                     ".msb"     delimited by   size
                                          into o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A9"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      o-pat                to   x-pat                  .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di runtime      *
      *              *-------------------------------------------------*
           if        w-cnt-cod-run        =    01
                     go to wrt-bkg-400
           else if   w-cnt-cod-run        =    02
                     go to wrt-bkg-600.
       wrt-bkg-200.
      *              *-------------------------------------------------*
      *              * Se : Acucobol 85                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open extend                                 *
      *                  *---------------------------------------------*
           move      "OE"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-bkg-220.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-bkg-220.
      *                  *---------------------------------------------*
      *                  * Preparazione record                         *
      *                  *---------------------------------------------*
           move      m-msg                to   x-rec                  .
      *                  *---------------------------------------------*
      *                  * Put next                                    *
      *                  *---------------------------------------------*
           move      "PN"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-bkg-240.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-bkg-240.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-bkg-260.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-bkg-260.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo00"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     wrt-bkg-999.
       wrt-bkg-400.
      *              *-------------------------------------------------*
      *              * Se : Austec RM-Master Cobol 74                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open extend                                 *
      *                  *---------------------------------------------*
           move      "OE"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-bkg-420.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-bkg-420.
      *                  *---------------------------------------------*
      *                  * Preparazione record                         *
      *                  *---------------------------------------------*
           move      m-msg                to   x-rec                  .
      *                  *---------------------------------------------*
      *                  * Put next                                    *
      *                  *---------------------------------------------*
           move      "PN"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-bkg-440.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-bkg-440.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-bkg-460.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-bkg-460.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo01"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     wrt-bkg-999.
       wrt-bkg-600.
      *              *-------------------------------------------------*
      *              * Se : Ryan McFarland RM-Cobol 85                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open extend                                 *
      *                  *---------------------------------------------*
           move      "OE"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-bkg-620.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-bkg-620.
      *                  *---------------------------------------------*
      *                  * Preparazione record                         *
      *                  *---------------------------------------------*
           move      m-msg                to   x-rec                  .
      *                  *---------------------------------------------*
      *                  * Put next                                    *
      *                  *---------------------------------------------*
           move      "PN"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-bkg-640.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-bkg-640.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmeo02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to wrt-bkg-660.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     out-frg-999.
       wrt-bkg-660.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmeo02"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     wrt-bkg-999.
       wrt-bkg-999.
           exit.
       
      *    *===========================================================*
      *    * Open input foreground                                     *
      *    *-----------------------------------------------------------*
       inp-frg-000.
      *              *-------------------------------------------------*
      *              * Determinazione valore dell'environment-variable *
      *              * V_DKB_PFIX se non gia' determinato              *
      *              *-------------------------------------------------*
           perform   det-ppu-000          thru det-ppu-999            .
      *              *-------------------------------------------------*
      *              * Determinazione tipo di runtime utilizzato, se   *
      *              * non gia' determinato                            *
      *              *-------------------------------------------------*
           perform   det-tru-000          thru det-tru-999            .
      *              *-------------------------------------------------*
      *              * Memorizzazione tipo funzionamento foreground    *
      *              *-------------------------------------------------*
           move      "F"                  to   w-cnt-tip-fun          .
      *              *-------------------------------------------------*
      *              * Preparazione name                               *
      *              *-------------------------------------------------*
           move      "msg "               to   x-nam                  .
      *              *-------------------------------------------------*
      *              * Preparazione pathname                           *
      *              *-------------------------------------------------*
           move      "A0"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "tmp"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      spaces               to   o-com                  .
           string    w-cnt-env-ppu
                                delimited by   spaces
                     ".msg"     delimited by   size
                                          into o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A9"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      o-pat                to   x-pat                  .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di runtime      *
      *              *-------------------------------------------------*
           if        w-cnt-cod-run        =    01
                     go to inp-frg-400
           else if   w-cnt-cod-run        =    02
                     go to inp-frg-600.
       inp-frg-200.
      *              *-------------------------------------------------*
      *              * Se : Acucobol 85                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open input                                  *
      *                  *---------------------------------------------*
           move      "OI"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to inp-frg-220.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei00"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmei00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     inp-frg-999.
       inp-frg-220.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     inp-frg-999.
       inp-frg-400.
      *              *-------------------------------------------------*
      *              * Se : Austec RM-Master Cobol 74                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open input                                  *
      *                  *---------------------------------------------*
           move      "OI"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to inp-frg-420.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei01"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmei01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     inp-frg-999.
       inp-frg-420.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     inp-frg-999.
       inp-frg-600.
      *              *-------------------------------------------------*
      *              * Se : Ryan McFarland RM-Cobol 85                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open input                                  *
      *                  *---------------------------------------------*
           move      "OI"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to inp-frg-620.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei02"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmei02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     inp-frg-999.
       inp-frg-620.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     inp-frg-999.
       inp-frg-999.
           exit.

      *    *===========================================================*
      *    * Open input background                                     *
      *    *-----------------------------------------------------------*
       inp-bkg-000.
      *              *-------------------------------------------------*
      *              * Determinazione valore dell'environment-variable *
      *              * V_DKB_PFIX se non gia' determinato              *
      *              *-------------------------------------------------*
           perform   det-ppu-000          thru det-ppu-999            .
      *              *-------------------------------------------------*
      *              * Determinazione tipo di runtime utilizzato, se   *
      *              * non gia' determinato                            *
      *              *-------------------------------------------------*
           perform   det-tru-000          thru det-tru-999            .
      *              *-------------------------------------------------*
      *              * Memorizzazione tipo funzionamento background    *
      *              *-------------------------------------------------*
           move      "B"                  to   w-cnt-tip-fun          .
      *              *-------------------------------------------------*
      *              * Preparazione name                               *
      *              *-------------------------------------------------*
           move      "msg "               to   x-nam                  .
      *              *-------------------------------------------------*
      *              * Preparazione pathname                           *
      *              *-------------------------------------------------*
           move      "A0"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "tmp"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      spaces               to   o-com                  .
           string    w-cnt-env-ppu
                                delimited by   spaces
                     ".msb"     delimited by   size
                                          into o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A9"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      o-pat                to   x-pat                  .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di runtime      *
      *              *-------------------------------------------------*
           if        w-cnt-cod-run        =    01
                     go to inp-bkg-400
           else if   w-cnt-cod-run        =    02
                     go to inp-bkg-600.
       inp-bkg-200.
      *              *-------------------------------------------------*
      *              * Se : Acucobol 85                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open input                                  *
      *                  *---------------------------------------------*
           move      "OI"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to inp-bkg-220.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei00"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmei00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     inp-bkg-999.
       inp-bkg-220.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     inp-bkg-999.
       inp-bkg-400.
      *              *-------------------------------------------------*
      *              * Se : Austec RM-Master Cobol 74                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open input                                  *
      *                  *---------------------------------------------*
           move      "OI"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to inp-bkg-420.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei01"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmei01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     inp-bkg-999.
       inp-bkg-420.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     inp-bkg-999.
       inp-bkg-600.
      *              *-------------------------------------------------*
      *              * Se : Ryan McFarland RM-Cobol 85                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open input                                  *
      *                  *---------------------------------------------*
           move      "OI"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to inp-bkg-620.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei02"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmei02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     inp-bkg-999.
       inp-bkg-620.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     inp-bkg-999.
       inp-bkg-999.
           exit.

      *    *===========================================================*
      *    * Read                                                      *
      *    *-----------------------------------------------------------*
       rea-rea-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di runtime      *
      *              *-------------------------------------------------*
           if        w-cnt-cod-run        =    01
                     go to rea-rea-400
           else if   w-cnt-cod-run        =    02
                     go to rea-rea-600.
       rea-rea-200.
      *              *-------------------------------------------------*
      *              * Se : Acucobol 85                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Get next                                    *
      *                  *---------------------------------------------*
           move      "GN"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to rea-rea-240.
           if        x-sts                =    e-end-fil
                     go to rea-rea-220.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Area record a spaces                    *
      *                      *-----------------------------------------*
           move      spaces               to   m-msg                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei00"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmei00"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rea-rea-999.
       rea-rea-220.
      *                  *---------------------------------------------*
      *                  * Se fine file                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di fine file in uscita           *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Area record a spaces                    *
      *                      *-----------------------------------------*
           move      spaces               to   m-msg                  .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rea-rea-999.
       rea-rea-240.
      *                  *---------------------------------------------*
      *                  * Se nessun errore                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di uscita a Ok                   *
      *                      *-----------------------------------------*
           move      spaces               to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Area record in uscita                   *
      *                      *-----------------------------------------*
           move      x-rec                to   m-msg                  .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rea-rea-999.
       rea-rea-400.
      *              *-------------------------------------------------*
      *              * Se : Austec RM-Master Cobol 74                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Get next                                    *
      *                  *---------------------------------------------*
           move      "GN"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to rea-rea-440.
           if        x-sts                =    e-end-fil
                     go to rea-rea-420.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Area record a spaces                    *
      *                      *-----------------------------------------*
           move      spaces               to   m-msg                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei01"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmei01"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rea-rea-999.
       rea-rea-420.
      *                  *---------------------------------------------*
      *                  * Se fine file                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di fine file in uscita           *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Area record a spaces                    *
      *                      *-----------------------------------------*
           move      spaces               to   m-msg                  .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rea-rea-999.
       rea-rea-440.
      *                  *---------------------------------------------*
      *                  * Se nessun errore                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di uscita a Ok                   *
      *                      *-----------------------------------------*
           move      spaces               to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Area record in uscita                   *
      *                      *-----------------------------------------*
           move      x-rec                to   m-msg                  .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rea-rea-999.
       rea-rea-600.
      *              *-------------------------------------------------*
      *              * Se : Ryan McFarland RM-Cobol 85                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Get next                                    *
      *                  *---------------------------------------------*
           move      "GN"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to rea-rea-640.
           if        x-sts                =    e-end-fil
                     go to rea-rea-620.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Area record a spaces                    *
      *                      *-----------------------------------------*
           move      spaces               to   m-msg                  .
      *                      *-----------------------------------------*
      *                      * Chiusura forzata                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei02"
                                         using x                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mmei02"                         .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rea-rea-999.
       rea-rea-620.
      *                  *---------------------------------------------*
      *                  * Se fine file                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di fine file in uscita           *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Area record a spaces                    *
      *                      *-----------------------------------------*
           move      spaces               to   m-msg                  .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rea-rea-999.
       rea-rea-640.
      *                  *---------------------------------------------*
      *                  * Se nessun errore                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di uscita a Ok                   *
      *                      *-----------------------------------------*
           move      spaces               to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Area record in uscita                   *
      *                      *-----------------------------------------*
           move      x-rec                to   m-msg                  .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rea-rea-999.
       rea-rea-999.
           exit.

      *    *===========================================================*
      *    * Close input                                               *
      *    *-----------------------------------------------------------*
       cls-inp-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di runtime      *
      *              *-------------------------------------------------*
           if        w-cnt-cod-run        =    01
                     go to cls-inp-400
           else if   w-cnt-cod-run        =    02
                     go to cls-inp-600.
       cls-inp-200.
      *              *-------------------------------------------------*
      *              * Se : Acucobol 85                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei00"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmei00"                         .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to cls-inp-220.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     cls-inp-999.
       cls-inp-220.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     cls-inp-999.
       cls-inp-400.
      *              *-------------------------------------------------*
      *              * Se : Austec RM-Master Cobol 74                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei01"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmei01"                         .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to cls-inp-420.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     cls-inp-999.
       cls-inp-420.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     cls-inp-999.
       cls-inp-600.
      *              *-------------------------------------------------*
      *              * Se : Ryan McFarland RM-Cobol 85                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   x-ope                  .
           call      "swd/mod/prg/obj/mmei02"
                                         using x                      .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mmei02"                         .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        x-sts                =    e-not-err
                     go to cls-inp-620.
      *                  *---------------------------------------------*
      *                  * Se errori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di errore in uscita              *
      *                      *-----------------------------------------*
           move      x-sts                to   m-rsc                  .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     cls-inp-999.
       cls-inp-620.
      *                  *---------------------------------------------*
      *                  * Status di uscita a Ok                       *
      *                  *---------------------------------------------*
           move      spaces               to   m-rsc                  .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     cls-inp-999.
       cls-inp-999.
           exit.

      *    *===========================================================*
      *    * Determinazione della environment-variable V_DKB_PFIX,     *
      *    * se necessario, per chiamata del modulo apposito           *
      *    *-----------------------------------------------------------*
       det-ppu-000.
      *              *-------------------------------------------------*
      *              * Se gia' determinata : uscita                    *
      *              *-------------------------------------------------*
           if        w-cnt-env-ppu        not  = spaces
                     go to det-ppu-999.
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per ottenere  *
      *              * il prefisso o postfisso unico per files tempo-  *
      *              * ranei                                           *
      *              *-------------------------------------------------*
           move      "U?"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Memorizzazione del prefisso o postfisso unico   *
      *              *-------------------------------------------------*
           move      s-pat                to   w-cnt-env-ppu          .
       det-ppu-999.
           exit.

      *    *===========================================================*
      *    * Determinazione tipo di runtime utilizzato, se necessario, *
      *    * per chiamata del modulo di segreteria                     *
      *    *-----------------------------------------------------------*
       det-tru-000.
      *              *-------------------------------------------------*
      *              * Se gia' determinato : uscita                    *
      *              *-------------------------------------------------*
           if        w-cnt-det-run        not  = spaces
                     go to det-tru-999.
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per ottenere  *
      *              * il codice del tipo di runtime utilizzato        *
      *              *-------------------------------------------------*
           move      "R?"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Memorizzazione del codice del tipo di runtime   *
      *              * utilizzato                                      *
      *              *-------------------------------------------------*
           move      s-num                to   w-cnt-cod-run          .
      *              *-------------------------------------------------*
      *              * Segnale di determinazione eseguita              *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-det-run          .
       det-tru-999.
           exit.

