       Identification Division.
       Program-Id.                                 ionprtmag          .
      *================================================================*
      *                                                                *
      *                 Input-Output Numeri prtmag                     *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     d-K-b-Snc-PD .
       Object-Computer.     d-K-b-Snc-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Pathname completo del modulo oggetto                  *
      *        *-------------------------------------------------------*
           05  i-ide-pmo                  pic  x(40) value
                     "pgm/mag/num/ioc/obj/ionprtmag           "       .

      *    *===========================================================*
      *    * Area di definizione della chiave                          *
      *    *-----------------------------------------------------------*
       01  k.
      *        *-------------------------------------------------------*
      *        * Componente fissa                                      *
      *        *-------------------------------------------------------*
           05  k-fix                      pic  x(08) value
                     "prtmag  "                                       .
      *        *-------------------------------------------------------*
      *        * Componente variabile : 10 caratteri                   *
      *        *-------------------------------------------------------*
           05  k-var.
      *            *---------------------------------------------------*
      *            * Anno di esercizio                                 *
      *            *---------------------------------------------------*
               10  k-ann-ese              pic  9(03)                  .
               10  k-cod-dpz              pic  9(02)                  .
               10  filler                 pic  x(05)                  .
      *        *-------------------------------------------------------*
      *        * Contatore numero frammenti                            *
      *        *-------------------------------------------------------*
           05  k-cnf                      pic  9(02)                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Record logico file [num]                                  *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/fls/rec/rfnum"                          .

      *    *===========================================================*
      *    * Work-area fissa per tutti i moduli di gestione i-o        *
      *    *-----------------------------------------------------------*
       01  z.
           05  z-inx                      pic  9(04)                  .
           05  z-pnt                      pic  9(04)                  .
           05  z-nfr                      pic  9(03)                  .
           05  z-cnf                      pic  9(03)                  .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Record logico numeri [prtmag]                             *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/num/rec/rnprtmag"                       .

      ******************************************************************
       Procedure Division                using f rn-prt-mag           .
      ******************************************************************

      *    *===========================================================*
      *    * Procedure division fissa per tutti i moduli di i-o        *
      *    *-----------------------------------------------------------*
           copy      "swd/ske/ion/ioncp50"                            .

      *    *===========================================================*
      *    * Unstring da record numeri a record [num]                  *
      *    *-----------------------------------------------------------*
       uns-000.
           unstring  rn-prt-mag           into rf-num-dat-num
                                  with pointer z-inx                  .
       uns-999.
           exit.

      *    *===========================================================*
      *    * String da record [num] a record numeri                    *
      *    *-----------------------------------------------------------*
       stg-000.
           string    rf-num-dat-num       
                     delimited  by size        into rn-prt-mag
                                  with pointer z-inx                  .
       stg-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione record numeri                             *
      *    *-----------------------------------------------------------*
       nor-000.
           move      spaces               to   rn-prt-mag             .
           move      zero                 to   rn-prt-mag-ann-ese     .
           move      zero                 to   rn-prt-mag-cod-dpz     .
           move      zero                 to   rn-prt-mag-num-prt     .
       nor-999.
           exit.
           
      *    *===========================================================*
      *    * Composizione componente variabile della chiave            *
      *    *-----------------------------------------------------------*
       key-000.
           move      spaces               to   k-var                  .
           move      rn-prt-mag-ann-ese   to   k-ann-ese              .
           move      rn-prt-mag-cod-dpz   to   k-cod-dpz              .
       key-999.
           exit.
