       Identification Division.
       Program-Id.                                 mysqlpr0           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    cnv                 *
      *                        Area gestionale:    cnv                 *
      *                                Settore:                        *
      *                                   Fase:    mysqlpr0            *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 11/11/02    *
      *                       Ultima revisione:    NdK del 11/11/02    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:    Prove di lettura di file mysql             *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************
      
      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     d-K-b-Snc-PD .
       Object-Computer.     d-K-b-Snc-PD .

       Special-Names.       Decimal-Point is comma .
       
      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [auc]                                        *
      *    *-----------------------------------------------------------*
           select  optional  auc   assign to disk         f-auc-pat
                             organization is indexed
                             access mode  is dynamic
                             record key   is auc-key
                             file status  is f-auc-sts                .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [auc]                                    *
      *    *-----------------------------------------------------------*
       fd  auc       label record standard                            .
       01  auc-rec.
           05  auc-key.
               10  auc-tre                pic  x(04)                  .
               10  auc-kre                pic  x(40)                  .
           05  auc-dat.
               10  auc-chr.
                   15  filler      occurs 1536
                                          pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*
      
      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mopsys" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area ausiliaria per controllo i-o su [auc]                *
      *    *-----------------------------------------------------------*
       01  f-auc.
      *        *-------------------------------------------------------*
      *        * File name                                             *
      *        *-------------------------------------------------------*
           05  f-auc-nam                  pic  x(04) value "auc "     .
      *        *-------------------------------------------------------*
      *        * File pathname                                         *
      *        *-------------------------------------------------------*
           05  f-auc-pat                  pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * File status                                           *
      *        *-------------------------------------------------------*
           05  f-auc-sts                  pic  x(02)                  .

      *    *===========================================================*
      *    * Work per records di [auc] 'ute'                           *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/waucute0.cpw"                   .

      *    *===========================================================*
      *    * Area di comodo                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * Parametri in input                                    *
      *        *-------------------------------------------------------*
       01  comodo.
           05  contax                     pic  9(07)                  .
           05  user                       pic  x(08)                  .
           05  pasw                       pic  x(08)                  .
           05  parametro1                 pic  x(200)                 .
           05  parametro1b                pic  x(80)                  .
           05  parametro1c                pic  x(80)                  .
           05  parametro2                 pic  x(200)                 .
           05  parametro2b                pic  x(80)                  .
           05  parametro2c                pic  x(80)                  .
           05  uscita                     pic  x(200)                 .
      *        *-------------------------------------------------------*
      *        * Stato di uscita                                       *
      *        *  - "em" : Utente e password mancanti                  *
      *        *  - "uu" : Utente non codificato                       *
      *        *  - "pr" : Password necessaria                         *
      *        *  - "wp" : Password errata                             *
      *        *  - "ok" : Accesso consentito                          *
      *        *  - "ko" : Accesso negato                              *
      *        *-------------------------------------------------------*
           05  exit-sts                   pic  x(02)                  .

      *    *===========================================================*
      *    * Area per parametri di 'chaining' dal chiamante            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * Variabile di environment V_ALTER_HOME                 *
      *        *-------------------------------------------------------*
       77  parametro                      pic  x(200)                 .

      ******************************************************************
       Procedure Division                                             .
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
______*    move      "OF"                 to   v-ope                  .
______*    call      "swd/mod/prg/obj/mvideo"
______*                                  using v                      .
      *              *-------------------------------------------------*
      *              * Chiamata MySQL                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Esecuzione di un comando 'Unix' da shell    *
      *                  *---------------------------------------------*
           move      "/usr/local/mysql/bin/mysql -h ndek2 -s -f -u maste
      -              "r -D tws -B -e ""SELECT * FROM dcp WHERE alf_pro L
      -              "IKE '0010001'"" > /dev/pts/1"
                                          to   o-shs                  .
      *                  *---------------------------------------------*
      *                  * Richiamo del modulo 'mopsys'                *
      *                  *---------------------------------------------*
           move      "SH"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      
           accept    parametro1 from CONSOLE.
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
______*    move      "ON"                 to   v-ope                  .
______*    call      "swd/mod/prg/obj/mvideo"
______*                                  using v                      .
      
      
      
      
           display   parametro1 line 02 position 02.
       main-999.
           exit      program.
           stop run.

      *    *===========================================================*
      *    * Open file [auc]                                           *
      *    *-----------------------------------------------------------*
       opn-fil-auc-000.
      *              *-------------------------------------------------*
      *              * Preparazione pathname per [auc]                 *
      *              *-------------------------------------------------*
           move      "/abd/fpx/auc"       to   f-auc-pat              .
      *              *-------------------------------------------------*
      *              * Operazione di i-o di Open                       *
      *              *-------------------------------------------------*
           open      i-o    auc                                       .
       opn-fil-auc-999.
           exit.

      *    *===========================================================*
      *    * Close file [auc]                                          *
      *    *-----------------------------------------------------------*
       cls-fil-auc-000.
           close      auc                                             .
       cls-fil-auc-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri correlati all'utente in w-ute-cod-ute   *
      *    *-----------------------------------------------------------*
       let-ute-auc-000.
      *              *-------------------------------------------------*
      *              * Lettura record codice utente                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura                                     *
      *                  *---------------------------------------------*
           move      "ute "               to   auc-tre                .
           move      w-ute-cod-ute        to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            go to   let-ute-auc-100.
           go to     let-ute-auc-200.
       let-ute-auc-100.
      *                  *---------------------------------------------*
      *                  * Se codice utente non esistente              *
      *                  *---------------------------------------------*
           move      "uu"                 to   exit-sts               .
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     let-ute-auc-999.
       let-ute-auc-200.
      *                  *---------------------------------------------*
      *                  * Se codice utente esistente                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Controllo password                      *
      *                      *-----------------------------------------*
           move      auc-dat              to   w-ute                  .
           if        w-ute-pwd-ute        =    pasw
                     move  "ok"           to   exit-sts
           else if   pasw                 =    spaces and
                     w-ute-pwd-ute        not  = spaces
                     move  "pr"           to   exit-sts
           else      move  "wp"           to   exit-sts               .
       let-ute-auc-999.
           exit.


