       Identification Division.
       Program-Id.                                 zatsc2g1           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    cnv                 *
      *                        Area gestionale:    cnv                 *
      *                                Settore:                        *
      *                                   Fase:    zatsc2              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 10/02/13    *
      *                       Ultima revisione:    NdK del 10/02/13    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Creazione file x SCHEMA 2 : parte SCHEMA 2  *
      *                                                                *
      *                    Lettura di /abd/asc/tmp/ZTTGCZ.SQZ          *
      *                                                                *
      *                    NOTE SUL PROGRAMMA                          *
      *                    ------------------                          *
      *                                                                *
      *                    - Si forza il codice Fornitore 1 (Zatti)    *
      *                    - Si forza il mese 2 (Febbraio)             *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     d-K-b-Snc-PD .
       Object-Computer.     d-K-b-Snc-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "cnv"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "cnv"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "   "                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "fiozat"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "fiozatg1"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     " Estrazione giacenza da ZATTI a SCHEMA2 "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "msegrt" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/g"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mopsys" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per padding campi alfanumerici con 'z'           *
      *        *-------------------------------------------------------*
           05  w-pad-zzz.
               10  w-pad-zzz-alf.
                   15  w-pad-zzz-alf-chr
                                   occurs 20       
                                          pic  x(01)                  .
               10  w-pad-zzz-ctr          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento conversione       *
      *        *-------------------------------------------------------*
           05  w-cnt-xcv.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-xcv-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-xcv-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-xcv-flg-sub      pic  x(01)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [mmz]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmmz"                          .

      *    *===========================================================*
      *    * Work-area richieste per conversione                       *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Pathname del file in input                            *
      *        *-------------------------------------------------------*
           05  rr-pth-inp                 pic  x(40)                  .

      *    *===========================================================*
      *    * Work per subroutines di Exe                               *
      *    *-----------------------------------------------------------*
       01  w-exe.
      *        *-------------------------------------------------------*
      *        * Flag di esecuzione batch                              *
      *        *-------------------------------------------------------*
           05  w-exe-flg-btc              pic  x(01)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo accodamento per file in output        *
      *        *-------------------------------------------------------*
           05  w-exp-out-ext.
               10  w-exp-out-ext-num      pic  9(02)       value 2    .
               10  w-exp-out-ext-lun      pic  9(02)       value 40   .
               10  w-exp-out-ext-tbl.
                   15  filler             pic  x(40) value
                            "Accodamento al file gia' esistente      ".
                   15  filler             pic  x(40) value
                            "Creazione di un file in output nuovo    ".

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [mmz]                        *
      *        *-------------------------------------------------------*
           05  w-let-rec-mmz.
               10  w-let-rec-mmz-flg      pic  x(01)                  .
               10  w-let-rec-mmz-dpz      pic  9(02)                  .
               10  w-let-rec-mmz-pro      pic  9(07)                  .
               10  w-let-rec-mmz-rec.
                   15  filler  occurs 2048
                                          pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Cmp                               *
      *    *-----------------------------------------------------------*
       01  w-cmp.
      *        *-------------------------------------------------------*
      *        * Work per Composizione record [mmz]                    *
      *        *-------------------------------------------------------*
           05  w-cmp-rec-mmz.
               10  w-cmp-rec-mmz-dpz      pic  9(02)                  .
               10  w-cmp-rec-mmz-pro      pic  9(07)                  .
               10  w-cmp-rec-mmz-gia      pic s9(08)v9(03)            .
               10  w-cmp-rec-mmz-rec.
                   15  filler  occurs 2048
                                          pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per la definizione chiavi record [mmz]          *
      *    *-----------------------------------------------------------*
       01  w-dkr.
      *        *-------------------------------------------------------*
      *        * Record 'gia' : Giacenza                               *
      *        *-------------------------------------------------------*
           05  w-dkr-gia.
      *            *---------------------------------------------------*
      *            * Codice numerico prodotto                          *
      *            *---------------------------------------------------*
               10  w-dkr-gia-num-pro      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Giacenza 01                                       *
      *            *---------------------------------------------------*
               10  w-dkr-gia-gia-d01      pic s9(08)v9(03)            .
      *            *---------------------------------------------------*
      *            * Giacenza 02                                       *
      *            *---------------------------------------------------*
               10  w-dkr-gia-gia-d02      pic s9(08)v9(03)            .

      *    *===========================================================*
      *    * Work area per la raccolta di una intera pagina di stampa  *
      *    *-----------------------------------------------------------*
       01  w-pds.
      *        *-------------------------------------------------------*
      *        * Tipo di divisione della pagina                        *
      *        * - F : a numero di linee fisso                         *
      *        * - V : a numero di linee variabile, con riconoscimento *
      *        *       dell'inizio pagina                              *
      *        *-------------------------------------------------------*
           05  w-pds-tdp                  pic  x(01)       value "F"  .
      *        *-------------------------------------------------------*
      *        * Numero di linee per ogni pagina di stampa, solo se    *
      *        * tipo di divisione pagina 'F'                          *
      *        *-------------------------------------------------------*
           05  w-pds-max                  pic  9(02)       value 01   .
      *        *-------------------------------------------------------*
      *        * Marker di fine file                                   *
      *        *-------------------------------------------------------*
           05  w-pds-mff                  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Marker di inizio pagina in sospeso                    *
      *        *-------------------------------------------------------*
           05  w-pds-mip                  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Linea di inizio pagina in sospeso                     *
      *        *-------------------------------------------------------*
           05  w-pds-lip.
               10  filler occurs 640      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Numero di linee lette                                 *
      *        *-------------------------------------------------------*
           05  w-pds-nll                  pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Numero di linee ignorate                              *
      *        *-------------------------------------------------------*
           05  w-pds-nli                  pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Numero di pagine lette                                *
      *        *-------------------------------------------------------*
           05  w-pds-npl                  pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Numero di records scritti [dcp]                       *
      *        *-------------------------------------------------------*
           05  w-pds-dcp                  pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Numero di records scritti [mau]                       *
      *        *-------------------------------------------------------*
           05  w-pds-mau                  pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Numero di records scritti [aaf]                       *
      *        *-------------------------------------------------------*
           05  w-pds-aaf                  pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Numero di records scritti [aaq]                       *
      *        *-------------------------------------------------------*
           05  w-pds-aaq                  pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Numero di linee lette per la pagina di stampa         *
      *        *-------------------------------------------------------*
           05  w-pds-ctr                  pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Indice di comodo sulla pagina di stampa               *
      *        *-------------------------------------------------------*
           05  w-pds-inx                  pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Pagina di stampa                                      *
      *        *-------------------------------------------------------*
           05  w-pds-pag.
      *            *---------------------------------------------------*
      *            * Max 96 linee di stampa                            *
      *            *---------------------------------------------------*
               10  w-pds-rig occurs 96.
      *                *-----------------------------------------------*
      *                * Max 640 caratteri per ogni linea di stampa    *
      *                *-----------------------------------------------*
                   15  w-pds-chr occurs 640
                                          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area per estrazioni                                   *
      *        *-------------------------------------------------------*
           05  w-pds-est.
      *            *---------------------------------------------------*
      *            * Numero linea                                      *
      *            *---------------------------------------------------*
               10  w-pds-lin              pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Numero posizione                                  *
      *            *---------------------------------------------------*
               10  w-pds-pos              pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Lunghezza                                         *
      *            *---------------------------------------------------*
               10  w-pds-lun              pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo campo                                        *
      *            * - A : Alfanumerico                                *
      *            * - N : Numerico intero                             *
      *            *---------------------------------------------------*
               10  w-pds-tip              pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Valore alfanumerico                               *
      *            *---------------------------------------------------*
               10  w-pds-alf              pic  x(80)                  .
      *            *---------------------------------------------------*
      *            * Valore numerico                                   *
      *            *---------------------------------------------------*
               10  w-pds-num              pic s9(13)v9(05)   trailing
                                                             separate
                                                             character.
      *            *---------------------------------------------------*
      *            * Aree di work locali per l'estrazione              *
      *            *---------------------------------------------------*
               10  w-pds-w01.
                   15  w-pds-w02 occurs 641
                                          pic  x(01)                  .
               10  w-pds-w03              pic  9(03)                  .
               10  w-pds-w04.
                   15  w-pds-w05 occurs 25.
                       20  w-pds-w06      pic  x(01)                  .
                       20  w-pds-w07 redefines
                           w-pds-w06      pic  9(01)                  .
               10  w-pds-w08              pic  9(02)                  .

      *    *===========================================================*
      *    * Work area per la ridefinizione delle linee di stampa      *
      *    *-----------------------------------------------------------*
       01  w-lds.
      *        *-------------------------------------------------------*
      *        * Linea base                                            *
      *        *-------------------------------------------------------*
           05  w-lds-000.
               10  filler    occurs 640   pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Linea 001                                             *
      *        *-------------------------------------------------------*
           05  w-lds-001 redefines
               w-lds-000.
      *            *---------------------------------------------------*
      *            * Record prodotto                                   *
      *            *---------------------------------------------------*
               10  w-lds-001-are-rec.
                   15  w-lds-001-num-pro  pic  x(07)                  .
                   15  filler             pic  x(01)                  .
                   15  w-lds-001-gia-d01  pic  x(15)                  .
                   15  filler             pic  x(01)                  .
                   15  w-lds-001-gia-d02  pic  x(15)                  .

      *    *===========================================================*
      *    * Work area per Determinazioni                              *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Per determinazione tipo prodotto                      *
      *        *-------------------------------------------------------*
           05  w-det-rec-tip.
      *            *---------------------------------------------------*
      *            * Tipo di prodotto                                  *
      *            *                                                   *
      *            * 01 - Prodotto normale                             *
      *            * 02 - Prodotto virtuale                            *
      *            *---------------------------------------------------*
               10  w-det-rec-tip-tpp      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Primo carattere della descrizione prodotto        *
      *            *---------------------------------------------------*
               10  w-det-rec-tip-pcr      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione presenza di testo da agganciare    *
      *        *-------------------------------------------------------*
           05  w-det-txt-agg.
      *            *---------------------------------------------------*
      *            * Flag di attivazione testo da agganciare           *
      *            *                                                   *
      *            * 'spaces' - Flag inattivo                          *
      *            * '#'      - Flag attivo                            *
      *            *---------------------------------------------------*
               10  w-det-txt-agg-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Contatore numero di linee di testo cumulate       *
      *            *---------------------------------------------------*
               10  w-det-txt-agg-num      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Contatore di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-txt-agg-ctr      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Linee di testo cumulate                           *
      *            *---------------------------------------------------*
               10  w-det-txt-agg-txt.
                   15  w-det-txt-agg-rig occurs 10
                                          pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione classe da fornitore                *
      *        *-------------------------------------------------------*
           05  w-det-cla-fnt.
      *            *---------------------------------------------------*
      *            * Componente numerica del codice prodotto           *
      *            *---------------------------------------------------*
               10  w-det-cla-fnt-num      pic  9(04)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione quantita' per confezione           *
      *        *-------------------------------------------------------*
           05  w-det-qta-cfz.
      *            *---------------------------------------------------*
      *            * Comodi                                            *
      *            *---------------------------------------------------*
               10  w-det-qta-cfz-tip      pic  9(02)                  .
               10  w-det-qta-cfz-qta      pic  9(06)v9(03)            .
               10  w-det-qta-cfz-inb      pic  9(06)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Per determinazione listino base                       *
      *        *-------------------------------------------------------*
           05  w-det-lst-bas.
      *            *---------------------------------------------------*
      *            * Comodi                                            *
      *            *---------------------------------------------------*
               10  w-det-lst-bas-prz      pic  9(09)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione codice fornitore                   *
      *        *-------------------------------------------------------*
           05  w-det-cod-dcf.
      *            *---------------------------------------------------*
      *            * Comodi                                            *
      *            *---------------------------------------------------*
               10  w-det-cod-dcf-cod      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Per nome archivio                                     *
      *        *-------------------------------------------------------*
           05  w-det-nom-arc.
      *            *---------------------------------------------------*
      *            * Comdi per editing                                 *
      *            *---------------------------------------------------*
               10  w-det-nom-arc-ann      pic  x(04)                  .
               10  w-det-nom-arc-mes      pic  x(02)                  .
               10  w-det-nom-arc-gio      pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione codice numerico prodotto           *
      *        *-------------------------------------------------------*
           05  w-det-num-pro.
      *            *---------------------------------------------------*
      *            * Codice alfanumerico prodotto                      *
      *            *---------------------------------------------------*
               10  w-det-num-pro-alf      pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Codice numerico prodotto                          *
      *            *---------------------------------------------------*
               10  w-det-num-pro-num      pic  9(07)                  .

      *    *===========================================================*
      *    * Work area per la definizione dei record in output         *
      *    *-----------------------------------------------------------*
       01  w-out.
           05  filler                     pic  x(01)                  .

      *    *===========================================================*
      *    * Work per attribuzione e ripristino codice automatico      *
      *    *-----------------------------------------------------------*
       01  w-enc-dcp.
      *        *-------------------------------------------------------*
      *        * Valore pre incremento                                 *
      *        *-------------------------------------------------------*
           05  w-enc-dcp-val-pre          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Valore post incremento                                *
      *        *-------------------------------------------------------*
           05  w-enc-dcp-val-pos          pic  9(07)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-600.
      *              *-------------------------------------------------*
      *              * Eventuali forzature se esecuzione batch         *
      *              *-------------------------------------------------*
           if        w-exe-flg-btc        =    "S"
                     go to main-300.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-600.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-300.
      *              *-------------------------------------------------*
      *              * Esecuzione in foreground                        *
      *              *-------------------------------------------------*
           perform   exe-pgm-frg-000      thru exe-pgm-frg-999        .
       main-600.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione campo alfanumerico con padding di "z"    *
      *    *-----------------------------------------------------------*
       pad-alf-zzz-000.
           move      20                   to   w-pad-zzz-ctr          .
       pad-alf-zzz-100.
           if        w-pad-zzz-ctr        >    zero
                     if    w-pad-zzz-alf-chr
                          (w-pad-zzz-ctr) =    spaces
                           move    "z"    to   w-pad-zzz-alf-chr
                                              (w-pad-zzz-ctr)
                           subtract 1     from w-pad-zzz-ctr
                           go to    pad-alf-zzz-100.
       pad-alf-zzz-999.
           exit.

      *    *===========================================================*
      *    * Programma di esecuzione in foreground                     *
      *    *-----------------------------------------------------------*
       exe-pgm-frg-000.
      *              *-------------------------------------------------*
      *              * Eventuali forzature se esecuzione batch         *
      *              *-------------------------------------------------*
           if        w-exe-flg-btc        =    "S"
                     go to exe-pgm-frg-300.
      *              *-------------------------------------------------*
      *              * Inizializzazione rullino messaggi di foreground *
      *              *-------------------------------------------------*
           move      "OF"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Se errore : uscita                          *
      *                  *---------------------------------------------*
            if       m-rsc                not  = spaces
                     go to exe-pgm-frg-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-pgm-frg-300.
      *              *-------------------------------------------------*
      *              * Esecuzione del programma                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di conversione                        *
      *                  *---------------------------------------------*
           perform   xcv-rou-pri-000      thru xcv-rou-pri-999        .
       exe-pgm-frg-400.
      *              *-------------------------------------------------*
      *              * Eventuali forzature se esecuzione batch         *
      *              *-------------------------------------------------*
           if        w-exe-flg-btc        =    "S"
                     go to exe-pgm-frg-999.
      *                  *---------------------------------------------*
      *                  * Visual. eventuali errori di esecuzione      *
      *                  *---------------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "F"                  to   b-tfe                  .
           move      i-ide-des            to   b-chr                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
           cancel    "swd/mod/prg/obj/mbckgv"                         .
       exe-pgm-frg-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di conversione                                      *
      *    *-----------------------------------------------------------*
       xcv-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione marker di trattamento della    *
      *              * prima pagina                                    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-xcv-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-xcv-flg-int      .
       xcv-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Trasferimento iniziale del file via ftp         *
      *              *-------------------------------------------------*
           perform   trf-fls-srv-000      thru trf-fls-srv-999        .
      *              *-------------------------------------------------*
      *              * Open files per la conversione                   *
      *              *-------------------------------------------------*
           perform   xcv-opn-fls-000      thru xcv-opn-fls-999        .
           if        w-cnt-xcv-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-xcv-flg-sub
                     go to  xcv-rou-pri-600.
       xcv-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura e bufferizzazione di una pagina stampa  *
      *              *-------------------------------------------------*
           perform   xcv-lbu-pds-000      thru xcv-lbu-pds-999        .
           if        w-cnt-xcv-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-xcv-flg-sub
                     go to  xcv-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Trattamento della pagina di stampa              *
      *              *-------------------------------------------------*
           perform   xcv-trt-pds-000      thru xcv-trt-pds-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-xcv-flg-int    not  = spaces
                     go to xcv-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Segnale di trattamento prima pagina eseguito    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-xcv-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura pagina di stampa              *
      *              *-------------------------------------------------*
           go to     xcv-rou-pri-200.
       xcv-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Test se trattata almeno una pagina              *
      *              *-------------------------------------------------*
           if        w-cnt-xcv-mrk-uno    not  = spaces
                     go to xcv-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   xcv-nes-ela-000      thru xcv-nes-ela-999        .
           go to     xcv-rou-pri-600.
       xcv-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Close files per la conversione                  *
      *              *-------------------------------------------------*
           perform   xcv-cls-fls-000      thru xcv-cls-fls-999        .
       xcv-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Routine di estrazione valore campo da buffer pagina       *
      *    *-----------------------------------------------------------*
       xcv-est-val-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo campo           *
      *              *-------------------------------------------------*
           if        w-pds-tip            =    "A"
                     go to xcv-est-val-100
           else if   w-pds-tip            =    "N"
                     go to xcv-est-val-200
           else      go to xcv-est-val-999.
       xcv-est-val-100.
      *              *-------------------------------------------------*
      *              * Estrazione valore alfanumerico                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea interessata in area di lavoro         *
      *                  *---------------------------------------------*
           move      w-pds-rig
                    (w-pds-lin)           to   w-pds-w01              .
      *                  *---------------------------------------------*
      *                  * Normalizzazione risultato                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-pds-alf              .
      *                  *---------------------------------------------*
      *                  * Terminatore per unstring                    *
      *                  *---------------------------------------------*
           move      w-pds-pos            to   w-pds-w03              .
           add       w-pds-lun            to   w-pds-w03              .
           move      high-value           to   w-pds-w02
                                              (w-pds-w03)             .
      *                  *---------------------------------------------*
      *                  * Pointer iniziale per unstring               *
      *                  *---------------------------------------------*
           move      w-pds-pos            to   w-pds-w03              .
      *                  *---------------------------------------------*
      *                  * Estrazione vera e propria                   *
      *                  *---------------------------------------------*
           unstring  w-pds-w01  delimited by   high-value
                                          into w-pds-alf
                                  with pointer w-pds-w03              .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     xcv-est-val-999.
       xcv-est-val-200.
      *              *-------------------------------------------------*
      *              * Estrazione valore numerico intero               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea interessata in area di lavoro         *
      *                  *---------------------------------------------*
           move      w-pds-rig
                    (w-pds-lin)           to   w-pds-w01              .
      *                  *---------------------------------------------*
      *                  * Estrazione rappresentazione alfanumerica    *
      *                  *---------------------------------------------*
           move      spaces               to   w-pds-w04              .
           move      w-pds-pos            to   w-pds-w03              .
           add       w-pds-lun            to   w-pds-w03              .
           move      high-value           to   w-pds-w02
                                              (w-pds-w03)             .
           move      w-pds-pos            to   w-pds-w03              .
           unstring  w-pds-w01  delimited by   high-value
                                          into w-pds-w04
                                  with pointer w-pds-w03              .
      *                  *---------------------------------------------*
      *                  * Conversione rappresentazione alfanumerica   *
      *                  * in rappresentazione numerica                *
      *                  *---------------------------------------------*
           move      zero                 to   w-pds-num              .
           move      zero                 to   w-pds-w08              .
       xcv-est-val-300.
           add       1                    to   w-pds-w08              .
           if        w-pds-w08            >    25
                     go to xcv-est-val-999.
           if        w-pds-w06
                    (w-pds-w08)           <    "0" or
                     w-pds-w06
                    (w-pds-w08)           >    "9"
                     go to xcv-est-val-300.
           multiply  10                   by   w-pds-num              .
           add       w-pds-w07
                    (w-pds-w08)           to   w-pds-num              .
           go to     xcv-est-val-300.
       xcv-est-val-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Lettura della variabile di environment          *
      *              *-------------------------------------------------*
           move      "I2"                 to   o-ope                  .
           move      "POST"               to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           if        o-pat                =    "S"
                     move  "S"            to   w-exe-flg-btc
           else      move  "N"            to   w-exe-flg-btc          .
      *              *-------------------------------------------------*
      *              * Eventuali forzature per batch                   *
      *              *-------------------------------------------------*
           if        w-exe-flg-btc        not  = "S"
                     go to pre-exe-pgm-999.
      *                  *---------------------------------------------*
      *                  * Determinazione data attuale                 *
      *                  *---------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Nome archivio importazione                  *
      *                  *---------------------------------------------*
           move      "/abd/asc/tmp/ZTTGCZ.SQZ"
                                          to   rr-pth-inp             .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Pathname file in input                      *
      *                  *---------------------------------------------*
           perform   acc-pth-inp-000      thru acc-pth-inp-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "Conferma impostazioni (S/N/E) ?"
                                          to   v-not                  .
           move      "S"                  to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
           move      spaces               to   rr-pth-inp             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Pathname file in input                          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      32                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Pathname del file in input     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Pathanme file in input               *
      *    *-----------------------------------------------------------*
       acc-pth-inp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione eventuale default              *
      *                  *---------------------------------------------*
           if        rr-pth-inp           not  = spaces
                     go to acc-pth-inp-100.
      *
           move      "/abd/asc/tmp/ZTTGCZ.SQZ"
                                          to   rr-pth-inp             .
       acc-pth-inp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      rr-pth-inp           to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-pth-inp-999.
       acc-pth-inp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-pth-inp             .
       acc-pth-inp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        rr-pth-inp           =    spaces
                     go to acc-pth-inp-100.
       acc-pth-inp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-pth-inp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-pth-inp-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-pth-inp-100.
       acc-pth-inp-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
      *              *-------------------------------------------------*
      *              * Controlli                                       *
      *              *-------------------------------------------------*
           if        rr-pth-inp           =    spaces
                     move  "#"            to   w-cnt-tdo-ric-flg
                     go to tdo-ric-sel-999.
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di conversione : Open files                         *
      *    *-----------------------------------------------------------*
       xcv-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-xcv-flg-sub      .
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di fine file             *
      *              *-------------------------------------------------*
           move      spaces               to   w-pds-mff              .
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di inizio pagina in so-  *
      *              * speso                                           *
      *              *-------------------------------------------------*
           move      "0"                  to   w-pds-mip              .
      *              *-------------------------------------------------*
      *              * Numero di linee lette : zero                    *
      *              *-------------------------------------------------*
           move      zero                 to   w-pds-nll              .
      *              *-------------------------------------------------*
      *              * Numero di linee ignorate : zero                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-pds-nli              .
      *              *-------------------------------------------------*
      *              * Numero di pagine lette : zero                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-pds-npl              .
      *              *-------------------------------------------------*
      *              * Numero di records scritti : zero                *
      *              *-------------------------------------------------*
           move      zero                 to   w-pds-dcp              .
           move      zero                 to   w-pds-mau              .
           move      zero                 to   w-pds-aaf              .
           move      zero                 to   w-pds-aaq              .
      *              *-------------------------------------------------*
      *              * Eventuali forzature se esecuzione batch         *
      *              *-------------------------------------------------*
           if        w-exe-flg-btc        =    "S"
                     go to xcv-opn-fls-100.
      *              *-------------------------------------------------*
      *              * Preparazione area per visualizzazione avanza-   *
      *              * mento esecuzione                                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      32                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero linee  lette            :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      32                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero linee  ignorate         :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      32                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero pagine lette            :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      32                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero records scritti [dcp]   :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       xcv-opn-fls-100.
      *              *-------------------------------------------------*
      *              * Apertura del file in input                      *
      *              *-------------------------------------------------*
           move      "OI"                 to   g-ope                  .
           move      "cvi "               to   g-nam                  .
           move      rr-pth-inp           to   g-pat                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *              *-------------------------------------------------*
      *              * Test se errori                                  *
      *              *-------------------------------------------------*
           if        g-sts                =    e-not-err
                     go to xcv-opn-fls-200.
      *              *-------------------------------------------------*
      *              * Se errori                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Status di uscita da routine                 *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-xcv-flg-sub      .
      *                  *---------------------------------------------*
      *                  * Messaggio di errore sull'input              *
      *                  *---------------------------------------------*
           perform   msg-inp-err-000      thru msg-inp-err-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     xcv-opn-fls-999.
       xcv-opn-fls-200.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di testo da agganciare     *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-txt-agg-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore testo da agganciare   *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-txt-agg-num      .
      *              *-------------------------------------------------*
      *              * [mmz]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
      *              *-------------------------------------------------*
      *              * Test se errori                                  *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to xcv-opn-fls-999.
      *              *-------------------------------------------------*
      *              * Se errori                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Status di uscita da routine                 *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-xcv-flg-sub      .
      *                  *---------------------------------------------*
      *                  * Messaggio di errore sull'output             *
      *                  *---------------------------------------------*
           perform   msg-out-err-000      thru msg-out-err-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     xcv-opn-fls-999.
       xcv-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di conversione : Close files                        *
      *    *-----------------------------------------------------------*
       xcv-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-xcv-flg-sub      .
       xcv-cls-fls-100.
      *              *-------------------------------------------------*
      *              * [mmz]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
      *              *-------------------------------------------------*
      *              * Chiusura del file in input                      *
      *              *-------------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo utilizzato                 *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mcvinp"                         .
       xcv-cls-fls-200.
       xcv-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di conversione : Messaggio per nessuna registrazio- *
      *    *                        ne da elaborare                    *
      *    *-----------------------------------------------------------*
       xcv-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessuna registrazione da elaborare !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       xcv-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di conversione : Lettura e bufferizzazione di una   *
      *    *                        pagina di stampa                   *
      *    *-----------------------------------------------------------*
       xcv-lbu-pds-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-xcv-flg-sub      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di divisione    *
      *              * della pagina                                    *
      *              *-------------------------------------------------*
           if        w-pds-tdp            =    "F"
                     go to xcv-lbu-pds-100
           else      go to xcv-lbu-pds-400.
       xcv-lbu-pds-100.
      *              *-------------------------------------------------*
      *              * Se pagina a formato fisso                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se marker di fine file in On           *
      *                  *---------------------------------------------*
           if        w-pds-mff            not  = spaces
                     move  "#"            to   w-cnt-xcv-flg-sub
                     go to xcv-lbu-pds-999.
      *                  *---------------------------------------------*
      *                  * Lettura della pagina di stampa              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Numero linee lette per la pagina : zero *
      *                      *-----------------------------------------*
           move      zero                 to   w-pds-ctr              .
       xcv-lbu-pds-125.
      *                      *-----------------------------------------*
      *                      * Lettura linea                           *
      *                      *-----------------------------------------*
           move      "GN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                      *-----------------------------------------*
      *                      * Test se errori                          *
      *                      *-----------------------------------------*
           if        g-sts                =    e-not-err
                     go to xcv-lbu-pds-200.
           if        g-sts                =    e-end-fil
                     go to xcv-lbu-pds-175.
       xcv-lbu-pds-150.
      *                      *-----------------------------------------*
      *                      * Se errore di i-o                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Status di uscita da routine         *
      *                          *-------------------------------------*
           move      "#"                  to   w-cnt-xcv-flg-sub      .
      *                          *-------------------------------------*
      *                          * Messaggio di errore sull'input      *
      *                          *-------------------------------------*
           perform   msg-inp-err-000      thru msg-inp-err-999        .
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     xcv-lbu-pds-999.
       xcv-lbu-pds-175.
      *                      *-----------------------------------------*
      *                      * Se fine file                            *
      *                      *-----------------------------------------*
           if        w-pds-ctr            =    zero
                     move  "#"            to   w-cnt-xcv-flg-sub
                     go to xcv-lbu-pds-999
           else      move  "#"            to   w-pds-mff
                     go to xcv-lbu-pds-999.
       xcv-lbu-pds-200.
      *                      *-----------------------------------------*
      *                      * Se nessun errore                        *
      *                      *-----------------------------------------*
      *                              *---------------------------------*
      *                              * Incremento numero linee lette   *
      *                              *---------------------------------*
           add       1                    to   w-pds-nll              .
      *                              *---------------------------------*
      *                              * Eventuali forzature se batch    *
      *                              *---------------------------------*
           if        w-exe-flg-btc        =    "S"
                     go to xcv-lbu-pds-210.
      *                              *---------------------------------*
      *                              * Visualizzo numero linee lette   *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      17                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      w-pds-nll            to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       xcv-lbu-pds-210.
      *                          *-------------------------------------*
      *                          * Test se prima linea letta           *
      *                          *-------------------------------------*
           if        w-pds-ctr            >    zero
                     go to xcv-lbu-pds-225.
      *                          *-------------------------------------*
      *                          * Se prima linea letta nella pagina   *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Normalizzazione area pagina     *
      *                              *---------------------------------*
           move      spaces               to   w-pds-pag              .
      *                              *---------------------------------*
      *                              * Incremento numero pagine lette  *
      *                              *---------------------------------*
           add       1                    to   w-pds-npl              .
      *                              *---------------------------------*
      *                              * Eventuali forzature se batch    *
      *                              *---------------------------------*
           if        w-exe-flg-btc        =    "S"
                     go to xcv-lbu-pds-225.
      *                              *---------------------------------*
      *                              * Visualizzo numero pagine lette  *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      19                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      w-pds-npl            to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       xcv-lbu-pds-225.
      *                          *-------------------------------------*
      *                          * Se non prima linea letta            *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Incremento numero linee lette   *
      *                              *---------------------------------*
           add       1                    to   w-pds-ctr              .
      *                              *---------------------------------*
      *                              * Bufferizzazione linea letta     *
      *                              *---------------------------------*
           move      g-rec                to   w-pds-rig
                                              (w-pds-ctr)             .
       xcv-lbu-pds-250.
      *                          *-------------------------------------*
      *                          * Test se raggiunta l'ultima linea    *
      *                          *-------------------------------------*
           if        w-pds-ctr            =    w-pds-max
                     go to xcv-lbu-pds-300.
       xcv-lbu-pds-275.
      *                          *-------------------------------------*
      *                          * Se non raggiunta l'ultima linea     *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Riciclo a lettura linea         *
      *                              *---------------------------------*
           go to     xcv-lbu-pds-125.
       xcv-lbu-pds-300.
      *                          *-------------------------------------*
      *                          * Se raggiunta l'ultima linea         *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     xcv-lbu-pds-999.
       xcv-lbu-pds-400.
      *              *-------------------------------------------------*
      *              * Se pagina a formato variabile, con riconosci-   *
      *              * mento dell'inizio pagina                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero linee lette per la pagina : zero     *
      *                  *---------------------------------------------*
           move      zero                 to   w-pds-ctr              .
      *                  *---------------------------------------------*
      *                  * Test se flag di inizio pagina in sospeso a  *
      *                  * "9"                                         *
      *                  *---------------------------------------------*
           if        w-pds-mip            not  = "9"
                     go to xcv-lbu-pds-415.
      *                  *---------------------------------------------*
      *                  * Se flag di inizio pagina in sospeso a "9"   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di fine file                       *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-xcv-flg-sub      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     xcv-lbu-pds-999.
       xcv-lbu-pds-415.
      *                  *---------------------------------------------*
      *                  * Test se flag di inizio pagina in sospeso a  *
      *                  * "2"                                         *
      *                  *---------------------------------------------*
           if        w-pds-mip            not  = "2"
                     go to xcv-lbu-pds-425.
      *                  *---------------------------------------------*
      *                  * Se flag di inizio pagina in sospeso a "2"   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di inizio pagina in sospeso a "0"  *
      *                      *-----------------------------------------*
           move      "0"                  to   w-pds-mip              .
      *                      *-----------------------------------------*
      *                      * Simulazione di lettura per ripresa dal  *
      *                      * buffer di salvataggio                   *
      *                      *-----------------------------------------*
           move      w-pds-lip            to   g-rec                  .
           move      e-not-err            to   g-sts                  .
      *                      *-----------------------------------------*
      *                      * Continuazione a dopo lettura            *
      *                      *-----------------------------------------*
           go to     xcv-lbu-pds-450.
       xcv-lbu-pds-425.
      *                  *---------------------------------------------*
      *                  * Lettura linea                               *
      *                  *---------------------------------------------*
           move      "GN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
       xcv-lbu-pds-450.
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        g-sts                =    e-not-err
                     go to xcv-lbu-pds-600.
           if        g-sts                =    e-end-fil
                     go to xcv-lbu-pds-500.
       xcv-lbu-pds-475.
      *                  *---------------------------------------------*
      *                  * Se errore di i-o                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di uscita da routine             *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-xcv-flg-sub      .
      *                      *-----------------------------------------*
      *                      * Messaggio di errore sull'input          *
      *                      *-----------------------------------------*
           perform   msg-inp-err-000      thru msg-inp-err-999        .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     xcv-lbu-pds-999.
       xcv-lbu-pds-500.
      *                  *---------------------------------------------*
      *                  * Se fine file                                *
      *                  *---------------------------------------------*
           if        w-pds-ctr            =    zero
                     move  "#"            to   w-cnt-xcv-flg-sub
                     go to xcv-lbu-pds-999
           else      move  "9"            to   w-pds-mip
                     go to xcv-lbu-pds-999.
       xcv-lbu-pds-600.
      *                  *---------------------------------------------*
      *                  * Se nessun errore                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Incremento numero linee lette           *
      *                      *-----------------------------------------*
           add       1                    to   w-pds-nll              .
      *                      *-----------------------------------------*
      *                      * Eventuali forzature se batch            *
      *                      *-----------------------------------------*
           if        w-exe-flg-btc        =    "S"
                     go to xcv-lbu-pds-800.
      *                      *-----------------------------------------*
      *                      * Visualizzo numero linee lette           *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      17                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      w-pds-nll            to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Test se linea di inizio pagina          *
      *                      *-----------------------------------------*
       xcv-lbu-pds-800.
      *                      *-----------------------------------------*
      *                      * Se linea di inizio pagina               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di inizio pagina       *
      *                          *-------------------------------------*
           if        w-pds-mip            =    "0"
                     go to xcv-lbu-pds-810
           else      go to xcv-lbu-pds-825.
       xcv-lbu-pds-810.
      *                          *-------------------------------------*
      *                          * Se flag di inizio pagina a "0"      *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Flag di inizio pagina a "1"     *
      *                              *---------------------------------*
           move      "1"                  to   w-pds-mip              .
      *                              *---------------------------------*
      *                              * Normalizzazione area pagina     *
      *                              *---------------------------------*
           move      spaces               to   w-pds-pag              .
      *                              *---------------------------------*
      *                              * Incremento numero pagine        *
      *                              *---------------------------------*
           add       1                    to   w-pds-npl              .
      *                              *---------------------------------*
      *                              * Eventuali forzature se batch    *
      *                              *---------------------------------*
           if        w-exe-flg-btc        =    "S"
                     go to xcv-lbu-pds-815.
      *                              *---------------------------------*
      *                              * Visualizzo numero pagine        *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      19                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      w-pds-npl            to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       xcv-lbu-pds-815.
      *                              *---------------------------------*
      *                              * Test se entro max linee         *
      *                              *---------------------------------*
           if        w-pds-ctr            <    96
                     go to xcv-lbu-pds-820.
      *                              *---------------------------------*
      *                              * Se no                           *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Incremento numero linee i-  *
      *                                  * gnorate                     *
      *                                  *-----------------------------*
           add       1                    to   w-pds-nli              .
      *                                  *-----------------------------*
      *                                  * Eventuali forzature batch   *
      *                                  *-----------------------------*
           if        w-exe-flg-btc        =    "S"
                     go to xcv-lbu-pds-817.
      *                                  *-----------------------------*
      *                                  * Visualizzo numero linee i-  *
      *                                  * gnorate                     *
      *                                  *-----------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      18                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      w-pds-nli            to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       xcv-lbu-pds-817.
      *                                  *-----------------------------*
      *                                  * Riciclo a lettura ignorando *
      *                                  * la linea letta              *
      *                                  *-----------------------------*
           go to     xcv-lbu-pds-425.
       xcv-lbu-pds-820.
      *                              *---------------------------------*
      *                              * Se si'                          *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Incremento numero linee     *
      *                                  * lette per la pagina         *
      *                                  *-----------------------------*
           add       1                    to   w-pds-ctr              .
      *                                  *-----------------------------*
      *                                  * Bufferizzo linea letta      *
      *                                  *-----------------------------*
           move      g-rec                to   w-pds-rig
                                              (w-pds-ctr)             .
      *                                  *-----------------------------*
      *                                  * Riciclo a lettura           *
      *                                  *-----------------------------*
           go to     xcv-lbu-pds-425.
       xcv-lbu-pds-825.
      *                          *-------------------------------------*
      *                          * Se flag di inizio pagina a "1"      *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Flag di inizio pagina a "2"     *
      *                              *---------------------------------*
           move      "2"                  to   w-pds-mip              .
      *                              *---------------------------------*
      *                              * Salvataggio linea letta         *
      *                              *---------------------------------*
           move      g-rec                to   w-pds-lip              .
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     xcv-lbu-pds-999.
       xcv-lbu-pds-900.
      *                      *-----------------------------------------*
      *                      * Se non linea di inizio pagina           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di inizio pagina       *
      *                          *-------------------------------------*
           if        w-pds-mip            =    "0"
                     go to xcv-lbu-pds-910
           else      go to xcv-lbu-pds-915.
       xcv-lbu-pds-910.
      *                          *-------------------------------------*
      *                          * Se flag di inizio pagina a "0"      *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Incremento numero linee ignora- *
      *                              * te                              *
      *                              *---------------------------------*
           add       1                    to   w-pds-nli              .
      *                                  *-----------------------------*
      *                                  * Eventuali forzature batch   *
      *                                  *-----------------------------*
           if        w-exe-flg-btc        =    "S"
                     go to xcv-lbu-pds-912.
      *                              *---------------------------------*
      *                              * Visualizzo numero linee ignora- *
      *                              * te                              *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      18                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      w-pds-nli            to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       xcv-lbu-pds-912.
      *                              *---------------------------------*
      *                              * Riciclo a lettura ignorando la  *
      *                              * linea letta                     *
      *                              *---------------------------------*
           go to     xcv-lbu-pds-425.
       xcv-lbu-pds-915.
      *                          *-------------------------------------*
      *                          * Se flag di inizio pagina a "1"      *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * A bufferizzazione linea letta   *
      *                              *---------------------------------*
           go to     xcv-lbu-pds-815.
       xcv-lbu-pds-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di conversione : Trattamento pagina di stampa       *
      *    *-----------------------------------------------------------*
       xcv-trt-pds-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-xcv-flg-int      .
      *              *-------------------------------------------------*
      *              * Da buffer a file di output                      *
      *              *-------------------------------------------------*
           move      w-pds-pag            to   w-lds-000              .
       xcv-trt-pds-100.
      *              *-------------------------------------------------*
      *              * Trattamento pagina (di 1 linea)                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Estrazione codice prodotto                  *
      *                  *---------------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      07                   to   v-car                  .
           move      w-lds-001-num-pro    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-dkr-gia-num-pro      .
      *                  *---------------------------------------------*
      *                  * Estrazione giacenza 01                      *
      *                  *---------------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      15                   to   v-car                  .
           move      w-lds-001-gia-d01    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-dkr-gia-gia-d01      .
      *                  *---------------------------------------------*
      *                  * Estrazione giacenza 02                      *
      *                  *---------------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      15                   to   v-car                  .
           move      w-lds-001-gia-d02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-dkr-gia-gia-d02      .
       xcv-trt-pds-110.
      *                  *---------------------------------------------*
      *                  * Lettura [mmz] per la Sede - 01              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tentativo di lettura record [mmz]       *
      *                      *-----------------------------------------*
           move      01                   to   w-let-rec-mmz-dpz      .
           move      w-dkr-gia-num-pro    to   w-let-rec-mmz-pro      .
           perform   let-rec-mmz-000      thru let-rec-mmz-999        .
      *                          *-------------------------------------*
      *                          * Deviazione in funzione dell'esito   *
      *                          *-------------------------------------*
           if        w-let-rec-mmz-flg    not  = spaces
                     go to xcv-trt-pds-130.
       xcv-trt-pds-120.
      *                          *-------------------------------------*
      *                          * Se record [mmz] trovato             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Aggiornamento                   *
      *                              *---------------------------------*
           move      w-dkr-gia-gia-d01    to   w-cmp-rec-mmz-gia      .
           perform   rew-rec-mmz-000      thru rew-rec-mmz-999        .
      *                              *---------------------------------*
      *                              * Oltre                           *
      *                              *---------------------------------*
           go to     xcv-trt-pds-200.
       xcv-trt-pds-130.
      *                          *-------------------------------------*
      *                          * Se record [mmz] non trovato         *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Scrittura nuovo record [mmz]    *
      *                              *---------------------------------*
           move      01                   to   w-cmp-rec-mmz-dpz      .
           move      w-lds-001-num-pro    to   w-cmp-rec-mmz-pro      .
           move      w-dkr-gia-gia-d01    to   w-cmp-rec-mmz-gia      .
           perform   wrt-rec-mmz-000      thru wrt-rec-mmz-999        .
      *                              *---------------------------------*
      *                              * Oltre                           *
      *                              *---------------------------------*
           go to     xcv-trt-pds-200.
       xcv-trt-pds-200.
      *                  *---------------------------------------------*
      *                  * Lettura [mmz] per Verona - 02               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tentativo di lettura record [mmz]       *
      *                      *-----------------------------------------*
           move      02                   to   w-let-rec-mmz-dpz      .
           move      w-dkr-gia-num-pro    to   w-let-rec-mmz-pro      .
           perform   let-rec-mmz-000      thru let-rec-mmz-999        .
      *                          *-------------------------------------*
      *                          * Deviazione in funzione dell'esito   *
      *                          *-------------------------------------*
           if        w-let-rec-mmz-flg    not  = spaces
                     go to xcv-trt-pds-230.
       xcv-trt-pds-220.
      *                          *-------------------------------------*
      *                          * Se record [mmz] trovato             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Aggiornamento                   *
      *                              *---------------------------------*
           move      w-dkr-gia-gia-d02    to   w-cmp-rec-mmz-gia      .
           perform   rew-rec-mmz-000      thru rew-rec-mmz-999        .
      *                              *---------------------------------*
      *                              * Oltre                           *
      *                              *---------------------------------*
           go to     xcv-trt-pds-400.
       xcv-trt-pds-230.
      *                          *-------------------------------------*
      *                          * Se record [mmz] non trovato         *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Scrittura nuovo record [mmz]    *
      *                              *---------------------------------*
           move      02                   to   w-cmp-rec-mmz-dpz      .
           move      w-lds-001-num-pro    to   w-cmp-rec-mmz-pro      .
           move      w-dkr-gia-gia-d02    to   w-cmp-rec-mmz-gia      .
           perform   wrt-rec-mmz-000      thru wrt-rec-mmz-999        .
      *                              *---------------------------------*
      *                              * Oltre                           *
      *                              *---------------------------------*
           go to     xcv-trt-pds-400.
       xcv-trt-pds-400.
      *                  *---------------------------------------------*
      *                  * Incremento numero records scritti [dcp]     *
      *                  *---------------------------------------------*
           add       1                    to   w-pds-dcp              .
      *                  *---------------------------------------------*
      *                  * Oltre                                       *
      *                  *---------------------------------------------*
           go to     xcv-trt-pds-900.
       xcv-trt-pds-500.
      *              *-------------------------------------------------*
      *              * Aggiornamento del record [aaq]                  *
      *              *-------------------------------------------------*
       xcv-trt-pds-600.
      *              *-------------------------------------------------*
      *              * Aggiornamento del record [aaf]                  *
      *              *-------------------------------------------------*
       xcv-trt-pds-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     xcv-trt-pds-999.
       xcv-trt-pds-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di conversione : Messaggio di input i-o error       *
      *    *-----------------------------------------------------------*
       msg-inp-err-000.
      *              *-------------------------------------------------*
      *              * Eventuali forzature se esecuzione batch         *
      *              *-------------------------------------------------*
           if        w-exe-flg-btc        =    "S"
                     go to msg-inp-err-999.
      *              *-------------------------------------------------*
      *              * Eliminazione messaggio programma in esecuzione  *
      *              *-------------------------------------------------*
           move      "PX"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio di errore                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio immagine video                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      17                   to   v-lto                  .
           move      64                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Messaggio di errore all'interno del box     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prima riga                              *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      21                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      "Errore di i-o codice "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      40                   to   v-pos                  .
           move      g-sts                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      21                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      43                   to   v-pos                  .
           move      " su file in input.   "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Seconda riga                            *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      44                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      "Terminazione forzata del programma.         "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Terza riga                              *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      44                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      "        Digitare 'OK' per presa visione :   "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione OK di presa visione            *
      *                  *---------------------------------------------*
           move      spaces               to   v-alf                  .
       msg-inp-err-600.
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      61                   to   v-pos                  .
           move      "EXIT"               to   v-pfk (20)             .
           move      "DO  "               to   v-pfk (05)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                =    "EXIT" or
                     v-key                =    "DO  "
                     go to msg-inp-err-800.
           if        v-alf                not  = "OK"
                     go to msg-inp-err-600.
       msg-inp-err-800.
      *                  *---------------------------------------------*
      *                  * Ripristino immagine video                   *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       msg-inp-err-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di conversione : Messaggio di output i-o error      *
      *    *-----------------------------------------------------------*
       msg-out-err-000.
      *              *-------------------------------------------------*
      *              * Eliminazione messaggio programma in esecuzione  *
      *              *-------------------------------------------------*
           move      "PX"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio di errore                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio immagine video                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      17                   to   v-lto                  .
           move      64                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Messaggio di errore all'interno del box     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prima riga                              *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      21                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      "Errore di i-o codice "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      40                   to   v-pos                  .
           move      g-sts                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      21                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      43                   to   v-pos                  .
           move      " su file in output.  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Seconda riga                            *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      44                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      "Terminazione forzata del programma.         "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Terza riga                              *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      44                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      "        Digitare 'OK' per presa visione :   "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione OK di presa visione            *
      *                  *---------------------------------------------*
           move      spaces               to   v-alf                  .
       msg-out-err-600.
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      61                   to   v-pos                  .
           move      "EXIT"               to   v-pfk (20)             .
           move      "DO  "               to   v-pfk (05)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                =    "EXIT" or
                     v-key                =    "DO  "
                     go to msg-out-err-800.
           if        v-alf                not  = "OK"
                     go to msg-out-err-600.
       msg-out-err-800.
      *                  *---------------------------------------------*
      *                  * Ripristino immagine video                   *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       msg-out-err-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di conversione : Trasferimento finale dei files     *
      *    *                        generati server                    *
      *    *-----------------------------------------------------------*
       trf-fls-srv-000.
       trf-fls-srv-999.
           exit.

      *    *===========================================================*
      *    * Tentativo di lettura record [mmz]                         *
      *    *-----------------------------------------------------------*
       let-rec-mmz-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione preliminare record              *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-rec-mmz-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione record di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-rec-mmz-rec      .
       let-rec-mmz-100.
      *              *-------------------------------------------------*
      *              * Determinazione data attuale                     *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Lettura record [mmz]                            *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "MAGARC    "         to   f-key                  .
           move      s-saa                to   rf-mmz-ann-ese         .
           move      w-let-rec-mmz-dpz    to   rf-mmz-cod-dpz         .
           move      01                   to   rf-mmz-tip-mag         .
           move      w-let-rec-mmz-pro    to   rf-mmz-num-mag         .
           move      spaces               to   rf-mmz-var-mag         .
           move      "T"                  to   rf-mmz-tip-ctm         .
           move      "VE "                to   rf-mmz-cod-ctm         .
           move      "F"                  to   rf-mmz-tip-arc         .
           move      0000001              to   rf-mmz-cod-arc         .
           move      spaces               to   rf-mmz-dpz-arc         .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
       let-rec-mmz-200.
      *              *-------------------------------------------------*
      *              * Test su esito lettura                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se record non trovato                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-let-rec-mmz-flg
                     go to let-rec-mmz-900.
      *                  *---------------------------------------------*
      *                  * Se record trovato                           *
      *                  *---------------------------------------------*
           move      rf-mmz               to   w-let-rec-mmz-rec      .
       let-rec-mmz-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-rec-mmz-999.
       let-rec-mmz-999.
           exit.

      *    *===========================================================*
      *    * Scrittura record [mmz]                                    *
      *    *-----------------------------------------------------------*
       wrt-rec-mmz-000.
      *              *-------------------------------------------------*
      *              * Determinazione data attuale                     *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
           move      s-saa                to   rf-mmz-ann-ese         .
           move      w-cmp-rec-mmz-dpz    to   rf-mmz-cod-dpz         .
           move      01                   to   rf-mmz-tip-mag         .
           move      w-cmp-rec-mmz-pro    to   rf-mmz-num-mag         .
           move      spaces               to   rf-mmz-var-mag         .
           move      "T"                  to   rf-mmz-tip-ctm         .
           move      "VE"                 to   rf-mmz-cod-ctm         .
           move      "F"                  to   rf-mmz-tip-arc         .
           move      0000001              to   rf-mmz-cod-arc         .
           move      spaces               to   rf-mmz-dpz-arc         .
           move      zero                 to   rf-mmz-qta-ini         .
      *
           initialize                          rf-mmz-prg-mes (01)    .
           initialize                          rf-mmz-prg-mes (02)    .
           initialize                          rf-mmz-prg-mes (03)    .
           initialize                          rf-mmz-prg-mes (04)    .
           initialize                          rf-mmz-prg-mes (05)    .
           initialize                          rf-mmz-prg-mes (06)    .
           initialize                          rf-mmz-prg-mes (07)    .
           initialize                          rf-mmz-prg-mes (08)    .
           initialize                          rf-mmz-prg-mes (09)    .
           initialize                          rf-mmz-prg-mes (10)    .
           initialize                          rf-mmz-prg-mes (11)    .
           initialize                          rf-mmz-prg-mes (12)    .
      *
           move      w-cmp-rec-mmz-gia    to   rf-mmz-prg-deb (02)    .
      *
           move      zero                 to   rf-mmz-dip-ife         .
           move      zero                 to   rf-mmz-din-ife         .
           move      spaces               to   rf-mmz-alx-exp         .
      *              *-------------------------------------------------*
      *              * Put record                                      *
      *              *-------------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
       wrt-rec-mmz-999.
           exit.

      *    *===========================================================*
      *    * Ri-scrittura record [mmz]                                 *
      *    *-----------------------------------------------------------*
       rew-rec-mmz-000.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
           perform   cmp-rec-mmz-000      thru cmp-rec-mmz-999        .
      *              *-------------------------------------------------*
      *              * Forced put record                               *
      *              *-------------------------------------------------*
           move      "FP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
       rew-rec-mmz-999.
           exit.

      *    *===========================================================*
      *    * Composizione record [mmz]                                 *
      *    *-----------------------------------------------------------*
       cmp-rec-mmz-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
           move      w-cmp-rec-mmz-rec    to   rf-mmz                 .
           move      w-cmp-rec-mmz-gia    to   rf-mmz-prg-deb (02)    .
       cmp-rec-mmz-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .
