       Identification Division.
       Program-Id.                                 pagb6500           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    sir                 *
      *                        Area gestionale:    agb                 *
      *                                Settore:    edi                 *
      *                                   Fase:    agb650              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 16/04/07    *
      *                       Ultima revisione:    NdK del 12/09/25    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Import conferme ordini provenienti da EDI   *
      *                    via Retarus                                 *
      *                                                                *
      *                    Files in /abd/asc/imp (/rtr in link)        *
      *                                                                *
      *                    Impiego moduli Perl Lettura (t_retarus_sel) *
      *                                        Cancell.(t_retarus_del) *
      *                                                                *
      *                                     in CRONTAB (t_retarus_in)  *
      *                                                                *
      *                  / ------------------------------------------- *
      *                  | I files in 'cnv' relativi a 'her' servono   *
      *                  | a sistemare eventuali discrepanze: in par-  *
      * NOTE IMPORTANTI! / ticolare 'pagb6590' che aggiorna anche il   *
      *                  \ database MySQL (da verificare)              *
      *                  | In 'orf520' c'e' comunque la possibilita'   *
      *                  | di forzare il flag '#' o usando 'agb950'    *
      *                  | (cioe' 'sirher03')                          *
      *                  \ ------------------------------------------- *
      *                    In data 30/08/07 sono state inibite le      *
      *                    scritture su file [ofr]                     *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * File name in chiave                               *
      *            *---------------------------------------------------*
               10  srt-key-nam            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Protocollo ordine                                 *
      *            *---------------------------------------------------*
               10  srt-num-prt            pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Data conferma ordine                              *
      *            *---------------------------------------------------*
               10  srt-key-scd            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Tipo record in chiave                             *
      *            *---------------------------------------------------*
               10  srt-key-rec            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Progressivo riga EDI                              *
      *            *---------------------------------------------------*
               10  srt-edi-prg            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Progressivo di rilascio file                      *
      *            *---------------------------------------------------*
               10  srt-fil-prg            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Progressivo riga ordine                           *
      *            *---------------------------------------------------*
               10  srt-num-prg            pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Progressivo riga EDI di riferimento               *
      *            *---------------------------------------------------*
               10  srt-edi-rif            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo record                                       *
      *            *---------------------------------------------------*
               10  srt-tip-rec            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * File name                                         *
      *            *---------------------------------------------------*
               10  srt-fil-nam            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Intero record di input                            *
      *            *---------------------------------------------------*
               10  srt-rec-inp.
                   15  filler occurs  512 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Intero record [oft]                               *
      *            *---------------------------------------------------*
               10  srt-rec-oft.
                   15  filler occurs 1024 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Intero record [ofr]                               *
      *            *---------------------------------------------------*
               10  srt-rec-ofr.
                   15  filler occurs 1024 pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "sir"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "agb"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "edi"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "agb650"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pagb6500"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "  TRATTAMENTO FILES 'CSV.ok' DA RETARUS "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "msegrt" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mpslct" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/r"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/g"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mopsys" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine sel-prm-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-sel-prm-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste per programma di esecuzione       *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico                       *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No richiesta di selezione stampa               *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area per preparazione parametri selezione stampa      *
      *        *-------------------------------------------------------*
           05  w-cnt-stp.
               10  w-cnt-stp-tip-sel      pic  x(10)                  .
               10  w-cnt-stp-cod-stp      pic  x(08)                  .
               10  w-cnt-stp-tip-sta      pic  x(01)                  .
               10  w-cnt-stp-cod-mod      pic  x(08)                  .
               10  w-cnt-stp-tip-mod      pic  x(01)                  .
               10  w-cnt-stp-amp-lin      pic  9(03)                  .
               10  w-cnt-stp-top-lin      pic  9(04)                  .
               10  w-cnt-stp-lin-min      pic  9(02)                  .
               10  w-cnt-stp-bot-lin      pic  9(04)                  .
               10  w-cnt-stp-amp-car      pic  9(02)v9(02)            .
               10  w-cnt-stp-alt-int      pic  9(02)v9(02)            .
               10  w-cnt-stp-esp-fut      pic  x(99)                  .
               10  w-cnt-stp-fnz-spc      pic  x(99)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale                         *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .

      *    *===========================================================*
      *    * Records files                                             *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [aaq]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfaaq"                          .
      *        *-------------------------------------------------------*
      *        * [oft]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orf/fls/rec/rfoft"                          .
      *        *-------------------------------------------------------*
      *        * [ofr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orf/fls/rec/rfofr"                          .
      *        *-------------------------------------------------------*
      *        * [hed]                                                 *
      *        *-------------------------------------------------------*
           copy      "sir/agb/fls/rec/rfhed"                          .
      *        *-------------------------------------------------------*
      *        * [her]                                                 *
      *        *-------------------------------------------------------*
           copy      "sir/agb/fls/rec/rfher"                          .

      *    *===========================================================*
      *    * Work-area richieste per stampa                            *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Codice fornitore                                      *
      *        *-------------------------------------------------------*
           05  rr-cod-fnt                 pic  9(07)                  .
           05  rr-cod-fnt-rag             pic  x(40)                  .
           05  rr-cod-fnt-vlt             pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Tipo esecuzione                                       *
      *        *                                                       *
      *        * - 01 : Prova                                          *
      *        * - 02 : Definitivo                                     *
      *        *-------------------------------------------------------*
           05  rr-tip-exe                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Opzioni di stampa                                     *
      *        *  - Spaces : No                                        *
      *        *  - X      : Si                                        *
      *        *-------------------------------------------------------*
           05  rr-opz-stp.
      *            *---------------------------------------------------*
      *            * Dettaglio ordini                                  *
      *            *---------------------------------------------------*
               10  rr-opz-stp-det         pic  x(01)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo esecuzione                            *
      *        *-------------------------------------------------------*
           05  w-exp-tip-exe.
               10  w-exp-tip-exe-num      pic  9(02)       value 2    .
               10  w-exp-tip-exe-lun      pic  9(02)       value 30   .
               10  w-exp-tip-exe-tbl.
                   15  filler             pic  x(30) value
                            "aggiornamento di Prova        "          .
                   15  filler             pic  x(30) value
                            "aggiornamento Definitivo      "          .
      *        *-------------------------------------------------------*
      *        * Work per : Opzioni di stampa                          *
      *        *-------------------------------------------------------*
           05  w-exp-opz-stp.
               10  w-exp-opz-stp-num      pic  9(02)       value 1    .
               10  w-exp-opz-stp-lun      pic  9(02)       value 25   .
               10  w-exp-opz-stp-tbl.
                   15  filler             pic  x(25) value
                            "[ ] Dettaglio righe      "               .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det elementi record                          *
      *        *-------------------------------------------------------*
           05  w-det-rec.
               10  w-det-rec-str-del      pic  x(01) value ","        .
               10  w-det-rec-num-ctr      pic  9(03)                  .
               10  w-det-rec-num-mis      pic  9(03) value 01         .
               10  w-det-rec-num-mas      pic  9(03) value 14         .
               10  w-det-rec-str-alf      pic  x(200)                 .
               10  w-det-rec-str-al1      pic  x(200)                 .
               10  w-det-rec-str-al2      pic  x(200)                 .
               10  w-det-rec-str-ext      pic  x(100)                 .
      *        *-------------------------------------------------------*
      *        * Work per Det numero documento                         *
      *        *-------------------------------------------------------*
           05  w-det-num-oft.
      *            *---------------------------------------------------*
      *            * Valori in entrata                                 *
      *            *---------------------------------------------------*
               10  w-det-num-oft-dds      pic  9(07)                  .
               10  w-det-num-oft-nds      pic  9(11)                  .
               10  w-det-num-oft-nds-r redefines
                   w-det-num-oft-nds.
                   15  w-det-num-oft-nsa  pic  9(03)                  .
                   15  w-det-num-oft-ndp  pic  9(02)                  .
                   15  w-det-num-oft-npg  pic  9(06)                  .
               10  w-det-num-oft-dpz      pic  9(02)                  .
               10  w-det-num-oft-sgl      pic  x(03)                  .
               10  w-det-num-oft-saa      pic  9(03)                  .
               10  w-det-num-oft-scd      pic  9(07)                  .
               10  w-det-num-oft-sai      pic  9(03)                  .
               10  w-det-num-oft-sdt      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Valori in uscita                                  *
      *            *---------------------------------------------------*
               10  w-det-num-oft-sel      pic  x(01)                  .
               10  w-det-num-oft-tof      pic  x(05)                  .
               10  w-det-num-oft-dat      pic  9(07)                  .
               10  w-det-num-oft-num      pic  9(11)                  .
               10  w-det-num-oft-prt      pic  9(11)                  .
               10  w-det-num-oft-prg      pic  9(05)                  .
               10  w-det-num-oft-rpg      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Valori di comodo                                  *
      *            *---------------------------------------------------*
               10  w-det-num-oft-ctr      pic  9(01)                  .
               10  w-det-num-oft-dtw      pic  9(08)                  .
               10  w-det-num-oft-dtw-r redefines
                   w-det-num-oft-dtw.
                   15  w-det-num-oft-sew  pic  9(02)                  .
                   15  w-det-num-oft-anw  pic  9(02)                  .
                   15  w-det-num-oft-msw  pic  9(02)                  .
                   15  w-det-num-oft-giw  pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det progressivo riga libero                  *
      *        *-------------------------------------------------------*
           05  w-det-prg-ofr.
      *            *---------------------------------------------------*
      *            * Valori in input                                   *
      *            *---------------------------------------------------*
               10  w-det-prg-ofr-prt      pic  9(11)                  .
               10  w-det-prg-ofr-prg      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Valore determinato                                *
      *            *---------------------------------------------------*
               10  w-det-prg-ofr-new      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det numero documento                         *
      *        *-------------------------------------------------------*
           05  w-det-num-doc.
      *            *---------------------------------------------------*
      *            * Comodo                                            *
      *            *---------------------------------------------------*
               10  w-det-num-doc-num      pic  x(10)                  .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione importo in riga  *
      *    *-----------------------------------------------------------*
           copy      "pgm/ffo/prg/cpy/dimpacq0.dtl"                   .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [fnt]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-fnt.
               10  w-let-arc-fnt-flg      pic  x(01)                  .
               10  w-let-arc-fnt-cod      pic  9(07)                  .
               10  w-let-arc-fnt-rag      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcf]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcf.
               10  w-let-arc-dcf-flg      pic  x(01)                  .
               10  w-let-arc-dcf-fnt      pic  9(07)                  .
               10  w-let-arc-dcf-dpz      pic  x(04)                  .
               10  w-let-arc-dcf-rag      pic  x(40)                  .
               10  w-let-arc-dcf-vlt      pic  x(03)                  .

      *    *===========================================================*
      *    * Link-area per accettazione codice commerciale fornitore   *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/acmndcf0.acl"                   .

      *    *===========================================================*
      *    * File area generica                                        *
      *    *-----------------------------------------------------------*
       01  f-xxx.
           05  f-xxx-pat                  pic  x(80)                  .
           05  f-xxx-nam                  pic  x(04)                  .
           05  f-xxx-npe                  pic  x(10)                  .
           05  f-xxx-ppb                  pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per salvataggi                                  *
      *    *-----------------------------------------------------------*
       01  w-sav.
      *        *-------------------------------------------------------*
      *        * Area per salvataggio [ofr]                            *
      *        *-------------------------------------------------------*
           05  w-sav-rec-ofr.
               10  filler occurs 1024     pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area generica                                        *
      *    *-----------------------------------------------------------*
       01  w-gen.
      *        *-------------------------------------------------------*
      *        * Buffer per i filename                                 *
      *        *-------------------------------------------------------*
           05  w-gen-buf-gen.
      *            *---------------------------------------------------*
      *            * Contatore elementi                                *
      *            *---------------------------------------------------*
               10  w-gen-buf-ctr          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Contatori di comodo                               *
      *            *---------------------------------------------------*
               10  w-gen-buf-c01          pic  9(03)                  .
               10  w-gen-buf-c02          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Max elementi                                      *
      *            *---------------------------------------------------*
               10  w-gen-buf-max          pic  9(03)    value 999     .
      *            *---------------------------------------------------*
      *            * Castelletto elementi                              *
      *            *---------------------------------------------------*
               10  w-gen-buf-cst occurs 999.
      *                *-----------------------------------------------*
      *                * Filename                                      *
      *                *-----------------------------------------------*
                   15  w-gen-buf-fil      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Buffer elementi testata convertiti                    *
      *        *-------------------------------------------------------*
           05  w-gen-buf-tes.
      *            *---------------------------------------------------*
      *            * Riferimenti conferma                              *
      *            *---------------------------------------------------*
               10  w-gen-buf-dat          pic  9(07)                  .
               10  w-gen-buf-num          pic  x(40)                  .
               10  w-gen-buf-rif          pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Buffer elementi riga convertiti                       *
      *        *-------------------------------------------------------*
           05  w-gen-buf-rig.
      *            *---------------------------------------------------*
      *            * Action Notification                               *
      *            *                                                   *
      *            *  - '02' : Deleted item from Seller                *
      *            *  - '04' : No action                               *
      *            *  - '05' : Accepted                                *
      *            *  - '06' : Accepted with amendement                *
      *            *  - '07' : Not accepted                            *
      *            *  - '10' : Not found                               *
      *            *---------------------------------------------------*
               10  w-gen-buf-ant          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Data conferma                                     *
      *            *---------------------------------------------------*
               10  w-gen-buf-dcf          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Qta conferma                                      *
      *            *---------------------------------------------------*
               10  w-gen-buf-qtc          pic s9(10)v9(03)            .
      *            *---------------------------------------------------*
      *            * Prezzo conferma                                   *
      *            *---------------------------------------------------*
               10  w-gen-buf-pcf          pic  9(10)v9(05)            .
      *            *---------------------------------------------------*
      *            * Flag codice confermato variato                    *
      *            *---------------------------------------------------*
               10  w-gen-buf-cfl          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag data conferma variata                        *
      *            *---------------------------------------------------*
               10  w-gen-buf-dfl          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag qta confermata variata                       *
      *            *---------------------------------------------------*
               10  w-gen-buf-qfl          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag prezzo confermato variato                    *
      *            *---------------------------------------------------*
               10  w-gen-buf-pfl          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Quantita' riferimento prezzo                      *
      *            *---------------------------------------------------*
               10  w-gen-buf-qrf          pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Rottura su elementi riga                              *
      *        *-------------------------------------------------------*
           05  w-gen-rot-rig.
      *            *---------------------------------------------------*
      *            * Flag di progressivo riga trattato                 *
      *            *---------------------------------------------------*
               10  w-gen-rot-prg          pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per la definizione dei record                   *
      *    * archivio sequenziale                                      *
      *    *-----------------------------------------------------------*
       01  w-inp.
      *        *-------------------------------------------------------*
      *        * Record generico                                       *
      *        *-------------------------------------------------------*
           05  w-inp-gen.
      *            *---------------------------------------------------*
      *            * Tipo record generico                              *
      *            *---------------------------------------------------*
               10  w-inp-gen-tip          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Record header                                         *
      *        *-------------------------------------------------------*
           05  w-inp-tes.
      *            *---------------------------------------------------*
      *            * Tipo record                                       *
      *            *---------------------------------------------------*
               10  w-inp-tes-tip          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Buyer name                                        *
      *            *---------------------------------------------------*
               10  w-inp-tes-buy          pic  x(30)                  .
      *            *---------------------------------------------------*
      *            * Seller name                                       *
      *            *---------------------------------------------------*
               10  w-inp-tes-sel          pic  x(30)                  .
      *            *---------------------------------------------------*
      *            * Seller responsible                                *
      *            *---------------------------------------------------*
               10  w-inp-tes-srs          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Seller conf date                                  *
      *            *---------------------------------------------------*
               10  w-inp-tes-scd          pic  x(08)                  .
      *            *---------------------------------------------------*
      *            * Seller conf num                                   *
      *            *---------------------------------------------------*
               10  w-inp-tes-scn          pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Buyer rif date                                    *
      *            *---------------------------------------------------*
               10  w-inp-tes-brd          pic  x(08)                  .
      *            *---------------------------------------------------*
      *            * Buyer rif num                                     *
      *            *---------------------------------------------------*
               10  w-inp-tes-brn          pic  x(10)                  .
      *        *-------------------------------------------------------*
      *        * Record detail                                         *
      *        *-------------------------------------------------------*
           05  w-inp-rig.
      *            *---------------------------------------------------*
      *            * Tipo record                                       *
      *            *---------------------------------------------------*
               10  w-inp-rig-tip          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Seller row ID                                     *
      *            *---------------------------------------------------*
               10  w-inp-rig-sri          pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Buyer row rif                                     *
      *            *---------------------------------------------------*
               10  w-inp-rig-brr          pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Action notification                               *
      *            *---------------------------------------------------*
               10  w-inp-rig-acn          pic  x(02)                  .
      *            *---------------------------------------------------*
      *            * Buyer part number                                 *
      *            *---------------------------------------------------*
               10  w-inp-rig-bpn          pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Seller part number                                *
      *            *---------------------------------------------------*
               10  w-inp-rig-spn          pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Qty conf                                          *
      *            *---------------------------------------------------*
               10  w-inp-rig-qtc          pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Delivery conf                                     *
      *            *---------------------------------------------------*
               10  w-inp-rig-dlc          pic  x(08)                  .
      *            *---------------------------------------------------*
      *            * Price qty rif                                     *
      *            *---------------------------------------------------*
               10  w-inp-rig-pqr          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Price qualifier                                   *
      *            *---------------------------------------------------*
               10  w-inp-rig-pql          pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Price conf                                        *
      *            *---------------------------------------------------*
               10  w-inp-rig-pcf          pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Price quota conf                                  *
      *            *---------------------------------------------------*
               10  w-inp-rig-pqc          pic  x(30)                  .

      *    *===========================================================*
      *    * Work area per calcoli ed operazioni su date               *
      *    *-----------------------------------------------------------*
       01  w-clc-dat.
      *        *-------------------------------------------------------*
      *        * Parametri in input ed output                          *
      *        *-------------------------------------------------------*
           05  w-clc-dat-min              pic  9(07)                  .
           05  w-clc-dat-max              pic  9(07)                  .
           05  w-clc-dat-nrg              pic s9(07)                  .
           05  w-clc-dat-ng0              pic  9(07)                  .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione quantita' da e-  *
      *    * vadere riga ordine fornitore                              *
      *    *-----------------------------------------------------------*
           copy      "pgm/orf/prg/cpy/dqevrof0.dtl"                   .

      *    *===========================================================*
      *    * Work-area per operazioni sulle date                       *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wnrgdat0.cpw"                   .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
      *            *---------------------------------------------------*
      *            * Filename in chiave                                *
      *            *---------------------------------------------------*
               10  w-rot-l02-fil-nam      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Protocollo documento                              *
      *            *---------------------------------------------------*
               10  w-rot-l02-num-prt      pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Data conferma da fornitore                        *
      *            *---------------------------------------------------*
               10  w-rot-l02-key-scd      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
      *            *---------------------------------------------------*
      *            * Progressivo riga documento                        *
      *            *---------------------------------------------------*
               10  w-rot-l01-num-prg      pic  9(05)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-800.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-800.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento programma       *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Se no richieste : a selezione stampante         *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-350.
       main-250.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-800.
      *                  *---------------------------------------------*
      *                  * Se uscita per 'N'                           *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "N"
                     go to main-250.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-350.
      *              *-------------------------------------------------*
      *              * Se no stampa : ad esecuzione                    *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to main-450.
      *              *-------------------------------------------------*
      *              * Preparazione defaults per parametri di selezio- *
      *              * ne stampa                                       *
      *              *-------------------------------------------------*
           perform   pre-prm-stp-000      thru pre-prm-stp-999        .
      *              *-------------------------------------------------*
      *              * Selezione parametri stampa                      *
      *              *-------------------------------------------------*
           perform   sel-prm-stp-000      thru sel-prm-stp-999        .
      *                  *---------------------------------------------*
      *                  * Test se uscita                              *
      *                  *---------------------------------------------*
           if        w-cnt-sel-prm-stp    not  = spaces
                     go to main-800.
       main-450.
      *              *-------------------------------------------------*
      *              * Esecuzione in foreground                        *
      *              *-------------------------------------------------*
           perform   exe-pgm-frg-000      thru exe-pgm-frg-999        .
      *              *-------------------------------------------------*
      *              * Test se tipo esecuzione ciclico                 *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S" or
                     w-cnt-fun-snx-cic    not  = "S"
                     go to main-800
           else      go to main-250.
       main-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Programma di esecuzione in foreground                     *
      *    *-----------------------------------------------------------*
       exe-pgm-frg-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione rullino messaggi di foreground *
      *              *-------------------------------------------------*
           move      "OF"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Se errore : uscita                          *
      *                  *---------------------------------------------*
            if       m-rsc                not  = spaces
                     go to exe-pgm-frg-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-pgm-frg-300.
      *              *-------------------------------------------------*
      *              * Esecuzione del programma                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura parametri di selezione stampa       *
      *                  *---------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to exe-pgm-frg-999.
      *                  *---------------------------------------------*
      *                  * Esecuzione eventuale sort preliminare       *
      *                  *---------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se sort eseguito       *
      *                  *---------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to exe-pgm-frg-400
           else      go to exe-pgm-frg-500.
       exe-pgm-frg-400.
      *                  *---------------------------------------------*
      *                  * Se sort non eseguito                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ciclo di report-program                 *
      *                      *-----------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     exe-pgm-frg-600.
       exe-pgm-frg-500.
      *                  *---------------------------------------------*
      *                  * Se sort eseguito                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     exe-pgm-frg-600.
       exe-pgm-frg-600.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo stampa                 *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       exe-pgm-frg-900.
      *                  *---------------------------------------------*
      *                  * Visual. eventuali errori di esecuzione      *
      *                  *---------------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "F"                  to   b-tfe                  .
           move      i-ide-des            to   b-chr                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
           cancel    "swd/mod/prg/obj/mbckgv"                         .
       exe-pgm-frg-999.
           exit.

      *    *===========================================================*
      *    *  Selezione parametri stampa                               *
      *    *-----------------------------------------------------------*
       sel-prm-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sel-prm-stp      .
      *              *-------------------------------------------------*
      *              * Test se selezione stampa da eseguire            *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to sel-prm-stp-999.
      *              *-------------------------------------------------*
      *              * Preparazione parametri per richiamo selezione   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Informazioni generali da segreteria         *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Codice azienda                          *
      *                      *-----------------------------------------*
           move      s-azi                to   r-env-cod-azi          .
      *                      *-----------------------------------------*
      *                      * Codice terminale                        *
      *                      *-----------------------------------------*
           move      s-ter                to   r-env-cod-ter          .
      *                      *-----------------------------------------*
      *                      * Codice utente                           *
      *                      *-----------------------------------------*
           move      s-ute                to   r-env-cod-ute          .
      *                      *-----------------------------------------*
      *                      * Date and time da segreteria             *
      *                      *-----------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Date and time                           *
      *                      *-----------------------------------------*
           move      s-sdt                to   r-env-dat-tim          .
      *                  *---------------------------------------------*
      *                  * Informazioni da identificazione programma   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Sistema applicativo                     *
      *                      *-----------------------------------------*
           move      i-ide-sap            to   r-ide-sis-app          .
      *                      *-----------------------------------------*
      *                      * Area gestionale                         *
      *                      *-----------------------------------------*
           move      i-ide-arg            to   r-ide-are-ges          .
      *                      *-----------------------------------------*
      *                      * Settore gestionale                      *
      *                      *-----------------------------------------*
           move      i-ide-set            to   r-ide-set-ges          .
      *                      *-----------------------------------------*
      *                      * Fase gestionale                         *
      *                      *-----------------------------------------*
           move      i-ide-fas            to   r-ide-fas-ges          .
      *                  *---------------------------------------------*
      *                  * Informazioni da preparazione param. stampa  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flags di tipo selezione                 *
      *                      *-----------------------------------------*
           move      w-cnt-stp-tip-sel    to   r-fix-tip-sel          .
      *                      *-----------------------------------------*
      *                      * Codice stampante                        *
      *                      *-----------------------------------------*
           move      w-cnt-stp-cod-stp    to   r-fix-cod-stp          .
      *                      *-----------------------------------------*
      *                      * Tipo di stampa                          *
      *                      *-----------------------------------------*
           move      w-cnt-stp-tip-sta    to   r-fix-tip-sta          .
      *                      *-----------------------------------------*
      *                      * Codice modulo                           *
      *                      *-----------------------------------------*
           move      w-cnt-stp-cod-mod    to   r-fix-cod-mod          .
      *                      *-----------------------------------------*
      *                      * Tipo modulo                             *
      *                      *-----------------------------------------*
           move      w-cnt-stp-tip-mod    to   r-fix-tip-mod          .
      *                      *-----------------------------------------*
      *                      * Ampiezza linea di stampa in caratteri   *
      *                      *-----------------------------------------*
           move      w-cnt-stp-amp-lin    to   r-fix-amp-lin          .
      *                      *-----------------------------------------*
      *                      * Top margin in linee                     *
      *                      *-----------------------------------------*
           move      w-cnt-stp-top-lin    to   r-fix-top-lin          .
      *                      *-----------------------------------------*
      *                      * Numero linee di stampa minimo           *
      *                      *-----------------------------------------*
           move      w-cnt-stp-lin-min    to   r-fix-lin-min          .
      *                      *-----------------------------------------*
      *                      * Bottom margin in linee                  *
      *                      *-----------------------------------------*
           move      w-cnt-stp-bot-lin    to   r-fix-bot-lin          .
      *                      *-----------------------------------------*
      *                      * Ampiezza caratteri                      *
      *                      *-----------------------------------------*
           move      w-cnt-stp-amp-car    to   r-fix-amp-car          .
      *                      *-----------------------------------------*
      *                      * Altezza interlinea                      *
      *                      *-----------------------------------------*
           move      w-cnt-stp-alt-int    to   r-fix-alt-int          .
      *                      *-----------------------------------------*
      *                      * Area riservata per espansioni future    *
      *                      *-----------------------------------------*
           move      w-cnt-stp-esp-fut    to   r-fix-esp-fut          .
      *                      *-----------------------------------------*
      *                      * Area riservata per funzioni speciali    *
      *                      *-----------------------------------------*
           move      w-cnt-stp-fnz-spc    to   r-fix-fnz-spc          .
      *              *-------------------------------------------------*
      *              * Richiamo modulo di selezione stampa             *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mpslct"
                                         using r                      .
           cancel    "swd/mod/prg/obj/mpslct"                         .
      *              *-------------------------------------------------*
      *              * Status di uscita                                *
      *              *-------------------------------------------------*
           if        r-rsc                not  = spaces
                     move  "#"            to   w-cnt-sel-prm-stp      .
       sel-prm-stp-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-cnt-tit-des-azi      .
           move      40                   to   w-cnt-tit-ctr-azi      .
       int-pag-std-100.
           if        w-cnt-tit-chr-azi
                    (w-cnt-tit-ctr-azi)   =    spaces
                     if     w-cnt-tit-ctr-azi
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-cnt-tit-ctr-tit      .
       int-pag-std-200.
           if        w-cnt-tit-chr-tit
                    (w-cnt-tit-ctr-tit)   =    spaces
                     if     w-cnt-tit-ctr-tit
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-tit      .
           subtract  w-cnt-tit-ctr-tit    from w-cnt-tit-pos-tit      .
           divide    2                    into w-cnt-tit-pos-tit      .
           add       1                    to   w-cnt-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    =    zero
                     move  4              to   w-cnt-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-cnt-tit-ctr-wrk      .
           inspect   w-cnt-tit-num-pag
                                      tallying w-cnt-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-cnt-tit-ctr-wrk    from 27
                                        giving w-cnt-tit-ctr-dep      .
           subtract  w-cnt-tit-ctr-wrk    from 5
                                        giving w-cnt-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-dep      .
           subtract  w-cnt-tit-ctr-dep    from w-cnt-tit-pos-dep      .
           add       1                    to   w-cnt-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-cnt-tit-ctr-azi    to   w-cnt-tit-ctr-wrk      .
           add       2                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-tit
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      w-cnt-tit-pos-tit    to   w-cnt-tit-ctr-wrk      .
           add       w-cnt-tit-ctr-tit    to   w-cnt-tit-ctr-wrk      .
           add       1                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-dep
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-cnt-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-cnt-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-cnt-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-cnt-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Preparazione pathname di base files sequenziali *
      *              *-------------------------------------------------*
           perform   pre-bas-pth-000      thru pre-bas-pth-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No richieste ad utente                       *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No funzionamento ciclico stampa              *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-cic      .
      *              *-------------------------------------------------*
      *              * Si/No richiesta di selezione stampa             *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice fornitore com-  *
      *              * merciale                                        *
      *              *-------------------------------------------------*
           perform   cod-mne-dcf-opn-000  thru cod-mne-dcf-opn-999    .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [aaq]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *              *-------------------------------------------------*
      *              * [oft]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *              *-------------------------------------------------*
      *              * [ofr]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *              *-------------------------------------------------*
      *              * [hed]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "sir/agb/fls/ioc/obj/iofhed"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-hed                 .
      *              *-------------------------------------------------*
      *              * [her]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "sir/agb/fls/ioc/obj/iofher"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-her                 .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione importo in riga   *
      *              *-------------------------------------------------*
           move      "OP"                 to   d-imp-acq-tip-ope      .
           move      "pgm/ffo/prg/obj/dimpacq0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-imp-acq              .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione quantita' da e-   *
      *              * vadere riga ordine                              *
      *              *-------------------------------------------------*
           move      "OP"                 to   d-qev-rof-tip-ope      .
           move      "pgm/orf/prg/obj/dqevrof0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-qev-rof
                                               rf-ofr                 .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice fornitore com- *
      *              * merciale                                        *
      *              *-------------------------------------------------*
           perform   cod-mne-dcf-cls-000  thru cod-mne-dcf-cls-999    .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [aaq]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *              *-------------------------------------------------*
      *              * [oft]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *              *-------------------------------------------------*
      *              * [ofr]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *              *-------------------------------------------------*
      *              * [hed]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "sir/agb/fls/ioc/obj/iofhed"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-hed                 .
      *              *-------------------------------------------------*
      *              * [her]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "sir/agb/fls/ioc/obj/iofher"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-her                 .
       rou-cls-fls-850.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione importo in riga  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-imp-acq-tip-ope      .
           move      "pgm/ffo/prg/obj/dimpacq0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-imp-acq              .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-imp-acq-tip-ope      .
           move      "pgm/ffo/prg/obj/dimpacq0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-imp-acq              .
           if        d-imp-acq-exi-sts    not  = spaces
                     go to rou-cls-fls-860.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/ffo/prg/obj/dimpacq0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       rou-cls-fls-860.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione quantita' da e-  *
      *              * vadere riga ordine                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-qev-rof-tip-ope      .
           move      "pgm/orf/prg/obj/dqevrof0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-qev-rof
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-qev-rof-tip-ope      .
           move      "pgm/orf/prg/obj/dqevrof0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-qev-rof
                                               rf-ofr                 .
           if        d-qev-rof-exi-sts    not  = spaces
                     go to rou-cls-fls-880.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/orf/prg/obj/dqevrof0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       rou-cls-fls-880.
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Codice fornitore                            *
      *                  *---------------------------------------------*
           perform   acc-cod-fnt-000      thru acc-cod-fnt-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-200.
      *                  *---------------------------------------------*
      *                  * Tipo esecuzione                             *
      *                  *---------------------------------------------*
           perform   acc-tip-exe-000      thru acc-tip-exe-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-100.
       acc-ric-sel-300.
      *                  *---------------------------------------------*
      *                  * Opzioni di stampa                           *
      *                  *---------------------------------------------*
           perform   acc-opz-stp-000      thru acc-opz-stp-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-200.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "Conferma impostazioni (S/N/E) ?"
                                          to   v-not                  .
           move      "S"                  to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
           move      zero                 to   rr-cod-fnt             .
           move      spaces               to   rr-cod-fnt-rag         .
           move      spaces               to   rr-cod-fnt-vlt         .
           move      zero                 to   rr-tip-exe             .
           move      "X"                  to   rr-opz-stp             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Codice fornitore                                *
      *              *-------------------------------------------------*
      *              *-------------------------------------------------*
      *              * Tipo esecuzione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo esecuzione            :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Opzioni di stampa                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo stampa                :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Codice fornitore                           *
      *    *-----------------------------------------------------------*
       acc-cod-fnt-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Attualmente inibito                         *
      *                  *---------------------------------------------*
           go to     acc-cod-fnt-999.
       acc-cod-fnt-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-dcf-ope      .
           move      rr-cod-fnt           to   w-cod-mne-dcf-cod      .
           move      05                   to   w-cod-mne-dcf-lin      .
           move      30                   to   w-cod-mne-dcf-pos      .
           move      05                   to   w-cod-mne-dcf-rln      .
           move      41                   to   w-cod-mne-dcf-rps      .
           move      zero                 to   w-cod-mne-dcf-vln      .
           move      zero                 to   w-cod-mne-dcf-vps      .
           move      zero                 to   w-cod-mne-dcf-lln      .
           move      zero                 to   w-cod-mne-dcf-lps      .
           move      "<B"                 to   v-edm                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-dcf-cll-000  thru cod-mne-dcf-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-dcf-foi-000  thru cod-mne-dcf-foi-999    .
       acc-cod-fnt-110.
           perform   cod-mne-dcf-cll-000  thru cod-mne-dcf-cll-999    .
           if        w-cod-mne-dcf-ope    =    "F+"
                     go to acc-cod-fnt-115.
           if        w-cod-mne-dcf-ope    =    "AC"
                     go to acc-cod-fnt-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-fnt-115.
           perform   cod-mne-dcf-foi-000  thru cod-mne-dcf-foi-999    .
           go to     acc-cod-fnt-110.
       acc-cod-fnt-120.
           move      w-cod-mne-dcf-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Cancellazione eventuali note operative          *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-cod-fnt-999.
       acc-cod-fnt-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-cod-fnt             .
       acc-cod-fnt-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-fnt-420.
      *                  *---------------------------------------------*
      *                  * Lettura file [fnt]                          *
      *                  *---------------------------------------------*
           move      rr-cod-fnt           to   w-let-arc-fnt-cod      .
           perform   let-arc-fnt-000      thru let-arc-fnt-999        .
      *                  *---------------------------------------------*
      *                  * Lettura record [dcf]                        *
      *                  *---------------------------------------------*
           move      rr-cod-fnt           to   w-let-arc-dcf-fnt      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione ragione sociale              *
      *                  *---------------------------------------------*
           if        w-let-arc-dcf-flg    =    spaces
                     move  w-let-arc-dcf-rag
                                          to   rr-cod-fnt-rag
           else      move  w-let-arc-fnt-rag
                                          to   rr-cod-fnt-rag         .
      *                  *---------------------------------------------*
      *                  * Memorizzazione codice valuta associato al   *
      *                  * fornitore commerciale                       *
      *                  *---------------------------------------------*
           move      w-let-arc-dcf-vlt    to   rr-cod-fnt-vlt         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione ragione sociale fornitore   *
      *                  *---------------------------------------------*
           perform   vis-cod-fnt-rag-000  thru vis-cod-fnt-rag-999    .
       acc-cod-fnt-440.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del valore impostato   *
      *                  *---------------------------------------------*
           if        rr-cod-fnt           =    zero
                     go to acc-cod-fnt-460
           else      go to acc-cod-fnt-480.
       acc-cod-fnt-460.
      *                  *---------------------------------------------*
      *                  * Se codice fornitore impostato a zero        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     acc-cod-fnt-600.
       acc-cod-fnt-480.
      *                  *---------------------------------------------*
      *                  * Se codice fornitore impostato diverso da 0  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se fornitore com-  *
      *                      * merciale esistente oppure no            *
      *                      *-----------------------------------------*
           if        w-let-arc-dcf-flg    =    spaces
                     go to acc-cod-fnt-560.
       acc-cod-fnt-500.
      *                      *-----------------------------------------*
      *                      * Se anagrafica fornitore commerciale non *
      *                      * esistente                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Deviazione a seconda se anagrafica  *
      *                          * fornitore esistente oppure no       *
      *                          *-------------------------------------*
           if        w-let-arc-fnt-flg    =    spaces
                     go to acc-cod-fnt-540.
       acc-cod-fnt-520.
      *                          *-------------------------------------*
      *                          * Se anagrafica fornitore contabile   *
      *                          * non esistente                       *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * A reimpostazione                *
      *                              *---------------------------------*
           go to     acc-cod-fnt-100.
       acc-cod-fnt-540.
      *                          *-------------------------------------*
      *                          * Se anagrafica fornitore contabile   *
      *                          * esistente                           *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Emissione messaggio di errore   *
      *                              *---------------------------------*
           move      "Manca l'anagrafica commerciale per il fornitore"
                                          to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                              *---------------------------------*
      *                              * A reimpostazione                *
      *                              *---------------------------------*
           go to     acc-cod-fnt-100.
       acc-cod-fnt-560.
      *                      *-----------------------------------------*
      *                      * Se anagrafica fornitore commerciale     *
      *                      * esistente                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * A dipendenze da impostazione        *
      *                          *-------------------------------------*
           go to     acc-cod-fnt-600.
       acc-cod-fnt-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-fnt-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-cod-fnt-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-cod-fnt-100.
       acc-cod-fnt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice fornitore                        *
      *    *-----------------------------------------------------------*
       vis-cod-fnt-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      05                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "<B"                 to   v-edm                  .
           move      rr-cod-fnt           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-fnt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Ragione sociale fornitore               *
      *    *-----------------------------------------------------------*
       vis-cod-fnt-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-cod-fnt-rag       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-fnt-rag-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Tipo esecuzione            *
      *    *-----------------------------------------------------------*
       acc-tip-exe-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-tip-exe-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-exe-lun    to   v-car                  .
           move      w-exp-tip-exe-num    to   v-ldt                  .
           move      "PD#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      07                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-tip-exe-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-tip-exe           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-tip-exe-999.
       acc-tip-exe-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-tip-exe             .
       acc-tip-exe-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se zero : reimpostazione                    *
      *                  *---------------------------------------------*
           if        rr-tip-exe           =    zero
                     go to acc-tip-exe-100.
       acc-tip-exe-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-tip-exe-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-tip-exe-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-tip-exe-100.
       acc-tip-exe-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Opzioni di stampa                    *
      *    *-----------------------------------------------------------*
       acc-opz-stp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-opz-stp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "C"                  to   v-tip                  .
           move      w-exp-opz-stp-lun    to   v-car                  .
           move      w-exp-opz-stp-num    to   v-ldt                  .
           move      "BX"                 to   v-edm                  .
           move      09                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-opz-stp-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-opz-stp           to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-opz-stp-999.
       acc-opz-stp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-opz-stp             .
       acc-opz-stp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-opz-stp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-opz-stp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-opz-stp-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-opz-stp-100.
       acc-opz-stp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Opzioni di stampa                 *
      *    *-----------------------------------------------------------*
       vis-opz-stp-000.
           move      "DS"                 to   v-ope                  .
           move      "C"                  to   v-tip                  .
           move      w-exp-opz-stp-lun    to   v-car                  .
           move      w-exp-opz-stp-num    to   v-ldt                  .
           move      "B"                  to   v-edm                  .
           move      09                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-opz-stp-tbl    to   v-txt                  .
           move      rr-opz-stp           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-opz-stp-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-800.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione messaggio di errore         *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Tipo esecuzione                                 *
      *              *-------------------------------------------------*
           if        rr-tip-exe           =    zero
                     move  01             to   rr-tip-exe             .
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Preparazione parametri per selezione stampa               *
      *    *-----------------------------------------------------------*
       pre-prm-stp-000.
      *              *-------------------------------------------------*
      *              * Flags di tipo selezione                         *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-tip-sel      .
      *              *-------------------------------------------------*
      *              * Codice stampante                                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-cod-stp      .
      *              *-------------------------------------------------*
      *              * Tipo di stampa                                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-tip-sta      .
      *              *-------------------------------------------------*
      *              * Codice modulo                                   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-cod-mod      .
      *              *-------------------------------------------------*
      *              * Tipo modulo                                     *
      *              *   - L : Libero                                  *
      *              *   - T : Tipografico                             *
      *              *-------------------------------------------------*
           move      "L"                  to   w-cnt-stp-tip-mod      .
      *              *-------------------------------------------------*
      *              * Ampiezza linea di stampa in caratteri           *
      *              *-------------------------------------------------*
           move      132                  to   w-cnt-stp-amp-lin      .
      *              *-------------------------------------------------*
      *              * Top margin in linee                             *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stp-top-lin      .
      *              *-------------------------------------------------*
      *              * Numero linee di stampa minimo                   *
      *              *-------------------------------------------------*
           move      30                   to   w-cnt-stp-lin-min      .
      *              *-------------------------------------------------*
      *              * Bottom margin in linee                          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stp-bot-lin      .
      *              *-------------------------------------------------*
      *              * Ampiezza caratteri                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stp-amp-car      .
      *              *-------------------------------------------------*
      *              * Altezza interlinea                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stp-alt-int      .
      *              *-------------------------------------------------*
      *              * Area riservata per espansioni future            *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-esp-fut      .
      *              *-------------------------------------------------*
      *              * Area riservata per espansioni speciali          *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-fnz-spc      .
       pre-prm-stp-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : Si'                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort                                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   prn-rou-pri-000
                                          thru prn-rou-pri-999        .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Trasferimento iniziale dei files generati nel   *
      *              * server                                          *
      *              *-------------------------------------------------*
           perform   trf-fls-srv-000      thru trf-fls-srv-999        .
      *              *-------------------------------------------------*
      *              * Preparazione pathname                           *
      *              *-------------------------------------------------*
           move      spaces               to   f-xxx-pat              .
           string    f-xxx-ppb  delimited by   spaces
                     "/LISTA"   delimited by   size
                                          into f-xxx-pat              .
       stp-srt-inp-010.
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-buf-ctr          .
      *              *-------------------------------------------------*
      *              * Open generica file sequenziale di input         *
      *              *-------------------------------------------------*
           perform   opn-seq-inp-000      thru opn-seq-inp-999        .
       stp-srt-inp-020.
      *              *-------------------------------------------------*
      *              * Lettura da sequenziale                          *
      *              *-------------------------------------------------*
           perform   get-nxt-inp-000      thru get-nxt-inp-999        .
      *              *-------------------------------------------------*
      *              * Test se errori                                  *
      *              *-------------------------------------------------*
           if        g-sts                =    e-not-err
                     go to stp-srt-inp-030.
           if        g-sts                =    e-end-fil
                     go to stp-srt-inp-100.
       stp-srt-inp-025.
      *              *-------------------------------------------------*
      *              * Se errore di i-o                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Messaggio di errore sull'input              *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      "Nessun file da trattare"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-900.
       stp-srt-inp-030.
      *              *-------------------------------------------------*
      *              * Incremento contatore                            *
      *              *-------------------------------------------------*
           if        w-gen-buf-ctr        <    w-gen-buf-max
                     add  1               to   w-gen-buf-ctr          .
      *              *-------------------------------------------------*
      *              * Bufferizzazione del record letto                *
      *              *-------------------------------------------------*
           move      g-rec                to   w-gen-buf-fil
                                              (w-gen-buf-ctr)         .
       stp-srt-inp-050.
      *              *-------------------------------------------------*
      *              * Riciclo su sequenziale                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-020.
       stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Chiusura del file                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura del file in input                  *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
       stp-srt-inp-110.
      *              *-------------------------------------------------*
      *              * Test sul numero elementi letti                  *
      *              *-------------------------------------------------*
           if        w-gen-buf-ctr        not  > zero
                     go to stp-srt-inp-025.
       stp-srt-inp-150.
      *              *-------------------------------------------------*
      *              * Inizio scansione buffer                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-gen-buf-c01          .
       stp-srt-inp-160.
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-gen-buf-c01          .
           if        w-gen-buf-c01        >    w-gen-buf-ctr or
                     w-gen-buf-c01        >    w-gen-buf-max
                     go to stp-srt-inp-900.
       stp-srt-inp-180.
      *                  *---------------------------------------------*
      *                  * Apertura e trattamento file                 *
      *                  *                                             *
      *                  * La directory 'rtr' e' link a '/abd/asc/imp' *
      *                  *---------------------------------------------*
           move      spaces               to   f-xxx-pat              .
           string    "/rtr/"    delimited by   size
                     w-gen-buf-fil
                    (w-gen-buf-c01)
                                delimited by   spaces
                                          into f-xxx-pat              .
      *                  *---------------------------------------------*
      *                  * Editing contatore                           *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-gen-buf-c01        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (02)     .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      "Trattamento file nr."
                                          to   w-all-str-cat (01)     .
           move      "-"                  to   w-all-str-cat (03)     .
           move      w-gen-buf-fil
                    (w-gen-buf-c01)       to   w-all-str-cat (04)     .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Open generica file sequenziale di input     *
      *                  *---------------------------------------------*
           perform   opn-seq-inp-000      thru opn-seq-inp-999        .
      *                  *---------------------------------------------*
      *                  * Normalizzazione comodo progressivo rilascio *
      *                  *---------------------------------------------*
           move      zero                 to   w-gen-buf-c02          .
       stp-srt-inp-200.
      *                  *---------------------------------------------*
      *                  * Lettura da sequenziale                      *
      *                  *---------------------------------------------*
           perform   get-nxt-inp-000      thru get-nxt-inp-999        .
      *                  *---------------------------------------------*
      *                  * Test se errori                              *
      *                  *---------------------------------------------*
           if        g-sts                =    e-not-err
                     go to stp-srt-inp-300.
           if        g-sts                =    e-end-fil
                     go to stp-srt-inp-800.
       stp-srt-inp-300.
      *              *-------------------------------------------------*
      *              * Trattamento in base al tipo di record           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * In campo di comodo                          *
      *                  *---------------------------------------------*
           move      g-rec                to   w-inp-gen              .
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-inp-gen-tip        =    "H"
                     go to stp-srt-inp-400
           else if   w-inp-gen-tip        =    "D"
                     go to stp-srt-inp-600
           else      go to stp-srt-inp-200.
       stp-srt-inp-400.
      *              *-------------------------------------------------*
      *              * Trattamento testate                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Scomposizione record sequenziale            *
      *                  *---------------------------------------------*
           perform   stp-srt-inp-tes-000  thru stp-srt-inp-tes-999    .
      *                  *---------------------------------------------*
      *                  * Determinazione protocollo ordine fornitore  *
      *                  *---------------------------------------------*
           perform   stp-srt-inp-doc-000  thru stp-srt-inp-doc-999    .
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [oft]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [oft]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-det-num-oft-prt    to   rf-oft-num-prt         .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *                  *---------------------------------------------*
      *                  * Normalizzazione preliminare                 *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Composizione record di sort                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Chiave                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Filename in chiave                  *
      *                          *-------------------------------------*
           move      w-gen-buf-fil
                    (w-gen-buf-c01)       to   srt-key-nam            .
      *                          *-------------------------------------*
      *                          * Protocollo ordine                   *
      *                          *-------------------------------------*
           move      w-det-num-oft-prt    to   srt-num-prt            .
      *                          *-------------------------------------*
      *                          * Data conferma fornitore in chiave   *
      *                          *-------------------------------------*
           move      w-inp-tes-scd        to   w-det-num-oft-dtw      .
           move      w-det-num-oft-anw    to   s-saa                  .
           add       100                  to   s-saa                  .
           move      w-det-num-oft-msw    to   s-mes                  .
           move      w-det-num-oft-giw    to   s-gio                  .
           move      s-dat                to   w-det-num-oft-scd      .
      *
           move      w-det-num-oft-scd    to   srt-key-scd            .
      *                          *-------------------------------------*
      *                          * Tipo record in chiave               *
      *                          *-------------------------------------*
           move      "A"                  to   srt-key-rec            .
      *                          *-------------------------------------*
      *                          * Progressivo riga EDI                *
      *                          *-------------------------------------*
           move      zero                 to   srt-edi-prg            .
      *                          *-------------------------------------*
      *                          * Progressivo rilascio riga EDI       *
      *                          *-------------------------------------*
           move      zero                 to   srt-fil-prg            .
      *                          *-------------------------------------*
      *                          * Progressivo riga ordine             *
      *                          *-------------------------------------*
           move      zero                 to   srt-num-prg            .
      *                      *-----------------------------------------*
      *                      * Dati                                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Progressivo riga EDI di riferimento *
      *                          *-------------------------------------*
           move      zero                 to   srt-edi-rif            .
      *                          *-------------------------------------*
      *                          * Tipo record                         *
      *                          *-------------------------------------*
           move      w-inp-tes-tip        to   srt-tip-rec            .
      *                          *-------------------------------------*
      *                          * Filename                            *
      *                          *-------------------------------------*
           move      w-gen-buf-fil
                    (w-gen-buf-c01)       to   srt-fil-nam            .
      *                          *-------------------------------------*
      *                          * Record di input                     *
      *                          *-------------------------------------*
           move      w-inp-tes            to   srt-rec-inp            .
      *                          *-------------------------------------*
      *                          * Record [oft]                        *
      *                          *-------------------------------------*
           move      rf-oft               to   srt-rec-oft            .
      *                          *-------------------------------------*
      *                          * Record [ofr]                        *
      *                          *-------------------------------------*
           move      spaces               to   srt-rec-ofr            .
      *                  *---------------------------------------------*
      *                  * Rilascio del record al Sort                 *
      *                  *---------------------------------------------*
           release   srt-rec                                          .
      *                  *---------------------------------------------*
      *                  * A riciclo                                   *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-200.
       stp-srt-inp-600.
      *              *-------------------------------------------------*
      *              * Trattamento righe                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Scomposizione record sequenziale            *
      *                  *---------------------------------------------*
           perform   stp-srt-inp-rig-000  thru stp-srt-inp-rig-999    .
      *                  *---------------------------------------------*
      *                  * Determinazione riga di riferimento          *
      *                  *---------------------------------------------*
           perform   stp-srt-inp-rif-000  thru stp-srt-inp-rif-999    .
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [ofr]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [ofr]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-det-num-oft-prt    to   rf-ofr-num-prt         .
           move      w-det-num-oft-prg    to   rf-ofr-num-prg         .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Normalizzazione preliminare                 *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Composizione record di sort                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Chiave                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Filename in chiave                  *
      *                          *-------------------------------------*
           move      w-gen-buf-fil
                    (w-gen-buf-c01)       to   srt-key-nam            .
      *                          *-------------------------------------*
      *                          * Protocollo ordine                   *
      *                          *-------------------------------------*
           move      w-det-num-oft-prt    to   srt-num-prt            .
      *                          *-------------------------------------*
      *                          * Data conferma fornitore in chiave   *
      *                          *-------------------------------------*
           move      w-det-num-oft-scd    to   srt-key-scd            .
      *                          *-------------------------------------*
      *                          * Tipo record in chiave               *
      *                          *-------------------------------------*
           move      "B"                  to   srt-key-rec            .
      *                          *-------------------------------------*
      *                          * Progressivo riga EDI                *
      *                          *-------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      03                   to   v-car                  .
           move      w-inp-rig-sri        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   srt-edi-prg            .
      *                          *-------------------------------------*
      *                          * Progressivo rilascio riga EDI       *
      *                          *-------------------------------------*
           add       1                    to   w-gen-buf-c02          .
           move      w-gen-buf-c02        to   srt-fil-prg            .
      *                          *-------------------------------------*
      *                          * Progressivo riga ordine reale       *
      *                          *-------------------------------------*
           move      w-det-num-oft-prg    to   srt-num-prg            .
      *                      *-----------------------------------------*
      *                      * Dati                                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Progressivo riga EDI di riferimento *
      *                          *-------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      03                   to   v-car                  .
           move      w-inp-rig-brr        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   srt-edi-rif            .
      *                          *-------------------------------------*
      *                          * Tipo record                         *
      *                          *-------------------------------------*
           move      w-inp-rig-tip        to   srt-tip-rec            .
      *                          *-------------------------------------*
      *                          * Filename                            *
      *                          *-------------------------------------*
           move      w-gen-buf-fil
                    (w-gen-buf-c01)       to   srt-fil-nam            .
      *                          *-------------------------------------*
      *                          * Record di input                     *
      *                          *-------------------------------------*
           move      w-inp-rig            to   srt-rec-inp            .
      *                          *-------------------------------------*
      *                          * Record [oft]                        *
      *                          *-------------------------------------*
           move      rf-oft               to   srt-rec-oft            .
      *                          *-------------------------------------*
      *                          * Record [ofr]                        *
      *                          *-------------------------------------*
           move      rf-ofr               to   srt-rec-ofr            .
      *                  *---------------------------------------------*
      *                  * Rilascio del record al Sort                 *
      *                  *---------------------------------------------*
           release   srt-rec                                          .
      *                  *---------------------------------------------*
      *                  * A riciclo                                   *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-200.
       stp-srt-inp-800.
      *              *-------------------------------------------------*
      *              * Chiusura del file                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura del file in input                  *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *              *-------------------------------------------------*
      *              * Riciclo su file sequenziale successivo          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-160.
       stp-srt-inp-900.
      *              *-------------------------------------------------*
      *              * Cancellazione modulo utilizzato                 *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mcvjnp"                         .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-999.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *                                                           *
      *    * Trattamento testata                                       *
      *    *-----------------------------------------------------------*
       stp-srt-inp-tes-000.
      *              *-------------------------------------------------*
      *              * Estrazione campi                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazioni su record                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione preliminare record      *
      *                      *-----------------------------------------*
           move      spaces               to   w-inp-tes              .
      *                      *-----------------------------------------*
      *                      * Record in comodo di trattamento         *
      *                      *-----------------------------------------*
           move      spaces               to   w-det-rec-str-alf      .
           move      g-rec                to   w-det-rec-str-alf      .
      *                      *-----------------------------------------*
      *                      * Test che esistano solo 'n' separatori   *
      *                      *                                         *
      *                      * Da implementare                         *
      *                      *-----------------------------------------*
       stp-srt-inp-tes-100.
      *                      *-----------------------------------------*
      *                      * Estrazione Tipo record                  *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-tes-tip          .
      *                      *-----------------------------------------*
      *                      * Estrazione Buyer name                   *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-tes-buy          .
      *                      *-----------------------------------------*
      *                      * Estrazione Seller name                  *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-tes-sel          .
      *                      *-----------------------------------------*
      *                      * Estrazione Seller responsible           *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-tes-srs          .
      *                      *-----------------------------------------*
      *                      * Estrazione Seller conf date             *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-tes-scd          .
      *                      *-----------------------------------------*
      *                      * Estrazione Seller conf num              *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-tes-scn          .
      *                      *-----------------------------------------*
      *                      * Estrazione Buyer rif date               *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-tes-brd          .
      *                      *-----------------------------------------*
      *                      * Estrazione Buyer rif num                *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-tes-brn          .
       stp-srt-inp-tes-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-tes-999.
       stp-srt-inp-tes-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *                                                           *
      *    * Trattamento riga                                          *
      *    *-----------------------------------------------------------*
       stp-srt-inp-rig-000.
      *              *-------------------------------------------------*
      *              * Estrazione campi                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Operazioni su record                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione preliminare record      *
      *                      *-----------------------------------------*
           move      spaces               to   w-inp-rig              .
      *                      *-----------------------------------------*
      *                      * Record in comodo di trattamento         *
      *                      *-----------------------------------------*
           move      spaces               to   w-det-rec-str-alf      .
           move      g-rec                to   w-det-rec-str-alf      .
      *                      *-----------------------------------------*
      *                      * Test che esistano solo 'n' separatori   *
      *                      *                                         *
      *                      * Da implementare                         *
      *                      *-----------------------------------------*
       stp-srt-inp-rig-100.
      *                      *-----------------------------------------*
      *                      * Estrazione Tipo record                  *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-rig-tip          .
      *                      *-----------------------------------------*
      *                      * Estrazione Seller row ID                *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-rig-sri          .
      *                      *-----------------------------------------*
      *                      * Estrazione Buyer row rif                *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-rig-brr          .
      *                      *-----------------------------------------*
      *                      * Estrazione Action notification          *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-rig-acn          .
      *                      *-----------------------------------------*
      *                      * Estrazione Buyer Part Number            *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-rig-bpn          .
      *                      *-----------------------------------------*
      *                      * Estrazione Seller Part Number           *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-rig-spn          .
      *                      *-----------------------------------------*
      *                      * Estrazione Qty conf                     *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-rig-qtc          .
      *                      *-----------------------------------------*
      *                      * Estrazione Delivery conf                *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-rig-dlc          .
      *                      *-----------------------------------------*
      *                      * Estrazione Price qty rif                *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-rig-pqr          .
      *                      *-----------------------------------------*
      *                      * Estrazione Price qualifier              *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-rig-pql          .
      *                      *-----------------------------------------*
      *                      * Estrazione Price conf                   *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-rig-pcf          .
      *                      *-----------------------------------------*
      *                      * Estrazione Price quota conf             *
      *                      *-----------------------------------------*
           perform   stp-srt-inp-ext-000  thru stp-srt-inp-ext-999    .
           move      w-det-rec-str-ext    to   w-inp-rig-pqc          .
       stp-srt-inp-rig-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-rig-999.
       stp-srt-inp-rig-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Estrazione campi                                          *
      *    *-----------------------------------------------------------*
       stp-srt-inp-ext-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-rec-num-ctr      .
           move      spaces               to   w-det-rec-str-al1      .
           move      spaces               to   w-det-rec-str-al2      .
           move      spaces               to   w-det-rec-str-ext      .
      *              *-------------------------------------------------*
      *              * Test preliminare                                *
      *              *-------------------------------------------------*
           inspect   w-det-rec-str-alf
                                      tallying w-det-rec-num-ctr
                                          for  all
                                               w-det-rec-str-del      .
           if        w-det-rec-num-ctr    =    zero
                     move  w-det-rec-str-alf
                                          to   w-det-rec-str-ext
                     go to stp-srt-inp-ext-999.
      *              *-------------------------------------------------*
      *              * Estrazione                                      *
      *              *-------------------------------------------------*
           unstring  w-det-rec-str-alf
                                delimited by   w-det-rec-str-del
                                          into w-det-rec-str-al1
                                    count in   w-det-rec-num-ctr      .
           add       2                    to   w-det-rec-num-ctr      .
      *              *-------------------------------------------------*
      *              * Estrazione stringa rimanente                    *
      *              *-------------------------------------------------*
           unstring  w-det-rec-str-alf    into w-det-rec-str-al2
                                  with pointer w-det-rec-num-ctr      .
      *              *-------------------------------------------------*
      *              * Valori estratti                                 *
      *              *-------------------------------------------------*
           move      w-det-rec-str-al1    to   w-det-rec-str-ext      .
           move      w-det-rec-str-al2    to   w-det-rec-str-alf      .
       stp-srt-inp-ext-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-ext-999.
       stp-srt-inp-ext-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *                                                           *
      *    * Determinazione estremi documento                          *
      *    *-----------------------------------------------------------*
       stp-srt-inp-doc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni                                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-num-oft-ctr      .
           move      zero                 to   w-det-num-oft-dat      .
           move      zero                 to   w-det-num-oft-prt      .
           move      zero                 to   w-det-num-oft-num      .
           move      spaces               to   w-det-num-oft-tof      .
      *              *-------------------------------------------------*
      *              * Trattamento data di sistema                     *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-det-num-oft-sdt      .
           move      s-saa                to   w-det-num-oft-sai      .
       stp-srt-inp-doc-050.
      *              *-------------------------------------------------*
      *              * Preparazione dei parametri per la ricerca       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero documento                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test preliminare se il numero contiene  *
      *                      * un prefisso "A/"                        *
      *                      *-----------------------------------------*
           move      w-inp-tes-brn        to   w-det-num-doc-num      .
           if        w-det-num-doc-num
                    (01 : 02)             =    "A/"
                     move  w-det-num-doc-num
                          (03 : 08)       to   w-inp-tes-brn          .
      *                      *-----------------------------------------*
      *                      * Test se il numero contiene altri sepa-  *
      *                      * ratori                                  *
      *                      *-----------------------------------------*
           move      zero                 to   w-all-str-num          .
           inspect   w-inp-tes-brn    tallying w-all-str-num
                                          for  all "/"                .
      *
           if        w-all-str-num        =    zero
                     go to stp-srt-inp-doc-055.
      *                      *-----------------------------------------*
      *                      * Se con separatori                       *
      *                      *-----------------------------------------*
           move      w-inp-tes-brn        to   w-all-str-alf          .
           move      "/"                  to   w-all-str-del          .
           perform   all-str-ext-000      thru all-str-ext-999        .
      *
           move      "CV"                 to   v-ope                  .
           move      07                   to   v-car                  .
           move      w-all-str-cat (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-det-num-oft-npg      .
      *                      *-----------------------------------------*
      *                      * Al momento non si estrae l'anno         *
      *                      * ___                                     *
      *                      *-----------------------------------------*
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-doc-058.
       stp-srt-inp-doc-055.
      *                      *-----------------------------------------*
      *                      * Se senza separatori (versione vecchia)  *
      *                      *-----------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      10                   to   v-car                  .
           move      w-inp-tes-brn        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-det-num-oft-npg      .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-doc-058.
       stp-srt-inp-doc-058.
      *                  *---------------------------------------------*
      *                  * Dipendenza                                  *
      *                  *---------------------------------------------*
           move      01                   to   w-det-num-oft-dpz      .
      *                  *---------------------------------------------*
      *                  * Sigla numerazione                           *
      *                  *---------------------------------------------*
           move      spaces               to   w-det-num-oft-sgl      .
      *                  *---------------------------------------------*
      *                  * Data documento                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se esistente                       *
      *                      *-----------------------------------------*
           if        w-inp-tes-brd        not  = spaces
                     go to  stp-srt-inp-doc-070.
      *                      *-----------------------------------------*
      *                      * Test se esistente data conferma         *
      *                      *-----------------------------------------*
           if        w-inp-tes-scd        =    spaces
                     go to  stp-srt-inp-doc-060.
      *                      *-----------------------------------------*
      *                      * Trattamento data conferma               *
      *                      *-----------------------------------------*
           move      w-inp-tes-scd        to   w-det-num-oft-dtw      .
           move      w-det-num-oft-anw    to   s-saa                  .
           add       100                  to   s-saa                  .
           move      w-det-num-oft-msw    to   s-mes                  .
           move      w-det-num-oft-giw    to   s-gio                  .
           move      s-dat                to   w-det-num-oft-dds      .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-doc-080.
       stp-srt-inp-doc-060.
      *                      *-----------------------------------------*
      *                      * Trattamento data non esistente          *
      *                      *-----------------------------------------*
           move      w-det-num-oft-sdt    to   w-det-num-oft-dds      .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-doc-080.
       stp-srt-inp-doc-070.
      *                      *-----------------------------------------*
      *                      * Trattamento data esistente              *
      *                      *-----------------------------------------*
           move      w-inp-tes-brd        to   w-det-num-oft-dtw      .
           move      w-det-num-oft-anw    to   s-saa                  .
           add       100                  to   s-saa                  .
           move      w-det-num-oft-msw    to   s-mes                  .
           move      w-det-num-oft-giw    to   s-gio                  .
           move      s-dat                to   w-det-num-oft-dds      .
       stp-srt-inp-doc-080.
      *                  *---------------------------------------------*
      *                  * Preparazione secolo, anno                   *
      *                  *---------------------------------------------*
           move      w-det-num-oft-dds    to   s-dat                  .
           move      s-saa                to   w-det-num-oft-saa      .
      *                  *---------------------------------------------*
      *                  * Completamento numero documento              *
      *                  *---------------------------------------------*
           move      w-det-num-oft-saa    to   w-det-num-oft-nsa      .
           move      w-det-num-oft-dpz    to   w-det-num-oft-ndp      .
       stp-srt-inp-doc-100.
      *              *-------------------------------------------------*
      *              * Start su file [oft]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "CNTDEN    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-det-num-oft-saa    to   rf-oft-scl-ann         .
           move      w-det-num-oft-dpz    to   rf-oft-cod-dpz         .
           move      w-det-num-oft-sgl    to   rf-oft-sgl-num         .
           move      w-det-num-oft-nds    to   rf-oft-num-doc         .
           move      zero                 to   rf-oft-num-prt         .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : a controllo contatore  *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-doc-800.
       stp-srt-inp-doc-200.
      *              *-------------------------------------------------*
      *              * Read-next su [oft]                              *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *                  *---------------------------------------------*
      *                  * Se at end : a controllo contatore           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-doc-800.
       stp-srt-inp-doc-300.
      *              *-------------------------------------------------*
      *              * Se oltre il massimo : a controllo contatore     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rf-oft-scl-ann       not  = w-det-num-oft-saa or
                     rf-oft-cod-dpz       not  = w-det-num-oft-dpz or
                     rf-oft-sgl-num       not  = w-det-num-oft-sgl or
                     rf-oft-num-doc       not  = w-det-num-oft-nds
                     go to stp-srt-inp-doc-800.
       stp-srt-inp-doc-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su fornitore                           *
      *                  *---------------------------------------------*
           if        rf-oft-cod-arc           =    0008017 or
                     rf-oft-cod-arc           =    0008020 or
                     rf-oft-cod-arc           =    0008028 or
                     rf-oft-cod-arc           =    0008039 or
                     rf-oft-cod-arc           =    0008050 or
                     rf-oft-cod-arc           =    0006210
                     go to stp-srt-inp-doc-500
           else      go to stp-srt-inp-doc-200.
       stp-srt-inp-doc-500.
      *              *-------------------------------------------------*
      *              * Bufferizzazione dati letti                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valori di output                            *
      *                  *---------------------------------------------*
           move      rf-oft-dat-doc       to   w-det-num-oft-dat      .
           move      rf-oft-num-doc       to   w-det-num-oft-num      .
           move      rf-oft-num-prt       to   w-det-num-oft-prt      .
           move      rf-oft-tmo-orf       to   w-det-num-oft-tof      .
      *                  *---------------------------------------------*
      *                  * Incremento del contatore passaggi           *
      *                  *---------------------------------------------*
           add       1                    to   w-det-num-oft-ctr      .
       stp-srt-inp-doc-800.
      *              *-------------------------------------------------*
      *              * Test su numero tentativi                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se giˆ eseguito un passaggio                *
      *                  *---------------------------------------------*
           if        w-det-num-oft-ctr    >    zero
                     go to stp-srt-inp-doc-900.
      *                  *---------------------------------------------*
      *                  * Si tenta una scansione nell'anno precedente *
      *                  *---------------------------------------------*
           move      w-det-num-oft-sai    to   w-det-num-oft-nsa      .
           subtract  1                    from w-det-num-oft-nsa      .
           subtract  1                    from w-det-num-oft-saa      .
           move      w-det-num-oft-dpz    to   w-det-num-oft-ndp      .
      *                  *---------------------------------------------*
      *                  * Incremento del contatore passaggi           *
      *                  *---------------------------------------------*
           add       1                    to   w-det-num-oft-ctr      .
      *                  *---------------------------------------------*
      *                  * A ripetizione start                         *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-doc-100.
       stp-srt-inp-doc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-doc-999.
       stp-srt-inp-doc-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *                                                           *
      *    * Determinazione riga di riferimento                        *
      *    *-----------------------------------------------------------*
       stp-srt-inp-rif-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni                                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-num-oft-prg      .
       stp-srt-inp-rif-050.
      *              *-------------------------------------------------*
      *              * Preparazione dei parametri per la ricerca       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Riga di riferimento                         *
      *                  *---------------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      03                   to   v-car                  .
           move      w-inp-rig-brr        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-det-num-oft-rpg      .
       stp-srt-inp-rif-100.
      *              *-------------------------------------------------*
      *              * Start su file [hed]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "EDIPRG    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-det-num-oft-rpg    to   rf-hed-edi-prg         .
           move      w-det-num-oft-prt    to   rf-hed-num-prt         .
           move      zero                 to   rf-hed-num-prg         .
           move      "sir/agb/fls/ioc/obj/iofhed"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-hed                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : a controllo contatore  *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-rif-900.
       stp-srt-inp-rif-200.
      *              *-------------------------------------------------*
      *              * Read-next su [hed]                              *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "sir/agb/fls/ioc/obj/iofhed"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-hed                 .
      *                  *---------------------------------------------*
      *                  * Se at end : a controllo contatore           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-rif-500.
       stp-srt-inp-rif-300.
      *              *-------------------------------------------------*
      *              * Se oltre il massimo : a controllo contatore     *
      *              *-------------------------------------------------*
           if        rf-hed-edi-prg       not  = w-det-num-oft-rpg or
                     rf-hed-num-prt       not  = w-det-num-oft-prt
                     go to stp-srt-inp-rif-900.
       stp-srt-inp-rif-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
       stp-srt-inp-rif-500.
      *              *-------------------------------------------------*
      *              * Bufferizzazione dati letti                      *
      *              *-------------------------------------------------*
           move      rf-hed-num-prg       to   w-det-num-oft-prg      .
       stp-srt-inp-rif-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-rif-999.
       stp-srt-inp-rif-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessun record trattato !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-prn-flg-sub
                            go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
      *              *-------------------------------------------------*
      *              * Filename in chiave                              *
      *              *-------------------------------------------------*
           move      srt-key-nam          to   w-rot-l02-fil-nam      .
      *              *-------------------------------------------------*
      *              * Protocollo documento                            *
      *              *-------------------------------------------------*
           move      srt-num-prt          to   w-rot-l02-num-prt      .
      *              *-------------------------------------------------*
      *              * Data conferma fornitore                         *
      *              *-------------------------------------------------*
           move      srt-key-scd          to   w-rot-l02-key-scd      .
      *              *-------------------------------------------------*
      *              * Progressivo riga                                *
      *              *-------------------------------------------------*
           move      srt-num-prg          to   w-rot-l01-num-prg      .
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Test se dettaglio da stampare                   *
      *              *-------------------------------------------------*
           if        rr-opz-stp-det       not  = spaces
                     go to prn-ini-cic-999.
       prn-ini-cic-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr2-100.
      *              *-------------------------------------------------*
      *              * Test se record che riguarda la testata          *
      *              *-------------------------------------------------*
           if        srt-tip-rec          not  = "H"
                     go to prn-ini-lr2-900.
       prn-ini-lr2-200.
      *              *-------------------------------------------------*
      *              * Trattamento testata                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione [oft]                       *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *                  *---------------------------------------------*
      *                  * Recupero [oft]                              *
      *                  *---------------------------------------------*
           move      srt-rec-oft          to   rf-oft                 .
      *                  *---------------------------------------------*
      *                  * Recupero testata                            *
      *                  *---------------------------------------------*
           move      srt-rec-inp          to   w-inp-tes              .
      *                  *---------------------------------------------*
      *                  * Trattamento effettivo testata               *
      *                  *---------------------------------------------*
           perform   prn-ini-lr2-tes-000  thru prn-ini-lr2-tes-999    .
       prn-ini-lr2-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-ini-lr2-999.
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *                                                           *
      *    * Trattamento testata                                       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-tes-000.
      *              *-------------------------------------------------*
      *              * Operazioni preliminari                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se ordine individuato                  *
      *                  *---------------------------------------------*
           if        rf-oft-num-prt       not  = zero
                     go to prn-ini-lr2-tes-200.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
      *
           string    "Per il file : "
                                delimited by   size
                     srt-fil-nam
                                delimited by   spaces
                     " - non e' stato trovato l'ordine !"
                                delimited by   size
                                          into m-msg                  .
      *
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-ini-lr2-tes-900.
       prn-ini-lr2-tes-200.
      *              *-------------------------------------------------*
      *              * Stampa                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se dettaglio da stampare               *
      *                  *---------------------------------------------*
           if        rr-opz-stp-det       not  = spaces
                     go to prn-ini-lr2-tes-210.
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    7
                     go to prn-ini-lr2-tes-220.
       prn-ini-lr2-tes-210.
      *                      *-----------------------------------------*
      *                      * Reintestazione                          *
      *                      *-----------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr2-tes-999.
       prn-ini-lr2-tes-220.
      *                  *---------------------------------------------*
      *                  * Preparazione dati                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica fornitore            *
      *                      *-----------------------------------------*
           move      rf-oft-cod-arc       to   w-let-arc-dcf-fnt      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                      *-----------------------------------------*
      *                      * Editing numero ordine                   *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      rf-oft-num-doc
                    (06 : 06)             to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (03)     .
      *                      *-----------------------------------------*
      *                      * Editing data ordine                     *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      "<"                  to   p-edm                  .
           move      rf-oft-dat-doc       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (05)     .
      *                      *-----------------------------------------*
      *                      * Editing codice fornitore                *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      rf-oft-cod-arc       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (07)     .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      132                  to   w-all-str-lun          .
           move      08                   to   w-all-str-num          .
           move      rf-oft-tmo-orf       to   w-all-str-cat (01)     .
           move      "nr."                to   w-all-str-cat (02)     .
           move      "del"                to   w-all-str-cat (04)     .
           move      "Fornitore :"        to   w-all-str-cat (06)     .
           move      w-let-arc-dcf-rag    to   w-all-str-cat (08)     .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr2-tes-300.
      *                      *-----------------------------------------*
      *                      * Editing data riferimento                *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      "<"                  to   p-edm                  .
      *
           move      w-inp-tes-scd        to   w-det-num-oft-dtw      .
           move      w-det-num-oft-anw    to   s-saa                  .
           add       100                  to   s-saa                  .
           move      w-det-num-oft-msw    to   s-mes                  .
           move      w-det-num-oft-giw    to   s-gio                  .
           move      s-dat                to   p-dat                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (03)     .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      33                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "Riferimenti :"      to   w-all-str-cat (01)     .
           move      w-inp-tes-scn        to   w-all-str-cat (02)     .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      033                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      100                  to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Nome file allineato a destra            *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      w-rot-l02-fil-nam    to   w-all-str-alf          .
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      040                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      093                  to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura                          *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr2-tes-400.
      *                  *---------------------------------------------*
      *                  * Fincatura per dettaglio                     *
      *                  *---------------------------------------------*
           perform   fin-liv-det-000      thru fin-liv-det-999        .
       prn-ini-lr2-tes-600.
      *              *-------------------------------------------------*
      *              * Bufferizzazione                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Data conferma ordine                        *
      *                  *---------------------------------------------*
           move      w-inp-tes-scd        to   w-det-num-oft-dtw      .
           move      w-det-num-oft-anw    to   s-saa                  .
           add       100                  to   s-saa                  .
           move      w-det-num-oft-msw    to   s-mes                  .
           move      w-det-num-oft-giw    to   s-gio                  .
           move      s-dat                to   w-gen-buf-dat          .
      *                  *---------------------------------------------*
      *                  * Numero conferma ordine                      *
      *                  *---------------------------------------------*
           move      w-inp-tes-scn        to   w-gen-buf-num          .
      *                  *---------------------------------------------*
      *                  * Riferimento conferma ordine                 *
      *                  *---------------------------------------------*
           move      w-inp-tes-srs        to   w-gen-buf-rif          .
       prn-ini-lr2-tes-800.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo esecuzione      *
      *              *-------------------------------------------------*
           if        rr-tip-exe           =    01
                     go to prn-ini-lr2-tes-850
           else if   rr-tip-exe           =    02
                     go to prn-ini-lr2-tes-860
           else      go to prn-ini-lr2-tes-850.
       prn-ini-lr2-tes-850.
      *              *-------------------------------------------------*
      *              * Esecuzione di prova                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nessuna azione                              *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-ini-lr2-tes-900.
       prn-ini-lr2-tes-860.
      *              *-------------------------------------------------*
      *              * Esecuzione definitiva                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Aggiornamento testata ordine per riferimen- *
      *                  * ti conferma ordine                          *
      *                  *---------------------------------------------*
______*    perform   agg-rec-oft-000      thru agg-rec-oft-999        .
      *                  *---------------------------------------------*
      *                  * Cancellazione file Retarus e aggiornamento  *
      *                  * database elementi trattati                  *
      *                  *---------------------------------------------*
           perform   del-fls-agb-000      thru del-fls-agb-999        .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-ini-lr2-tes-900.
       prn-ini-lr2-tes-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-ini-lr2-tes-999.
       prn-ini-lr2-tes-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento record [oft]                                *
      *    *                                                           *
      *    * Inibito (30/08/07)                                        *
      *    *-----------------------------------------------------------*
       agg-rec-oft-000.
      *              *-------------------------------------------------*
      *              * INIBITO                                         *
      *              *-------------------------------------------------*
           go to     agg-rec-oft-999.
      *              *-------------------------------------------------*
      *              * Normalizzazione record [oft]                    *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
       agg-rec-oft-100.
      *              *-------------------------------------------------*
      *              * Lettura record [oft]                            *
      *              *-------------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      srt-num-prt          to   rf-oft-num-prt         .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *                  *---------------------------------------------*
      *                  * Test su esito lettura                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to agg-rec-oft-900.
       agg-rec-oft-200.
      *              *-------------------------------------------------*
      *              * Aggiornamento record [oft]                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Data conferma ordine                        *
      *                  *---------------------------------------------*
           move      w-inp-tes-scd        to   w-det-num-oft-dtw      .
           move      w-det-num-oft-anw    to   s-saa                  .
           add       100                  to   s-saa                  .
           move      w-det-num-oft-msw    to   s-mes                  .
           move      w-det-num-oft-giw    to   s-gio                  .
           move      s-dat                to   rf-oft-cof-dat         .
      *                  *---------------------------------------------*
      *                  * Numero conferma ordine                      *
      *                  *---------------------------------------------*
           move      w-inp-tes-scn        to   rf-oft-cof-num         .
      *                  *---------------------------------------------*
      *                  * Riferimento conferma ordine                 *
      *                  *---------------------------------------------*
           move      w-inp-tes-srs        to   rf-oft-cof-rif         .
       agg-rec-oft-400.
      *              *-------------------------------------------------*
      *              * Update record                                   *
      *              *-------------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *              *-------------------------------------------------*
      *              * Release record                                  *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
       agg-rec-oft-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     agg-rec-oft-999.
       agg-rec-oft-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr1-100.
      *              *-------------------------------------------------*
      *              * Test se record che riguarda la riga             *
      *              *-------------------------------------------------*
           if        srt-tip-rec          not  = "D"
                     go to prn-ini-lr1-999.
       prn-ini-lr1-200.
      *              *-------------------------------------------------*
      *              * Flag progressivo riga ordine trattato           *
      *              *-------------------------------------------------*
           move      spaces               to   w-gen-rot-prg          .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-liv-det-100.
      *              *-------------------------------------------------*
      *              * Trattamento in base al tipo di record           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        srt-tip-rec          not  = "D"
                     go to prn-liv-det-900.
       prn-liv-det-200.
      *              *-------------------------------------------------*
      *              * Trattamento riga                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione [ofr]                       *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Recupero [ofr]                              *
      *                  *---------------------------------------------*
           move      srt-rec-ofr          to   rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Recupero riga                               *
      *                  *---------------------------------------------*
           move      srt-rec-inp          to   w-inp-rig              .
      *                  *---------------------------------------------*
      *                  * Trattamento effettivo riga                  *
      *                  *---------------------------------------------*
           perform   prn-liv-det-rig-000  thru prn-liv-det-rig-999    .
       prn-liv-det-800.
      *              *-------------------------------------------------*
      *              * Flag progressivo riga ordine trattato           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-gen-rot-prg          .
       prn-liv-det-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Trattamento riga                                          *
      *    *-----------------------------------------------------------*
       prn-liv-det-rig-000.
      *              *-------------------------------------------------*
      *              * Operazioni preliminari                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se riga rintracciata                   *
      *                  *---------------------------------------------*
           if        rf-ofr-num-prg       not  = zero
                     go to prn-liv-det-rig-050.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
      *
           string    "Errori nel file : "
                                delimited by   size
                     srt-fil-nam
                                delimited by   spaces
                                          into m-msg                  .
      *
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
      *
           string    "Per la riga : "
                                delimited by   size
                     w-inp-rig-brr
                                delimited by   spaces
                     " - non e' stato trovata corrispondenza !"
                                delimited by   size
                                          into m-msg                  .
      *
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Emissione della riga intera                 *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-inp-rig            to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Emissione sottolineatura                    *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      all "-"              to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-rig-900.
       prn-liv-det-rig-050.
      *                  *---------------------------------------------*
      *                  * Test di congruenza codice prodotto          *
      *                  *---------------------------------------------*
           if        rf-ofr-alf-mag       =    w-inp-rig-bpn
                     go to prn-liv-det-rig-100.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
      *
           string    "Errori nel file : "
                                delimited by   size
                     srt-fil-nam
                                delimited by   spaces
                                          into m-msg                  .
      *
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
      *
           string    "Per la riga : "
                                delimited by   size
                     w-inp-rig-brr
                                delimited by   spaces
                     " - il codice prodotto non trova corrispondenza !"
                                delimited by   size
                                          into m-msg                  .
      *
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-rig-900.
       prn-liv-det-rig-100.
      *              *-------------------------------------------------*
      *              * Conversione elementi letti                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Action notification                         *
      *                  *---------------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      02                   to   v-car                  .
           move      w-inp-rig-acn        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-gen-buf-ant          .
      *                  *---------------------------------------------*
      *                  * Data conferma                               *
      *                  *---------------------------------------------*
           if        w-inp-rig-dlc        =    spaces
                     move  w-det-num-oft-sdt
                                          to   w-gen-buf-dcf
                     go to prn-liv-det-rig-120.
      *
           move      w-inp-rig-dlc        to   w-det-num-oft-dtw      .
           move      w-det-num-oft-anw    to   s-saa                  .
           add       100                  to   s-saa                  .
           move      w-det-num-oft-msw    to   s-mes                  .
           move      w-det-num-oft-giw    to   s-gio                  .
           move      s-dat                to   w-gen-buf-dcf          .
       prn-liv-det-rig-120.
      *                  *---------------------------------------------*
      *                  * Quantita' in conferma                       *
      *                  *---------------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      10                   to   v-car                  .
           move      w-inp-rig-qtc        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-gen-buf-qtc          .
      *                  *---------------------------------------------*
      *                  * Quantita' per il prezzo                     *
      *                  *---------------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      05                   to   v-car                  .
           move      w-inp-rig-pqr        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-gen-buf-qrf          .
      *                  *---------------------------------------------*
      *                  * Prezzo in conferma                          *
      *                  *---------------------------------------------*
           inspect   w-inp-rig-pcf
                                replacing all  "."
                                          by   ","                    .
      *
           move      "CV"                 to   v-ope                  .
           move      10                   to   v-car                  .
           move      w-inp-rig-pcf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-gen-buf-pcf          .
      *
           if        w-gen-buf-qrf        =    10000
                     multiply  10         by   w-gen-buf-pcf
           else if   w-gen-buf-qrf        =    1000
                     multiply  100        by   w-gen-buf-pcf
           else if   w-gen-buf-qrf        =    100
                     multiply  1000       by   w-gen-buf-pcf
           else if   w-gen-buf-qrf        =    10
                     multiply  10000      by   w-gen-buf-pcf
           else if   w-gen-buf-qrf        =    1
                     multiply  100000     by   w-gen-buf-pcf
           else      multiply  100000     by   w-gen-buf-pcf          .
       prn-liv-det-rig-200.
      *              *-------------------------------------------------*
      *              * Confronto tra elementi                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Part Number fornitore                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione [aaq]                   *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                      *-----------------------------------------*
      *                      * Lettura [aaq]                           *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      01                   to   rf-aaq-tip-mag         .
           move      rf-ofr-num-mag       to   rf-aaq-num-pro         .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                      *-----------------------------------------*
      *                      * Codice prodotto per il fornitore        *
      *                      *-----------------------------------------*
           if        rf-aaq-cdp-pdt       =    w-inp-rig-spn
                     move  spaces         to   w-gen-buf-cfl
           else      move  "*"            to   w-gen-buf-cfl          .
      *                  *---------------------------------------------*
      *                  * Quantita' in conferma                       *
      *                  *---------------------------------------------*
           if        rf-ofr-qta-ord       =    w-gen-buf-qtc
                     move  " "            to   w-gen-buf-qfl
           else if   rf-ofr-qta-ord       >    w-gen-buf-qtc
                     move  "-"            to   w-gen-buf-qfl
           else      move  "+"            to   w-gen-buf-qfl          .
      *                  *---------------------------------------------*
      *                  * Prezzo in conferma                          *
      *                  *---------------------------------------------*
           if        rf-ofr-prz-net       =    w-gen-buf-pcf
                     move  " "            to   w-gen-buf-pfl
           else if   rf-ofr-prz-net       >    w-gen-buf-pcf
                     move  "-"            to   w-gen-buf-pfl
           else      move  "+"            to   w-gen-buf-pfl          .
      *                  *---------------------------------------------*
      *                  * Data conferma                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Calcolo differenza date                 *
      *                      *-----------------------------------------*
           move      rf-ofr-dcn-ric       to   w-clc-dat-min          .
           move      w-gen-buf-dcf        to   w-clc-dat-max          .
           perform   clc-ope-dat-000      thru clc-ope-dat-999        .
      *                      *-----------------------------------------*
      *                      * Se gap <> 10 gg. (Norina 17/10/07)      *
      *                      *-----------------------------------------*
           if        w-clc-dat-nrg        >    9
                     move  "+"            to   w-gen-buf-dfl
           else if   w-clc-dat-nrg        <   -9
                     move  "-"            to   w-gen-buf-dfl
           else      move  " "            to   w-gen-buf-dfl          .
       prn-liv-det-rig-600.
      *              *-------------------------------------------------*
      *              * Stampa                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se dettaglio da stampare               *
      *                  *---------------------------------------------*
           if        rr-opz-stp-det       =    spaces
                     go to prn-liv-det-rig-800.
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    1
                     go to prn-liv-det-rig-620.
      *                      *-----------------------------------------*
      *                      * Reintestazione                          *
      *                      *-----------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-rig-999.
      *                      *-----------------------------------------*
      *                      * Fincatura per dettaglio                 *
      *                      *-----------------------------------------*
           perform   fin-liv-det-000      thru fin-liv-det-999        .
       prn-liv-det-rig-620.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Codice prodotto                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      rf-ofr-alf-mag       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Flag di riga extra                          *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      010                  to   p-pos                  .
           move      w-gen-rot-prg        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Progressivo riga fornitore                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing progressivo EDI di riferimento  *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      srt-edi-rif          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      05                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "{"                  to   w-all-str-cat (1)      .
           move      p-edt                to   w-all-str-cat (2)      .
           move      "}"                  to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      013                  to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Part Number fornitore (nostro)              *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      020                  to   p-pos                  .
           move      rf-aaq-cdp-pdt       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Flag di variazione Part Number              *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      034                  to   p-pos                  .
           move      w-gen-buf-cfl        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Part Number fornitore                       *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      036                  to   p-pos                  .
           move      w-inp-rig-spn        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Descrizione riga                            *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Unita' di misura                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      057                  to   p-pos                  .
           move      rf-ofr-umi-acq       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Quantita' ordinata                          *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "GB"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      060                  to   p-pos                  .
           move      rf-ofr-qta-ord       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-rig-680.
      *                  *---------------------------------------------*
      *                  * Test su Notification Action                 *
      *                  *---------------------------------------------*
           if        w-gen-buf-ant        =    04 or
                     w-gen-buf-ant        =    05 or
                     w-gen-buf-ant        =    06
                     go to prn-liv-det-rig-700.
      *                  *---------------------------------------------*
      *                  * Notifica rilevata                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      072                  to   p-pos                  .
      *
           if        w-gen-buf-ant        =    02
                     move  "DELETED   "   to   p-alf
           else if   w-gen-buf-ant        =    07
                     move  "NOT ACCEPT"   to   p-alf
           else if   w-gen-buf-ant        =    10
                     move  "NOT FOUND "   to   p-alf
           else      move  "???       "   to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Oltre                                       *
      *                  *---------------------------------------------*
           go to     prn-liv-det-rig-720.
       prn-liv-det-rig-700.
      *                  *---------------------------------------------*
      *                  * Quantita' confermata                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "GB"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      071                  to   p-pos                  .
           move      w-gen-buf-qtc        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Flag di variazione quantita'                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      082                  to   p-pos                  .
           move      w-gen-buf-qfl        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-rig-720.
      *                  *---------------------------------------------*
      *                  * Prezzo unitario confermato                  *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           if        w-gen-buf-pcf        >    9999999
                     move  09             to   p-car
           else      move  07             to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      spaces               to   p-sgn                  .
           if        w-gen-buf-pcf        >    9999999
                     move  "B"            to   p-edm
           else      move  "BG"           to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      083                  to   p-pos                  .
           move      w-gen-buf-pcf        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Flag di variazione prezzo                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      093                  to   p-pos                  .
           move      w-gen-buf-pfl        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data consegna richiesta                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      094                  to   p-pos                  .
           move      rf-ofr-dcn-ric       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Flag di variazione data                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      111                  to   p-pos                  .
           move      w-gen-buf-dfl        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data consegna confermata                    *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      103                  to   p-pos                  .
           move      w-gen-buf-dcf        to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Note - eventuale stato riga ordine          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se riga chiusa                     *
      *                      *-----------------------------------------*
           if        rf-ofr-flg-rch       =    spaces
                     go to prn-liv-det-rig-770.
      *                      *-----------------------------------------*
      *                      * Messaggio riga chiusa                   *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      113                  to   p-pos                  .
           move      "RIGA CHIUSA !!!     "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     prn-liv-det-rig-800.
       prn-liv-det-rig-770.
      *                      *-----------------------------------------*
      *                      * Determinazione quantita' evasa riga     *
      *                      *-----------------------------------------*
           move      "DT"                 to   d-qev-rof-tip-ope      .
           move      "pgm/orf/prg/obj/dqevrof0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-qev-rof
                                               rf-ofr                 .
      *                      *-----------------------------------------*
      *                      * Test se riga evasa                      *
      *                      *-----------------------------------------*
           if        d-qev-rof-qta-ric    =    zero
                     go to prn-liv-det-rig-780.
           if        d-qev-rof-qta-ric    =    rf-ofr-qta-ord
                     go to prn-liv-det-rig-777.
       prn-liv-det-rig-775.
      *                      *-----------------------------------------*
      *                      * Messaggio riga parzialmente evasa       *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      113                  to   p-pos                  .
           move      "RIGA CON EVASIONI ! "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     prn-liv-det-rig-800.
       prn-liv-det-rig-777.
      *                      *-----------------------------------------*
      *                      * Messaggio riga evasa                    *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      113                  to   p-pos                  .
           move      "RIGA EVASA !        "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     prn-liv-det-rig-800.
       prn-liv-det-rig-780.
      *                  *---------------------------------------------*
      *                  * Note - quota                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      113                  to   p-pos                  .
           move      w-inp-rig-pqc        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-rig-800.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo esecuzione      *
      *              *-------------------------------------------------*
           if        rr-tip-exe           =    01
                     go to prn-liv-det-rig-850
           else if   rr-tip-exe           =    02
                     go to prn-liv-det-rig-860
           else      go to prn-liv-det-rig-850.
       prn-liv-det-rig-850.
      *              *-------------------------------------------------*
      *              * Esecuzione di prova                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nessuna azione                              *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-rig-900.
       prn-liv-det-rig-860.
      *              *-------------------------------------------------*
      *              * Esecuzione definitiva                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Aggiornamento [her]                         *
      *                  *---------------------------------------------*
           perform   wrt-rec-her-000      thru wrt-rec-her-999        .
      *                  *---------------------------------------------*
      *                  * Aggiornamento riga ordine                   *
      *                  *---------------------------------------------*
______*    perform   agg-rec-ofr-000      thru agg-rec-ofr-999        .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-rig-900.
       prn-liv-det-rig-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-rig-999.
       prn-liv-det-rig-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento record [ofr]                                *
      *    *                                                           *
      *    * Inibito (30/08/07)                                        *
      *    *-----------------------------------------------------------*
       agg-rec-ofr-000.
      *              *-------------------------------------------------*
      *              * INIBITO                                         *
      *              *-------------------------------------------------*
           go to     agg-rec-ofr-999.
      *              *-------------------------------------------------*
      *              * Test su flag di riga extra                      *
      *              *-------------------------------------------------*
           if        w-gen-rot-prg        =    spaces
                     go to agg-rec-ofr-300.
       agg-rec-ofr-100.
      *              *-------------------------------------------------*
      *              * Scrittura riga extra                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione progressivo riga ordine      *
      *                  *---------------------------------------------*
           move      rf-ofr-num-prt       to   w-det-prg-ofr-prt      .
           move      rf-ofr-num-prg       to   w-det-prg-ofr-prg      .
           perform   det-prg-ofr-000      thru det-prg-ofr-999        .
      *                  *---------------------------------------------*
      *                  * Nuovo progressivo determinato               *
      *                  *---------------------------------------------*
           move      w-det-prg-ofr-new    to   rf-ofr-num-prg         .
      *                  *---------------------------------------------*
      *                  * Composizione record [ofr]                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Data consegna prevista                  *
      *                      *-----------------------------------------*
           move      w-inp-rig-dlc        to   w-det-num-oft-dtw      .
           move      w-det-num-oft-anw    to   s-saa                  .
           add       100                  to   s-saa                  .
           move      w-det-num-oft-msw    to   s-mes                  .
           move      w-det-num-oft-giw    to   s-gio                  .
           move      s-dat                to   rf-ofr-dcn-prv         .
      *                      *-----------------------------------------*
      *                      * Flag conferma                           *
      *                      *-----------------------------------------*
           move      "C"                  to   rf-ofr-flg-cnf         .
      *                      *-----------------------------------------*
      *                      * Quantita' confermata                    *
      *                      *-----------------------------------------*
           move      w-gen-buf-qtc        to   rf-ofr-qta-ord         .
      *                      *-----------------------------------------*
      *                      * Prezzo confermato                       *
      *                      *-----------------------------------------*
           move      w-gen-buf-pcf        to   rf-ofr-prz-acq         .
           move      w-gen-buf-pcf        to   rf-ofr-prz-net         .
       agg-rec-ofr-200.
      *                  *---------------------------------------------*
      *                  * Write record [ofr]                          *
      *                  *---------------------------------------------*
           perform   wrt-rec-ofr-000      thru wrt-rec-ofr-999        .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     agg-rec-ofr-900.
       agg-rec-ofr-300.
      *              *-------------------------------------------------*
      *              * Update riga esistente                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [ofr]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [ofr]                        *
      *                  *---------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      srt-num-prt          to   rf-ofr-num-prt         .
           move      srt-num-prg          to   rf-ofr-num-prg         .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Test su esito lettura                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to agg-rec-ofr-900.
       agg-rec-ofr-400.
      *                  *---------------------------------------------*
      *                  * Aggiornamento record [ofr]                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se riga cancellata dal fornitore        *
      *                      *-----------------------------------------*
           if        w-gen-buf-ant        not  = 02 and
                     w-gen-buf-ant        not  = 07
                     go to agg-rec-ofr-440.
      *                      *-----------------------------------------*
      *                      * Flag di riga chiusa                     *
      *                      *-----------------------------------------*
           move      "#"                  to   rf-ofr-flg-rch         .
      *                      *-----------------------------------------*
      *                      * Flag di riga saldata                    *
      *                      *-----------------------------------------*
           move      "#"                  to   rf-ofr-sdr-ccs         .
      *                      *-----------------------------------------*
      *                      * A update                                *
      *                      *-----------------------------------------*
           go to     agg-rec-ofr-500.
       agg-rec-ofr-440.
      *                      *-----------------------------------------*
      *                      * Data consegna prevista                  *
      *                      *-----------------------------------------*
           move      w-inp-rig-dlc        to   w-det-num-oft-dtw      .
           move      w-det-num-oft-anw    to   s-saa                  .
           add       100                  to   s-saa                  .
           move      w-det-num-oft-msw    to   s-mes                  .
           move      w-det-num-oft-giw    to   s-gio                  .
           move      s-dat                to   rf-ofr-dcn-prv         .
      *                      *-----------------------------------------*
      *                      * Flag conferma                           *
      *                      *-----------------------------------------*
           move      "C"                  to   rf-ofr-flg-cnf         .
      *                      *-----------------------------------------*
      *                      * Quantita' confermata                    *
      *                      *-----------------------------------------*
           move      w-gen-buf-qtc        to   rf-ofr-qta-ord         .
      *                      *-----------------------------------------*
      *                      * Quantita' per il formato d'acquisto     *
      *                      *-----------------------------------------*
           move      w-gen-buf-qtc        to   rf-ofr-qta-fda         .
           divide    1000                 into rf-ofr-qta-fda         .
      *                      *-----------------------------------------*
      *                      * Prezzo confermato                       *
      *                      *-----------------------------------------*
           move      w-gen-buf-pcf        to   rf-ofr-prz-acq         .
           move      w-gen-buf-pcf        to   rf-ofr-prz-net         .
      *                      *-----------------------------------------*
      *                      * Importo in riga                         *
      *                      *-----------------------------------------*
           perform   det-imp-rig-000      thru det-imp-rig-999        .
           move      d-imp-acq-imp-rig    to   rf-ofr-imp-rig         .
       agg-rec-ofr-500.
      *                  *---------------------------------------------*
      *                  * Update record                               *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Release record                              *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     agg-rec-ofr-900.
       agg-rec-ofr-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     agg-rec-ofr-999.
       agg-rec-ofr-999.
           exit.

      *    *===========================================================*
      *    * Scrittura record righe [ofr]                              *
      *    *-----------------------------------------------------------*
       wrt-rec-ofr-000.
      *              *-------------------------------------------------*
      *              * Put record                                      *
      *              *-------------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
       wrt-rec-ofr-999.
           exit.

      *    *===========================================================*
      *    * Composizione record righe [her]                           *
      *    *-----------------------------------------------------------*
       cmp-rec-her-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "sir/agb/fls/ioc/obj/iofher"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-her                 .
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
           move      srt-fil-nam          to   rf-her-pth-edi         .
           move      srt-fil-prg          to   rf-her-prg-inp         .
           move      srt-num-prt          to   rf-her-orc-prt         .
           move      srt-num-prg          to   rf-her-orc-prg         .
           move      srt-edi-rif          to   rf-her-edi-prg         .
           move      w-gen-buf-dat        to   rf-her-cof-dat         .
           move      w-gen-buf-num        to   rf-her-cof-num         .
           move      w-gen-buf-rif        to   rf-her-cof-rif         .
           move      w-gen-buf-qtc        to   rf-her-qta-cnf         .
           move      w-gen-buf-pcf        to   rf-her-prz-cnf         .
           move      w-gen-buf-dcf        to   rf-her-dcn-cnf         .
           move      rf-ofr-alf-mag       to   rf-her-alf-pro         .
           move      w-inp-rig-spn        to   rf-her-alf-fnt         .
           move      spaces               to   rf-her-flg-car         .
           move      w-gen-buf-ant        to   rf-her-act-not         .
           move      spaces               to   rf-her-alx-exp         .
       cmp-rec-her-999.
           exit.

      *    *===========================================================*
      *    * Scrittura record righe [her]                              *
      *    *-----------------------------------------------------------*
       wrt-rec-her-000.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
           perform   cmp-rec-her-000      thru cmp-rec-her-999        .
      *              *-------------------------------------------------*
      *              * Put record                                      *
      *              *-------------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "sir/agb/fls/ioc/obj/iofher"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-her                 .
       wrt-rec-her-999.
           exit.

      *    *===========================================================*
      *    * Determinazione progressivo riga successivo libero         *
      *    *-----------------------------------------------------------*
       det-prg-ofr-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni                                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-prg-ofr-new      .
       det-prg-ofr-200.
      *              *-------------------------------------------------*
      *              * Incremento di 1 unita'                          *
      *              *-------------------------------------------------*
           add       1                    to   w-det-prg-ofr-prg
                                        giving w-det-prg-ofr-new      .
       det-prg-ofr-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-prg-ofr-999.
       det-prg-ofr-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri intestazione standard    *
      *              *-------------------------------------------------*
           move      "LOG TRATTAMENTO FILES RICEVUTI DA RETARUS"
                                          to   w-cnt-tit-des-tit      .
       int-pag-sta-040.
      *              *-------------------------------------------------*
      *              * System date                                     *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-cnt-tit-dat-stp      .
           move      p-pag                to   w-cnt-tit-num-pag      .
           add       1                    to   w-cnt-tit-num-pag      .
       int-pag-sta-100.
      *              *-------------------------------------------------*
      *              * Intestazione standard                           *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per interruzione forzata          *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-sta-999.
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Fincatura per il livello di dettaglio                     *
      *    *-----------------------------------------------------------*
       fin-liv-det-000.
      *              *-------------------------------------------------*
      *              * Test se dettaglio da stampare                   *
      *              *-------------------------------------------------*
           if        rr-opz-stp-det       =    spaces
                     go to fin-liv-det-999.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       02
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura                                       *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Ns. Cod. S  r.Edi               Part number       
      -              "      Udm  Ordinato  Confermato   Prezzo   Cons.Ri
      -              "c Cons.Cnf          Note        "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura                        *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "-------  -  -----  -------------------------------
      -              "----- --- ---------- ---------- ---------- -------
      -              "- --------  --------------------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       1
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       fin-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di conversione : Trasferimento iniziale dei files   *
      *    *                        generati, nel server               *
      *    *-----------------------------------------------------------*
       trf-fls-srv-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Comando di ricezione                            *
      *              *-------------------------------------------------*
           move      spaces               to   o-shs                  .
           string    "t_retarus_sel "
                                delimited by   size
                     "94.199.91.48 "
                                delimited by   size
                     "siri_vishay "
                                delimited by   size
                     "q7nw3hefzuwfzhwx "
                                delimited by   size
                                          into o-shs                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo 'mopsys'                    *
      *              *-------------------------------------------------*
           move      "SH"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Attesa tecnica di 2 secondi                     *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mwait0"                         .
           call      "swd/mod/prg/obj/mwait0"                         .
       trf-fls-srv-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
            go to    trf-fls-srv-999.
       trf-fls-srv-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di conversione : Cancellazione file Retarus e ag-   *
      *    *                        giornamento database elementi      *
      *    *-----------------------------------------------------------*
       del-fls-agb-000.
      *              *-------------------------------------------------*
      *              * Codice utente da passare al modulo              *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Comando di ricezione                            *
      *              *-------------------------------------------------*
           move      spaces               to   o-shs                  .
           string    "t_retarus_del "
                                delimited by   size
                     "94.199.91.48 "
                                delimited by   size
                     "siri_vishay "
                                delimited by   size
                     "q7nw3hefzuwfzhwx "
                                delimited by   size
                     srt-fil-nam
                                delimited by   spaces
                     " "
                                delimited by   size
                     s-ute
                                delimited by   spaces
                     " "
                                delimited by   size
                     w-inp-tes-sel                                
                                delimited by   spaces
                     " "
                                delimited by   size
                     w-inp-tes-brn
                                delimited by   spaces
                                          into o-shs                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo 'mopsys'                    *
      *              *-------------------------------------------------*
           move      "SH"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Attesa tecnica di 1 secondo                     *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mwait0"                         .
       del-fls-agb-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
            go to    del-fls-agb-999.
       del-fls-agb-999.
           exit.

      *    *===========================================================*
      *    * Preparazione pathname di base files sequenziali           *
      *    *-----------------------------------------------------------*
       pre-bas-pth-000.
      *              *-------------------------------------------------*
      *              * Pathname di base da segreteria                  *
      *              *-------------------------------------------------*
           move      "PB"                 to   s-ope                  .
           move      "asc "               to   s-nam                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * String                                          *
      *              *-------------------------------------------------*
           move      spaces               to   f-xxx-ppb              .
           string    s-pat      delimited by   spaces
                     "/imp"     delimited by   size
                                          into f-xxx-ppb              .
       pre-bas-pth-999.
           exit.

      *    *===========================================================*
      *    * Open generica file sequenziale di input                   *
      *    *-----------------------------------------------------------*
       opn-seq-inp-000.
      *              *-------------------------------------------------*
      *              * Apertura del file in input                      *
      *              *-------------------------------------------------*
           move      "OI"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      f-xxx-pat            to   g-pat                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
       opn-seq-inp-999.
           exit.

      *    *===========================================================*
      *    * Get next generica per input in sequenziale                *
      *    *-----------------------------------------------------------*
       get-nxt-inp-000.
      *              *-------------------------------------------------*
      *              * Lettura linea                                   *
      *              *-------------------------------------------------*
           move      "GN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
       get-nxt-inp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [fnt]                         *
      *    *-----------------------------------------------------------*
       let-arc-fnt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-fnt-cod    =    zero
                     go to let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT"             to   f-key                  .
           move      w-let-arc-fnt-cod    to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-fnt-400.
       let-arc-fnt-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-fnt-rag-soc       to   w-let-arc-fnt-rag      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-fnt-999.
       let-arc-fnt-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-fnt-flg      .
           move      all   "."            to   w-let-arc-fnt-rag      .
           go to     let-arc-fnt-999.
       let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-rag      .
       let-arc-fnt-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dcf]                         *
      *    *-----------------------------------------------------------*
       let-arc-dcf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcf-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-fnt    =    zero
                     go to let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT"             to   f-key                  .
           move      w-let-arc-dcf-fnt    to   rf-dcf-cod-fnt         .
           move      w-let-arc-dcf-dpz    to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcf-400.
       let-arc-dcf-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcf-rag-soc       to   w-let-arc-dcf-rag      .
           move      rf-dcf-cod-vlt       to   w-let-arc-dcf-vlt      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcf-999.
       let-arc-dcf-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcf-flg      .
           move      all"."               to   w-let-arc-dcf-rag      .
           move      spaces               to   w-let-arc-dcf-vlt      .
           go to     let-arc-dcf-999.
       let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcf-rag      .
           move      spaces               to   w-let-arc-dcf-vlt      .
       let-arc-dcf-999.
           exit.

      *    *===========================================================*
      *    * Determinazione importo in riga                            *
      *    *-----------------------------------------------------------*
       det-imp-rig-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri per la determinazione    *
      *              *-------------------------------------------------*
           move      "IR"                 to   d-imp-acq-tip-ope      .
           move      rf-ofr-qta-fda       to   d-imp-acq-qta-acq      .
           move      rf-ofr-prz-acq       to   d-imp-acq-prz-uni      .
           move      rf-ofr-dec-prz       to   d-imp-acq-dec-prz      .
           move      rf-ofr-per-scr (1)   to   d-imp-acq-per-scr (1)  .
           move      rf-ofr-per-scr (2)   to   d-imp-acq-per-scr (2)  .
           move      rf-ofr-per-scr (3)   to   d-imp-acq-per-scr (3)  .
           move      rf-ofr-per-scr (4)   to   d-imp-acq-per-scr (4)  .
           move      rf-ofr-per-scr (5)   to   d-imp-acq-per-scr (5)  .
           move      spaces               to   d-imp-acq-tip-clc      .
      *              *-------------------------------------------------*
      *              * Determinazione                                  *
      *              *-------------------------------------------------*
           move      "pgm/ffo/prg/obj/dimpacq0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-imp-acq              .
       det-imp-rig-999.
           exit.

      *    *===========================================================*
      *    * Routine per calcoli ed operazioni su date                 *
      *    *-----------------------------------------------------------*
       clc-ope-dat-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-clc-dat-nrg          .
           move      w-clc-dat-min        to   w-clc-dat-ng0          .
      *              *-------------------------------------------------*
      *              * Test preliminari                                *
      *              *-------------------------------------------------*
           if        w-clc-dat-max        not  > w-clc-dat-min
                     go to clc-ope-dat-999.
       clc-ope-dat-100.
      *              *-------------------------------------------------*
      *              * Ciclo                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento                                  *
      *                  *---------------------------------------------*
           add       1                    to   w-clc-dat-nrg          .
           move      w-clc-dat-ng0        to   w-det-dat-nrg-dtb      .
           move      1                    to   w-det-dat-nrg-ngi      .
           perform   det-dat-nrg-000      thru det-dat-nrg-999        .
           move      w-det-dat-nrg-dti    to   w-clc-dat-ng0          .
           if        w-clc-dat-ng0        =    w-clc-dat-max
                     go to clc-ope-dat-999.
           go to     clc-ope-dat-100.
       clc-ope-dat-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per operazioni sulle date                     *
      *    *                                                           *
      *    * 'det-dat-nrg-000/999'                                     *
      *    *                                                           *
      *    * Routines per l'aumento di una data in giorni              *
      *    *                                                           *
      *    * Input  : w-det-dat-nrg-dtb = Data iniziale                *
      *    *                                                           *
      *    *          w-det-dat-nrg-ngi = nr. giorni di incremento     *
      *    *                                                           *
      *    *                                                           *
      *    * Output : w-det-dat-nrg-dti = Data incrementata            *
      *    *                                                           *
      *    *-----------------------------------------------------------*
      *    *                                                           *
      *    * 'det-nrg-dat-000/999'                                     *
      *    *                                                           *
      *    * Routines per l'aumento di una data in giorni              *
      *    *                                                           *
      *    * Input  : w-det-nrg-dat-dtb = Data iniziale                *
      *    *                                                           *
      *    *          w-det-nrg-dat-ngd = nr. giorni di decremento     *
      *    *                                                           *
      *    *                                                           *
      *    * Output : w-det-nrg-dat-dtd = Data decrementata            *
      *    *                                                           *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wnrgdat0.cps"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice fornitore com-  *
      *    * merciale                                                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/acmndcf0.acs"                   .

