       Identification Division.
       Program-Id.                                 pagb4800           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    sir                 *
      *                        Area gestionale:    agb                 *
      *                                Settore:                        *
      *                                   Fase:    agb480              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 03/12/04    *
      *                       Ultima revisione:    NdK del 03/12/04    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Invio circolare a clienti con Zetafax       *
      *                                                                *
      *                    /abd/asc/ZFAX/FILENAME.SUB                  *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     d-K-b-Snc-PD .
       Object-Computer.     d-K-b-Snc-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Tipo archivio                                     *
      *            *---------------------------------------------------*
               10  srt-tip-arc            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice lingua                                     *
      *            *---------------------------------------------------*
               10  srt-cod-lng            pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale archivio per ordinamento          *
      *            *---------------------------------------------------*
               10  srt-rag-key            pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Ragione sociale archivio                          *
      *            *---------------------------------------------------*
               10  srt-rag-soc            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Numero Fax                                        *
      *            *---------------------------------------------------*
               10  srt-num-fax            pic  x(30)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "sir"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "agb"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "   "                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "agb480"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pagb4800"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "  INVIO CIRCOLARE A CLIENTI CON ZETAFAX "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "msegrt" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mopsys" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/g"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine qry-rou-pri-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-qry-rou-pri      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste pre esecuzione interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico interrogazione        *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento automatico interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-aut      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di Si/No primo giro di esecuzione            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-prm-gir      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento qry-routine       *
      *        *-------------------------------------------------------*
           05  w-cnt-qry.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-qry-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-liv.
                   15  w-cnt-qry-sav-l05  pic  x(64)                  .
                   15  w-cnt-qry-sav-l04  pic  x(64)                  .
                   15  w-cnt-qry-sav-l03  pic  x(64)                  .
                   15  w-cnt-qry-sav-l02  pic  x(64)                  .
                   15  w-cnt-qry-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Literals                                              *
      *        *-------------------------------------------------------*
           05  w-cnt-lit.
               10  w-cnt-lit-t80          pic  x(80) value all "="    .
      *        *-------------------------------------------------------*
      *        * Work per padding campi alfanumerici con 'z'           *
      *        *-------------------------------------------------------*
           05  w-pad-zzz.
               10  w-pad-zzz-alf.
                   15  w-pad-zzz-alf-chr
                                   occurs 40       
                                          pic  x(01)                  .
               10  w-pad-zzz-ctr          pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per test se blanks embedded                     *
      *    *-----------------------------------------------------------*
       01  w-bla-emb.
           05  w-bla-emb-flg              pic  x(01)                  .
           05  w-bla-emb-str.
               10  w-bla-emb-chr occurs 40
                                          pic  x(01)                  .
           05  w-bla-emb-ctr              pic  9(02)                  .

      *    *===========================================================*
      *    * Record file                                               *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [adc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/azi/fls/rec/rfadc"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .

      *    *===========================================================*
      *    * Work-area richieste per programma                         *
      *    *-----------------------------------------------------------*
       01  rr.
           05  filler                     pic  x(01)                  .

      *    *===========================================================*
      *    * Work generica per il programma                            *
      *    *-----------------------------------------------------------*
       01  w-gen.
      *        *-------------------------------------------------------*
      *        * Carattere di fine record                              *
      *        *-------------------------------------------------------*
           05  w-gen-chr-end              pic  x(01)   value H"0D"    .
      *        *-------------------------------------------------------*
      *        * Data attuale                                          *
      *        *-------------------------------------------------------*
           05  w-gen-dat-att              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Si/No programma richiamato in batch                   *
      *        *-------------------------------------------------------*
           05  w-gen-snx-btc              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Contatore archivi selezionati                         *
      *        *-------------------------------------------------------*
           05  w-gen-max-arc              pic  9(09)        value 300 .
           05  w-gen-tot-arc              pic  9(09)                  .
           05  w-gen-sel-arc              pic  9(09)                  .
           05  w-gen-nam-fil              pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det pathname file sequenziale in output      *
      *        *-------------------------------------------------------*
           05  w-det-pth-fso.
               10  w-det-pth-fso-nam      pic  x(13)                  .
               10  w-det-pth-fso-pt1      pic  x(40)                  .
               10  w-det-pth-fso-pt2      pic  x(40)                  .
               10  w-det-pth-fso-pt3      pic  x(40)                  .

      *    *===========================================================*
      *    * Work per subroutines di bufferizzazione                   *
      *    *-----------------------------------------------------------*
       01  w-buf.
      *        *-------------------------------------------------------*
      *        * Work per bufferizzazione righe circolare              *
      *        *-------------------------------------------------------*
           05  w-buf-tst-cir.
               10  w-buf-tst-cir-ctr      pic  9(03)                  .
               10  w-buf-tst-cir-eff      pic  9(03)                  .
               10  w-buf-tst-cir-max      pic  9(03)       value 72   .
               10  w-buf-tst-cir-txt occurs 72.
                   15  w-buf-tst-cir-rig  pic  x(96)                  .

      *    *===========================================================*
      *    * Work-area per rotture                                     *
      *    *-----------------------------------------------------------*
       01  w-rot.
           05  w-rot-tip-arc              pic  x(01)                  .
           05  w-rot-cod-lng              pic  x(03)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale                         *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Se no richieste : a esecuzione programma        *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-500.
       main-250.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-500.
      *              *-------------------------------------------------*
      *              * Esecuzione in foreground                        *
      *              *-------------------------------------------------*
           perform   exe-pgm-frg-000      thru exe-pgm-frg-999        .
       main-750.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Test se blanks embedded in w-bla-emb-str                  *
      *    *-----------------------------------------------------------*
       tst-bla-emb-000.
           move      spaces               to   w-bla-emb-flg          .
           if        w-bla-emb-str        =    spaces
                     go to tst-bla-emb-999.
           if        w-bla-emb-chr (1)    =    spaces
                     move  "#"            to   w-bla-emb-flg
                     go to tst-bla-emb-999.
           move      1                    to   w-bla-emb-ctr          .
       tst-bla-emb-100.
           add       1                    to   w-bla-emb-ctr          .
           if        w-bla-emb-ctr        >    40
                     go to tst-bla-emb-999.
           if        w-bla-emb-chr
                    (w-bla-emb-ctr)       not  = spaces
                     go to tst-bla-emb-100.
       tst-bla-emb-200.
           add       1                    to   w-bla-emb-ctr          .
           if        w-bla-emb-ctr        >    40
                     go to tst-bla-emb-999.
           if        w-bla-emb-chr
                    (w-bla-emb-ctr)       =    spaces
                     go to tst-bla-emb-200.
           move      "#"                  to   w-bla-emb-flg          .
       tst-bla-emb-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione campo alfanumerico con padding di "z"    *
      *    *-----------------------------------------------------------*
       pad-alf-zzz-000.
           move      20                   to   w-pad-zzz-ctr          .
       pad-alf-zzz-100.
           if        w-pad-zzz-ctr        >    zero
                     if    w-pad-zzz-alf-chr
                          (w-pad-zzz-ctr) =    spaces
                           move    "z"    to   w-pad-zzz-alf-chr
                                              (w-pad-zzz-ctr)
                           subtract 1     from w-pad-zzz-ctr
                           go to    pad-alf-zzz-100.
       pad-alf-zzz-999.
           exit.

      *    *===========================================================*
      *    * Programma di esecuzione in foreground                     *
      *    *-----------------------------------------------------------*
       exe-pgm-frg-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione rullino messaggi di foreground *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se programma richiamato in modo batch : no  *
      *                  *---------------------------------------------*
           if        w-gen-snx-btc        =    "S"
                     go to exe-pgm-frg-100.
      *                  *---------------------------------------------*
      *                  * Esecuzione                                  *
      *                  *---------------------------------------------*
           move      "OF"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Se errore : uscita                          *
      *                  *---------------------------------------------*
            if       m-rsc                not  = spaces
                     go to exe-pgm-frg-999.
       exe-pgm-frg-100.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Esecuzione del programma                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Creazione archivio anagrafiche clienti      *
      *                  *---------------------------------------------*
           perform   crz-cir-arc-000      thru crz-cir-arc-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione eventuali errori di esecuzione  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se programma richiamato in modo batch : no  *
      *                  *---------------------------------------------*
           if        w-gen-snx-btc        =    "S"
                     go to exe-pgm-frg-999.
      *                  *---------------------------------------------*
      *                  * Esecuzione                                  *
      *                  *---------------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "F"                  to   b-tfe                  .
           move      i-ide-des            to   b-chr                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
           cancel    "swd/mod/prg/obj/mbckgv"                         .
       exe-pgm-frg-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Preparazione data attuale                       *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-gen-dat-att          .
      *              *-------------------------------------------------*
      *              * Lettura variabile di I.P.C. globale con il nome *
      *              * fase                                            *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "nom-fas"            to   s-var                  .
           move      "G"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Se variabile esistente e con lo stesso valore   *
      *              * del nome della fase e lettura record richieste  *
      *              * positiva : attivazione flag generico di batch   *
      *              * in corso                                        *
      *              *-------------------------------------------------*
           if        s-sts                =    spaces    and
                     s-alf                =    i-ide-fas
                     move  "S"            to   w-gen-snx-btc
           else      move  "N"            to   w-gen-snx-btc          .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda che il programma sia ri-   *
      *              * chiamato come batch o no                        *
      *              *-------------------------------------------------*
           if        w-gen-snx-btc        =    "S"
                     go to pre-tip-fun-100
           else      go to pre-tip-fun-200.
       pre-tip-fun-100.
      *              *-------------------------------------------------*
      *              * Se programma richiamato in modo batch           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Si/No richieste ad utente : No              *
      *                  *---------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-ric      .
      *                  *---------------------------------------------*
      *                  * Oltre                                       *
      *                  *---------------------------------------------*
           go to     pre-tip-fun-500.
       pre-tip-fun-200.
      *              *-------------------------------------------------*
      *              * Se programma non richiamato in modo batch       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Si/No richieste ad utente                   *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *                  *---------------------------------------------*
      *                  * Oltre                                       *
      *                  *---------------------------------------------*
           go to     pre-tip-fun-500.
       pre-tip-fun-500.
      *              *-------------------------------------------------*
      *              * No funzionamento ciclico                        *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-cic      .
      *              *-------------------------------------------------*
      *              * No funzionamento automatico                     *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-aut      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "Conferma esecuzione del programma (S/E) ?"
                                          to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "SE"                 to   v-msk                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-800.
      *              *-------------------------------------------------*
      *              * Uscita con successo                             *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Uscita con errori                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Emissione messaggio di errore               *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Creazione archivio : Circolare a clienti / fornitori      *
      *    *-----------------------------------------------------------*
       crz-cir-arc-000.
      *              *-------------------------------------------------*
      *              * Esecuzione sort per ordinamento richiesto       *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   crz-cir-arc-inp-000
                                          thru crz-cir-arc-inp-999
                     output procedure     is   crz-cir-arc-out-000
                                          thru crz-cir-arc-out-999    .
       crz-cir-arc-200.
      *              *-------------------------------------------------*
      *              * Messaggio per totale                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing archivi selezionati                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "<BG"                to   v-edm                  .
           move      w-gen-tot-arc        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Messaggio                                   *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
           string    "Elementi selezionati : "
                     " "        delimited by   size
                     v-edt
                                delimited by   spaces
                                          into m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *              *-------------------------------------------------*
      *              * Visualizzazione rullino messaggi                *
      *              *-------------------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "F"                  to   b-tfe                  .
           move      i-ide-des            to   b-chr                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
           cancel    "swd/mod/prg/obj/mbckgv"                         .
       crz-cir-arc-999.
           exit.

      *    *===========================================================*
      *    * Creazione archivio : Circolare a clienti                  *
      *    *                                                           *
      *    * Subroutine di input                                       *
      *    *-----------------------------------------------------------*
       crz-cir-arc-inp-000.
      *              *-------------------------------------------------*
      *              * Apertura files                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [adc]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofadc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-adc                 .
      *                  *---------------------------------------------*
      *                  * [dcc]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * [dcf]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
       crz-cir-arc-inp-100.
      *              *-------------------------------------------------*
      *              * Start su file [adc]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "ARCCON    "         to   f-key                  .
           move      02                   to   rf-adc-tip-arc         .
           move      zero                 to   rf-adc-cod-arc         .
           move      spaces               to   rf-adc-dpz-arc         .
           move      zero                 to   rf-adc-num-prg         .
           move      "pgm/azi/fls/ioc/obj/iofadc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-adc                 .
      *                  *---------------------------------------------*
      *                  * Se start errata : ad uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to crz-cir-arc-inp-900.
       crz-cir-arc-inp-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [adc]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofadc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-adc                 .
      *                  *---------------------------------------------*
      *                  * Se fine file : a uscita                     *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to crz-cir-arc-inp-900.
       crz-cir-arc-inp-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
       crz-cir-arc-inp-400.
      *              *-------------------------------------------------*
      *              * Selezioni su [adc]                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo archivio                       *
      *                  *---------------------------------------------*
           if        rf-adc-tip-arc       not  = 02 and
                     rf-adc-tip-arc       not  = 12
                     go to crz-cir-arc-inp-200.
      *                  *---------------------------------------------*
      *                  * Test su tipo contatto                       *
      *                  *---------------------------------------------*
           if        rf-adc-tip-con       not  = "FAX"
                     go to crz-cir-arc-inp-200.
       crz-cir-arc-inp-500.
      *              *-------------------------------------------------*
      *              * Letture complementari                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo archivio    *
      *                  *---------------------------------------------*
           if        rf-adc-tip-arc       =    02
                     go to crz-cir-arc-inp-520
           else      go to crz-cir-arc-inp-540.
       crz-cir-arc-inp-520.
      *                  *---------------------------------------------*
      *                  * Clienti                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione                         *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Lettura per codice                      *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-adc-cod-arc       to   rf-dcc-cod-cli         .
           move      rf-adc-dpz-arc       to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * A composizione                          *
      *                      *-----------------------------------------*
           go to     crz-cir-arc-inp-600.
       crz-cir-arc-inp-540.
      *                  *---------------------------------------------*
      *                  * Fornitori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione                         *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                      *-----------------------------------------*
      *                      * Lettura per codice                      *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      rf-adc-cod-arc       to   rf-dcf-cod-fnt         .
           move      rf-adc-dpz-arc       to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                      *-----------------------------------------*
      *                      * A composizione                          *
      *                      *-----------------------------------------*
           go to     crz-cir-arc-inp-600.
       crz-cir-arc-inp-600.
      *              *-------------------------------------------------*
      *              * Composizione record di sort                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record di sort              *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Composizione chiave                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo archivio                           *
      *                      *-----------------------------------------*
           if        rf-adc-tip-arc       =    02
                     move  "C"            to   srt-tip-arc
           else      move  "F"            to   srt-tip-arc            .
      *                      *-----------------------------------------*
      *                      * Codice lingua                           *
      *                      *-----------------------------------------*
           if        rf-adc-tip-arc       =    02
                     move  rf-dcc-cod-lng to   srt-cod-lng
           else      move  rf-dcf-cod-lng to   srt-cod-lng            .
      *                      *-----------------------------------------*
      *                      * Ragione sociale archivio di ordinamento *
      *                      *-----------------------------------------*
           if        rf-adc-tip-arc       =    02
                     move  rf-dcc-rag-key to   srt-rag-key
           else      move  rf-dcf-rag-key to   srt-rag-key            .
      *                  *---------------------------------------------*
      *                  * Composizione dati                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ragione sociale archivio                *
      *                      *-----------------------------------------*
           if        rf-adc-tip-arc       =    02
                     move  rf-dcc-rag-soc to   srt-rag-soc
           else      move  rf-dcf-rag-soc to   srt-rag-soc            .
      *                      *-----------------------------------------*
      *                      * Numero di Fax                           *
      *                      *-----------------------------------------*
           move      rf-adc-num-con       to   srt-num-fax            .
       crz-cir-arc-inp-700.
      *              *-------------------------------------------------*
      *              * Rilascio del record al Sort                     *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
       crz-cir-arc-inp-800.
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale file [adc]       *
      *              *-------------------------------------------------*
           go to     crz-cir-arc-inp-200.
       crz-cir-arc-inp-900.
      *              *-------------------------------------------------*
      *              * Chiusura                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [adc]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofadc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-adc                 .
      *                  *---------------------------------------------*
      *                  * [dcc]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * [dcf]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
       crz-cir-arc-inp-999.
           exit.

      *    *===========================================================*
      *    * Creazione archivio : Circolare a clienti                  *
      *    *                                                           *
      *    * Subroutine di output                                      *
      *    *-----------------------------------------------------------*
       crz-cir-arc-out-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-tot-arc          .
           move      zero                 to   w-gen-sel-arc          .
           move      zero                 to   w-gen-nam-fil          .
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari rotture             *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot-tip-arc          .
           move      spaces               to   w-rot-cod-lng          .
       crz-cir-arc-out-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se At End : uscita                          *
      *                  *---------------------------------------------*
           return    srt    at end
                     perform   crz-cir-arc-old-000
                                          thru crz-cir-arc-old-999
                     go to crz-cir-arc-out-900.
       crz-cir-arc-out-300.
      *              *-------------------------------------------------*
      *              * Test se rottura                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se primo passaggio                          *
      *                  *---------------------------------------------*
           if        w-rot-tip-arc        =    spaces
                     go to crz-cir-arc-out-500.
      *                  *---------------------------------------------*
      *                  * Test su numero elementi                     *
      *                  *---------------------------------------------*
           if        w-gen-sel-arc        >    w-gen-max-arc
                     go to crz-cir-arc-out-400.
      *                  *---------------------------------------------*
      *                  * Test di rottura                             *
      *                  *---------------------------------------------*
           if        srt-tip-arc          =    w-rot-tip-arc and
                     srt-cod-lng          =    w-rot-cod-lng
                     go to crz-cir-arc-out-600.
       crz-cir-arc-out-400.
      *                  *---------------------------------------------*
      *                  * Fine rottura                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Chiusura file in corso di trattamento   *
      *                      *-----------------------------------------*
           perform   crz-cir-arc-old-000  thru crz-cir-arc-old-999    .
       crz-cir-arc-out-500.
      *                  *---------------------------------------------*
      *                  * Inizio rottura                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione contatore               *
      *                      *-----------------------------------------*
           move      zero                 to   w-gen-sel-arc          .
      *                      *-----------------------------------------*
      *                      * Comodi di rottura                       *
      *                      *-----------------------------------------*
           move      srt-tip-arc          to   w-rot-tip-arc          .
           move      srt-cod-lng          to   w-rot-cod-lng          .
      *                      *-----------------------------------------*
      *                       * Intestazione file                      *
      *                      *-----------------------------------------*
           perform   crz-cir-arc-new-000  thru crz-cir-arc-new-999    .
      *                      *-----------------------------------------*
      *                       * A emissione riga                       *
      *                      *-----------------------------------------*
           go to     crz-cir-arc-out-600.
       crz-cir-arc-out-600.
      *              *-------------------------------------------------*
      *              * Emissione riga                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatori                        *
      *                  *---------------------------------------------*
           add       1                    to   w-gen-tot-arc          .
           add       1                    to   w-gen-sel-arc          .
      *                  *---------------------------------------------*
      *                  * Sub-prompt TO                               *
      *                  *---------------------------------------------*
           move      "PN"                 to   g-ope                  .
      *
           if        srt-cod-lng          =    "I  "
                     move  "TO: Uff. Amministrazione"
                                          to   g-rec
           else      move  "TO: CUSTOMERS AND SUPPLIERS"
                                          to   g-rec                  .
      *
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Sub-prompt ORGANISATION                     *
      *                  *---------------------------------------------*
           move      54                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "ORGANISATION:"      to   w-all-str-cat (1)      .
           move      srt-rag-soc          to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *
           move      "PN"                 to   g-ope                  .
           move      w-all-str-alf        to   g-rec                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Sub-prompt FAX                              *
      *                  *---------------------------------------------*
           move      54                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "FAX:"               to   w-all-str-cat (1)      .
           move      srt-num-fax          to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *
           move      "PN"                 to   g-ope                  .
           move      w-all-str-alf        to   g-rec                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * A riciclo                                   *
      *                  *---------------------------------------------*
           go to     crz-cir-arc-out-800.
       crz-cir-arc-out-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     crz-cir-arc-out-200.
       crz-cir-arc-out-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     crz-cir-arc-out-999.
       crz-cir-arc-out-999.
           exit.

      *    *===========================================================*
      *    * Creazione archivio : Circolare a clienti                  *
      *    *                                                           *
      *    * Subroutine di intestazione nuovo file                     *
      *    *-----------------------------------------------------------*
       crz-cir-arc-new-000.
      *              *-------------------------------------------------*
      *              * Incremento comodo per nome file                 *
      *              *-------------------------------------------------*
           add      1                     to   w-gen-nam-fil          .
      *              *-------------------------------------------------*
      *              * Bufferizzazione del testo della circolare       *
      *              *-------------------------------------------------*
           perform   buf-tst-cir-000      thru buf-tst-cir-999        .
       crz-cir-arc-new-100.
      *              *-------------------------------------------------*
      *              * Editing comodo per nome file                    *
      *              *-------------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9"                  to   v-edm                  .
           move      w-gen-nam-fil        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Preparazione nome                               *
      *              *-------------------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      srt-tip-arc          to   w-all-str-cat (1)      .
      *
           if        srt-cod-lng          =    "I  "
                     move  "ITA"          to   w-all-str-cat (2)
           else      move  "ING"          to   w-all-str-cat (2)      .
      *
           move      "_"                  to   w-all-str-cat (3)      .
           move      v-edt                to   w-all-str-cat (4)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
       crz-cir-arc-new-200.
      *              *-------------------------------------------------*
      *              * File sequenziale in output                      *
      *              *-------------------------------------------------*
           move      w-all-str-alf        to   w-det-pth-fso-nam      .
           perform   det-pth-fso-000      thru det-pth-fso-999        .
      *              *-------------------------------------------------*
      *              * Apertura del file in output                     *
      *              *-------------------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      w-det-pth-fso-pt1    to   g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       crz-cir-arc-new-400.
      *              *-------------------------------------------------*
      *              * Intestazione messaggio                          *
      *              *-------------------------------------------------*
       crz-cir-arc-new-420.
      *                  *---------------------------------------------*
      *                  * Prompt %%[MESSAGE]                          *
      *                  *---------------------------------------------*
           move      "PN"                 to   g-ope                  .
           move      "%%[MESSAGE]"        to   g-rec                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       crz-cir-arc-new-440.
      *                  *---------------------------------------------*
      *                  * Sub-prompt AFTER                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Data di sistema                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Data e ora di invio                 *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Preparazione                    *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Scomposizione data          *
      *                                  *-----------------------------*
           move      w-gen-dat-att        to   s-dat                  .
      *                                  *-----------------------------*
      *                                  * Concatenamento              *
      *                                  *-----------------------------*
           move      40                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "AFTER:"             to   w-all-str-cat (1)      .
           move      s-ann                to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *
           move      05                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      "-"                  to   w-all-str-cat (2)      .
           move      s-mes                to   w-all-str-cat (3)      .
           move      "-"                  to   w-all-str-cat (4)      .
           move      s-gio                to   w-all-str-cat (5)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *
           move      40                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      "22:00:00"           to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                              *---------------------------------*
      *                              * Valore preparato                *
      *                              *---------------------------------*
           move      w-all-str-alf        to   g-rec                  .
      *                              *---------------------------------*
      *                              * Scrittura su sequenziale        *
      *                              *---------------------------------*
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       crz-cir-arc-new-500.
      *                  *---------------------------------------------*
      *                  * Sub-prompt FROM                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Determinazione nome azienda             *
      *                      *-----------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Preparazione                            *
      *                      *-----------------------------------------*
           move      46                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "FROM:"              to   w-all-str-cat (1)      .
           move      s-asx                to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   g-rec                  .
      *                      *-----------------------------------------*
      *                      * Scrittura record in file sequenziale    *
      *                      *-----------------------------------------*
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       crz-cir-arc-new-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     crz-cir-arc-new-999.
       crz-cir-arc-new-999.
           exit.

      *    *===========================================================*
      *    * Creazione archivio : Circolare a clienti                  *
      *    *                                                           *
      *    * Subroutine di chiusura file                               *
      *    *-----------------------------------------------------------*
       crz-cir-arc-old-000.
      *              *-------------------------------------------------*
      *              * Emissione testo della circolare                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore righe             *
      *                  *---------------------------------------------*
           move      zero                 to   w-buf-tst-cir-ctr      .
       crz-cir-arc-old-200.
      *                  *---------------------------------------------*
      *                  * Incremento contatore righe                  *
      *                  *---------------------------------------------*
           add       1                    to   w-buf-tst-cir-ctr      .
      *                  *---------------------------------------------*
      *                  * Test sul numero effettivo di righe          *
      *                  *---------------------------------------------*
           if        w-buf-tst-cir-ctr    >    w-buf-tst-cir-eff
                     go to  crz-cir-arc-old-700.
      *                  *---------------------------------------------*
      *                  * Scrittura linea appena letta                *
      *                  *---------------------------------------------*
           move      "PN"                 to   g-ope                  .
           move      w-buf-tst-cir-rig
                    (w-buf-tst-cir-ctr)   to   g-rec                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Riciclo a riga successiva                   *
      *                  *---------------------------------------------*
           go to     crz-cir-arc-old-200.
       crz-cir-arc-old-700.
      *              *-------------------------------------------------*
      *              * Ridenominazione file da '.XXX' a '.SUB'         *
      *              *-------------------------------------------------*
           move      "A0"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
           move      "A5"                 to   o-ope                  .
           move      w-det-pth-fso-pt1    to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
           move      "A5"                 to   o-ope                  .
           move      w-det-pth-fso-pt2    to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
           move      "RP"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
       crz-cir-arc-old-800.
      *              *-------------------------------------------------*
      *              * Chiusura files                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * File sequenziale in output                  *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       crz-cir-arc-old-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     crz-cir-arc-old-999.
       crz-cir-arc-old-999.
           exit.

      *    *===========================================================*
      *    * Determinazione pathname completo per il file di appoggio  *
      *    * in output                                                 *
      *    *-----------------------------------------------------------*
       det-pth-fso-000.
      *              *-------------------------------------------------*
      *              * Preparazione pathname per file in fase di com-  *
      *              * posizione                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione nome file completo             *
      *                  *---------------------------------------------*
           move      spaces               to   w-det-pth-fso-pt1      .
           string    "/ZFAX/"    delimited by   size
                     w-det-pth-fso-nam
                                delimited by   spaces
                     ".XXX"     delimited by   size
                                          into w-det-pth-fso-pt1      .
      *                  *---------------------------------------------*
      *                  * Pathname completo sotto /abd/asc            *
      *                  *---------------------------------------------*
           move      "AS"                 to   s-ope                  .
           move      w-det-pth-fso-pt1    to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-pat                to   w-det-pth-fso-pt1      .
      *              *-------------------------------------------------*
      *              * Preparazione pathname per file completato       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione nome file completo             *
      *                  *---------------------------------------------*
           move      spaces               to   w-det-pth-fso-pt2      .
           string    "/ZFAX/"    delimited by   size
                     w-det-pth-fso-nam
                                delimited by   spaces
                     ".SUB"     delimited by   size
                                          into w-det-pth-fso-pt2      .
      *                  *---------------------------------------------*
      *                  * Pathname completo sotto /abd/asc            *
      *                  *---------------------------------------------*
           move      "AS"                 to   s-ope                  .
           move      w-det-pth-fso-pt2    to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-pat                to   w-det-pth-fso-pt2      .
       det-pth-fso-999.
           exit.

      *    *===========================================================*
      *    * Routine di Bufferizzazione del testo della circolare      *
      *    *-----------------------------------------------------------*
       buf-tst-cir-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore righe                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-buf-tst-cir-ctr      .
       buf-tst-cir-050.
      *              *-------------------------------------------------*
      *              * Preparazione pathname per il file contenente il *
      *              * testo                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test preliminare sul codice lingua          *
      *                  *---------------------------------------------*
           if        srt-cod-lng          not  = "I  " and
                     srt-cod-lng          not  = "ING"
                     move  "I  "          to   srt-cod-lng            .
      *                  *---------------------------------------------*
      *                  * Preparazione nome file completo             *
      *                  *---------------------------------------------*
           move      spaces               to   w-det-pth-fso-pt3      .
           string    "/ZFAX/"    delimited by   size
                     srt-cod-lng
                                delimited by   spaces
                     ".TXT"     delimited by   size
                                          into w-det-pth-fso-pt3      .
      *                  *---------------------------------------------*
      *                  * Pathname completo sotto /abd/asc            *
      *                  *---------------------------------------------*
           move      "AS"                 to   s-ope                  .
           move      w-det-pth-fso-pt3    to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-pat                to   w-det-pth-fso-pt3      .
       buf-tst-cir-100.
      *              *-------------------------------------------------*
      *              * Apertura del file in input contenente il testo  *
      *              *-------------------------------------------------*
           move      "OI"                 to   g-ope                  .
           move      "testo"              to   g-nam                  .
           move      w-det-pth-fso-pt3    to   g-pat                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *              *-------------------------------------------------*
      *              * Test se errori                                  *
      *              *-------------------------------------------------*
           if        g-sts                not  = e-not-err
                     go to buf-tst-cir-900.
       buf-tst-cir-200.
      *              *-------------------------------------------------*
      *              * Ciclo di lettura file                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura linea                               *
      *                  *---------------------------------------------*
           move      "GN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Test se at-end                              *
      *                  *---------------------------------------------*
           if        g-sts                =    e-end-fil
                     go to buf-tst-cir-900.
      *                  *---------------------------------------------*
      *                  * Incremento contatore righe                  *
      *                  *---------------------------------------------*
           add       1                    to   w-buf-tst-cir-ctr      .
      *                  *---------------------------------------------*
      *                  * Test sul numero massimo di righe            *
      *                  *---------------------------------------------*
           if        w-buf-tst-cir-ctr    >    w-buf-tst-cir-max
                     go to  buf-tst-cir-999.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione riga di testo               *
      *                  *---------------------------------------------*
           move      g-rec                to   w-buf-tst-cir-rig
                                              (w-buf-tst-cir-ctr)     .
      *                  *---------------------------------------------*
      *                  * Aggiornamento contatore righe effettive     *
      *                  *---------------------------------------------*
           move      w-buf-tst-cir-ctr    to   w-buf-tst-cir-eff      .
      *                  *---------------------------------------------*
      *                  * Riciclo a lettura                           *
      *                  *---------------------------------------------*
           go to     buf-tst-cir-200.
       buf-tst-cir-900.
      *              *-------------------------------------------------*
      *              * Chiusura del file in input                      *
      *              *-------------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
       buf-tst-cir-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

