       Identification division.
       Program-Id.                                 pfab4101           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    fab                 *
      *                                Settore:    pri                 *
      *                                   Fase:    fab410              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 15/05/95    *
      *                       Ultima revisione:    NdK del 12/10/21    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione stampa per il programma fab410   *
      *                                                                *
      *                    Stampa fabbisogni prodotti di vendita per   *
      *                    data                                        *
      *                                                                *
      *                    Modificato per SIRI (IN USO - 12/10/2021)   *
      *                                                                *
      *                    ------------------------------------------- *
      *                                                                *
      *                    File di esportazione :                      *
      *                                                                *
      *                    /abd/asc/UTENTE/exp/AZI_fab410.CSV          *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Codice fornitore preferenziale                    *
      *            *---------------------------------------------------*
               10  srt-fnt-key            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Progressivo di rilascio record [dcp]              *
      *            *---------------------------------------------------*
               10  srt-prg-pro            pic  9(08)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Record [dcp]                                      *
      *            *---------------------------------------------------*
               10  srt-rec-dcp.
                   15  filler occurs 1024 pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "fab"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "pri"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "fab410"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pfab4101"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "FABBISOGNI PRODOTTI DI VENDITA PER DATA "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/g"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records logici                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [zp1]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp1"                          .
      *        *-------------------------------------------------------*
      *        * [zp2]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp2"                          .
      *        *-------------------------------------------------------*
      *        * [zp3]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp3"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [pdx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfpdx"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [aaq]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfaaq"                          .
      *        *-------------------------------------------------------*
      *        * [aaf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfaaf"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [mms]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmms"                          .
      *        *-------------------------------------------------------*
      *        * [oct]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfoct"                          .
      *        *-------------------------------------------------------*
      *        * [ocr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfocr"                          .
      *        *-------------------------------------------------------*
      *        * [oft]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orf/fls/rec/rfoft"                          .
      *        *-------------------------------------------------------*
      *        * [ofr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orf/fls/rec/rfofr"                          .

      *    *===========================================================*
      *    * Record per le richieste                                   *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Codice dipendenza in uso                              *
      *        *-------------------------------------------------------*
           05  rr-dpz-inu                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice filtro di selezione                            *
      *        *-------------------------------------------------------*
           05  rr-fso-dcp                 pic  9(08)                  .
           05  rr-fso-dcp-alf redefines
               rr-fso-dcp                 pic  x(08)                  .
           05  rr-fso-dcp-des             pic  x(40)                  .
           05  rr-fso-dcp-ord             pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Tipo salto pagina                                     *
      *        * - 01 : No salto pagina                                *
      *        * - 02 : Ad ogni classe                                 *
      *        * - 03 : Ad ogni gruppo                                 *
      *        * - 04 : Ad ogni sottogruppo                            *
      *        *-------------------------------------------------------*
           05  rr-tip-slp                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Data elaborazione                                     *
      *        *-------------------------------------------------------*
           05  rr-dat-ela                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Si/No evidenziazione dei soli fabbisogni              *
      *        *-------------------------------------------------------*
           05  rr-snx-fab                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Tipo di correttivo alla giacenza da considerare       *
      *        * - 01 : Nessun correttivo                              *
      *        * - 10 : Scorta minima                                  *
      *        *-------------------------------------------------------*
           05  rr-tcr-gia                 pic  9(02)                  .

      *    *===========================================================*
      *    * Work per tipo ordinamento                                 *
      *    *-----------------------------------------------------------*
       01  w-tip-ord.
      *        *-------------------------------------------------------*
      *        * Tipo ordinamento ottenuto da richiesta al modulo di   *
      *        * filtro, selezione, ordinamento, su file [dcp]         *
      *        * - 01 : Per classe, gruppo, sottogruppo, codice pro-   *
      *        *        dotto                                          *
      *        * - 02 : Per classe, gruppo, sottogruppo, descrizione   *
      *        *        prodotto                                       *
      *        * - 03 : Per codice prodotto                            *
      *        * - 04 : Per descrizione prodotto                       *
      *        *-------------------------------------------------------*
           05  w-tip-ord-tip-ord          pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Modalita' di espressione del tempo di consegna        *
      *        *                                                       *
      *        *  - 0 : In giorni                                      *
      *        *  - 1 : In settimane                                   *
      *        *-------------------------------------------------------*
           05  w-prs-mde-tdc              pic  9(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zp1]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zp1.
               10  w-let-arc-zp1-flg      pic  x(01)                  .
               10  w-let-arc-zp1-cla      pic  9(05)                  .
               10  w-let-arc-zp1-des      pic  x(40)                  .
               10  w-let-arc-zp1-mne      pic  x(05)                  .
               10  w-let-arc-zp1-sud      pic  9(02)                  .
               10  w-let-arc-zp1-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zp2]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zp2.
               10  w-let-arc-zp2-flg      pic  x(01)                  .
               10  w-let-arc-zp2-cla      pic  9(05)                  .
               10  w-let-arc-zp2-gru      pic  9(05)                  .
               10  w-let-arc-zp2-des      pic  x(40)                  .
               10  w-let-arc-zp2-mne      pic  x(05)                  .
               10  w-let-arc-zp2-sud      pic  9(02)                  .
               10  w-let-arc-zp2-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zp3]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zp3.
               10  w-let-arc-zp3-flg      pic  x(01)                  .
               10  w-let-arc-zp3-cla      pic  9(05)                  .
               10  w-let-arc-zp3-gru      pic  9(05)                  .
               10  w-let-arc-zp3-sgr      pic  9(05)                  .
               10  w-let-arc-zp3-des      pic  x(40)                  .
               10  w-let-arc-zp3-mne      pic  x(05)                  .
               10  w-let-arc-zp3-sud      pic  9(02)                  .
               10  w-let-arc-zp3-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [pdx]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-pdx.
               10  w-let-arc-pdx-flg      pic  x(01)                  .
               10  w-let-arc-pdx-rec      pic  9(02)                  .
               10  w-let-arc-pdx-arc      pic  9(07)                  .
               10  w-let-arc-pdx-lng      pic  x(03)                  .
               10  w-let-arc-pdx-pro      pic  9(07)                  .
               10  w-let-arc-pdx-fmt      pic  x(14)                  .
               10  w-let-arc-pdx-ctr      pic  9(02)                  .
               10  w-let-arc-pdx-des.
                   15  w-let-arc-pdx-rig  occurs 10
                                          pic  x(40)                  .

      *    *===========================================================*
      *    * Work area per gestione classe, gruppo e sottogruppo       *
      *    *-----------------------------------------------------------*
       01  w-cgs.
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori generici                   *
      *        *-------------------------------------------------------*
           05  w-cgs-gen.
      *            *---------------------------------------------------*
      *            * Flag di prima intestazione pagina da eseguire     *
      *            *---------------------------------------------------*
               10  w-cgs-gen-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori classe                     *
      *        *-------------------------------------------------------*
           05  w-cgs-cla.
      *            *---------------------------------------------------*
      *            * Si/No intestazione ad inizio classe               *
      *            *---------------------------------------------------*
               10  w-cgs-cla-int          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice classe                                     *
      *            *---------------------------------------------------*
               10  w-cgs-cla-cod          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Mnemonico classe                                  *
      *            *---------------------------------------------------*
               10  w-cgs-cla-mne          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di sequenza classe                         *
      *            *---------------------------------------------------*
               10  w-cgs-cla-sqz          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione classe                                *
      *            *---------------------------------------------------*
               10  w-cgs-cla-des          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Segnale di classe ulteriormente suddivisa         *
      *            *---------------------------------------------------*
               10  w-cgs-cla-sud          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Flag di intestazione gia' eseguita                *
      *            *---------------------------------------------------*
               10  w-cgs-cla-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori gruppo                     *
      *        *-------------------------------------------------------*
           05  w-cgs-gru.
      *            *---------------------------------------------------*
      *            * Si/No intestazione ad inizio gruppo               *
      *            *---------------------------------------------------*
               10  w-cgs-gru-int          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice gruppo                                     *
      *            *---------------------------------------------------*
               10  w-cgs-gru-cod          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Mnemonico gruppo                                  *
      *            *---------------------------------------------------*
               10  w-cgs-gru-mne          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di sequenza gruppo                         *
      *            *---------------------------------------------------*
               10  w-cgs-gru-sqz          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione gruppo                                *
      *            *---------------------------------------------------*
               10  w-cgs-gru-des          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Segnale di gruppo ulteriormente suddiviso         *
      *            *---------------------------------------------------*
               10  w-cgs-gru-sud          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Flag di intestazione gia' eseguita                *
      *            *---------------------------------------------------*
               10  w-cgs-gru-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori sottogruppo                *
      *        *-------------------------------------------------------*
           05  w-cgs-sgr.
      *            *---------------------------------------------------*
      *            * Si/No intestazione ad inizio sottogruppo          *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-int          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice sottogruppo                                *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-cod          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Mnemonico sottogruppo                             *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-mne          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di sequenza sottogruppo                    *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-sqz          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione sottogruppo                           *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-des          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Flag di intestazione gia' eseguita                *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori dettaglio                  *
      *        *-------------------------------------------------------*
           05  w-cgs-det.
      *            *---------------------------------------------------*
      *            * Numero di linee effettive impegnate dalla finca-  *
      *            * tura per il dettaglio e la sottolineatura         *
      *            *---------------------------------------------------*
               10  w-cgs-det-idf          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Per work                                              *
      *        *-------------------------------------------------------*
           05  w-cgs-wrk.
               10  w-cgs-wrk-nln          pic  9(02)                  .
               10  w-cgs-wrk-inx          pic  9(03)                  .
               10  w-cgs-wrk-pnt          pic  9(03)                  .
               10  w-cgs-wrk-car          pic  9(03)                  .
               10  w-cgs-wrk-pos          pic  9(03)                  .
               10  w-cgs-wrk-pfn          pic  9(03)                  .
               10  w-cgs-wrk-des          pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per routine stp-srt-inp-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-stp-srt-inp.
           05  w-stp-srt-inp-ctr          pic  9(08)                  .

      *    *===========================================================*
      *    * Work-area per routine prn-liv-det-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-prn-liv-det.
      *        *-------------------------------------------------------*
      *        * Comodo per composizione stringa                       *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-x40          pic  x(40)                  .
           05  w-prn-liv-det-w40          pic  x(40)                  .
           05  w-prn-liv-det-x60          pic  x(60)                  .
           05  w-prn-liv-det-pnt          pic  9(03)                  .
           05  w-prn-liv-det-ctr          pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per ridefinizione numero documento             *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-wnd          pic  9(11)                  .
           05  w-prn-liv-det-wnd-r redefines
               w-prn-liv-det-wnd.
               10  w-prn-liv-det-wsa      pic  9(03)                  .
               10  w-prn-liv-det-wdz      pic  9(02)                  .
               10  w-prn-liv-det-wpg      pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per costo di riferimento                       *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-svc          pic  x(03)                  .
           05  w-prn-liv-det-dvc          pic  9(01)                  .
           05  w-prn-liv-det-svl          pic  x(03)                  .
           05  w-prn-liv-det-crl          pic  9(08)v9(03)            .
           05  w-prn-liv-det-pll          pic  9(01)v9(02)            .
           05  w-prn-liv-det-dec          pic  9(01)                  .
           05  w-prn-liv-det-val          pic  9(09)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per lotto di acquisto                          *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-laq          pic  9(06)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Comodo per fornitore preferenziale                    *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-pfz          pic  9(07)                  .
           05  w-prn-liv-det-cdp          pic  x(20)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det prezzo riga ordine                       *
      *        *-------------------------------------------------------*
           05  w-det-prz-rig.
      *            *---------------------------------------------------*
      *            * Data documento                                    *
      *            *---------------------------------------------------*
               10  w-det-prz-rig-dat      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero documento                                  *
      *            *---------------------------------------------------*
               10  w-det-prz-rig-num      pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Progressivo riga documento                        *
      *            *---------------------------------------------------*
               10  w-det-prz-rig-prg      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Prezzo unitario determinato                       *
      *            *---------------------------------------------------*
               10  w-det-prz-rig-prz      pic  9(09)                  .
      *            *---------------------------------------------------*
      *            * Decimali prezzo unitario determinato              *
      *            *---------------------------------------------------*
               10  w-det-prz-rig-dec      pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Sigla valuta                                      *
      *            *---------------------------------------------------*
               10  w-det-prz-rig-sgl      pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det pathname file sequenziale in output      *
      *        *-------------------------------------------------------*
           05  w-det-pth-fso.
               10  w-det-pth-fso-pat      pic  x(40)                  .
               10  w-det-pth-fso-pth      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Per Fine riga                                         *
      *        *-------------------------------------------------------*
           05  w-det-fin-rig.
      *            *---------------------------------------------------*
      *            * Separatore 'CR'                                   *
      *            *---------------------------------------------------*
               10  w-det-fin-rig-chr      pic  x(01)   value H"0D"    .
      *            *---------------------------------------------------*
      *            * Separatore 'TAB'                                  *
      *            *---------------------------------------------------*
               10  w-det-fin-rig-tab      pic  x(01)   value H"09"    .

      *    *===========================================================*
      *    * Work-area per totali                                      *
      *    *-----------------------------------------------------------*
       01  w-tot.
      *        *-------------------------------------------------------*
      *        * Totali generali                                       *
      *        *-------------------------------------------------------*
           05  w-tot-gen.
               10  w-tot-gen-ele          pic  9(11)                  .

      *    *===========================================================*
      *    * Work area per la definizione dei record in output         *
      *    *-----------------------------------------------------------*
       01  w-out.
      *        *-------------------------------------------------------*
      *        * Output disponibilita'                                 *
      *        *-------------------------------------------------------*
           05  w-out-dsp.
      *            *---------------------------------------------------*
      *            * Colonna 001                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-001      pic  x(01)                  .
               10  w-out-dsp-sep-001      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Colonna 002                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-002      pic  x(20)                  .
               10  w-out-dsp-sep-002      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Colonna 003                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-003      pic  x(80)                  .
               10  w-out-dsp-sep-003      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Colonna 004                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-004      pic  x(15)                  .
               10  w-out-dsp-sep-004      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Colonna 005                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-005      pic  x(15)                  .
               10  w-out-dsp-sep-005      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Colonna 006                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-006      pic  x(20)                  .
               10  w-out-dsp-sep-006      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Colonna 007                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-007      pic  x(30)                  .
               10  w-out-dsp-sep-007      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Colonna 008                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-008      pic  x(20)                  .
               10  w-out-dsp-sep-008      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Colonna 009                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-009      pic  x(20)                  .
               10  w-out-dsp-sep-009      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Colonna 010                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-010      pic  x(20)                  .
               10  w-out-dsp-sep-010      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Colonna 011                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-011      pic  x(20)                  .
               10  w-out-dsp-sep-011      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Colonna 012                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-012      pic  x(20)                  .
               10  w-out-dsp-sep-012      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Colonna 013                                       *
      *            *---------------------------------------------------*
               10  w-out-dsp-col-013      pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Carattere di fine riga                            *
      *            *---------------------------------------------------*
               10  w-out-dsp-fin-rig      pic  x(01)                  .

      *    *===========================================================*
      *    * Work per routine det-cos-rif-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-det-cos-rif.
      *        *-------------------------------------------------------*
      *        * Data base per calcolo                         [Input] *
      *        *-------------------------------------------------------*
           05  w-det-cos-rif-dtb          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Tipo codice di magazzino                      [Input] *
      *        *-------------------------------------------------------*
           05  w-det-cos-rif-tpm          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice numerico di magazzino                  [Input] *
      *        *-------------------------------------------------------*
           05  w-det-cos-rif-cnm          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Tipo determinazione effettuata               [Output] *
      *        * - 01 : Costo d'acquisto fornitore/prodotto [aaf]      *
      *        * - 02 : Costo medio continuo                           *
      *        *-------------------------------------------------------*
           05  w-det-cos-rif-tde          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Sigla valuta di espressione costo            [Output] *
      *        *-------------------------------------------------------*
           05  w-det-cos-rif-svc          pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Numero decimali valuta di espressione costo  [Output] *
      *        *-------------------------------------------------------*
           05  w-det-cos-rif-dvc          pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Numero decimali per espressione costo        [Output] *
      *        *-------------------------------------------------------*
           05  w-det-cos-rif-dec          pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Costo di riferimento                         [Output] *
      *        *-------------------------------------------------------*
           05  w-det-cos-rif-cdr          pic  9(09)                  .
      *        *-------------------------------------------------------*
      *        * Sigla valuta per legame valutario            [Output] *
      *        *                                                       *
      *        * N.B.: Solo se tipo determinazione effettuata 01       *
      *        *-------------------------------------------------------*
           05  w-det-cos-rif-svl          pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Tipo di cambio per legame valutario          [Output] *
      *        *                                                       *
      *        * N.B.: Solo se tipo determinazione effettuata 01       *
      *        *-------------------------------------------------------*
           05  w-det-cos-rif-tcl          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Coefficiente di cambio di riferimento per legame va-  *
      *        * lutario                                      [Output] *
      *        *                                                       *
      *        * N.B.: Solo se tipo determinazione effettuata 01       *
      *        *-------------------------------------------------------*
           05  w-det-cos-rif-crl          pic  9(06)v9(05)            .
      *        *-------------------------------------------------------*
      *        * Percentuale di limitazione per legame valutario       *
      *        *                                              [Output] *
      *        *                                                       *
      *        * N.B.: Solo se tipo determinazione effettuata 01       *
      *        *-------------------------------------------------------*
           05  w-det-cos-rif-pll          pic  9(01)v9(02)            .

      *    *===========================================================*
      *    * Work per routine det-scm-mes-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-det-scm-mes.
      *        *-------------------------------------------------------*
      *        * Data base per calcolo                         [Input] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-dtb          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Mese di chiusura esercizio                    [Input] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-mce          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza in uso                      [Input] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-dpz          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Tipo codice di magazzino                      [Input] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-tpm          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice numerico di magazzino                  [Input] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-cnm          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Tabella scarichi per mese                    [Output] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-tbl.
               10  w-det-scm-mes-ele occurs 15.
                   15  w-det-scm-mes-tan  pic  9(02)                  .
                   15  w-det-scm-mes-tme  pic  9(02)                  .
                   15  w-det-scm-mes-tqu  pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Progressivo carichi ultimi 12 mesi           [Output] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-pcu          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Progressivo scarichi ultimi 12 mesi          [Output] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-psu          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Comodo per anno di esercizio                   [Work] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-wes          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per mese di esercizio                   [Work] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-wme          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per data ridefinita                     [Work] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-wdt          pic  9(07)                  .
           05  w-det-scm-mes-wdt-r redefines
               w-det-scm-mes-wdt.
               10  w-det-scm-mes-wda      pic  9(03)                  .
               10  w-det-scm-mes-wdm      pic  9(02)                  .
               10  w-det-scm-mes-wdg      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                            [Work] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-c01          pic  9(03)                  .

      *    *===========================================================*
      *    * Work generica per tutto il programma                      *
      *    *-----------------------------------------------------------*
       01  w-gen.
      *        *-------------------------------------------------------*
      *        * Data attuale                                          *
      *        *-------------------------------------------------------*
           05  w-gen-dat-att              pic  9(07)                  .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione buffer dei fab-  *
      *    * bisogni/disponibilita' per un prodotto                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/fab/prg/cpy/dbuffod0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione valore unitario  *
      *    * di magazzino                                              *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dvunmag0.dtl"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  w-rot-l04-cod-fnt      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  w-rot-l03-cod-cla      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  w-rot-l02-cod-gru      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  w-rot-l01-cod-sgr      pic  9(05)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-cnt-tit-des-azi      .
           move      40                   to   w-cnt-tit-ctr-azi      .
       int-pag-std-100.
           if        w-cnt-tit-chr-azi
                    (w-cnt-tit-ctr-azi)   =    spaces
                     if     w-cnt-tit-ctr-azi
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-cnt-tit-ctr-tit      .
       int-pag-std-200.
           if        w-cnt-tit-chr-tit
                    (w-cnt-tit-ctr-tit)   =    spaces
                     if     w-cnt-tit-ctr-tit
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-tit      .
           subtract  w-cnt-tit-ctr-tit    from w-cnt-tit-pos-tit      .
           divide    2                    into w-cnt-tit-pos-tit      .
           add       1                    to   w-cnt-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    =    zero
                     move  4              to   w-cnt-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-cnt-tit-ctr-wrk      .
           inspect   w-cnt-tit-num-pag
                                      tallying w-cnt-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-cnt-tit-ctr-wrk    from 27
                                        giving w-cnt-tit-ctr-dep      .
           subtract  w-cnt-tit-ctr-wrk    from 5
                                        giving w-cnt-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-dep      .
           subtract  w-cnt-tit-ctr-dep    from w-cnt-tit-pos-dep      .
           add       1                    to   w-cnt-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-cnt-tit-ctr-azi    to   w-cnt-tit-ctr-wrk      .
           add       2                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-tit
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      w-cnt-tit-pos-tit    to   w-cnt-tit-ctr-wrk      .
           add       w-cnt-tit-ctr-tit    to   w-cnt-tit-ctr-wrk      .
           add       1                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-dep
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-cnt-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-cnt-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-cnt-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-cnt-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Determinazione data attuale                     *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-gen-dat-att          .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione relativa alla modali- *
      *              * ta' di espressione del tempo di consegna        *
      *              *-------------------------------------------------*
           perform   prs-mde-tdc-000      thru prs-mde-tdc-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura della personalizzazione relativa alla modalita'   *
      *    * di espressione del tempo di consegna per l'acquisto       *
      *    *-----------------------------------------------------------*
       prs-mde-tdc-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/dcf[mde-tdc]"   to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-num          to   w-prs-mde-tdc
           else      move  0              to   w-prs-mde-tdc          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-mde-tdc        not  = 1
                     move  0              to   w-prs-mde-tdc          .
       prs-mde-tdc-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [pdx]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *              *-------------------------------------------------*
      *              * [zp1]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
      *              *-------------------------------------------------*
      *              * [zp2]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
      *              *-------------------------------------------------*
      *              * [zp3]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [aaq]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *              *-------------------------------------------------*
      *              * [aaf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaf                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [mms]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmms"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mms                 .
      *              *-------------------------------------------------*
      *              * [oct]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *              *-------------------------------------------------*
      *              * [ocr]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *              *-------------------------------------------------*
      *              * [oft]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *              *-------------------------------------------------*
      *              * [ofr]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *              *-------------------------------------------------*
      *              * Filtro per selezione ed ordinamento [dcp]       *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Lettura tipo ordinamento da filtro di selezione *
      *              * ed ordinamento per file [dcp]                   *
      *              *-------------------------------------------------*
           move      "TO"                 to   f-ope                  .
           move      rr-fso-dcp-alf       to   f-key                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
           if        f-sts                =    "01"
                     move  01             to   w-tip-ord-tip-ord
           else if   f-sts                =    "02"
                     move  02             to   w-tip-ord-tip-ord
           else if   f-sts                =    "03"
                     move  03             to   w-tip-ord-tip-ord
           else if   f-sts                =    "04"
                     move  04             to   w-tip-ord-tip-ord
           else      move  01             to   w-tip-ord-tip-ord      .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione buffer dei fabbi- *
      *              * sogni/disponibilita'                            *
      *              *-------------------------------------------------*
           move      "OP"                 to   d-buf-fod-tip-ope      .
           move      "pgm/fab/prg/obj/dbuffod0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-buf-fod              .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione valore di magazz. *
      *              *-------------------------------------------------*
           move      "OP"                 to   d-vun-mag-tip-ope      .
           move      "pgm/mag/prg/obj/pmag300v"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-vun-mag              .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [pdx]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *              *-------------------------------------------------*
      *              * [zp1]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
      *              *-------------------------------------------------*
      *              * [zp2]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
      *              *-------------------------------------------------*
      *              * [zp3]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [aaq]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *              *-------------------------------------------------*
      *              * [aaf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaf                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [mms]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmms"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mms                 .
      *              *-------------------------------------------------*
      *              * [oct]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *              *-------------------------------------------------*
      *              * [ocr]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *              *-------------------------------------------------*
      *              * [oft]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *              *-------------------------------------------------*
      *              * [ofr]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *              *-------------------------------------------------*
      *              * Filtro per selezione ed ordinamento [dcp]       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Cancel                                      *
      *                  *---------------------------------------------*
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       prn-cls-fls-100.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione buffer dei fab-  *
      *              * bisogni/disponibilita'                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-buf-fod-tip-ope      .
           move      "pgm/fab/prg/obj/dbuffod0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-buf-fod              .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-buf-fod-tip-ope      .
           move      "pgm/fab/prg/obj/dbuffod0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-buf-fod              .
           if        d-buf-fod-exi-sts    not  = spaces
                     go to prn-cls-fls-200.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/fab/prg/obj/dbuffod0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       prn-cls-fls-200.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione valore di magazz.*
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-vun-mag-tip-ope      .
           move      "pgm/mag/prg/obj/pmag300v"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-vun-mag              .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-vun-mag-tip-ope      .
           move      "pgm/mag/prg/obj/pmag300v"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-vun-mag              .
           if        d-vun-mag-exi-sts    not  = spaces
                     go to prn-cls-fls-999.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/mag/prg/obj/pmag300v"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : Si'                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort                                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   prn-rou-pri-000
                                          thru prn-rou-pri-999        .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione contatore records [dcp] letti  *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-srt-inp-ctr      .
      *              *-------------------------------------------------*
      *              * Start filtro di ordinamento e selezione per il  *
      *              * file [dcp]                                      *
      *              *-------------------------------------------------*
           move      "ST"                 to   f-ope                  .
           move      rr-fso-dcp           to   f-key                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se errore su Start : ad uscita              *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-900.
       stp-srt-inp-200.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Read Next filtro di ordinamento e selezione per *
      *              * file [dcp]                                      *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se At End : ad uscita                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-900.
       stp-srt-inp-300.
      *              *-------------------------------------------------*
      *              * Test max                                        *
      *              *-------------------------------------------------*
       stp-srt-inp-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo prodotto                       *
      *                  *---------------------------------------------*
           if        rf-dcp-tip-pro       not  = 01
                     go to stp-srt-inp-200.
       stp-srt-inp-500.
      *              *-------------------------------------------------*
      *              * Letture supplementari                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [aaq]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [aaq]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      01                   to   rf-aaq-tip-mag         .
           move      rf-dcp-num-pro       to   rf-aaq-num-pro         .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
       stp-srt-inp-600.
      *              *-------------------------------------------------*
      *              * Composizione del record di Sort                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione preliminare                 *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Incremento contatore records [dcp] letti    *
      *                  *---------------------------------------------*
           add       1                    to   w-stp-srt-inp-ctr      .
      *                  *---------------------------------------------*
      *                  * Composizione chiave                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice fornitore preferenziale          *
      *                      *-----------------------------------------*
           move      rf-aaq-dcf-pfz       to   srt-fnt-key            .
      *                      *-----------------------------------------*
      *                      * Progressivo di rilascio del record      *
      *                      *-----------------------------------------*
           move      w-stp-srt-inp-ctr    to   srt-prg-pro            .
      *                  *---------------------------------------------*
      *                  * Composizione dati                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Record [dcp]                            *
      *                      *-----------------------------------------*
           move      rf-dcp               to   srt-rec-dcp            .
       stp-srt-inp-700.
      *              *-------------------------------------------------*
      *              * Rilascio del record al Sort                     *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
       stp-srt-inp-800.
      *              *-------------------------------------------------*
      *              * Riciclo a record successivo                     *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-200.
       stp-srt-inp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-999.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessuna registrazione entro i limiti assegnati !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-prn-flg-sub
                            go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Recupero del record [dcp]                       *
      *              *-------------------------------------------------*
           move      srt-rec-dcp          to   rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Test su tipo prodotto                           *
      *              *-------------------------------------------------*
           if        rf-dcp-tip-pro       not  = 01
                     go to prn-sel-rec-900.
       prn-sel-rec-100.
      *              *-------------------------------------------------*
      *              * Determinazione buffer dei fabbisogni/disponibi- *
      *              * lita'                                           *
      *              *-------------------------------------------------*
           move      "DT"                 to   d-buf-fod-tip-ope      .
           move      rr-dat-ela           to   d-buf-fod-dat-ela      .
           move      rr-dpz-inu           to   d-buf-fod-cod-dpz      .
           move      01                   to   d-buf-fod-tip-mag      .
           move      rf-dcp-num-pro       to   d-buf-fod-num-mag      .
           if        rr-tcr-gia           =    01
                     move  01             to   d-buf-fod-tip-crg
           else if   rr-tcr-gia           =    10
                     move  10             to   d-buf-fod-tip-crg
           else      move  01             to   d-buf-fod-tip-crg      .
           move      02                   to   d-buf-fod-snx-oav      .
           move      "pgm/fab/prg/obj/dbuffod0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-buf-fod              .
       prn-sel-rec-200.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di selezione su *
      *              * fabbisogni                                      *
      *              *-------------------------------------------------*
           if        rr-snx-fab           =    "D"
                     go to prn-sel-rec-210
           else if   rr-snx-fab           =    "A"
                     go to prn-sel-rec-220
           else      go to prn-sel-rec-230.
       prn-sel-rec-210.
      *                  *---------------------------------------------*
      *                  * Se solo con fabbisogno per data             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        d-buf-fod-fpf-eot    =    spaces and
                     d-buf-fod-fpf-aot    =    spaces and
                     d-buf-fod-fpf-oot    =    spaces
                     go to prn-sel-rec-900.
      *                      *-----------------------------------------*
      *                      * Ad uscita per test superati             *
      *                      *-----------------------------------------*
           go to     prn-sel-rec-800.
       prn-sel-rec-220.
      *                  *---------------------------------------------*
      *                  * Se solo con fabbisogno assoluto             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        d-buf-fod-qtt-fod    not  < zero
                     go to prn-sel-rec-900.
      *                      *-----------------------------------------*
      *                      * Ad uscita per test superati             *
      *                      *-----------------------------------------*
           go to     prn-sel-rec-800.
       prn-sel-rec-230.
      *                  *---------------------------------------------*
      *                  * Se nessuna selezione sul fabbisogno         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad uscita per test superati             *
      *                      *-----------------------------------------*
           go to     prn-sel-rec-800.
       prn-sel-rec-800.
      *              *-------------------------------------------------*
      *              * Uscita per test superati                        *
      *              *-------------------------------------------------*
           go to     prn-sel-rec-999.
       prn-sel-rec-900.
      *              *-------------------------------------------------*
      *              * Uscita per test non superati                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di selezione non superata              *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-prn-flg-sub      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-sel-rec-999.
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
      *              *-------------------------------------------------*
      *              * Codice fornitore preferenziale                  *
      *              *-------------------------------------------------*
           move      srt-fnt-key          to   w-rot-l04-cod-fnt      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-cmp-rot-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-cmp-rot-600.
       prn-cmp-rot-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice ma-   *
      *              *   gazzino                                       *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   magazzino                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione area per rottura classe        *
      *                  *---------------------------------------------*
           move      rf-dcp-cla-pro       to   w-rot-l03-cod-cla      .
      *                  *---------------------------------------------*
      *                  * Composizione area per rottura gruppo        *
      *                  *---------------------------------------------*
           move      rf-dcp-gru-pro       to   w-rot-l02-cod-gru      .
      *                  *---------------------------------------------*
      *                  * Composizione area per rottura sottogruppo   *
      *                  *---------------------------------------------*
           move      rf-dcp-sgr-pro       to   w-rot-l01-cod-sgr      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-cmp-rot-999.
       prn-cmp-rot-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice magazzino                          *
      *              * - Per descrizione magazzino                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione area rottura classe         *
      *                  *---------------------------------------------*
           move      zero                 to   w-rot-l03-cod-cla      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione area rottura gruppo         *
      *                  *---------------------------------------------*
           move      zero                 to   w-rot-l02-cod-gru      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione area rottura sottogruppo    *
      *                  *---------------------------------------------*
           move      zero                 to   w-rot-l01-cod-sgr      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-cmp-rot-999.
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-cic-050.
      *              *-------------------------------------------------*
      *              * Apertura del file in output                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatori elementi          *
      *                  *---------------------------------------------*
           move      zero                 to   w-tot-gen-ele          .
      *                  *---------------------------------------------*
      *                  * Determinazione pathname file sequenziale in *
      *                  * output                                      *
      *                  *---------------------------------------------*
           perform   det-pth-fso-000      thru det-pth-fso-999        .
      *                  *---------------------------------------------*
      *                  * Apertura del file in output                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      w-det-pth-fso-pth    to   g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       prn-ini-cic-100.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo ordinamento       *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-ini-cic-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-ini-cic-600.
       prn-ini-cic-300.
      *              *-------------------------------------------------*
      *              * Se ordinamento per Classe, gruppo e sottogruppo *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione numero di linee effettive im-  *
      *                  * pegnate dalla fincatura per il dettaglio e  *
      *                  * la relativa sottolineatura                  *
      *                  *---------------------------------------------*
           move      2                    to   w-cgs-det-idf          .
      *                  *---------------------------------------------*
      *                  * Preparazione segnali di richiesta intesta-  *
      *                  * zione per inizio classe gruppo sottogruppo  *
      *                  *---------------------------------------------*
           if        rr-tip-slp           =    02
                     move  "S"            to   w-cgs-cla-int
                     move  "N"            to   w-cgs-gru-int
                     move  "N"            to   w-cgs-sgr-int
           else if   rr-tip-slp           =    03
                     move  "S"            to   w-cgs-cla-int
                     move  "S"            to   w-cgs-gru-int
                     move  "N"            to   w-cgs-sgr-int
           else if   rr-tip-slp           =    04
                     move  "S"            to   w-cgs-cla-int
                     move  "S"            to   w-cgs-gru-int
                     move  "S"            to   w-cgs-sgr-int
           else      move  "N"            to   w-cgs-cla-int
                     move  "N"            to   w-cgs-gru-int
                     move  "N"            to   w-cgs-sgr-int          .
      *                  *---------------------------------------------*
      *                  * Flag di prima intestazione : non eseguita   *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-gen-fie          .
      *                  *---------------------------------------------*
      *                  * Flag di intestazione classe : non eseguita  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-cla-fie          .
      *                  *---------------------------------------------*
      *                  * Flag di intestazione gruppo : non eseguita  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-gru-fie          .
      *                  *---------------------------------------------*
      *                  * Flag di intestazione sottogruppo : non ese- *
      *                  * guita                                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-sgr-fie          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-999.
       prn-ini-cic-600.
      *              *-------------------------------------------------*
      *              * Se ordinamento per Codice o Descrizione         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-999.
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-cic-010.
      *              *-------------------------------------------------*
      *              * Chiusura sequenziale                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura del file in output                 *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo utilizzato             *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mcvout"                         .
       prn-fin-cic-020.
      *                  *---------------------------------------------*
      *                  * Eventuale messaggio di dati elaborati       *
      *                  *---------------------------------------------*
           if        w-tot-gen-ele        not  > zero
                     go to prn-fin-cic-999.
      *                  *---------------------------------------------*
      *                  * Richiesta informazioni generali segreteria  *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Messaggio per nome file                     *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
           string    "Preparato archivio              : "
                                delimited by   size
                     "["        delimited by   size
                     w-det-pth-fso-pat
                                delimited by   spaces
                     "]"        delimited by   size
                                          into m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Editing contatore                           *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<BG"                to   p-edm                  .
           move      w-tot-gen-ele        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Messaggio per contatore elementi            *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      spaces               to   m-msg                  .
           string    "Linee movimenti estratte nr.    : "
                                delimited by   size
                     p-edt      delimited by   spaces
                                          into m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-100.
      *              *-------------------------------------------------*
      *              * Intestazione fornitore                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Intestazione foglio                         *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                  *---------------------------------------------*
      *                  * Fincatura per dettaglio                     *
      *                  *---------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
      *                      *-----------------------------------------*
      *                      * Test se interruzione forzata            *
      *                      *-----------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr4-999.
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-ini-lr3-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-ini-lr3-600.
       prn-ini-lr3-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice ma-   *
      *              *   gazzino                                       *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   magazzino                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati classe                         *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-cla    to   w-let-arc-zp1-cla      .
           perform   let-arc-zp1-000      thru let-arc-zp1-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione dati classe                 *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-cla    to   w-cgs-cla-cod          .
           move      w-let-arc-zp1-des    to   w-cgs-cla-des          .
           move      w-let-arc-zp1-mne    to   w-cgs-cla-mne          .
           move      w-let-arc-zp1-sqz    to   w-cgs-cla-sqz          .
           move      w-let-arc-zp1-sud    to   w-cgs-cla-sud          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di classe gia' inte-   *
      *                  * stata                                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-cla-fie          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice magazzino                          *
      *              * - Per descrizione magazzino                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-ini-lr2-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-ini-lr2-600.
       prn-ini-lr2-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice ma-   *
      *              *   gazzino                                       *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   magazzino                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati gruppo                         *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-cla    to   w-let-arc-zp2-cla      .
           move      w-rot-l02-cod-gru    to   w-let-arc-zp2-gru      .
           perform   let-arc-zp2-000      thru let-arc-zp2-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione dati gruppo                 *
      *                  *---------------------------------------------*
           move      w-rot-l02-cod-gru    to   w-cgs-gru-cod          .
           move      w-let-arc-zp2-des    to   w-cgs-gru-des          .
           move      w-let-arc-zp2-mne    to   w-cgs-gru-mne          .
           move      w-let-arc-zp2-sqz    to   w-cgs-gru-sqz          .
           move      w-let-arc-zp2-sud    to   w-cgs-gru-sud          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di gruppo gia' inte-   *
      *                  * stato                                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-gru-fie          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-lr2-999.
       prn-ini-lr2-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice magazzino                          *
      *              * - Per descrizione magazzino                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     prn-ini-lr2-999.
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-ini-lr1-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-ini-lr1-600.
       prn-ini-lr1-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice ma-   *
      *              *   gazzino                                       *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   magazzino                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati sottogruppo                    *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-cla    to   w-let-arc-zp3-cla      .
           move      w-rot-l02-cod-gru    to   w-let-arc-zp3-gru      .
           move      w-rot-l01-cod-sgr    to   w-let-arc-zp3-sgr      .
           perform   let-arc-zp3-000      thru let-arc-zp3-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione dati sottogruppo            *
      *                  *---------------------------------------------*
           move      w-rot-l01-cod-sgr    to   w-cgs-sgr-cod          .
           move      w-let-arc-zp3-des    to   w-cgs-sgr-des          .
           move      w-let-arc-zp3-mne    to   w-cgs-sgr-mne          .
           move      w-let-arc-zp3-sqz    to   w-cgs-sgr-sqz          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di sottogruppo gia'    *
      *                  * intestato                                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-sgr-fie          .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dei flags di intesta-  *
      *                  * zione gia' eseguita                         *
      *                  *---------------------------------------------*
           if        w-cgs-cla-fie        =    spaces
                     go to prn-ini-lr1-350
           else if   w-cgs-gru-fie        =    spaces
                     go to prn-ini-lr1-450
           else      go to prn-ini-lr1-500.
       prn-ini-lr1-350.
      *                  *---------------------------------------------*
      *                  * Se classe non ancora intestata              *
      *                  *---------------------------------------------*
       prn-ini-lr1-355.
      *                      *-----------------------------------------*
      *                      * Flag di intestazione eseguita per :     *
      *                      * - Classe                                *
      *                      * - Gruppo                                *
      *                      * - Sottogruppo                           *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cgs-cla-fie          .
           move      "#"                  to   w-cgs-gru-fie          .
           move      "#"                  to   w-cgs-sgr-fie          .
       prn-ini-lr1-360.
      *                      *-----------------------------------------*
      *                      * Se intestazione generale non ancora e-  *
      *                      * seguita                                 *
      *                      *-----------------------------------------*
           if        w-cgs-gen-fie        not  = spaces
                     go to prn-ini-lr1-370.
      *                          *-------------------------------------*
      *                          * Flag di intestazione generale gia'  *
      *                          * eseguita                            *
      *                          *-------------------------------------*
           move      "#"                  to   w-cgs-gen-fie          .
       prn-ini-lr1-365.
      *                          *-------------------------------------*
      *                          * Intestazione pagina                 *
      *                          *-------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * A test su suddivisione classe       *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-375.
       prn-ini-lr1-370.
      *                      *-----------------------------------------*
      *                      * Se intestazione generale gia' eseguita  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se richiesta comunque una intesta-  *
      *                          * zione ad inizio classe : ad inte-   *
      *                          * stazione pagina                     *
      *                          *-------------------------------------*
           if        w-cgs-cla-int        =    "S"
                     go to prn-ini-lr1-365.
       prn-ini-lr1-375.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se classe suddivi- *
      *                      * sa oppure no                            *
      *                      *-----------------------------------------*
           if        w-cgs-cla-sud        =    02
                     go to prn-ini-lr1-385
           else      go to prn-ini-lr1-380.
       prn-ini-lr1-380.
      *                      *-----------------------------------------*
      *                      * Se classe non suddivisa                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Intestazione per la sola classe     *
      *                          *-------------------------------------*
           perform   sta-int-cla-000      thru sta-int-cla-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-385.
      *                      *-----------------------------------------*
      *                      * Se classe suddivisa                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Deviazione a seconda se gruppo sud- *
      *                          * diviso oppure no                    *
      *                          *-------------------------------------*
           if        w-cgs-gru-sud        =    02
                     go to prn-ini-lr1-395
           else      go to prn-ini-lr1-390.
       prn-ini-lr1-390.
      *                          *-------------------------------------*
      *                          * Se gruppo non suddiviso             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Intestazione per classe e grup- *
      *                              * po                              *
      *                              *---------------------------------*
           perform   sta-int-gru-000      thru sta-int-gru-999        .
      *                              *---------------------------------*
      *                              * Se interruzione forzata : usci- *
      *                              * ta                              *
      *                              *---------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-395.
      *                          *-------------------------------------*
      *                          * Se gruppo suddiviso                 *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Intestazione per classe, grup-  *
      *                              * po, sottogruppo                 *
      *                              *---------------------------------*
           perform   sta-int-sgr-000      thru sta-int-sgr-999        .
      *                              *---------------------------------*
      *                              * Se interruzione forzata : usci- *
      *                              * ta                              *
      *                              *---------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-450.
      *                  *---------------------------------------------*
      *                  * Se gruppo non ancora intestato              *
      *                  *---------------------------------------------*
       prn-ini-lr1-455.
      *                      *-----------------------------------------*
      *                      * Flag di intestazione eseguita per :     *
      *                      * - Gruppo                                *
      *                      * - Sottogruppo                           *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cgs-gru-fie          .
           move      "#"                  to   w-cgs-sgr-fie          .
       prn-ini-lr1-460.
      *                      *-----------------------------------------*
      *                      * Se richiesta comunque una intestazione  *
      *                      * ad inizio gruppo                        *
      *                      *-----------------------------------------*
           if        w-cgs-gru-int        not  = "S"
                     go to prn-ini-lr1-465.
      *                          *-------------------------------------*
      *                          * Intestazione pagina                 *
      *                          *-------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
       prn-ini-lr1-465.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se gruppo suddivi- *
      *                      * so oppure no                            *
      *                      *-----------------------------------------*
           if        w-cgs-gru-sud        =    02
                     go to prn-ini-lr1-475
           else      go to prn-ini-lr1-470.
       prn-ini-lr1-470.
      *                      *-----------------------------------------*
      *                      * Se gruppo non suddiviso                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Intestazione per classe e gruppo    *
      *                          *-------------------------------------*
           perform   sta-int-gru-000      thru sta-int-gru-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-475.
      *                      *-----------------------------------------*
      *                      * Se gruppo suddiviso                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Intestazione per classe, gruppo, e  *
      *                          * sottogruppo                         *
      *                          *-------------------------------------*
           perform   sta-int-sgr-000      thru sta-int-sgr-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-500.
      *                  *---------------------------------------------*
      *                  * Se sottogruppo non ancora intestato         *
      *                  *---------------------------------------------*
       prn-ini-lr1-505.
      *                      *-----------------------------------------*
      *                      * Flag di intestazione eseguita per :     *
      *                      * - Sottogruppo                           *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cgs-sgr-fie          .
       prn-ini-lr1-510.
      *                      *-----------------------------------------*
      *                      * Se richiesta comunque una intestazione  *
      *                      * ad inizio sottogruppo                   *
      *                      *-----------------------------------------*
           if        w-cgs-sgr-int        not  = "S"
                     go to prn-ini-lr1-515.
      *                          *-------------------------------------*
      *                          * Intestazione pagina                 *
      *                          *-------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
       prn-ini-lr1-515.
      *                          *-------------------------------------*
      *                          * Intestazione per classe, gruppo, e  *
      *                          * sottogruppo                         *
      *                          *-------------------------------------*
           perform   sta-int-sgr-000      thru sta-int-sgr-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice magazzino                          *
      *              * - Per descrizione magazzino                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Ciclo di scansione buffer fabbisogni/disponibi- *
      *              * lita' per il prodotto                           *
      *              *-------------------------------------------------*
           move      zero                 to   d-buf-fod-ctr-001      .
       prn-liv-det-100.
           add       1                    to   d-buf-fod-ctr-001      .
           if        d-buf-fod-ctr-001    >    d-buf-fod-num-ele
                     go to prn-liv-det-800.
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    4
                     go to prn-liv-det-120.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                  *---------------------------------------------*
      *                  * Fincatura per dettaglio                     *
      *                  *---------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
       prn-liv-det-120.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-140.
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo record      *
      *                  *---------------------------------------------*
           if        d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    00
                     go to prn-liv-det-200
           else if   d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    10
                     go to prn-liv-det-300
           else if   d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    20
                     go to prn-liv-det-400
           else if   d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    30
                     go to prn-liv-det-500
           else if   d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    40
                     go to prn-liv-det-600
           else if   d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    50
                     go to prn-liv-det-700.
       prn-liv-det-200.
      *                  *---------------------------------------------*
      *                  * Tipo record : 00 - Giacenza                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura descrizione per documenti       *
      *                      *-----------------------------------------*
           move      01                   to   w-let-arc-pdx-rec      .
           move      zero                 to   w-let-arc-pdx-arc      .
           move      "I  "                to   w-let-arc-pdx-lng      .
           move      rf-dcp-num-pro       to   w-let-arc-pdx-pro      .
           move      spaces               to   w-let-arc-pdx-fmt      .
           perform   let-arc-pdx-000      thru let-arc-pdx-999        .
      *                      *-----------------------------------------*
      *                      * Codice alfanumerico magazzino           *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      rf-dcp-alf-pro       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Descrizione magazzino                   *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      016                  to   p-pos                  .
      *
           if        w-let-arc-pdx-flg    not  = spaces
                     move  rf-dcp-des-pro to   p-alf
           else      move  w-let-arc-pdx-des
                                          to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Quantita' in spedizione                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      058                  to   p-pos                  .
           move      d-buf-fod-qta-ics    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Quantita' in giacenza                   *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      070                  to   p-pos                  .
           move      d-buf-fod-qta-ioc
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-220.
      *                      *-----------------------------------------*
      *                      * Tempo di approvigionamento              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se necessario                  *
      *                          *-------------------------------------*
           if        d-buf-fod-tmp-apv    =    zero
                     go to prn-liv-det-240.
      *                          *-------------------------------------*
      *                          * Composizione stringa                *
      *                          *-------------------------------------*
           move      spaces               to   w-prn-liv-det-x40      .
           move      1                    to   w-prn-liv-det-pnt      .
      *                              *---------------------------------*
      *                              * Prompt                          *
      *                              *---------------------------------*
           string    "Consegna: "
                                delimited by   size
                                          into w-prn-liv-det-x40
                                  with pointer w-prn-liv-det-pnt      .
      *                              *---------------------------------*
      *                              * Valore in giorni o settimane    *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Editing                     *
      *                                  *-----------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      070                  to   p-pos                  .
           move      d-buf-fod-tmp-apv    to   p-num                  .
           if        w-prs-mde-tdc        =    1
                     divide   7           into p-num
                                               rounded                .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                                  *-----------------------------*
      *                                  * String                      *
      *                                  *-----------------------------*
           string    p-edt
                                delimited by   spaces
                                          into w-prn-liv-det-x40
                                  with pointer w-prn-liv-det-pnt      .
      *                              *---------------------------------*
      *                              * Literal per giorni o settimane  *
      *                              *---------------------------------*
           if        w-prs-mde-tdc        =    0
                     go to prn-liv-det-222
           else if   w-prs-mde-tdc        =    1
                     go to prn-liv-det-224.
       prn-liv-det-222.
      *                              *---------------------------------*
      *                              * Se giorni                       *
      *                              *---------------------------------*
           string    " gg."
                                delimited by   size
                                          into w-prn-liv-det-x40
                                  with pointer w-prn-liv-det-pnt      .
           go to     prn-liv-det-230.
       prn-liv-det-224.
      *                              *---------------------------------*
      *                              * Se settimane                    *
      *                              *---------------------------------*
           string    " s."
                                delimited by   size
                                          into w-prn-liv-det-x40
                                  with pointer w-prn-liv-det-pnt      .
           go to     prn-liv-det-230.
       prn-liv-det-230.
      *                          *-------------------------------------*
      *                          * Stampa stringa                      *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      16                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      084                  to   p-pos                  .
           move      w-prn-liv-det-x40    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-240.
      *                      *-----------------------------------------*
      *                      * Quantita' di fabbisogno/disponibilita'  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      103                  to   p-pos                  .
           move      d-buf-fod-qta-fod
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-260.
      *                      *-----------------------------------------*
      *                      * Seconda riga per dati prodotto          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da stampare                 *
      *                          *-------------------------------------*
           if        w-let-arc-pdx-flg    not  = spaces
                     go to prn-liv-det-280.
      *                          *-------------------------------------*
      *                          * Interlinea                          *
      *                          *-------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Stampa descrizione 2                *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      016                  to   p-pos                  .
           move      w-let-arc-pdx-rig (02)
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-280.
      *                      *-----------------------------------------*
      *                      * Terza riga per dati prodotto            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione scarichi magazzino   *
      *                          * per mese                            *
      *                          *-------------------------------------*
           move      w-gen-dat-att        to   w-det-scm-mes-dtb      .
           move      12                   to   w-det-scm-mes-mce      .
           move      rr-dpz-inu           to   w-det-scm-mes-dpz      .
           move      01                   to   w-det-scm-mes-tpm      .
           move      rf-dcp-num-pro       to   w-det-scm-mes-cnm      .
           perform   det-scm-mes-000      thru det-scm-mes-999        .
      *                          *-------------------------------------*
      *                          * Determinazione costo d'aquisto di   *
      *                          * riferimento                         *
      *                          *-------------------------------------*
           perform   prn-liv-det-cdr-000  thru prn-liv-det-cdr-999    .
      *                          *-------------------------------------*
      *                          * Lotto di acquisto                   *
      *                          *-------------------------------------*
           move      d-buf-fod-lot-acq    to   w-prn-liv-det-laq      .
      *                          *-------------------------------------*
      *                          * Codice prodotto per il produttore   *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Normalizzazione [aaq]           *
      *                              *---------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                              *---------------------------------*
      *                              * Lettura [aaq]                   *
      *                              *---------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      01                   to   rf-aaq-tip-mag         .
           move      rf-dcp-num-pro       to   rf-aaq-num-pro         .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                              *---------------------------------*
      *                              * Bufferizzazione                 *
      *                              *---------------------------------*
           move      rf-aaq-cdp-pdt       to   w-prn-liv-det-cdp      .
      *                          *-------------------------------------*
      *                          * Assemblaggio valori determinati     *
      *                          * con i relativi prompts              *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Assemblaggio                    *
      *                              *---------------------------------*
           move      120                  to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           if        w-prn-liv-det-cdp    =    spaces
                     move  spaces         to   w-all-str-cat (1)
           else      move  "PN:"          to   w-all-str-cat (1)      .
           move      w-prn-liv-det-cdp    to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *
           move      120                  to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      w-prn-liv-det-w40    to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                              *---------------------------------*
      *                              * Test                            *
      *                              *---------------------------------*
           if        w-prn-liv-det-laq    =    zero
                     go to prn-liv-det-283.
      *                              *---------------------------------*
      *                              * Editing                         *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-prn-liv-det-laq    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * Assemblaggio                    *
      *                              *---------------------------------*
           move      120                  to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      "Lotto :"            to   w-all-str-cat (2)      .
           move      p-edt                to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .           
       prn-liv-det-283.
      *                              *---------------------------------*
      *                              * Test                            *
      *                              *---------------------------------*
           if        w-det-scm-mes-psu    =    zero
                     go to prn-liv-det-285.
      *                              *---------------------------------*
      *                              * Editing scarichi ultimi 12 mesi *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-det-scm-mes-psu    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * Assemblaggio                    *
      *                              *---------------------------------*
           move      120                  to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      "Scarichi ult.12 mesi :"
                                          to   w-all-str-cat (2)      .
           move      p-edt                to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
       prn-liv-det-285.
      *                          *-------------------------------------*
      *                          * Stampa valori determinati           *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Interlinea                      *
      *                              *---------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * Stampa                          *
      *                              *---------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      120                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      006                  to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-290.
      *                      *-----------------------------------------*
      *                      * Esportazione archivio                   *
      *                      *-----------------------------------------*
           perform   prn-liv-det-exp-000  thru prn-liv-det-exp-999    .
      *                      *-----------------------------------------*
      *                      * Riciclo su scansione buffer             *
      *                      *-----------------------------------------*
           go to     prn-liv-det-100.
       prn-liv-det-300.
      *                  *---------------------------------------------*
      *                  * Tipo record : 10 - Fornitori entro l'oriz-  *
      *                  * zonte temporale                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo, codice e dipendenza archivio      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Composizione stringa                *
      *                          *-------------------------------------*
           move      spaces               to   w-prn-liv-det-x40      .
           move      1                    to   w-prn-liv-det-pnt      .
      *                              *---------------------------------*
      *                              * Prompt                          *
      *                              *---------------------------------*
           string    " - F/"
                                delimited by   size
                                          into w-prn-liv-det-x40
                                  with pointer w-prn-liv-det-pnt      .
      *                              *---------------------------------*
      *                              * Codice archivio                 *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Editing                     *
      *                                  *-----------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      d-buf-fod-cod-arc
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                                  *-----------------------------*
      *                                  * String                      *
      *                                  *-----------------------------*
           string    p-edt
                                delimited by   spaces
                                          into w-prn-liv-det-x40
                                  with pointer w-prn-liv-det-pnt      .
      *                              *---------------------------------*
      *                              * Dipendenza archivio             *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Test se esistente           *
      *                                  *-----------------------------*
           if        d-buf-fod-dpz-arc
                    (d-buf-fod-ctr-001)   =    spaces
                     go to prn-liv-det-310.
           string    "-"
                                delimited by   size
                     d-buf-fod-dpz-arc
                    (d-buf-fod-ctr-001)
                                delimited by   size
                                          into w-prn-liv-det-x40
                                  with pointer w-prn-liv-det-pnt      .
       prn-liv-det-310.
      *                          *-------------------------------------*
      *                          * Stampa stringa                      *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-prn-liv-det-x40    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Descrizione archivio                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Lettura archivio [dcf]              *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      d-buf-fod-cod-arc
                    (d-buf-fod-ctr-001)   to   rf-dcf-cod-fnt         .
           move      d-buf-fod-dpz-arc
                    (d-buf-fod-ctr-001)   to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                          *-------------------------------------*
      *                          * Normalizzazione ragione sociale     *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     move  all "."        to   rf-dcf-rag-soc         .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      016                  to   p-pos                  .
           move      rf-dcf-rag-soc       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Quantita' di impegno/copertura          *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      070                  to   p-pos                  .
           move      d-buf-fod-qta-ioc
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Data consegna richiesta                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      084                  to   p-pos                  .
           move      d-buf-fod-dcn-ric
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Data consegna prevista                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      093                  to   p-pos                  .
           move      d-buf-fod-dcn-prv
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Flag di conferma                        *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      102                  to   p-pos                  .
           move      d-buf-fod-flg-cnf
                    (d-buf-fod-ctr-001)   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Quantita' di fabbisogno/disponibilita'  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      103                  to   p-pos                  .
           move      d-buf-fod-qta-fod
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Numero ordine                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Valore in work di comodo            *
      *                          *-------------------------------------*
           move      d-buf-fod-num-doc
                    (d-buf-fod-ctr-001)   to   w-prn-liv-det-wnd      .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      116                  to   p-pos                  .
           move      w-prn-liv-det-wpg    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Data ordine                             *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      123                  to   p-pos                  .
           move      d-buf-fod-dat-doc
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Prezzo x 1000                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione prezzo riga ordine   *
      *                          *-------------------------------------*
           move      d-buf-fod-dat-doc
                    (d-buf-fod-ctr-001)   to   w-det-prz-rig-dat      .
           move      d-buf-fod-num-doc
                    (d-buf-fod-ctr-001)   to   w-det-prz-rig-num      .
           move      d-buf-fod-num-prg
                    (d-buf-fod-ctr-001)   to   w-det-prz-rig-prg      .
           perform   det-prz-rig-000      thru det-prz-rig-999        .
      *                          *-------------------------------------*
      *                          * Stampa del prezzo attualmente ini-  *
      *                          * bita (Guido - 13/10/2021)           *
      *                          *-------------------------------------*
           go to     prn-liv-det-390.
      *                          *-------------------------------------*
      *                          * Eventuale sigla valuta              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      133                  to   p-pos                  .
      *
           if        w-det-prz-rig-sgl    =    "USD"
                     move  "$"            to   p-alf
           else      move  spaces         to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           add       w-det-prz-rig-dec    to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      134                  to   p-pos                  .
           move      w-det-prz-rig-prz    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-390.
      *                      *-----------------------------------------*
      *                      * Esportazione archivio                   *
      *                      *-----------------------------------------*
           perform   prn-liv-det-exp-000  thru prn-liv-det-exp-999    .
      *                      *-----------------------------------------*
      *                      * Riciclo su scansione buffer             *
      *                      *-----------------------------------------*
           go to     prn-liv-det-100.
       prn-liv-det-400.
      *                  *---------------------------------------------*
      *                  * Tipo record : 20 - Clienti entro l'oriz-    *
      *                  * zonte temporale                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo, codice e dipendenza archivio      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Composizione stringa                *
      *                          *-------------------------------------*
           move      spaces               to   w-prn-liv-det-x40      .
           move      1                    to   w-prn-liv-det-pnt      .
      *                              *---------------------------------*
      *                              * Prompt                          *
      *                              *---------------------------------*
           string    " - C/"
                                delimited by   size
                                          into w-prn-liv-det-x40
                                  with pointer w-prn-liv-det-pnt      .
      *                              *---------------------------------*
      *                              * Codice archivio                 *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Editing                     *
      *                                  *-----------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      d-buf-fod-cod-arc
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                                  *-----------------------------*
      *                                  * String                      *
      *                                  *-----------------------------*
           string    p-edt
                                delimited by   spaces
                                          into w-prn-liv-det-x40
                                  with pointer w-prn-liv-det-pnt      .
      *                              *---------------------------------*
      *                              * Dipendenza archivio             *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Test se esistente           *
      *                                  *-----------------------------*
           if        d-buf-fod-dpz-arc
                    (d-buf-fod-ctr-001)   =    spaces
                     go to prn-liv-det-410.
           string    "-"
                                delimited by   size
                     d-buf-fod-dpz-arc
                    (d-buf-fod-ctr-001)
                                delimited by   size
                                          into w-prn-liv-det-x40
                                  with pointer w-prn-liv-det-pnt      .
       prn-liv-det-410.
      *                          *-------------------------------------*
      *                          * Stampa stringa                      *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-prn-liv-det-x40    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Descrizione archivio                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Lettura archivio [dcc]              *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      d-buf-fod-cod-arc
                    (d-buf-fod-ctr-001)   to   rf-dcc-cod-cli         .
           move      d-buf-fod-dpz-arc
                    (d-buf-fod-ctr-001)   to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                          *-------------------------------------*
      *                          * Normalizzazione ragione sociale     *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     move  all "."        to   rf-dcc-rag-soc         .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      016                  to   p-pos                  .
           move      rf-dcc-rag-soc       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Quantita' di impegno/copertura          *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      058                  to   p-pos                  .
           move      d-buf-fod-qta-ioc
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Data consegna richiesta                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      084                  to   p-pos                  .
           move      d-buf-fod-dcn-ric
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Data consegna prevista                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      093                  to   p-pos                  .
           move      d-buf-fod-dcn-prv
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Flag di conferma                        *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      102                  to   p-pos                  .
           move      d-buf-fod-flg-cnf
                    (d-buf-fod-ctr-001)   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Quantita' di fabbisogno/disponibilita'  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      103                  to   p-pos                  .
           move      d-buf-fod-qta-fod
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Numero ordine                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Valore in work di comodo            *
      *                          *-------------------------------------*
           move      d-buf-fod-num-doc
                    (d-buf-fod-ctr-001)   to   w-prn-liv-det-wnd      .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      116                  to   p-pos                  .
           move      w-prn-liv-det-wpg    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Data ordine                             *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      123                  to   p-pos                  .
           move      d-buf-fod-dat-doc
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Flag tipo ordine 'forecast'             *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      132                  to   p-pos                  .
           move      d-buf-fod-fds-dcr
                    (d-buf-fod-ctr-001)   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Prezzo x 1000                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione prezzo riga ordine   *
      *                          *-------------------------------------*
           move      d-buf-fod-dat-doc
                    (d-buf-fod-ctr-001)   to   w-det-prz-rig-dat      .
           move      d-buf-fod-num-doc
                    (d-buf-fod-ctr-001)   to   w-det-prz-rig-num      .
           move      d-buf-fod-num-prg
                    (d-buf-fod-ctr-001)   to   w-det-prz-rig-prg      .
           perform   det-prz-rig-000      thru det-prz-rig-999        .
      *                          *-------------------------------------*
      *                          * Stampa del prezzo attualmente ini-  *
      *                          * bita (Guido - 13/10/2021)           *
      *                          *-------------------------------------*
           go to     prn-liv-det-490.
      *                          *-------------------------------------*
      *                          * Eventuale sigla valuta              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      133                  to   p-pos                  .
      *
           if        w-det-prz-rig-sgl    =    "USD"
                     move  "$"            to   p-alf
           else      move  spaces         to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           add       w-det-prz-rig-dec    to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      134                  to   p-pos                  .
           move      w-det-prz-rig-prz    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-490.
      *                      *-----------------------------------------*
      *                      * Esportazione archivio                   *
      *                      *-----------------------------------------*
           perform   prn-liv-det-exp-000  thru prn-liv-det-exp-999    .
      *                      *-----------------------------------------*
      *                      * Riciclo su scansione buffer             *
      *                      *-----------------------------------------*
           go to     prn-liv-det-100.
       prn-liv-det-500.
      *                  *---------------------------------------------*
      *                  * Tipo record : 30 - Elemento alla data del-  *
      *                  * l'orizzonte temporale                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal per sottoscorta                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da eseguire                 *
      *                          *-------------------------------------*
           if        rr-tcr-gia           not  = 10
                     go to prn-liv-det-510.
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      016                  to   p-pos                  .
           move      "                           Scorta Minima"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Quantita' di impegno/copertura          *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      058                  to   p-pos                  .
           move      d-buf-fod-qta-ioc
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-510.
      *                      *-----------------------------------------*
      *                      * Data consegna prevista                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      093                  to   p-pos                  .
           move      d-buf-fod-dcn-prv
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Quantita' di fabbisogno/disponibilita'  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da eseguire                 *
      *                          *-------------------------------------*
           if        rr-tcr-gia           =    01
                     go to prn-liv-det-520.
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      103                  to   p-pos                  .
           move      d-buf-fod-qta-fod
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-520.
      *                      *-----------------------------------------*
      *                      * Esportazione archivio                   *
      *                      *-----------------------------------------*
           perform   prn-liv-det-exp-000  thru prn-liv-det-exp-999    .
      *                      *-----------------------------------------*
      *                      * Riciclo su scansione buffer             *
      *                      *-----------------------------------------*
           go to     prn-liv-det-100.
       prn-liv-det-600.
      *                  *---------------------------------------------*
      *                  * Tipo record : 40 - Fornitori oltre l'oriz-  *
      *                  * zonte temporale                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Stesso trattamento di quelli entro l'o- *
      *                      * rizzonte temporale                      *
      *                      *-----------------------------------------*
           go to     prn-liv-det-300.
       prn-liv-det-700.
      *                  *---------------------------------------------*
      *                  * Tipo record : 50 - Clienti oltre l'orizzon- *
      *                  * te temporale                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Stesso trattamento di quelli entro l'o- *
      *                      * rizzonte temporale                      *
      *                      *-----------------------------------------*
           go to     prn-liv-det-400.
       prn-liv-det-800.
      *                  *---------------------------------------------*
      *                  * Stampa trattini di chiusura articolo        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "-------------- -----------------------------------
      -              "------- ----------- ----------- --------- --------
      -              " - ----------- -----------------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Subroutine per il costo di riferimento                    *
      *    *                                                           *
      *    * N.B.: Come in orc500s                                     *
      *    *-----------------------------------------------------------*
       prn-liv-det-cdr-000.
      *              *-------------------------------------------------*
      *              * Determinazione                                  *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-det-cos-rif-dtb      .
           move      01                   to   w-det-cos-rif-tpm      .
           move      rf-dcp-num-pro       to   w-det-cos-rif-cnm      .
           perform   det-cos-rif-000      thru det-cos-rif-999        .
           move      w-det-cos-rif-svc    to   w-prn-liv-det-svc      .
           move      w-det-cos-rif-dvc    to   w-prn-liv-det-dvc      .
           move      w-det-cos-rif-dec    to   w-prn-liv-det-dec      .
           move      w-det-cos-rif-cdr    to   w-prn-liv-det-val      .
           move      w-det-cos-rif-svl    to   w-prn-liv-det-svl      .
           move      w-det-cos-rif-crl    to   w-prn-liv-det-crl      .
           move      w-det-cos-rif-pll    to   w-prn-liv-det-pll      .
       prn-liv-det-cdr-100.
      *              *-------------------------------------------------*
      *              * Assemblaggio                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del costo da esporre *
      *                  *---------------------------------------------*
           if        w-prn-liv-det-svl    not  = spaces
                     go to prn-liv-det-cdr-102
           else if   w-prn-liv-det-svc    not  = c-sgl
                     go to prn-liv-det-cdr-104
           else      go to prn-liv-det-cdr-106.
       prn-liv-det-cdr-102.
      *                  *---------------------------------------------*
      *                  * Costo da esporre : con legame valutario     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-prn-liv-det-w40      .
           move      1                    to   w-prn-liv-det-ctr      .
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           string    "Costo: "
                                delimited by   size
                                          into w-prn-liv-det-w40
                                  with pointer w-prn-liv-det-ctr      .
      *                          *-------------------------------------*
      *                          * Valore costo di riferimento         *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing                         *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      w-prn-liv-det-dvc    to   p-dec                  .
           add       w-prn-liv-det-dec    to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "G<"                 to   p-edm                  .
           move      w-prn-liv-det-val    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * String                          *
      *                              *---------------------------------*
           string    p-edt
                                delimited by   spaces
                     " "
                                delimited by   size
                                          into w-prn-liv-det-w40
                                  with pointer w-prn-liv-det-ctr      .
      *                          *-------------------------------------*
      *                          * Sigla valuta per legame             *
      *                          *-------------------------------------*
           string    w-prn-liv-det-svl
                                delimited by   spaces
                     " "
                                delimited by   size
                                          into w-prn-liv-det-w40
                                  with pointer w-prn-liv-det-ctr      .
      *                          *-------------------------------------*
      *                          * Coeff. di cambio di riferim. per    *
      *                          * legame                              *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing                         *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "GD<"                to   p-edm                  .
           move      w-prn-liv-det-crl    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * String                          *
      *                              *---------------------------------*
           string    p-edt
                                delimited by   spaces
                     " "
                                delimited by   size
                                          into w-prn-liv-det-w40
                                  with pointer w-prn-liv-det-ctr      .
      *                          *-------------------------------------*
      *                          * Perc. di limitazione per legame     *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing                         *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "GBD<"               to   p-edm                  .
           move      w-prn-liv-det-pll    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * String                          *
      *                              *---------------------------------*
           string    p-edt
                                delimited by   spaces
                                          into w-prn-liv-det-w40
                                  with pointer w-prn-liv-det-ctr      .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     prn-liv-det-cdr-900.
       prn-liv-det-cdr-104.
      *                  *---------------------------------------------*
      *                  * Costo da esporre : con sigla valuta diversa *
      *                  * da quella base                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Composizione stringa                *
      *                          *-------------------------------------*
           move      spaces               to   w-prn-liv-det-w40      .
           move      1                    to   w-prn-liv-det-ctr      .
      *                              *---------------------------------*
      *                              * Literal                         *
      *                              *---------------------------------*
           string    "Costo di rif."
                                delimited by   size
                                          into w-prn-liv-det-w40
                                  with pointer w-prn-liv-det-ctr      .
      *                              *---------------------------------*
      *                              * Sigla valuta di riferimento per *
      *                              * l'acquisto                      *
      *                              *---------------------------------*
           string    w-prn-liv-det-svc
                                delimited by   size
                                          into w-prn-liv-det-w40
                                  with pointer w-prn-liv-det-ctr      .
      *                          *-------------------------------------*
      *                          * Due punti finale                    *
      *                          *-------------------------------------*
           move      ":"                  to   w-prn-liv-det-w40
                                              (22 : 1)                .
      *                      *-----------------------------------------*
      *                      * Assemblaggio con valore                 *
      *                      *-----------------------------------------*
           go to     prn-liv-det-cdr-110.
       prn-liv-det-cdr-106.
      *                  *---------------------------------------------*
      *                  * Costo da esporre : Normale in valuta base   *
      *                  * da quella base                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "Costo di rif. :"
                                          to   w-prn-liv-det-w40      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio con valore                 *
      *                      *-----------------------------------------*
           go to     prn-liv-det-cdr-110.
       prn-liv-det-cdr-110.
      *                  *---------------------------------------------*
      *                  * Assemblaggio con valore                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      w-prn-liv-det-dvc    to   p-dec                  .
           add       w-prn-liv-det-dec    to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "G<"                 to   p-edm                  .
           move      w-prn-liv-det-val    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      w-prn-liv-det-w40    to   w-all-str-cat (1)      .
           move      p-edt                to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-prn-liv-det-w40      .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     prn-liv-det-cdr-900.
       prn-liv-det-cdr-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-cdr-999.
       prn-liv-det-cdr-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Subroutine per esportazione                               *
      *    *-----------------------------------------------------------*
       prn-liv-det-exp-000.
      *              *-------------------------------------------------*
      *              * Preparazione                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore elementi               *
      *                  *---------------------------------------------*
           add       1                    to   w-tot-gen-ele          .
      *                  *---------------------------------------------*
      *                  * Pulizia preliminare                         *
      *                  *---------------------------------------------*
           move      spaces               to   g-rec                  .
      *                  *---------------------------------------------*
      *                  * Separatori dati fissi                       *
      *                  *---------------------------------------------*
           move      w-det-fin-rig-tab    to   w-out-dsp-sep-001
                                               w-out-dsp-sep-002
                                               w-out-dsp-sep-003
                                               w-out-dsp-sep-004
                                               w-out-dsp-sep-005
                                               w-out-dsp-sep-006
                                               w-out-dsp-sep-007
                                               w-out-dsp-sep-008
                                               w-out-dsp-sep-009
                                               w-out-dsp-sep-010
                                               w-out-dsp-sep-011
                                               w-out-dsp-sep-012      .
       prn-liv-det-exp-200.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo record          *
      *              *-------------------------------------------------*
           if        d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    00
                     perform  prn-liv-det-e00-000
                                          thru prn-liv-det-e00-999
           else if   d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    10
                     perform  prn-liv-det-e10-000
                                          thru prn-liv-det-e10-999
           else if   d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    20
                     perform  prn-liv-det-e20-000
                                          thru prn-liv-det-e20-999
           else if   d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    30
                     perform  prn-liv-det-e30-000
                                          thru prn-liv-det-e30-999
           else if   d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    40
                     perform  prn-liv-det-e10-000
                                          thru prn-liv-det-e10-999
           else if   d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    50
                     perform  prn-liv-det-e20-000
                                          thru prn-liv-det-e20-999    .
       prn-liv-det-exp-800.
      *              *-------------------------------------------------*
      *              * Carattere di fine riga                          *
      *              *-------------------------------------------------*
           move      w-det-fin-rig-chr    to   w-out-dsp-fin-rig      .
      *              *-------------------------------------------------*
      *              * Scrittura record in output                      *
      *              *-------------------------------------------------*
           move      w-out-dsp            to   g-rec                  .
           perform   put-nxt-out-000      thru put-nxt-out-999        .
       prn-liv-det-exp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-exp-999.
       prn-liv-det-exp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Subroutine per esportazione                               *
      *    *                                                           *
      *    * Tipo record: 00 - Giacenza                                *
      *    *-----------------------------------------------------------*
       prn-liv-det-e00-000.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Colonna 001 - (vuota)                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-out-dsp-col-001      .
      *                  *---------------------------------------------*
      *                  * Colonna 002 - Codice prodotto               *
      *                  *---------------------------------------------*
           move      rf-dcp-alf-pro       to   w-out-dsp-col-002      .
      *                  *---------------------------------------------*
      *                  * Colonna 003 - Descrizione prodotto          *
      *                  *---------------------------------------------*
           move      w-let-arc-pdx-des    to   w-out-dsp-col-003      .
      *                  *---------------------------------------------*
      *                  * Colonna 004 - In spedizione                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<G"                 to   p-edm                  .
           move      d-buf-fod-qta-ics    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-004      .
      *                  *---------------------------------------------*
      *                  * Colonna 005 - Giacenza                      *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<G"                 to   p-edm                  .
           move      d-buf-fod-qta-ioc
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-005      .
      *                  *---------------------------------------------*
      *                  * Colonna 006 - Tempo di approvigionamento    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing tempo di approvigionamento      *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      070                  to   p-pos                  .
           move      d-buf-fod-tmp-apv    to   p-num                  .
           if        w-prs-mde-tdc        =    1
                     divide   7           into p-num
                                               rounded                .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      30                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "Consegna :"         to   w-all-str-cat (1)      .
           move      p-edt                to   w-all-str-cat (2)      .
           move      "s."                 to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * In campo di output                      *
      *                      *-----------------------------------------*
           move      w-all-str-alf        to   w-out-dsp-col-006      .
      *                  *---------------------------------------------*
      *                  * Colonna 007 - Codice prodotto produttore    *
      *                  *---------------------------------------------*
           move      w-prn-liv-det-cdp    to   w-out-dsp-col-007      .
      *                  *---------------------------------------------*
      *                  * Colonna 008 - Lotto                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-prn-liv-det-laq    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      20                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "Lotto :"            to   w-all-str-cat (1)      .
           move      p-edt                to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .           
      *                      *-----------------------------------------*
      *                      * In campo di output                      *
      *                      *-----------------------------------------*
           move      w-all-str-alf        to   w-out-dsp-col-008      .
      *                  *---------------------------------------------*
      *                  * Colonna 009 - scarichi ultimi 12 mesi       *
      *                  * ___                                         *
      *                  *---------------------------------------------*
           move      spaces               to   w-out-dsp-col-009      .
      *                  *---------------------------------------------*
      *                  * Colonna 010 - (vuota)                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-out-dsp-col-010      .
      *                  *---------------------------------------------*
      *                  * Colonna 011 - (vuota)                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-out-dsp-col-011      .
      *                  *---------------------------------------------*
      *                  * Colonna 012 - (vuota)                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-out-dsp-col-012      .
      *                  *---------------------------------------------*
      *                  * Colonna 013 - (vuota)                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-out-dsp-col-013      .
       prn-liv-det-e00-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-e00-999.
       prn-liv-det-e00-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Subroutine per esportazione                               *
      *    *                                                           *
      *    * Tipo record: 10 e 40 - Fornitori                          *
      *    *-----------------------------------------------------------*
       prn-liv-det-e10-000.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Colonna 001 - Tipo record                   *
      *                  *---------------------------------------------*
           move      "F"                  to   w-out-dsp-col-001      .
      *                  *---------------------------------------------*
      *                  * Colonna 002 - Codice fornitore              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      d-buf-fod-cod-arc
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      15                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      p-edt                to   w-all-str-cat (1)      .
      *
           if        d-buf-fod-dpz-arc
                    (d-buf-fod-ctr-001)   =    spaces
                     move spaces          to   w-all-str-cat (2)
                     move spaces          to   w-all-str-cat (3)
           else      move "-"             to   w-all-str-cat (2)
                     move d-buf-fod-dpz-arc
                         (d-buf-fod-ctr-001)
                                          to   w-all-str-cat (3)      .
      *
           perform   all-str-cat-000      thru all-str-cat-999        .           
      *                      *-----------------------------------------*
      *                      * In campo di output                      *
      *                      *-----------------------------------------*
           move      w-all-str-alf        to   w-out-dsp-col-002      .
      *                  *---------------------------------------------*
      *                  * Colonna 003 - Descrizione archivio          *
      *                  *---------------------------------------------*
           move      rf-dcf-rag-soc       to   w-out-dsp-col-003      .
      *                  *---------------------------------------------*
      *                  * Colonna 004 - Quantita' di impegno          *
      *                  *---------------------------------------------*
           move      spaces               to   w-out-dsp-col-004      .
      *                  *---------------------------------------------*
      *                  * Colonna 005 - Quantita' di copertura        *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<G"                 to   p-edm                  .
           move      d-buf-fod-qta-ioc
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-005      .
      *                  *---------------------------------------------*
      *                  * Colonna 006 - Data consegna richiesta       *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      d-buf-fod-dcn-ric
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-006      .
      *                  *---------------------------------------------*
      *                  * Colonna 007 - Data consegna prevista        *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      d-buf-fod-dcn-prv
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-007      .
      *                  *---------------------------------------------*
      *                  * Colonna 008 - Flag condegna                 *
      *                  *---------------------------------------------*
           move      d-buf-fod-flg-cnf
                    (d-buf-fod-ctr-001)   to   w-out-dsp-col-008      .
      *                  *---------------------------------------------*
      *                  * Colonna 009 - Quantita' di fabbisogno       *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<G"                 to   p-edm                  .
           move      d-buf-fod-qta-fod
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-009      .
      *                  *---------------------------------------------*
      *                  * Colonna 010 - Numero ordine                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-prn-liv-det-wpg    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-010      .
      *                  *---------------------------------------------*
      *                  * Colonna 011 - Data ordine                   *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      d-buf-fod-dat-doc
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-011      .
      *                  *---------------------------------------------*
      *                  * Colonna 012 - Sigla valuta                  *
      *                  *---------------------------------------------*
           move      w-det-prz-rig-sgl    to   w-out-dsp-col-012      .
      *                  *---------------------------------------------*
      *                  * Colonna 013 - Prezzo x mille                *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           add       w-det-prz-rig-dec    to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<BG"                to   p-edm                  .
           move      w-det-prz-rig-prz    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-013      .
       prn-liv-det-e10-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-e10-999.
       prn-liv-det-e10-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Subroutine per esportazione                               *
      *    *                                                           *
      *    * Tipo record: 20 e 50 - Clienti                            *
      *    *-----------------------------------------------------------*
       prn-liv-det-e20-000.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Colonna 001 - Tipo record                   *
      *                  *---------------------------------------------*
           move      "C"                  to   w-out-dsp-col-001      .
      *                  *---------------------------------------------*
      *                  * Colonna 002 - Codice cliente                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      d-buf-fod-cod-arc
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      15                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      p-edt                to   w-all-str-cat (1)      .
      *
           if        d-buf-fod-dpz-arc
                    (d-buf-fod-ctr-001)   =    spaces
                     move spaces          to   w-all-str-cat (2)
                     move spaces          to   w-all-str-cat (3)
           else      move "-"             to   w-all-str-cat (2)
                     move d-buf-fod-dpz-arc
                         (d-buf-fod-ctr-001)
                                          to   w-all-str-cat (3)      .
      *
           perform   all-str-cat-000      thru all-str-cat-999        .           
      *                      *-----------------------------------------*
      *                      * In campo di output                      *
      *                      *-----------------------------------------*
           move      w-all-str-alf        to   w-out-dsp-col-002      .
      *                  *---------------------------------------------*
      *                  * Colonna 003 - Descrizione archivio          *
      *                  *---------------------------------------------*
           move      rf-dcc-rag-soc       to   w-out-dsp-col-003      .
      *                  *---------------------------------------------*
      *                  * Colonna 004 - Quantita' di impegno          *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<G"                 to   p-edm                  .
           move      d-buf-fod-qta-ioc
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-004      .
      *                  *---------------------------------------------*
      *                  * Colonna 005 - Quantita' di copertura        *
      *                  *---------------------------------------------*
           move      spaces               to   w-out-dsp-col-005      .
      *                  *---------------------------------------------*
      *                  * Colonna 006 - Data consegna richiesta       *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      d-buf-fod-dcn-ric
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-006      .
      *                  *---------------------------------------------*
      *                  * Colonna 007 - Data consegna prevista        *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      d-buf-fod-dcn-prv
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-007      .
      *                  *---------------------------------------------*
      *                  * Colonna 008 - Flag condegna                 *
      *                  *---------------------------------------------*
           move      d-buf-fod-flg-cnf
                    (d-buf-fod-ctr-001)   to   w-out-dsp-col-008      .
      *                  *---------------------------------------------*
      *                  * Colonna 009 - Quantita' di fabbisogno       *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<G"                 to   p-edm                  .
           move      d-buf-fod-qta-fod
                    (d-buf-fod-ctr-001)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-009      .
      *                  *---------------------------------------------*
      *                  * Colonna 010 - Numero ordine                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-prn-liv-det-wpg    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-010      .
      *                  *---------------------------------------------*
      *                  * Colonna 011 - Data ordine                   *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      d-buf-fod-dat-doc
                    (d-buf-fod-ctr-001)   to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-011      .
      *                  *---------------------------------------------*
      *                  * Colonna 012 - Sigla valuta                  *
      *                  *---------------------------------------------*
           move      w-det-prz-rig-sgl    to   w-out-dsp-col-012      .
      *                  *---------------------------------------------*
      *                  * Colonna 013 - Prezzo x mille                *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           add       w-det-prz-rig-dec    to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<BG"                to   p-edm                  .
           move      w-det-prz-rig-prz    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-dsp-col-013      .
       prn-liv-det-e20-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-e20-999.
       prn-liv-det-e20-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Subroutine per esportazione                               *
      *    *                                                           *
      *    * Tipo record: 30 - Elemento alla data dell'orizzonte       *
      *    *                   temporale                               *
      *    *-----------------------------------------------------------*
       prn-liv-det-e30-000.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
           move      spaces               to   w-out-dsp-col-001
                                               w-out-dsp-col-002
                                               w-out-dsp-col-003
                                               w-out-dsp-col-004
                                               w-out-dsp-col-005
                                               w-out-dsp-col-006
                                               w-out-dsp-col-007
                                               w-out-dsp-col-008
                                               w-out-dsp-col-009
                                               w-out-dsp-col-010
                                               w-out-dsp-col-011
                                               w-out-dsp-col-012
                                               w-out-dsp-col-013      .
       prn-liv-det-e30-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-e30-999.
       prn-liv-det-e30-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri intestazione standard    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione titolo                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing data elaborazione               *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      rr-dat-ela           to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * String                                  *
      *                      *-----------------------------------------*
           string    "PROIEZIONE FABBISOGNI PRODOTTI DI VENDITA PER DATA
      -              " AL " 
                                delimited by   size
                     p-edt
                                delimited by   spaces
                                          into w-cnt-tit-des-tit      .
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Preparazione altri dati                     *
      *                  *---------------------------------------------*
           move      s-dat                to   w-cnt-tit-dat-stp      .
           move      p-pag                to   w-cnt-tit-num-pag      .
           add       1                    to   w-cnt-tit-num-pag      .
      *              *-------------------------------------------------*
      *              * Intestazione standard                           *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per interruzione forzata          *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-sta-999.
       int-pag-sta-200.
      *              *-------------------------------------------------*
      *              * Intestazione fornitore                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Test su cidce fornitore preferenziale       *
      *                  *---------------------------------------------*
           if        w-rot-l04-cod-fnt    =    zero
                     move  "(Senza Fornitore preferenziale)"
                                          to   rf-dcf-rag-soc
                     go to int-pag-sta-300.
      *                  *---------------------------------------------*
      *                  * Lettura anagrafica                          *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      w-rot-l04-cod-fnt    to   rf-dcf-cod-fnt         .
           move      spaces               to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
           if        f-sts                not  = e-not-err
                     move all "."         to   rf-dcf-rag-soc         .
      *                  *---------------------------------------------*
      *                  * Codice fornitore                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      040                  to   p-pos                  .
           move      w-rot-l04-cod-fnt    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-300.
      *                  *---------------------------------------------*
      *                  * Ragione sociale fornitore                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      049                  to   p-pos                  .
           move      rf-dcf-rag-soc       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-800.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Fincatura dettaglio                                       *
      *    *-----------------------------------------------------------*
       int-fin-det-000.
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea di fincatura                        *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "                                                  
      -              "          Impegni    Coperture   Consegna Consegna
      -              "   Fabb./Disp.      Estremi     "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea di fincatura                      *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "    Codice                    Descrizione         
      -              "            (-)         (+)     Richiesta Calcol. 
      -              " C     (=)          Ordine      "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura                        *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "-------------- -----------------------------------
      -              "------- ----------- ----------- --------- --------
      -              " - ----------- -----------------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-fin-det-999.
           exit.

      *    *===========================================================*
      *    * Determinazione costo di riferimento per il prodotto       *
      *    *-----------------------------------------------------------*
       det-cos-rif-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori in uscita                *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-cos-rif-tde      .
           move      spaces               to   w-det-cos-rif-svc      .
           move      zero                 to   w-det-cos-rif-dvc      .
           move      zero                 to   w-det-cos-rif-dec      .
           move      zero                 to   w-det-cos-rif-cdr      .
           move      spaces               to   w-det-cos-rif-svl      .
           move      spaces               to   w-det-cos-rif-tcl      .
           move      zero                 to   w-det-cos-rif-crl      .
           move      zero                 to   w-det-cos-rif-pll      .
      *              *-------------------------------------------------*
      *              * Tentativo di determinazione con combinazione    *
      *              * fornitore/prodotto [aaf]                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura record [aaq]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      w-det-cos-rif-tpm    to   rf-aaq-tip-mag         .
           move      w-det-cos-rif-cnm    to   rf-aaq-num-pro         .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                  *---------------------------------------------*
      *                  * Se record non trovato : a determinazione    *
      *                  * costo medio continuo                        *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-cos-rif-500.
      *                  *---------------------------------------------*
      *                  * Se fornitore preferenziale per il prodotto  *
      *                  * a zero : a determinazione costo medio con-  *
      *                  * tinuo                                       *
      *                  *---------------------------------------------*
           if        rf-aaq-dcf-pfz       =    zero
                     go to det-cos-rif-500.
      *                  *---------------------------------------------*
      *                  * Lettura record [aaf]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "PRFNFM"             to   f-key                  .
           move      w-det-cos-rif-tpm    to   rf-aaf-tip-mag         .
           move      w-det-cos-rif-cnm    to   rf-aaf-num-pro         .
           move      rf-aaq-dcf-pfz       to   rf-aaf-cod-dcf         .
           move      spaces               to   rf-aaf-fda-pif         .
           move      "pgm/dcf/fls/ioc/obj/iofaaf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaf                 .
      *                  *---------------------------------------------*
      *                  * Se record non trovato : : a determinazione  *
      *                  * costo medio continuo                        *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-cos-rif-500.
      *                  *---------------------------------------------*
      *                  * Preparazione valori in uscita               *
      *                  *---------------------------------------------*
           move      01                   to   w-det-cos-rif-tde      .
           move      rf-aaf-sgl-vlt       to   w-det-cos-rif-svc      .
           move      rf-aaf-dec-vlt       to   w-det-cos-rif-dvc      .
           move      rf-aaf-dec-prz       to   w-det-cos-rif-dec      .
           move      rf-aaf-prz-pes (1)   to   w-det-cos-rif-cdr      .
           if        rf-aaf-lgv-vlt       not  = spaces
                     move  rf-aaf-lgv-vlt to   w-det-cos-rif-svl
                     move  rf-aaf-lgv-tdc to   w-det-cos-rif-tcl
                     move  rf-aaf-lgv-cdc to   w-det-cos-rif-crl
                     move  rf-aaf-lgv-pdt to   w-det-cos-rif-pll      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-cos-rif-999.
       det-cos-rif-500.
      *              *-------------------------------------------------*
      *              * Determinazione con costo medio continuo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiamo modulo di magazzino                *
      *                  *---------------------------------------------*
           move      "VM"                 to   d-vun-mag-tip-ope      .
           move      0005                 to   d-vun-mag-tip-val      .
           move      w-det-cos-rif-dtb    to   d-vun-mag-dat-val      .
           move      w-det-cos-rif-tpm    to   d-vun-mag-tip-mag      .
           move      w-det-cos-rif-cnm    to   d-vun-mag-num-mag      .
           move      "pgm/mag/prg/obj/pmag300v"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-vun-mag              .
      *                  *---------------------------------------------*
      *                  * Preparazione valori in uscita               *
      *                  *---------------------------------------------*
           move      02                   to   w-det-cos-rif-tde      .
           move      c-sgl                to   w-det-cos-rif-svc      .
           move      c-dec                to   w-det-cos-rif-dvc      .
           move      02                   to   w-det-cos-rif-dec      .
           move      d-vun-mag-val-uni    to   w-det-cos-rif-cdr      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-cos-rif-999.
       det-cos-rif-999.
           exit.

      *    *===========================================================*
      *    * Stampa intestazione classe                                *
      *    *-----------------------------------------------------------*
       sta-int-cla-000.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      9                    to   w-cgs-wrk-nln          .
           add       w-cgs-det-idf        to   w-cgs-wrk-nln          .
           if        p-res                >    w-cgs-wrk-nln
                     go to sta-int-cla-200.
       sta-int-cla-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Test se interruzione forzata                    *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-int-cla-999.
       sta-int-cla-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la fincatura       *
      *              *-------------------------------------------------*
           subtract  40                   from p-sel-als-sel
                                        giving w-cgs-wrk-pfn          .
           divide    2                    into w-cgs-wrk-pfn          .
           add       1                    to   w-cgs-wrk-pfn          .
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini superiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "="              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione classe                 *
      *              *-------------------------------------------------*
           move      w-cgs-cla-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione classe     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la classe          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione classe                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini inferiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       sta-int-cla-999.
           exit.

      *    *===========================================================*
      *    * Stampa intestazione classe e gruppo                       *
      *    *-----------------------------------------------------------*
       sta-int-gru-000.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      10                   to   w-cgs-wrk-nln          .
           add       w-cgs-det-idf        to   w-cgs-wrk-nln          .
           if        p-res                >    w-cgs-wrk-nln
                     go to sta-int-gru-200.
       sta-int-gru-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Test se interruzione forzata                    *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-int-gru-999.
       sta-int-gru-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la fincatura       *
      *              *-------------------------------------------------*
           subtract  40                   from p-sel-als-sel
                                        giving w-cgs-wrk-pfn          .
           divide    2                    into w-cgs-wrk-pfn          .
           add       1                    to   w-cgs-wrk-pfn          .
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini superiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "="              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione classe                 *
      *              *-------------------------------------------------*
           move      w-cgs-cla-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione classe     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la classe          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione classe                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione gruppo                 *
      *              *-------------------------------------------------*
           move      w-cgs-gru-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione gruppo     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per il gruppo          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione gruppo                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini inferiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       sta-int-gru-999.
           exit.

      *    *===========================================================*
      *    * Stampa intestazione classe, gruppo, sottogruppo           *
      *    *-----------------------------------------------------------*
       sta-int-sgr-000.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      11                   to   w-cgs-wrk-nln          .
           add       w-cgs-det-idf        to   w-cgs-wrk-nln          .
           if        p-res                >    w-cgs-wrk-nln
                     go to sta-int-sgr-200.
       sta-int-sgr-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Test se interruzione forzata                    *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-int-sgr-999.
       sta-int-sgr-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la fincatura       *
      *              *-------------------------------------------------*
           subtract  40                   from p-sel-als-sel
                                        giving w-cgs-wrk-pfn          .
           divide    2                    into w-cgs-wrk-pfn          .
           add       1                    to   w-cgs-wrk-pfn          .
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini superiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "="              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione classe                 *
      *              *-------------------------------------------------*
           move      w-cgs-cla-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione classe     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la classe          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione classe                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione gruppo                 *
      *              *-------------------------------------------------*
           move      w-cgs-gru-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione gruppo     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per il gruppo          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione gruppo                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione sottogruppo            *
      *              *-------------------------------------------------*
           move      w-cgs-sgr-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione sottogrup- *
      *              * po                                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per il sottogruppo     *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione sottogruppo                         *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini inferiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       sta-int-sgr-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [pdx] per scansione delle righe   *
      *    *-----------------------------------------------------------*
       let-arc-pdx-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-pdx-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-let-arc-pdx-ctr      .
      *              *-------------------------------------------------*
      *              * Normalizzazione valore in uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-pdx-des      .
       let-arc-pdx-100.
      *              *-------------------------------------------------*
      *              * Start su file [pdx]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "TRCLNG    "         to   f-key                  .
           move      w-let-arc-pdx-rec    to   rf-pdx-tip-rec         .
           move      w-let-arc-pdx-arc    to   rf-pdx-cod-arc         .
           move      w-let-arc-pdx-lng    to   rf-pdx-cod-lng         .
           move      w-let-arc-pdx-pro    to   rf-pdx-cod-num         .
           move      w-let-arc-pdx-fmt    to   rf-pdx-for-mat         .
           move      zero                 to   rf-pdx-num-prg         .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-pdx-800.
       let-arc-pdx-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [pdx]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *                  *---------------------------------------------*
      *                  * Test se 'at end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-pdx-800.
       let-arc-pdx-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-pdx-tip-rec       not  = w-let-arc-pdx-rec or
                     rf-pdx-cod-arc       not  = w-let-arc-pdx-arc or
                     rf-pdx-cod-lng       not  = w-let-arc-pdx-lng or
                     rf-pdx-cod-num       not  = w-let-arc-pdx-pro or
                     rf-pdx-for-mat       not  = w-let-arc-pdx-fmt
                     go to let-arc-pdx-800.
       let-arc-pdx-400.
      *              *-------------------------------------------------*
      *              * Incremento contatore                            *
      *              *-------------------------------------------------*
           add       1                    to   w-let-arc-pdx-ctr      .
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-pdx-des-pro       to   w-let-arc-pdx-rig
                                              (w-let-arc-pdx-ctr)     .
       let-arc-pdx-600.
      *              *-------------------------------------------------*
      *              * Riciclo su lettura                              *
      *              *-------------------------------------------------*
           go to     let-arc-pdx-200.
       let-arc-pdx-800.
      *              *-------------------------------------------------*
      *              * Test su contatore elementi letti                *
      *              *-------------------------------------------------*
           if        w-let-arc-pdx-ctr    =    zero
                     go to let-arc-pdx-820
           else      go to let-arc-pdx-900.
       let-arc-pdx-820.
      *                  *---------------------------------------------*
      *                  * Se nessun elemento rilevato                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di nessun elemento rilevato        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-let-arc-pdx-flg      .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     let-arc-pdx-900.
       let-arc-pdx-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-pdx-999.
       let-arc-pdx-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zp1]                             *
      *    *-----------------------------------------------------------*
       let-arc-zp1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp1-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice classe a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-zp1-cla    =    zero
                     go to let-arc-zp1-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLA    "         to   f-key                  .
           move      w-let-arc-zp1-cla    to   rf-zp1-cod-cla         .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zp1-400.
       let-arc-zp1-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zp1-des-cla       to   w-let-arc-zp1-des      .
           move      rf-zp1-mne-cla       to   w-let-arc-zp1-mne      .
           move      rf-zp1-ult-sud       to   w-let-arc-zp1-sud      .
           move      rf-zp1-sqz-num       to   w-let-arc-zp1-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zp1-999.
       let-arc-zp1-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zp1-flg      .
           move      all   "."            to   w-let-arc-zp1-des      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-zp1-cla    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-let-arc-zp1-mne      .
           go to     let-arc-zp1-600.
       let-arc-zp1-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp1-des      .
           move      spaces               to   w-let-arc-zp1-mne      .
       let-arc-zp1-600.
           move      zero                 to   w-let-arc-zp1-sud      .
           move      zero                 to   w-let-arc-zp1-sqz      .
       let-arc-zp1-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zp2]                             *
      *    *-----------------------------------------------------------*
       let-arc-zp2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp2-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice gruppo a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-zp2-gru    =    zero
                     go to let-arc-zp2-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODGRU    "         to   f-key                  .
           move      w-let-arc-zp2-cla    to   rf-zp2-cod-cla         .
           move      w-let-arc-zp2-gru    to   rf-zp2-cod-gru         .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zp2-400.
       let-arc-zp2-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zp2-des-gru       to   w-let-arc-zp2-des      .
           move      rf-zp2-mne-gru       to   w-let-arc-zp2-mne      .
           move      rf-zp2-ult-sud       to   w-let-arc-zp2-sud      .
           move      rf-zp2-sqz-num       to   w-let-arc-zp2-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zp2-999.
       let-arc-zp2-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zp2-flg      .
           move      all   "."            to   w-let-arc-zp2-des      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-zp2-gru    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-let-arc-zp2-mne      .
           go to     let-arc-zp2-600.
       let-arc-zp2-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp2-des      .
           move      spaces               to   w-let-arc-zp2-mne      .
       let-arc-zp2-600.
           move      zero                 to   w-let-arc-zp2-sud      .
           move      zero                 to   w-let-arc-zp2-sqz      .
       let-arc-zp2-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zp3]                             *
      *    *-----------------------------------------------------------*
       let-arc-zp3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp3-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice sottogruppo a zero               *
      *              *-------------------------------------------------*
           if        w-let-arc-zp3-sgr    =    zero
                     go to let-arc-zp3-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODSGR    "         to   f-key                  .
           move      w-let-arc-zp3-cla    to   rf-zp3-cod-cla         .
           move      w-let-arc-zp3-gru    to   rf-zp3-cod-gru         .
           move      w-let-arc-zp3-sgr    to   rf-zp3-cod-sgr         .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zp3-400.
       let-arc-zp3-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zp3-des-sgr       to   w-let-arc-zp3-des      .
           move      rf-zp3-mne-sgr       to   w-let-arc-zp3-mne      .
           move      rf-zp3-ult-sud       to   w-let-arc-zp3-sud      .
           move      rf-zp3-sqz-num       to   w-let-arc-zp3-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zp3-999.
       let-arc-zp3-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zp3-flg      .
           move      all   "."            to   w-let-arc-zp3-des      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-zp3-sgr    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-let-arc-zp3-mne      .
           go to     let-arc-zp3-600.
       let-arc-zp3-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp3-des      .
           move      spaces               to   w-let-arc-zp3-mne      .
       let-arc-zp3-600.
           move      zero                 to   w-let-arc-zp3-sud      .
           move      zero                 to   w-let-arc-zp3-sqz      .
       let-arc-zp3-999.
           exit.

      *    *===========================================================*
      *    * Determinazione scarichi di magazzino per mese             *
      *    *-----------------------------------------------------------*
       det-scm-mes-000.
      *              *-------------------------------------------------*
      *              * Data base in work di comodo                     *
      *              *-------------------------------------------------*
           move      w-det-scm-mes-dtb    to   w-det-scm-mes-wdt      .
      *              *-------------------------------------------------*
      *              * Determinazione anno di esercizio di partenza    *
      *              *-------------------------------------------------*
           move      w-det-scm-mes-wdt    to   s-dat                  .
           if        w-det-scm-mes-mce    =    12             or
                     s-mes                >    w-det-scm-mes-mce
                     move     s-saa       to   w-det-scm-mes-wes
           else      move     s-saa       to   w-det-scm-mes-wes
                     subtract 1           from w-det-scm-mes-wes      .
      *              *-------------------------------------------------*
      *              * Determinazione indice mese di esercizio di par- *
      *              * tenza                                           *
      *              *-------------------------------------------------*
           move      w-det-scm-mes-wdt    to   s-dat                  .
           move      s-mes                to   w-det-scm-mes-wme      .
           if        w-det-scm-mes-mce    =    12
                     go to det-scm-mes-100.
           if        w-det-scm-mes-wme    >    w-det-scm-mes-mce
                     subtract  w-det-scm-mes-mce
                                          from w-det-scm-mes-wme
                     go to det-scm-mes-100.
           if        w-det-scm-mes-wme    <    w-det-scm-mes-mce
                     add      12          to   w-det-scm-mes-wme
                     subtract w-det-scm-mes-mce
                                          from w-det-scm-mes-wme
                     go to det-scm-mes-100.
           move      12                   to   w-det-scm-mes-wme      .
       det-scm-mes-100.
      *              *-------------------------------------------------*
      *              * Lettura scheda saldi esercizio in corso         *
      *              *-------------------------------------------------*
           perform   det-scm-mes-950      thru det-scm-mes-959        .
      *              *-------------------------------------------------*
      *              * Normalizzazione progressivi carichi e scarichi  *
      *              * ultimi 12 mesi                                  *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-scm-mes-pcu      .
           move      zero                 to   w-det-scm-mes-psu      .
      *              *-------------------------------------------------*
      *              * Ciclo di scansione a ritroso                    *
      *              *-------------------------------------------------*
           move      15                   to   w-det-scm-mes-c01      .
       det-scm-mes-120.
      *                  *---------------------------------------------*
      *                  * Aggiornamento progressivi carichi e scari-  *
      *                  * chi ultimi 12 mesi                          *
      *                  *---------------------------------------------*
           if        w-det-scm-mes-c01    >    3
                     add  rf-mms-prg-car
                         (w-det-scm-mes-wme)
                                          to   w-det-scm-mes-pcu
                     add  rf-mms-prg-sca
                         (w-det-scm-mes-wme)
                                          to   w-det-scm-mes-psu      .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione elemento in tabella         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Anno                                    *
      *                      *-----------------------------------------*
           move      w-det-scm-mes-wda    to   w-det-scm-mes-tan
                                              (w-det-scm-mes-c01)     .
      *                      *-----------------------------------------*
      *                      * Mese                                    *
      *                      *-----------------------------------------*
           move      w-det-scm-mes-wdm    to   w-det-scm-mes-tme
                                              (w-det-scm-mes-c01)     .
      *                      *-----------------------------------------*
      *                      * Quantita'                               *
      *                      *-----------------------------------------*
           move      rf-mms-prg-sca
                    (w-det-scm-mes-wme)   to   w-det-scm-mes-tqu
                                              (w-det-scm-mes-c01)     .
      *                  *---------------------------------------------*
      *                  * Aggiornamento contatore elementi            *
      *                  *---------------------------------------------*
           subtract  1                    from w-det-scm-mes-c01      .
           if        w-det-scm-mes-c01    =    zero
                     go to det-scm-mes-900.
      *                  *---------------------------------------------*
      *                  * Aggiornamento data per anno/mese            *
      *                  *---------------------------------------------*
           subtract  1                    from w-det-scm-mes-wdm      .
           if        w-det-scm-mes-wdm    =    zero
                     move 12              to   w-det-scm-mes-wdm
                     subtract 1           from w-det-scm-mes-wda      .
      *                  *---------------------------------------------*
      *                  * Aggiornamento anno/mese di esercizio        *
      *                  *---------------------------------------------*
           subtract  1                    from w-det-scm-mes-wme      .
           if        w-det-scm-mes-wme    >    zero
                     go to det-scm-mes-130.
      *                      *-----------------------------------------*
      *                      * Passaggio all'esercizio precedente      *
      *                      *-----------------------------------------*
           move      12                   to   w-det-scm-mes-wme      .
           subtract  1                    from w-det-scm-mes-wes      .
      *                      *-----------------------------------------*
      *                      * Lettura scheda saldi esercizio prece-   *
      *                      * dente                                   *
      *                      *-----------------------------------------*
           perform   det-scm-mes-950      thru det-scm-mes-959        .
       det-scm-mes-130.
      *                  *---------------------------------------------*
      *                  * Riciclo su scansione                        *
      *                  *---------------------------------------------*
           go to     det-scm-mes-120.
       det-scm-mes-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-scm-mes-999.
       det-scm-mes-950.
      *              *=================================================*
      *              * Subroutine per lettura record [mms]             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [mms]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmms"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mms                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [mms]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "DPMGDS    "         to   f-key                  .
           move      w-det-scm-mes-wes    to   rf-mms-ann-ese         .
           move      w-det-scm-mes-dpz    to   rf-mms-cod-dpz         .
           move      w-det-scm-mes-tpm    to   rf-mms-tip-mag         .
           move      w-det-scm-mes-cnm    to   rf-mms-num-mag         .
           move      spaces               to   rf-mms-var-mag
           move      spaces               to   rf-mms-cod-dsl         .
           move      "pgm/mag/fls/ioc/obj/iofmms"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mms                 .
       det-scm-mes-959.
           exit.
       det-scm-mes-999.
           exit.

      *    *===========================================================*
      *    * Determinazione prezzo relativo alla riga ordine           *
      *    *                                                           *
      *    * SIRI                                                      *
      *    *-----------------------------------------------------------*
       det-prz-rig-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-prz-rig-prz      .
           move      zero                 to   w-det-prz-rig-dec      .
           move      spaces               to   w-det-prz-rig-sgl      .
      *              *-------------------------------------------------*
      *              * Test preliminari                                *
      *              *-------------------------------------------------*
           if        w-det-prz-rig-dat    =    zero or
                     w-det-prz-rig-num    =    zero or
                     w-det-prz-rig-prg    =    zero
                     go to det-prz-rig-900.
       det-prz-rig-200.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo archivio        *
      *              *-------------------------------------------------*
           if        d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    20 or
                     d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    50
                     perform  det-prz-rig-orc-000
                                          thru det-prz-rig-orc-999
           else if   d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    10 or
                     d-buf-fod-tip-rec
                    (d-buf-fod-ctr-001)   =    40
                     perform  det-prz-rig-orf-000
                                          thru det-prz-rig-orf-999
           else      go to det-prz-rig-900.
       det-prz-rig-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-prz-rig-999.
       det-prz-rig-999.
           exit.

      *    *===========================================================*
      *    * Determinazione prezzo relativo alla riga ordine           *
      *    *                                                           *
      *    * Subroutine ordini Clienti                                 *
      *    *-----------------------------------------------------------*
       det-prz-rig-orc-000.
       det-prz-rig-orc-100.
      *              *-------------------------------------------------*
      *              * Start su file [oct]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "IDEDOC    "         to   f-key                  .
           move      w-det-prz-rig-dat    to   rf-oct-dat-doc         .
           move      rr-dpz-inu           to   rf-oct-cod-dpz         .
           move      w-det-prz-rig-num    to   rf-oct-num-doc         .
           move      spaces               to   rf-oct-tmo-orc         .
           move      zero                 to   rf-oct-num-prt         .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : ad uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-prz-rig-orc-900.
       det-prz-rig-orc-200.
      *              *-------------------------------------------------*
      *              * Next su [oct]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : ad uscita                     *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-prz-rig-orc-900.
       det-prz-rig-orc-300.
      *              *-------------------------------------------------*
      *              * Max su [oct], se non superato : ad uscita       *
      *              *-------------------------------------------------*
           if        rf-oct-dat-doc       not  = w-det-prz-rig-dat or
                     rf-oct-cod-dpz       not  = rr-dpz-inu        or
                     rf-oct-num-doc       not  = w-det-prz-rig-num
                     go to det-prz-rig-orc-900.
       det-prz-rig-orc-400.
      *              *-------------------------------------------------*
      *              * Selezioni su [oct]                              *
      *              *-------------------------------------------------*
       det-prz-rig-orc-500.
      *              *-------------------------------------------------*
      *              * Start su righe                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      rf-oct-num-prt       to   rf-ocr-num-prt         .
           move      zero                 to   rf-ocr-num-prg         .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : ad uscita              *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-prz-rig-orc-900.
       det-prz-rig-orc-520.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [ocr]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *                  *---------------------------------------------*
      *                  * Se at end : ad uscita                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-prz-rig-orc-900.
       det-prz-rig-orc-530.
      *              *-------------------------------------------------*
      *              * Max su [ocr], se non superato : ad uscita       *
      *              *-------------------------------------------------*
           if        rf-ocr-num-prt       not  = rf-oct-num-prt
                     go to det-prz-rig-orc-900.
       det-prz-rig-orc-540.
      *              *-------------------------------------------------*
      *              * Selezioni su [ocr]                              *
      *              *-------------------------------------------------*
           if        rf-ocr-num-prg       not  = w-det-prz-rig-prg
                     go to det-prz-rig-orc-520.
       det-prz-rig-orc-560.
      *              *-------------------------------------------------*
      *              * Bufferizzazione prezzo e decimali               *
      *              * da cercare                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Prezzo netto                                *
      *                  *---------------------------------------------*
           move      rf-ocr-prz-net       to   w-det-prz-rig-prz      .
      *                  *---------------------------------------------*
      *                  * Decimali prezzo                             *
      *                  *---------------------------------------------*
           move      rf-ocr-dec-prz       to   w-det-prz-rig-dec      .
      *                  *---------------------------------------------*
      *                  * Sigla valuta                                *
      *                  *---------------------------------------------*
           move      rf-ocr-sgl-vpf       to   w-det-prz-rig-sgl      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-prz-rig-orc-900.
       det-prz-rig-orc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-prz-rig-orc-999.
       det-prz-rig-orc-999.
           exit.

      *    *===========================================================*
      *    * Determinazione prezzo relativo alla riga ordine           *
      *    *                                                           *
      *    * Subroutine ordini Fornitori                               *
      *    *-----------------------------------------------------------*
       det-prz-rig-orf-000.
       det-prz-rig-orf-100.
      *              *-------------------------------------------------*
      *              * Start su file [oft]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "IDEDOC    "         to   f-key                  .
           move      w-det-prz-rig-dat    to   rf-oft-dat-doc         .
           move      rr-dpz-inu           to   rf-oft-cod-dpz         .
           move      w-det-prz-rig-num    to   rf-oft-num-doc         .
           move      spaces               to   rf-oft-tmo-orf         .
           move      zero                 to   rf-oft-num-prt         .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : ad uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-prz-rig-orf-900.
       det-prz-rig-orf-200.
      *              *-------------------------------------------------*
      *              * Next su [oft]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : ad uscita                     *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-prz-rig-orf-900.
       det-prz-rig-orf-300.
      *              *-------------------------------------------------*
      *              * Max su [oft], se non superato : ad uscita       *
      *              *-------------------------------------------------*
           if        rf-oft-dat-doc       not  = w-det-prz-rig-dat or
                     rf-oft-cod-dpz       not  = rr-dpz-inu        or
                     rf-oft-num-doc       not  = w-det-prz-rig-num
                     go to det-prz-rig-orf-900.
       det-prz-rig-orf-400.
      *              *-------------------------------------------------*
      *              * Selezioni su [oft]                              *
      *              *-------------------------------------------------*
       det-prz-rig-orf-500.
      *              *-------------------------------------------------*
      *              * Start su righe                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      rf-oft-num-prt       to   rf-ofr-num-prt         .
           move      zero                 to   rf-ofr-num-prg         .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : ad uscita              *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-prz-rig-orf-900.
       det-prz-rig-orf-520.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [ofr]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Se at end : ad uscita                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-prz-rig-orf-900.
       det-prz-rig-orf-530.
      *              *-------------------------------------------------*
      *              * Max su [ofr], se non superato : ad uscita       *
      *              *-------------------------------------------------*
           if        rf-ofr-num-prt       not  = rf-oft-num-prt
                     go to det-prz-rig-orf-900.
       det-prz-rig-orf-540.
      *              *-------------------------------------------------*
      *              * Selezioni su [ofr]                              *
      *              *-------------------------------------------------*
           if        rf-ofr-num-prg       not  = w-det-prz-rig-prg
                     go to det-prz-rig-orf-520.
       det-prz-rig-orf-560.
      *              *-------------------------------------------------*
      *              * Bufferizzazione prezzo e decimali               *
      *              * da cercare                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Prezzo netto                                *
      *                  *---------------------------------------------*
           move      rf-ofr-prz-net       to   w-det-prz-rig-prz      .
      *                  *---------------------------------------------*
      *                  * Decimali prezzo                             *
      *                  *---------------------------------------------*
           move      rf-ofr-dec-prz       to   w-det-prz-rig-dec      .
      *                  *---------------------------------------------*
      *                  * Sigla valuta                                *
      *                  *---------------------------------------------*
           move      rf-ofr-sgl-vpf       to   w-det-prz-rig-sgl      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-prz-rig-orf-900.
       det-prz-rig-orf-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-prz-rig-orf-999.
       det-prz-rig-orf-999.
           exit.

      *    *===========================================================*
      *    * Put next generica per output in sequenziale               *
      *    *-----------------------------------------------------------*
       put-nxt-out-000.
      *              *-------------------------------------------------*
      *              * Scrittura su sequenziale                        *
      *              *-------------------------------------------------*
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       put-nxt-out-999.
           exit.

      *    *===========================================================*
      *    * Determinazione pathname completo per il file di appoggio  *
      *    * in output                                                 *
      *    *-----------------------------------------------------------*
       det-pth-fso-000.
      *              *-------------------------------------------------*
      *              * Preparazione nome file completo                 *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-pth-fso-pat      .
           move      spaces               to   w-det-pth-fso-pth      .
      *              *-------------------------------------------------*
      *              * Pathname da segreteria                          *
      *              *-------------------------------------------------*
           move      "UE"                 to   s-ope                  .
           move      "CSV "               to   s-nam                  .
           move      spaces               to   s-tip                  .
           call      "swd/mod/prg/obj/msegrt"
                                          using s                     .
      *              *-------------------------------------------------*
      *              * Pathname determinati                            *
      *              *-------------------------------------------------*
           move      s-pat                to   w-det-pth-fso-pth      .
           move      s-alf                to   w-det-pth-fso-pat      .
       det-pth-fso-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

