       Identification Division.
       Program-Id.                                 dgenstf0           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    nob                 *
      *                        Area gestionale:    bol                 *
      *                                Settore:                        *
      *                                   Fase:    genstf              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 08/03/11    *
      *                       Ultima revisione:    NdK del 15/06/18    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Trasmissione DDT a Corriere STEF            *
      *                                                                *
      *                    Formato TXT                                 *
      *                                                                *
      *                    Richiamato da 'pbol300s'                    *
      *                                                                *
      *                    Impiego modulo Perl Invio (t_nob_bol_stf)   *
      *                                                                *
      *                    ___ OBSOLETO (vedi 'paut3000')              *
      *                                                                *
      * ============================================================== *
      *                                                                *
      * Tipi operazione                                                *
      *                                                                *
      * -------------------------------------------------------------- *
      *                                                                *
      * "OP" - Open, inizio utilizzo                                   *
      *                                                                *
      *                                                                *
      *        Input  : d-gen-stf-tip-ope = "OP"                       *
      *                                                                *
      *                                                                *
      *        Output : nessuno                                        *
      *                                                                *
      * -------------------------------------------------------------- *
      *                                                                *
      * "CL" - Close, fine utilizzo                                    *
      *                                                                *
      *                                                                *
      *        Input  : d-gen-stf-tip-ope = "CL"                       *
      *                                                                *
      *                                                                *
      *        Output : nessuno                                        *
      *                                                                *
      * -------------------------------------------------------------- *
      *                                                                *
      * "C?" - Test se modulo cancellabile                             *
      *                                                                *
      *                                                                *
      *        Input  : d-gen-stf-tip-ope = "C?"                       *
      *                                                                *
      *                                                                *
      *        Output : d-gen-stf-exi-sts = spaces: Si                 *
      *                                     #     : No                 *
      *                                                                *
      * -------------------------------------------------------------- *
      *                                                                *
      * "GF" - Generazione file per Executive                          *
      *                                                                *
      *                                                                *
      *        Input  : d-gen-stf-tip-ope = "GF"                       *
      *                                                                *
      *                 d-gen-stf-prt-bit = protocollo bolla cliente   *
      *                                                                *
      *                                                                *
      *        Output : d-gen-stf-exi-sts = spaces: generazione ese-   *
      *                                             guita              *
      *                                     #     : errore             *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     d-K-b-Snc-PD .
       Object-Computer.     d-K-b-Snc-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/g"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mopsys" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [bit]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bol/fls/rec/rfbit"                          .
      *        *-------------------------------------------------------*
      *        * [bir]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bol/fls/rec/rfbir"                          .
      *        *-------------------------------------------------------*
      *        * [bix]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bol/fls/rec/rfbix"                          .
      *        *-------------------------------------------------------*
      *        * [vet]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bol/fls/rec/rfvet"                          .
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [age]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/age/fls/rec/rfage"                          .
      *        *-------------------------------------------------------*
      *        * [ada]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/azi/fls/rec/rfada"                          .
      *        *-------------------------------------------------------*
      *        * [gxc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/geo/fls/rec/rfgxc"                          .

      *    *===========================================================*
      *    * Work area per la definizione dei record per generazione   *
      *    * archivio sequenziale                                      *
      *    *                                                           *
      *    * NOBILI - STEF                                             *
      *    *-----------------------------------------------------------*
       01  w-out.
      *        *-------------------------------------------------------*
      *        * Record testata                                        *
      *        *-------------------------------------------------------*
           05  w-out-tes.
      *            *---------------------------------------------------*
      *            * Tipo record                                       *
      *            *---------------------------------------------------*
               10  w-out-tes-tip-rec      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero documento                                  *
      *            *---------------------------------------------------*
               10  w-out-tes-num-doc      pic  x(16)                  .
      *            *---------------------------------------------------*
      *            * Data documento - AAAAMMGG                         *
      *            *---------------------------------------------------*
               10  w-out-tes-dat-doc      pic  x(08)                  .
      *            *---------------------------------------------------*
      *            * Data affidamento merce - AAAAMMGG                 *
      *            *---------------------------------------------------*
               10  w-out-tes-dat-cns      pic  x(08)                  .
      *            *---------------------------------------------------*
      *            * Riferimenti ordine                                *
      *            *---------------------------------------------------*
               10  w-out-tes-num-ord      pic  x(16)                  .
      *            *---------------------------------------------------*
      *            * Mittente                                          *
      *            *---------------------------------------------------*
               10  filler                 pic  x(16)                  .
               10  w-out-tes-mit-rag      pic  x(36)                  .
               10  w-out-tes-mit-via      pic  x(36)                  .
               10  w-out-tes-mit-loc      pic  x(36)                  .
               10  w-out-tes-mit-cap      pic  x(09)                  .
               10  w-out-tes-mit-prv      pic  x(02)                  .
               10  w-out-tes-mit-naz      pic  x(02)                  .
      *            *---------------------------------------------------*
      *            * Luogo di carico                                   *
      *            *---------------------------------------------------*
               10  filler    occurs 137   pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Destinatario                                      *
      *            *---------------------------------------------------*
               10  filler                 pic  x(16)                  .
               10  w-out-tes-dst-rag      pic  x(36)                  .
               10  w-out-tes-dst-via      pic  x(36)                  .
               10  w-out-tes-dst-loc      pic  x(36)                  .
               10  w-out-tes-dst-cap      pic  x(09)                  .
               10  w-out-tes-dst-prv      pic  x(02)                  .
               10  w-out-tes-dst-naz      pic  x(02)                  .
      *            *---------------------------------------------------*
      *            * Luogo di consegna                                 *
      *            *---------------------------------------------------*
               10  filler                 pic  x(16)                  .
               10  w-out-tes-cns-rag      pic  x(36)                  .
               10  w-out-tes-cns-via      pic  x(36)                  .
               10  w-out-tes-cns-loc      pic  x(36)                  .
               10  w-out-tes-cns-cap      pic  x(09)                  .
               10  w-out-tes-cns-prv      pic  x(02)                  .
               10  w-out-tes-cns-naz      pic  x(02)                  .
      *            *---------------------------------------------------*
      *            * Numero colli                                      *
      *            *---------------------------------------------------*
               10  w-out-tes-num-col      pic  x(06)                  .
      *            *---------------------------------------------------*
      *            * Peso lordo                                        *
      *            *---------------------------------------------------*
               10  w-out-tes-pes-lrd      pic  x(06)                  .
      *            *---------------------------------------------------*
      *            * Numero pezzi                                      *
      *            *---------------------------------------------------*
               10  w-out-tes-num-pcs      pic  x(06)                  .
      *            *---------------------------------------------------*
      *            * Numero bancali                                    *
      *            *---------------------------------------------------*
               10  w-out-tes-num-bnc      pic  x(06)                  .
      *            *---------------------------------------------------*
      *            * Dati complementari                                *
      *            *---------------------------------------------------*
               10  filler                 pic  x(06)                  .
               10  filler                 pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Contrassegno                                      *
      *            *---------------------------------------------------*
               10  w-out-tes-imp-cts      pic  x(10)                  .
               10  w-out-tes-val-cts      pic  x(03)                  .
               10  w-out-tes-rmb-cts      pic  x(02)                  .
      *            *---------------------------------------------------*
      *            * Data consegna richiesta - AAAAMMGG                *
      *            *---------------------------------------------------*
               10  w-out-tes-cns-ric      pic  x(08)                  .
      *            *---------------------------------------------------*
      *            * Ora consegna richiesta - HHMM                     *
      *            *---------------------------------------------------*
               10  w-out-tes-hcn-ric      pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Commenti                                          *
      *            *---------------------------------------------------*
               10  w-out-tes-com-cns      pic  x(128)                 .
      *            *---------------------------------------------------*
      *            * Giro camion                                       *
      *            *---------------------------------------------------*
               10  filler                 pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Categoria temperatura (SU, FR, NR)                *
      *            *---------------------------------------------------*
               10  w-out-tes-cat-tmp      pic  x(02)                  .
      *            *---------------------------------------------------*
      *            * Altri dati                                        *
      *            *---------------------------------------------------*
               10  filler                 pic  x(04)                  .
               10  filler                 pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Porto (PP = Porto franco, PD = Assegnato)         *
      *            *---------------------------------------------------*
               10  w-out-tes-tip-por      pic  x(02)                  .
      *            *---------------------------------------------------*
      *            * Altri dati                                        *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .
               10  filler                 pic  x(01)                  .
               10  filler                 pic  x(01)                  .
               10  filler                 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Nome file PDF della bolla                         *
      *            *---------------------------------------------------*
               10  w-out-tes-nam-pdf      pic  x(17)                  .
      *            *---------------------------------------------------*
      *            * Altri dati (da 56 a 91)                           *
      *            *---------------------------------------------------*
               10  filler                 pic  x(12)                  .
               10  filler                 pic  x(04)                  .
               10  filler                 pic  x(16)                  .
               10  filler                 pic  x(12)                  .
               10  filler                 pic  x(04)                  .
               10  filler                 pic  x(04)                  .
               10  filler                 pic  x(16)                  .
               10  filler                 pic  x(03)                  .
               10  filler                 pic  x(06)                  .
               10  filler                 pic  x(06)                  .
               10  filler                 pic  x(06)                  .
               10  filler                 pic  x(06)                  .
               10  filler                 pic  x(06)                  .
               10  filler                 pic  x(36)                  .
               10  filler                 pic  x(36)                  .
               10  filler                 pic  x(36)                  .
               10  filler                 pic  x(09)                  .
               10  filler                 pic  x(02)                  .
               10  filler                 pic  x(02)                  .
               10  filler                 pic  x(20)                  .
               10  filler                 pic  x(15)                  .
               10  filler                 pic  x(08)                  .
               10  filler                 pic  x(35)                  .
               10  filler                 pic  x(08)                  .
               10  filler                 pic  x(35)                  .
               10  filler                 pic  x(35)                  .
               10  filler                 pic  x(36)                  .
               10  filler                 pic  x(36)                  .
               10  filler                 pic  x(36)                  .
               10  filler                 pic  x(09)                  .
               10  filler                 pic  x(02)                  .
               10  filler                 pic  x(02)                  .
               10  filler                 pic  x(04)                  .
               10  filler                 pic  x(04)                  .
               10  filler                 pic  x(128)                 .
               10  filler                 pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Carattere di fine record                          *
      *            *---------------------------------------------------*
               10  w-out-tes-chr-end      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Record dettaglio                                      *
      *        *-------------------------------------------------------*
           05  w-out-rig.
      *            *---------------------------------------------------*
      *            * Tipo record                                       *
      *            *---------------------------------------------------*
               10  w-out-rig-tip-rec      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero documento                                  *
      *            *---------------------------------------------------*
               10  w-out-rig-num-doc      pic  x(16)                  .
      *            *---------------------------------------------------*
      *            * Numero riga (facoltativo)                         *
      *            *---------------------------------------------------*
               10  w-out-rig-num-prg      pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Codice prodotto                                   *
      *            *---------------------------------------------------*
               10  w-out-rig-alf-pro      pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Descrizione prodotto                              *
      *            *---------------------------------------------------*
               10  w-out-rig-des-pro      pic  x(36)                  .
      *            *---------------------------------------------------*
      *            * Altri dati                                        *
      *            *---------------------------------------------------*
               10  filler                 pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Numero colli in riga                              *
      *            *---------------------------------------------------*
               10  w-out-rig-num-col      pic  x(06)                  .
      *            *---------------------------------------------------*
      *            * Altri dati                                        *
      *            *---------------------------------------------------*
               10  filler                 pic  x(08)                  .
               10  filler                 pic  x(06)                  .
               10  filler                 pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Lotto                                             *
      *            *---------------------------------------------------*
               10  w-out-rig-lot-num      pic  x(20)                  .
               10  w-out-rig-lot-dat      pic  x(08)                  .
      *            *---------------------------------------------------*
      *            * Altri dati (da 6 a 10)                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(240)                 .
               10  filler                 pic  x(14)                  .
               10  filler                 pic  x(15)                  .
               10  filler                 pic  x(13)                  .
               10  filler                 pic  x(04)                  .
               10  filler                 pic  x(10)                  .
               10  filler                 pic  x(08)                  .
      *            *---------------------------------------------------*
      *            * Carattere di fine record                          *
      *            *---------------------------------------------------*
               10  w-out-rig-chr-end      pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per parametri esclusi da link-area              *
      *    *-----------------------------------------------------------*
       01  w-nol.
      *        *-------------------------------------------------------*
      *        * Contatore di Open modulo                              *
      *        *-------------------------------------------------------*
           05  w-nol-ctr-opn              pic s9(05) value zero       .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det pathname file sequenziale in output      *
      *        *-------------------------------------------------------*
           05  w-det-pth-fso.
               10  w-det-pth-fso-pth      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione totale documento                   *
      *        *-------------------------------------------------------*
           05  w-det-tot-doc.
               10  w-det-tot-doc-ctr      pic  9(02)                  .
               10  w-det-tot-doc-tot      pic s9(11)                  .
               10  w-det-tot-doc-wpa      pic s9(11)                  .
               10  w-det-tot-doc-s11      pic s9(11)                  .
               10  w-det-tot-doc-wpr      pic s9(11)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [gxc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-gxc.
               10  w-let-arc-gxc-flg      pic  x(01)                  .
               10  w-let-arc-gxc-tip      pic  x(01)                  .
               10  w-let-arc-gxc-cmn      pic  9(05)                  .
               10  w-let-arc-gxc-fzn      pic  9(03)                  .
               10  w-let-arc-gxc-lct      pic  9(03)                  .
               10  w-let-arc-gxc-des      pic  x(30)                  .
               10  w-let-arc-gxc-prv      pic  x(02)                  .
               10  w-let-arc-gxc-cap      pic  x(05)                  .

      *    *===========================================================*
      *    * Work-area per numero documento                            *
      *    *-----------------------------------------------------------*
       01  w-num-doc.
      *        *-------------------------------------------------------*
      *        * Work per ridefinizione                                *
      *        *-------------------------------------------------------*
           05  w-num-doc-num              pic  9(11)                  .
           05  w-num-doc-num-r redefines
               w-num-doc-num.
               10  w-num-doc-saa          pic  9(03)                  .
               10  w-num-doc-doi          pic  9(02)                  .
               10  w-num-doc-prg          pic  9(06)                  .
           05  w-num-doc-pps              pic  9(09)                  .
           05  w-num-doc-pps-r redefines
               w-num-doc-pps.
               10  w-num-doc-pss          pic  9(03)                  .
               10  w-num-doc-psp          pic  9(06)                  .

      *    *===========================================================*
      *    * Work-area per dati di intestazione documento              *
      *    *-----------------------------------------------------------*
       01  w-int-doc.
           05  w-int-doc-rag              pic  x(40)                  .
           05  w-int-doc-via              pic  x(40)                  .
           05  w-int-doc-loc              pic  x(40)                  .
           05  w-int-doc-piv              pic  9(11)                  .
           05  w-int-doc-cfs              pic  x(16)                  .
           05  w-int-doc-cmn              pic  9(05)                  .
           05  w-int-doc-fzn              pic  9(03)                  .
           05  w-int-doc-lct              pic  9(03)                  .
           05  w-int-doc-naz              pic  x(03)                  .

      *    *===========================================================*
      *    * Work-area per dati di inoltro documento                   *
      *    *-----------------------------------------------------------*
       01  w-inl-dcm.
           05  w-inl-dcm-rs1              pic  x(40)                  .
           05  w-inl-dcm-rs2              pic  x(40)                  .
           05  w-inl-dcm-via              pic  x(40)                  .
           05  w-inl-dcm-loc              pic  x(40)                  .
           05  w-inl-dcm-cmn              pic  9(05)                  .
           05  w-inl-dcm-fzn              pic  9(03)                  .
           05  w-inl-dcm-lct              pic  9(03)                  .
           05  w-inl-dcm-naz              pic  x(03)                  .

      *    *===========================================================*
      *    * Work-area per estensioni al record di testata             *
      *    *-----------------------------------------------------------*
       01  w-ext.
           05  w-ext-rag-ids              pic  x(40)                  .
           05  w-ext-rs2-ids              pic  x(40)                  .
           05  w-ext-via-ids              pic  x(40)                  .
           05  w-ext-loc-ids              pic  x(40)                  .
           05  w-ext-rag-vet              pic  x(40)                  .
           05  w-ext-via-vet              pic  x(40)                  .
           05  w-ext-loc-vet              pic  x(40)                  .
           05  w-ext-des-ant.
               10  w-ext-rig-ant occurs 3 pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per trattamento date                            *
      *    *-----------------------------------------------------------*
       01  w-dat.
           05  w-dat-ext                  pic  9(07)                  .
           05  w-dat-ext-r                redefines
               w-dat-ext.
               10  w-dat-ext-sec          pic  9(01)                  .
               10  w-dat-ext-ann          pic  9(02)                  .
               10  w-dat-ext-mes          pic  9(02)                  .
               10  w-dat-ext-gio          pic  9(02)                  .
           05  w-dat-x06                  pic  x(06)                  .
           05  w-dat-x06-r                redefines
               w-dat-x06.
               10  w-dat-x06-ann          pic  9(02)                  .
               10  w-dat-x06-mes          pic  9(02)                  .
               10  w-dat-x06-gio          pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area generica                                        *
      *    *-----------------------------------------------------------*
       01  w-wrk.
           05  w-wrk-pnt                  pic  9(03)                  .
           05  w-wrk-pnt-prv              pic  9(03)                  .
           05  w-wrk-pnt-loc              pic  9(03)                  .
           05  w-wrk-loc                  pic  x(40)                  .
           05  w-wrk-loc-r                redefines
               w-wrk-loc.
               10  w-wrk-loc-chr occurs 40
                                          pic  x(01)                  .
           05  w-wrk-lun-loc              pic  9(03)                  .
           05  w-wrk-sgl-vrn              pic  x(14)                  .
           05  w-wrk-sgl-vrn-r redefines
               w-wrk-sgl-vrn.
               10  w-wrk-sgl-vrn-lot      pic  x(07)                  .
               10  w-wrk-sgl-vrn-dat      pic  9(07)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per generazione file STEF           *
      *    *-----------------------------------------------------------*
           copy      "nob/bol/prg/cpy/dgenstf0.dtl"                   .

      ******************************************************************
       Procedure Division                using d-gen-stf              .
      ******************************************************************

      *    *===========================================================*
      *    * Main program                                              *
      *    *-----------------------------------------------------------*
       main-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   d-gen-stf-exi-sts      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo operazione      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open                                        *
      *                  *---------------------------------------------*
           if        d-gen-stf-tip-ope    =    "OP"
                     perform opn-000      thru opn-999
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           else if   d-gen-stf-tip-ope    =    "CL"
                     perform cls-000      thru cls-999
      *                  *---------------------------------------------*
      *                  * Test cancellabilita' modulo                 *
      *                  *---------------------------------------------*
           else if   d-gen-stf-tip-ope    =    "C?"
                     perform tcm-000      thru tcm-999
      *                  *---------------------------------------------*
      *                  * Generazione file                            *
      *                  *---------------------------------------------*
           else if   d-gen-stf-tip-ope    =    "GF"
                     perform gfl-000      thru gfl-999                .
       main-999.
           exit program.

      *    *===========================================================*
      *    * Open                                                      *
      *    *-----------------------------------------------------------*
       opn-000.
      *              *-------------------------------------------------*
      *              * Incremento contatore Open modulo                *
      *              *-------------------------------------------------*
           add       1                    to   w-nol-ctr-opn          .
       opn-100.
      *              *-------------------------------------------------*
      *              * [bit]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
      *              *-------------------------------------------------*
      *              * [bir]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *              *-------------------------------------------------*
      *              * [bix]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbix"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bix                 .
      *              *-------------------------------------------------*
      *              * [vet]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofvet"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-vet                 .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [age]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *              *-------------------------------------------------*
      *              * [ada]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *              *-------------------------------------------------*
      *              * [gxc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
       opn-999.
           exit.

      *    *===========================================================*
      *    * Close                                                     *
      *    *-----------------------------------------------------------*
       cls-000.
      *              *-------------------------------------------------*
      *              * Decremento contatore Open modulo                *
      *              *-------------------------------------------------*
           subtract  1                    from w-nol-ctr-opn          .
      *              *-------------------------------------------------*
      *              * [bit]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
      *              *-------------------------------------------------*
      *              * [bir]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *              *-------------------------------------------------*
      *              * [bix]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbix"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bix                 .
      *              *-------------------------------------------------*
      *              * [vet]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofvet"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-vet                 .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [age]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *              *-------------------------------------------------*
      *              * [ada]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *              *-------------------------------------------------*
      *              * [gxc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
       cls-999.
           exit.

      *    *===========================================================*
      *    * Test cancellabilita' modulo                               *
      *    *-----------------------------------------------------------*
       tcm-000.
      *              *-------------------------------------------------*
      *              * Se il contatore di Open e' a zero il modulo e'  *
      *              * cancellabile, altrimenti non lo e'              *
      *              *-------------------------------------------------*
           if        w-nol-ctr-opn        =    zero
                     move  spaces         to   d-gen-stf-exi-sts
           else      move  "#"            to   d-gen-stf-exi-sts      .
       tcm-999.
           exit.

      *    *===========================================================*
      *    * Generazione file per STEF                                 *
      *    *-----------------------------------------------------------*
       gfl-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record [bit]                    *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
      *              *-------------------------------------------------*
      *              * Lettura record [bit]                            *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT     "        to   f-key                  .
           move      d-gen-stf-prt-bit    to   rf-bit-num-prt         .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
      *              *-------------------------------------------------*
      *              * Test se operazione da eseguire                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Solo se vettore STEF                        *
      *                  *---------------------------------------------*
           if        rf-bit-cod-vet        not  = 0000079
                     go to gfl-999.
       gfl-100.
      *              *-------------------------------------------------*
      *              * Open file sequenziale                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione pathname file sequenziale in *
      *                  * output                                      *
      *                  *---------------------------------------------*
           perform   det-pth-fso-000      thru det-pth-fso-999        .
      *                  *---------------------------------------------*
      *                  * Apertura del file in output                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      w-det-pth-fso-pth    to   g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Determinazione destinatario bolla           *
      *                  *---------------------------------------------*
           perform   det-dst-bol-000      thru det-dst-bol-999        .
       gfl-200.
      *              *-------------------------------------------------*
      *              * Emissione testata                               *
      *              *-------------------------------------------------*
           perform   gfl-tes-000          thru gfl-tes-999            .
       gfl-400.
      *              *-------------------------------------------------*
      *              * Emissione righe                                 *
      *              *-------------------------------------------------*
           perform   gfl-rig-000          thru gfl-rig-999            .
       gfl-800.
      *              *-------------------------------------------------*
      *              * Chiusura sequenziale                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura del file in output                 *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo utilizzato             *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mcvout"                         .
       gfl-850.
      *              *-------------------------------------------------*
      *              * Invio tramite FTP del file generato e della     *
      *              * relativa bolla in PDF                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione del comando di invio           *
      *                  *---------------------------------------------*
           move      spaces               to   o-shs                  .
           string    "t_nob_bol_stf "
                                delimited by   size
                     rf-bit-num-doc
                    (06 : 06)   delimited by   spaces
                                          into o-shs                  .
      *                  *---------------------------------------------*
      *                  * Chiamata al sistema effettiva               *
      *                  *---------------------------------------------*
           move      "CU"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
       gfl-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     gfl-999.
       gfl-999.
           exit.

      *    *===========================================================*
      *    * Generazione file per STEF                                 *
      *    *                                                           *
      *    * Subroutine per la testata                                 *
      *    *-----------------------------------------------------------*
       gfl-tes-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record di output                *
      *              *-------------------------------------------------*
           move      spaces               to   w-out-tes              .
       gfl-tes-100.
      *              *-------------------------------------------------*
      *              * Preparazione record di output                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo record                                 *
      *                  *---------------------------------------------*
           move      "T"                  to   w-out-tes-tip-rec      .
      *                  *---------------------------------------------*
      *                  * Numero documento                            *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      rf-bit-num-doc
                    (6 : 6)               to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-out-tes-num-doc      .
      *                  *---------------------------------------------*
      *                  * Data documento                              *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      rf-bit-dat-doc       to   v-num                  .
           add       19000000             to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-out-tes-dat-doc      .
      *                  *---------------------------------------------*
      *                  * Data consegna (inizio trasporto)            *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      rf-bit-dat-itr       to   v-num                  .
           add       19000000             to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-out-tes-dat-cns      .
      *                  *---------------------------------------------*
      *                  * Riferimenti ordine                          *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Mittente                                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [ada]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [ada]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODDPZ    "         to   f-key                  .
           move      zero                 to   rf-ada-cod-dpz         .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                      *-----------------------------------------*
      *                      * Ragione sociale                         *
      *                      *-----------------------------------------*
           move      rf-ada-rag-soc       to   w-out-tes-mit-rag      .
           move      rf-ada-via-azi       to   w-out-tes-mit-via      .
           move      rf-ada-loc-azi       to   w-out-tes-mit-loc      .
      *                      *-----------------------------------------*
      *                      * Elementi localita'                      *
      *                      *-----------------------------------------*
           move      "C"                  to   w-let-arc-gxc-tip      .
           move      rf-ada-cod-cmn       to   w-let-arc-gxc-cmn      .
           move      zero                 to   w-let-arc-gxc-fzn      .
           move      zero                 to   w-let-arc-gxc-lct      .
           perform   let-arc-gxc-000      thru let-arc-gxc-999        .
      *
           move      w-let-arc-gxc-cap    to   w-out-tes-mit-cap      .
           move      w-let-arc-gxc-prv    to   w-out-tes-mit-prv      .
           move      rf-ada-cod-naz       to   w-out-tes-mit-naz      .
       gfl-tes-300.
      *                  *---------------------------------------------*
      *                  * Destinatario                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ragione sociale                         *
      *                      *-----------------------------------------*
           move      w-int-doc-rag        to   w-out-tes-dst-rag      .
           move      w-int-doc-via        to   w-out-tes-dst-via      .
           move      w-int-doc-loc        to   w-out-tes-dst-loc      .
      *                      *-----------------------------------------*
      *                      * Elementi localita'                      *
      *                      *-----------------------------------------*
           move      "C"                  to   w-let-arc-gxc-tip      .
           move      w-int-doc-cmn        to   w-let-arc-gxc-cmn      .
           move      zero                 to   w-let-arc-gxc-fzn      .
           move      zero                 to   w-let-arc-gxc-lct      .
           perform   let-arc-gxc-000      thru let-arc-gxc-999        .
      *
           move      w-let-arc-gxc-cap    to   w-out-tes-dst-cap      .
           move      w-let-arc-gxc-prv    to   w-out-tes-dst-prv      .
           move      w-int-doc-naz        to   w-out-tes-dst-naz      .
       gfl-tes-400.
      *                  *---------------------------------------------*
      *                  * Luogo di consegna se diverso                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su indirizzo                       *
      *                      *-----------------------------------------*
           if        w-int-doc-via        =    w-inl-dcm-via
                     go to gfl-tes-500.
      *                      *-----------------------------------------*
      *                      * Ragione sociale                         *
      *                      *-----------------------------------------*
           move      w-inl-dcm-rs1        to   w-out-tes-dst-rag      .
           move      w-inl-dcm-via        to   w-out-tes-dst-via      .
           move      w-inl-dcm-loc        to   w-out-tes-dst-loc      .
      *                      *-----------------------------------------*
      *                      * Elementi localita'                      *
      *                      *-----------------------------------------*
           move      "C"                  to   w-let-arc-gxc-tip      .
           move      w-inl-dcm-cmn        to   w-let-arc-gxc-cmn      .
           move      zero                 to   w-let-arc-gxc-fzn      .
           move      zero                 to   w-let-arc-gxc-lct      .
           perform   let-arc-gxc-000      thru let-arc-gxc-999        .
      *
           move      w-let-arc-gxc-cap    to   w-out-tes-dst-cap      .
           move      w-let-arc-gxc-prv    to   w-out-tes-dst-prv      .
           move      w-inl-dcm-naz        to   w-out-tes-dst-naz      .
       gfl-tes-500.
      *                  *---------------------------------------------*
      *                  * Numero colli                                *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      rf-bit-num-col       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-out-tes-num-col      .
      *                  *---------------------------------------------*
      *                  * Peso lordo                                  *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      rf-bit-pes-tot       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-out-tes-pes-lrd      .
      *                  *---------------------------------------------*
      *                  * Numero pezzi                                *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero bancali                              *
      *                  *---------------------------------------------*
           move      rf-bit-voc-des (1)   to   w-out-tes-num-bnc      . 
      *                  *---------------------------------------------*
      *                  * Contrassegno                                *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Data consegna richiesta - AAAAMMGG          *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      rf-bit-dat-itr       to   v-num                  .
           add       19000000             to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-out-tes-cns-ric      .
      *                  *---------------------------------------------*
      *                  * Ora consegna richiesta - HHMM               *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      rf-bit-ora-itr       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-out-tes-hcn-ric      .
      *                  *---------------------------------------------*
      *                  * Commenti                                    *
      *                  * ___           
      *                  * rf-bit-cod-ant e lettura 'zba'
      *                  * ___           
      *                  *---------------------------------------------*
           move      spaces               to   w-out-tes-com-cns      .
      *                  *---------------------------------------------*
      *                  * Categoria temperatura (SU, FR, NR)          *
      *                  *---------------------------------------------*
           move      "FR"                 to   w-out-tes-cat-tmp      .
      *                  *---------------------------------------------*
      *                  * Porto (PP = Porto franco, PD = Assegnato)   *
      *                  *                                             *
      *                  * Non indicato (Massimiliano 14/06/18)        *
      *                  *                                             *
      *                  * Forzato (Lucia - STEF - 18/06/18)           *
      *                  *---------------------------------------------*
           move      "PP"                 to   w-out-tes-tip-por      .
      *                  *---------------------------------------------*
      *                  * Nome file PDF della bolla                   *
      *                  *---------------------------------------------*
           move      rf-bit-num-doc
                    (06 : 06)             to   w-out-tes-nam-pdf      .
       gfl-tes-800.
      *              *-------------------------------------------------*
      *              * Composizione carattere di fine record           *
      *              *-------------------------------------------------*
           move      H"0D"                to   w-out-tes-chr-end      .
      *              *-------------------------------------------------*
      *              * Scrittura record di output                      *
      *              *-------------------------------------------------*
           move      w-out-tes            to   g-rec                  .
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       gfl-tes-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     gfl-tes-999.
       gfl-tes-999.
           exit.

      *    *===========================================================*
      *    * Generazione file per STEF                                 *
      *    *                                                           *
      *    * Subroutine per le righe                                   *
      *    *-----------------------------------------------------------*
       gfl-rig-000.
       
       


       gfl-rig-100.
      *              *-------------------------------------------------*
      *              * Start su righe documento [bir]                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      d-gen-stf-prt-bit    to   rf-bir-num-prt         .
           move      zero                 to   rf-bir-num-prg         .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata                             *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gfl-rig-900.
       gfl-rig-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [bir]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *                  *---------------------------------------------*
      *                  * Test se 'at end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gfl-rig-900.
       gfl-rig-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-bir-num-prt       not  = d-gen-stf-prt-bit
                     go to gfl-rig-900.
       gfl-rig-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
       gfl-rig-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione record di output                *
      *              *-------------------------------------------------*
           move      spaces               to   w-out-rig              .
       gfl-rig-600.
      *              *-------------------------------------------------*
      *              * Preparazione record di output                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo record                                 *
      *                  *---------------------------------------------*
           move      "R"                  to   w-out-rig-tip-rec      .
      *                  *---------------------------------------------*
      *                  * Numero documento                            *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      rf-bir-num-doc
                    (6 : 6)               to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-out-rig-num-doc      .
      *                  *---------------------------------------------*
      *                  * Numero riga                                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-out-rig-num-prg      .
      *                  *---------------------------------------------*
      *                  * Codice prodotto                             *
      *                  *---------------------------------------------*
           move      rf-bir-alf-pro       to   w-out-rig-alf-pro      .
      *                  *---------------------------------------------*
      *                  * Descrizione prodotto                        *
      *                  *---------------------------------------------*
           move      rf-bir-des-rig       to   w-out-rig-des-pro      .
      *                  *---------------------------------------------*
      *                  * Numero colli in riga                        *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      rf-bir-qta-a03       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-out-rig-num-col      .
      *                  *---------------------------------------------*
      *                  * Numero lotto                                *
      *                  *---------------------------------------------*
           move      rf-bir-sgl-vrn       to   w-wrk-sgl-vrn          .
           move      w-wrk-sgl-vrn-lot    to   w-out-rig-lot-num      .
      *                  *---------------------------------------------*
      *                  * Data lotto                                  *
      *                  *---------------------------------------------*
           if        w-wrk-sgl-vrn-dat    not  numeric
                     move  zero           to   w-wrk-sgl-vrn-dat      .
      *
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-wrk-sgl-vrn-dat    to   v-num                  .
           add       19000000             to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-out-rig-lot-dat      .
      *                  *---------------------------------------------*
      *                  * Composizione carattere di fine record       *
      *                  *---------------------------------------------*
           move      H"0D"                to   w-out-rig-chr-end      .
      *                  *---------------------------------------------*
      *                  * Scrittura record di output                  *
      *                  *---------------------------------------------*
           move      w-out-rig            to   g-rec                  .
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       gfl-rig-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     gfl-rig-200.
       gfl-rig-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     gfl-rig-999.
       gfl-rig-999.
           exit.

      *    *===========================================================*
      *    * Determinazione pathname completo per il file di appoggio  *
      *    * in output                                                 *
      *    *-----------------------------------------------------------*
       det-pth-fso-000.
      *              *-------------------------------------------------*
      *              * Preparazione nome file completo                 *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-pth-fso-pth      .
      *              *-------------------------------------------------*
      *              * Pathname di base da segreteria                  *
      *              *-------------------------------------------------*
           move      "PB"                 to   s-ope                  .
           move      "asc "               to   s-nam                  .
           call      "swd/mod/prg/obj/msegrt"
                                          using s                     .
      *              *-------------------------------------------------*
      *              * String                                          *
      *              *-------------------------------------------------*
           string    s-pat      delimited by   spaces
                     "/pdf/"
                                delimited by   size
                     rf-bit-num-doc
                    (06 : 06)   delimited by   spaces
                     ".txt"     delimited by   size
                                          into w-det-pth-fso-pth      .
       det-pth-fso-999.
           exit.

      *    *===========================================================*
      *    * Determinazione destinatario bolla                         *
      *    *-----------------------------------------------------------*
       det-dst-bol-000.
      *              *-------------------------------------------------*
      *              * Tentativo di lettura record [bix] di appoggio   *
      *              * ai valori di testata                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [bix]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbix"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bix                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [bix]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      rf-bit-num-prt       to   rf-bix-num-prt         .
           move      zero                 to   rf-bix-num-prg         .
           move      01                   to   rf-bix-tip-rec         .
           move      "pgm/bol/fls/ioc/obj/iofbix"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bix                 .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valori di estensione al re- *
      *                  * cord di testata                             *
      *                  *---------------------------------------------*
           move      rf-bix-rag-ids       to   w-ext-rag-ids          .
           move      rf-bix-rs2-ids       to   w-ext-rs2-ids          .
           move      rf-bix-via-ids       to   w-ext-via-ids          .
           move      rf-bix-loc-ids       to   w-ext-loc-ids          .
           move      rf-bix-rag-vet       to   w-ext-rag-vet          .
           move      rf-bix-via-vet       to   w-ext-via-vet          .
           move      rf-bix-loc-vet       to   w-ext-loc-vet          .
           move      rf-bix-des-ant       to   w-ext-des-ant          .
       det-dst-bol-150.
      *              *-------------------------------------------------*
      *              * Lettura dati anagrafici archivio                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo archivio    *
      *                  *---------------------------------------------*
           if        rf-bit-tip-arc       =    "C"
                     go to det-dst-bol-160
           else if   rf-bit-tip-arc       =    "F"
                     go to det-dst-bol-170
           else if   rf-bit-tip-arc       =    "D"
                     go to det-dst-bol-180
           else if   rf-bit-tip-arc       =    "A"
                     go to det-dst-bol-185
           else      go to det-dst-bol-190.
       det-dst-bol-160.
      *                  *---------------------------------------------*
      *                  * Tipo archivio : Clienti                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [cli]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [cli]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-bit-cod-arc       to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori                   *
      *                      *-----------------------------------------*
           move      rf-cli-rag-soc       to   w-int-doc-rag          .
           move      rf-cli-via-cli       to   w-int-doc-via          .
           move      rf-cli-loc-cli       to   w-int-doc-loc          .
           move      rf-cli-prt-iva       to   w-int-doc-piv          .
           move      rf-cli-cod-fis       to   w-int-doc-cfs          .
           move      rf-cli-cod-cmn       to   w-int-doc-cmn          .
           move      rf-cli-cod-fzn       to   w-int-doc-fzn          .
           move      rf-cli-cod-lct       to   w-int-doc-lct          .
           move      rf-cli-cod-naz       to   w-int-doc-naz          .
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [dcc]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [dcc]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-bit-cod-arc       to   rf-dcc-cod-cli         .
           move      spaces               to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
       det-dst-bol-168.
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     det-dst-bol-200.
       det-dst-bol-170.
      *                  *---------------------------------------------*
      *                  * Tipo archivio : Fornitori                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [fnt]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [fnt]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      rf-bit-cod-arc       to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori                   *
      *                      *-----------------------------------------*
           move      rf-fnt-rag-soc       to   w-int-doc-rag          .
           move      rf-fnt-via-fnt       to   w-int-doc-via          .
           move      rf-fnt-loc-fnt       to   w-int-doc-loc          .
           move      rf-fnt-prt-iva       to   w-int-doc-piv          .
           move      rf-fnt-cod-fis       to   w-int-doc-cfs          .
           move      rf-fnt-cod-cmn       to   w-int-doc-cmn          .
           move      rf-fnt-cod-fzn       to   w-int-doc-fzn          .
           move      rf-fnt-cod-lct       to   w-int-doc-lct          .
           move      rf-fnt-cod-naz       to   w-int-doc-naz          .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     det-dst-bol-200.
       det-dst-bol-180.
      *                  *---------------------------------------------*
      *                  * Tipo archivio : Dipendenza                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [ada]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [ada]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODDPZ    "         to   f-key                  .
           move      rf-bit-cod-arc       to   rf-ada-cod-dpz         .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori                   *
      *                      *-----------------------------------------*
           move      rf-ada-rag-soc       to   w-int-doc-rag          .
           move      rf-ada-via-azi       to   w-int-doc-via          .
           move      rf-ada-loc-azi       to   w-int-doc-loc          .
           move      zero                 to   w-int-doc-piv          .
           move      spaces               to   w-int-doc-cfs          .
           move      rf-ada-cod-cmn       to   w-int-doc-cmn          .
           move      rf-ada-cod-fzn       to   w-int-doc-fzn          .
           move      rf-ada-cod-lct       to   w-int-doc-lct          .
           move      rf-ada-cod-naz       to   w-int-doc-naz          .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     det-dst-bol-200.
       det-dst-bol-185.
      *                  *---------------------------------------------*
      *                  * Tipo archivio : Agenti                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [age]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [fnt]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODAGE    "         to   f-key                  .
           move      rf-bit-cod-arc       to   rf-age-cod-age         .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori                   *
      *                      *-----------------------------------------*
           move      rf-age-rag-soc       to   w-int-doc-rag          .
           move      rf-age-via-age       to   w-int-doc-via          .
           move      rf-age-loc-age       to   w-int-doc-loc          .
           move      rf-age-prt-iva       to   w-int-doc-piv          .
           move      rf-age-cod-fis       to   w-int-doc-cfs          .
           move      rf-age-cod-cmn       to   w-int-doc-cmn          .
           move      rf-age-cod-fzn       to   w-int-doc-fzn          .
           move      rf-age-cod-lct       to   w-int-doc-lct          .
           move      rf-age-cod-naz       to   w-int-doc-naz          .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     det-dst-bol-200.
       det-dst-bol-190.
      *                  *---------------------------------------------*
      *                  * Tipo archivio : Nessuno                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione valori                  *
      *                      *-----------------------------------------*
           move      spaces               to   w-int-doc-rag          .
           move      spaces               to   w-int-doc-via          .
           move      spaces               to   w-int-doc-loc          .
           move      zero                 to   w-int-doc-piv          .
           move      spaces               to   w-int-doc-cfs          .
           move      zero                 to   w-int-doc-cmn          .
           move      zero                 to   w-int-doc-fzn          .
           move      zero                 to   w-int-doc-lct          .
           move      spaces               to   w-int-doc-naz          .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     det-dst-bol-200.
       det-dst-bol-200.
       det-dst-bol-400.
      *              *-------------------------------------------------*
      *              * Indirizzo di spedizione                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo di indiriz- *
      *                  * zo di spedizione :                          *
      *                  *                                             *
      *                  * - 01 : alla sede legale                     *
      *                  * - 02 : manuale                              *
      *                  * - 03 : alla sede                            *
      *                  * - 04 : alla dipendenza                      *
      *                  *---------------------------------------------*
           go to     det-dst-bol-410
                     det-dst-bol-420
                     det-dst-bol-430
                     det-dst-bol-440
                                depending on   rf-bit-tip-ids         .
       det-dst-bol-410.
      *                  *---------------------------------------------*
      *                  * Indirizzo di spedizione : alla sede legale  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Memorizzazione dati da intestazione do- *
      *                      * cumento                                 *
      *                      *-----------------------------------------*
           move      w-int-doc-rag        to   w-inl-dcm-rs1          .
           move      spaces               to   w-inl-dcm-rs2          .
           move      w-int-doc-via        to   w-inl-dcm-via          .
           move      w-int-doc-loc        to   w-inl-dcm-loc          .
           move      w-int-doc-cmn        to   w-inl-dcm-cmn          .
           move      w-int-doc-fzn        to   w-inl-dcm-fzn          .
           move      w-int-doc-lct        to   w-inl-dcm-lct          .
           move      w-int-doc-naz        to   w-inl-dcm-naz          .
      *                      *-----------------------------------------*
      *                      * A uscita                                *
      *                      *-----------------------------------------*
           go to     det-dst-bol-500.
       det-dst-bol-420.
      *                  *---------------------------------------------*
      *                  * Indirizzo di spedizione : manuale           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Memorizzazione dati da record [bix]     *
      *                      *-----------------------------------------*
           move      w-ext-rag-ids        to   w-inl-dcm-rs1          .
           move      w-ext-rs2-ids        to   w-inl-dcm-rs2          .
           move      w-ext-via-ids        to   w-inl-dcm-via          .
           move      w-ext-loc-ids        to   w-inl-dcm-loc          .
           move      zero                 to   w-inl-dcm-cmn          .
           move      zero                 to   w-inl-dcm-fzn          .
           move      zero                 to   w-inl-dcm-lct          .
           move      spaces               to   w-inl-dcm-naz          .
      *                      *-----------------------------------------*
      *                      * A uscita                                *
      *                      *-----------------------------------------*
           go to     det-dst-bol-500.
       det-dst-bol-430.
      *                  *---------------------------------------------*
      *                  * Indirizzo di spedizione : alla sede         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione del tipo archi-  *
      *                      * vio                                     *
      *                      *-----------------------------------------*
           if        rf-bit-tip-arc       =    "C"
                     go to det-dst-bol-432
           else if   rf-bit-tip-arc       =    "F"
                     go to det-dst-bol-434
           else      go to det-dst-bol-500.
       det-dst-bol-432.
      *                      *-----------------------------------------*
      *                      * Tipo archivio : Clienti                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione record [dcc]        *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                          *-------------------------------------*
      *                          * Lettura record [dcc]                *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-bit-cod-arc       to   rf-dcc-cod-cli         .
           move      spaces               to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                          *-------------------------------------*
      *                          * Bufferizzazione valori              *
      *                          *-------------------------------------*
           move      rf-dcc-rs1-doc       to   w-inl-dcm-rs1          .
           move      rf-dcc-rs2-doc       to   w-inl-dcm-rs2          .
           move      rf-dcc-via-dcc       to   w-inl-dcm-via          .
           move      rf-dcc-loc-dcc       to   w-inl-dcm-loc          .
           move      rf-dcc-cod-cmn       to   w-inl-dcm-cmn          .
           move      rf-dcc-cod-fzn       to   w-inl-dcm-fzn          .
           move      rf-dcc-cod-lct       to   w-inl-dcm-lct          .
           move      rf-dcc-cod-naz       to   w-inl-dcm-naz          .
      *                          *-------------------------------------*
      *                          * A uscita                            *
      *                          *-------------------------------------*
           go to     det-dst-bol-500.
       det-dst-bol-434.
      *                      *-----------------------------------------*
      *                      * Tipo archivio : Fornitori               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione record [dcf]        *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                          *-------------------------------------*
      *                          * Lettura record [dcf]                *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      rf-bit-cod-arc       to   rf-dcf-cod-fnt         .
           move      spaces               to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                          *-------------------------------------*
      *                          * Bufferizzazione valori              *
      *                          *-------------------------------------*
           move      rf-dcf-rs1-doc       to   w-inl-dcm-rs1          .
           move      rf-dcf-rs2-doc       to   w-inl-dcm-rs2          .
           move      rf-dcf-via-dcf       to   w-inl-dcm-via          .
           move      rf-dcf-loc-dcf       to   w-inl-dcm-loc          .
           move      rf-dcf-cod-cmn       to   w-inl-dcm-cmn          .
           move      rf-dcf-cod-fzn       to   w-inl-dcm-fzn          .
           move      rf-dcf-cod-lct       to   w-inl-dcm-lct          .
           move      rf-dcf-cod-naz       to   w-inl-dcm-naz          .
      *                          *-------------------------------------*
      *                          * A uscita                            *
      *                          *-------------------------------------*
           go to     det-dst-bol-500.
       det-dst-bol-440.
      *                  *---------------------------------------------*
      *                  * Indirizzo di spedizione : alla dipendenza   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione del tipo archi-  *
      *                      * vio                                     *
      *                      *-----------------------------------------*
           if        rf-bit-tip-arc       =    "C"
                     go to det-dst-bol-442
           else if   rf-bit-tip-arc       =    "F"
                     go to det-dst-bol-444
           else      go to det-dst-bol-500.
       det-dst-bol-442.
      *                      *-----------------------------------------*
      *                      * Tipo archivio : Clienti                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione record [dcc]        *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                          *-------------------------------------*
      *                          * Lettura record [dcc]                *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-bit-cod-arc       to   rf-dcc-cod-cli         .
           move      rf-bit-dpz-arc       to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                          *-------------------------------------*
      *                          * Bufferizzazione valori              *
      *                          *-------------------------------------*
           move      rf-dcc-rs1-doc       to   w-inl-dcm-rs1          .
           move      rf-dcc-rs2-doc       to   w-inl-dcm-rs2          .
           move      rf-dcc-via-dcc       to   w-inl-dcm-via          .
           move      rf-dcc-loc-dcc       to   w-inl-dcm-loc          .
           move      rf-dcc-cod-cmn       to   w-inl-dcm-cmn          .
           move      rf-dcc-cod-fzn       to   w-inl-dcm-fzn          .
           move      rf-dcc-cod-lct       to   w-inl-dcm-lct          .
           move      rf-dcc-cod-naz       to   w-inl-dcm-naz          .
      *                          *-------------------------------------*
      *                          * A uscita                            *
      *                          *-------------------------------------*
           go to     det-dst-bol-500.
       det-dst-bol-444.
      *                      *-----------------------------------------*
      *                      * Tipo archivio : Fornitori               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione record [dcf]        *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                          *-------------------------------------*
      *                          * Lettura record [dcf]                *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      rf-bit-cod-arc       to   rf-dcf-cod-fnt         .
           move      rf-bit-dpz-arc       to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                          *-------------------------------------*
      *                          * Bufferizzazione valori              *
      *                          *-------------------------------------*
           move      rf-dcf-rs1-doc       to   w-inl-dcm-rs1          .
           move      rf-dcf-rs2-doc       to   w-inl-dcm-rs2          .
           move      rf-dcf-via-dcf       to   w-inl-dcm-via          .
           move      rf-dcf-loc-dcf       to   w-inl-dcm-loc          .
           move      rf-dcf-cod-cmn       to   w-inl-dcm-cmn          .
           move      rf-dcf-cod-fzn       to   w-inl-dcm-fzn          .
           move      rf-dcf-cod-lct       to   w-inl-dcm-lct          .
           move      rf-dcf-cod-naz       to   w-inl-dcm-naz          .
      *                          *-------------------------------------*
      *                          * A uscita                            *
      *                          *-------------------------------------*
           go to     det-dst-bol-500.
       det-dst-bol-500.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-dst-bol-999.
       det-dst-bol-999.
           exit.

      *    *===========================================================*
      *    * Determinazione totale documento                           *
      *    *-----------------------------------------------------------*
       det-tot-doc-000.
      *              *-------------------------------------------------*
      *              * Azzeramento totalizzatore                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-tot-doc-tot      .
      *              *-------------------------------------------------*
      *              * Ciclo di scansione castelletto iva              *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-tot-doc-ctr      .
       det-tot-doc-100.
           add       1                    to   w-det-tot-doc-ctr      .
           if        w-det-tot-doc-ctr    >    6
                     go to det-tot-doc-800.
           if        rf-bit-iva-cod
                    (w-det-tot-doc-ctr)   =    zero
                     go to det-tot-doc-100.
      *                  *---------------------------------------------*
      *                  * Imponibile                                  *
      *                  *---------------------------------------------*
           add       rf-bit-iva-ibl
                    (w-det-tot-doc-ctr)   to   w-det-tot-doc-tot      .
      *                  *---------------------------------------------*
      *                  * Imposta                                     *
      *                  *---------------------------------------------*
           if        rf-bit-iva-cod
                    (w-det-tot-doc-ctr)   >    900
                     move  rf-bit-iva-imp
                          (w-det-tot-doc-ctr)
                                          to   w-det-tot-doc-wpa
                     go to det-tot-doc-600.
           if        rf-bit-iva-cod
                    (w-det-tot-doc-ctr)   >    100 
                     go to det-tot-doc-700.
           multiply  rf-bit-iva-cod
                    (w-det-tot-doc-ctr)   by   rf-bit-iva-ibl
                                              (w-det-tot-doc-ctr)
                                        giving w-det-tot-doc-wpa      .
           divide    100                  into w-det-tot-doc-wpa
                                        giving w-det-tot-doc-s11
                                     remainder w-det-tot-doc-wpr      .
           move      w-det-tot-doc-s11    to   w-det-tot-doc-wpa      .
           if        w-det-tot-doc-wpr    >    zero
                     add      1           to   w-det-tot-doc-wpa
           else if   w-det-tot-doc-wpr    <    zero
                     subtract 1           from w-det-tot-doc-wpa      .
       det-tot-doc-600.
           add       w-det-tot-doc-wpa    to   w-det-tot-doc-tot      .
       det-tot-doc-700.
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     det-tot-doc-100.
       det-tot-doc-800.
       det-tot-doc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-tot-doc-999.
       det-tot-doc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [gxc]                         *
      *    *-----------------------------------------------------------*
       let-arc-gxc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-gxc-flg      .
      *              *-------------------------------------------------*
      *              * Deviazione secondo il tipo elemento             *
      *              *-------------------------------------------------*
           if        w-let-arc-gxc-tip    =    "C"
                     go to let-arc-gxc-100
           else if   w-let-arc-gxc-tip    =    "F"
                     go to let-arc-gxc-200
           else if   w-let-arc-gxc-tip    =    "L"
                     go to let-arc-gxc-300.
       let-arc-gxc-100.
      *              *-------------------------------------------------*
      *              * Se tipo elemento : Comune                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se codice a zero                       *
      *                  *---------------------------------------------*
           if        w-let-arc-gxc-cmn    =    zero
                     go to let-arc-gxc-400.
      *                  *---------------------------------------------*
      *                  * Lettura Comune                              *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      w-let-arc-gxc-cmn    to   rf-gxc-cod-cmn         .
           move      zero                 to   rf-gxc-cod-fzn         .
           move      zero                 to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se record esistente    *
      *                  * oppure no                                   *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to let-arc-gxc-600
           else      go to let-arc-gxc-500.
       let-arc-gxc-200.
      *              *-------------------------------------------------*
      *              * Se tipo elemento : Frazione                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se codice a zero                       *
      *                  *---------------------------------------------*
           if        w-let-arc-gxc-cmn    =    zero or
                     w-let-arc-gxc-fzn    =    zero
                     go to let-arc-gxc-400.
      *                  *---------------------------------------------*
      *                  * Lettura Frazione                            *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      w-let-arc-gxc-cmn    to   rf-gxc-cod-cmn         .
           move      w-let-arc-gxc-fzn    to   rf-gxc-cod-fzn         .
           move      zero                 to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se record esistente    *
      *                  * oppure no                                   *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to let-arc-gxc-600
           else      go to let-arc-gxc-500.
       let-arc-gxc-300.
      *              *-------------------------------------------------*
      *              * Se tipo elemento : Localita'                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se codice a zero                       *
      *                  *---------------------------------------------*
           if        w-let-arc-gxc-cmn    =    zero or
                     w-let-arc-gxc-lct    =    zero
                     go to let-arc-gxc-400.
      *                  *---------------------------------------------*
      *                  * Lettura Localita'                           *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      w-let-arc-gxc-cmn    to   rf-gxc-cod-cmn         .
           move      w-let-arc-gxc-fzn    to   rf-gxc-cod-fzn         .
           move      w-let-arc-gxc-lct    to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se record esistente    *
      *                  * oppure no                                   *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to let-arc-gxc-600
           else      go to let-arc-gxc-500.
       let-arc-gxc-400.
      *              *-------------------------------------------------*
      *              * Se codice elemento a zero                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione work area                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-gxc-des      .
           move      spaces               to   w-let-arc-gxc-prv      .
           move      spaces               to   w-let-arc-gxc-cap      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-gxc-999.
       let-arc-gxc-500.
      *              *-------------------------------------------------*
      *              * Se codice elemento non esistente                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione work area                   *
      *                  *---------------------------------------------*
           move      all   "."            to   w-let-arc-gxc-des      .
           move      spaces               to   w-let-arc-gxc-prv      .
           move      spaces               to   w-let-arc-gxc-cap      .
      *                  *---------------------------------------------*
      *                  * Flag di uscita a non trovato                *
      *                  *---------------------------------------------*
           move      "#"                  to   w-let-arc-gxc-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-gxc-999.
       let-arc-gxc-600.
      *              *-------------------------------------------------*
      *              * Se codice elemento esistente                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione in work area                *
      *                  *---------------------------------------------*
           move      rf-gxc-des-cfl       to   w-let-arc-gxc-des      .
           move      rf-gxc-cod-prv       to   w-let-arc-gxc-prv      .
           move      rf-gxc-cap-avp       to   w-let-arc-gxc-cap      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-gxc-999.
       let-arc-gxc-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .


