       Identification Division.
       Program-Id.                                 pmag7000           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    mag                 *
      *                                Settore:    lif                 *
      *                                   Fase:    mag700              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 23/08/94    *
      *                       Ultima revisione:    NdK del 14/11/22    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Gestione schede L.I.F.O.                    *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "mag"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "lif"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "mag700"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pmag7000"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "        GESTIONE SCHEDE L.I.F.O.        "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-let-reg-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-let-reg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-ins-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-ins      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-mod-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-mod      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-vis-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-vis      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-snx-del      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-snx-del      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-tus.
      *            *---------------------------------------------------*
      *            * Da accettazione campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-nok      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione testata                           *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-tes      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-key-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per controllo se chiave vuota                     *
      *            *---------------------------------------------------*
               10  w-cnt-key-vuo-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-nok-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su modalita' di funzionamento      *
      *        *-------------------------------------------------------*
           05  w-cnt-mfu.
      *            *---------------------------------------------------*
      *            * Tipo impostazione                                 *
      *            * - K : Impostazione campi chiave                   *
      *            * - T : Impostazione campi testata                  *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-imp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo funzione                                     *
      *            * - I : Inserimento                                 *
      *            * - M : Modifica                                    *
      *            * - V : Visualizzazione                             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-fun      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione forzata da segreteria             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-vis-sgr      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flag di controllo su status visualizzazione titolo    *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis-tit          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione chiave                               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina testata in corso di trattamento     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-npt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Salvataggio per il campo precedente               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-svp      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Si/No pagina testata in corso di trattamento      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-snp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagine componenti la testata               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-mpt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Impostazione testata                              *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione pagine di testata                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-pte.
                   15  w-cnt-sts-imp-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Ingresso in pagine di testata                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-ing-pte.
                   15  w-cnt-sts-ing-ptx  occurs 9
                                          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts chiave                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts testata                   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts pagine di testata         *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-pte.
                   15  w-cnt-sts-pmt-ptx  occurs 9
                                          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati chiave                       *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati testata                      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati pagine di testata            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-pte.
                   15  w-cnt-sts-vis-ptx  occurs 9
                                          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per accettazioni singoli campi      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
               10  w-cnt-acc-flg-aum      pic  x(01)                  .
               10  w-cnt-acc-sav-tip      pic  x(01)                  .
               10  w-cnt-acc-sav-car      pic  9(02)                  .
               10  w-cnt-acc-sav-ldt      pic  9(02)                  .
               10  w-cnt-acc-sav-dec      pic  9(01)                  .
               10  w-cnt-acc-sav-sgn      pic  x(01)                  .
               10  w-cnt-acc-sav-edm      pic  x(10)                  .
               10  w-cnt-acc-sav-msk      pic  x(24)                  .
               10  w-cnt-acc-sav-lin      pic  9(02)                  .
               10  w-cnt-acc-sav-pos      pic  9(02)                  .
               10  w-cnt-acc-sav-alf      pic  x(80)                  .
               10  w-cnt-acc-sav-txt.
                   15  filler occurs 400  pic  x(01)                  .
               10  w-cnt-acc-sav-num      pic s9(13)v9(05)  trailing
                                                            separate
                                                            character .
               10  w-cnt-acc-sav-dat      pic  9(07)                  .
               10  w-cnt-acc-sav-ufk      pic  x(80)                  .
               10  w-cnt-acc-sav-mod      pic  x(01)                  .
               10  w-cnt-acc-sav-l23      pic  x(80)                  .
               10  w-cnt-acc-sav-l24      pic  x(80)                  .
      *        *-------------------------------------------------------*
      *        * Work area                                             *
      *        *-------------------------------------------------------*
           05  w-cnt-wrk.
               10  w-cnt-wrk-ctr-001      pic  9(05)                  .
               10  w-cnt-wrk-ctr-002      pic  9(05)                  .
               10  w-cnt-wrk-ctr-008      pic  9(05)                  .
               10  w-cnt-wrk-ctr-009      pic  9(05)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [mmv]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmmv"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [dps]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dps/fls/rec/rfdps"                          .
      *        *-------------------------------------------------------*
      *        * [dpm]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dpm/fls/rec/rfdpm"                          .
      *        *-------------------------------------------------------*
      *        * [mtv]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mtv/fls/rec/rfmtv"                          .
      *        *-------------------------------------------------------*
      *        * [datife]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/num/rec/rndatife"                       .

      *    *===========================================================*
      *    * Work-area per bufferizzazione testata                     *
      *    *-----------------------------------------------------------*
       01  w-tes.
      *        *-------------------------------------------------------*
      *        * Valori chiave                                         *
      *        *-------------------------------------------------------*
           05  w-tes-val-key.
      *            *---------------------------------------------------*
      *            * Anno di esercizio                                 *
      *            *---------------------------------------------------*
               10  w-tes-ann-ese          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Anno di esercizio attuale                         *
      *            *---------------------------------------------------*
               10  w-tes-uec-chi          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Tipo voce di magazzino                            *
      *            *                                                   *
      *            * - 01 : Prodotti di vendita                        *
      *            * - 02 : Semilavorati                               *
      *            * - 03 : Materie prime                              *
      *            * - 04 : Materiali vari                             *
      *            *---------------------------------------------------*
               10  w-tes-tip-mag          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice voce di magazzino                          *
      *            *---------------------------------------------------*
               10  w-tes-num-mag          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice voce di magazzino, codice alfanumerico     *
      *            *---------------------------------------------------*
               10  w-tes-num-mag-alf      pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Codice voce di magazzino, descrizione             *
      *            *---------------------------------------------------*
               10  w-tes-num-mag-des      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice voce di magazzino, unita' di misura        *
      *            *---------------------------------------------------*
               10  w-tes-num-mag-udm      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Codice voce di magazzino, numero decimali quan-   *
      *            * tita'                                             *
      *            *---------------------------------------------------*
               10  w-tes-num-mag-ndq      pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Contatori di comodo per i 10 esercizi precenti    *
      *            *---------------------------------------------------*
               10  w-tes-ctr-pre          pic  9(02)                  .
               10  w-tes-ctr-p01          pic  9(02)                  .
               10  w-tes-ctr-p09          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Valori attuali e precedenti                           *
      *        *-------------------------------------------------------*
           05  w-tes-val-aep occurs 2.
      *            *---------------------------------------------------*
      *            * Valore normale del bene nell'ultimo trimestre     *
      *            * dell'esercizio attuale                            *
      *            *---------------------------------------------------*
               10  w-tes-vnb-gea          pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Flag di rivalutazione dell'esercizio attuale      *
      *            * - Spaces : No                                     *
      *            * - S      : Si                                     *
      *            *---------------------------------------------------*
               10  w-tes-fdr-gea          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * 10 esercizi precedenti                            *
      *            *---------------------------------------------------*
               10  w-tes-ese-pre occurs 10.
      *                *-----------------------------------------------*
      *                * Anno                                          *
      *                *-----------------------------------------------*
                   15  w-tes-ese-pre-ann  pic  9(04)                  .
      *                *-----------------------------------------------*
      *                * Unita' di misura                              *
      *                *-----------------------------------------------*
                   15  w-tes-ese-pre-udm  pic  x(03)                  .
      *                *-----------------------------------------------*
      *                * Decimali quantita'                            *
      *                *-----------------------------------------------*
                   15  w-tes-ese-pre-ndq  pic  9(01)                  .
      *                *-----------------------------------------------*
      *                * Rimanenza finale                              *
      *                *-----------------------------------------------*
                   15  w-tes-rim-pre      pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * Costo medio ponderato                         *
      *                *-----------------------------------------------*
                   15  w-tes-ump-pre      pic  9(11)                  .
      *                *-----------------------------------------------*
      *                * Valore normale del bene nell'ultimo trimestre *
      *                * dell'esercizio passato                        *
      *                *-----------------------------------------------*
                   15  w-tes-vnb-pre      pic  9(11)                  .
      *                *-----------------------------------------------*
      *                * Flag di rivalutazione                         *
      *                * - Spaces : No                                 *
      *                * - S      : Si                                 *
      *                *-----------------------------------------------*
                   15  w-tes-fdr-pre      pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Si/No gestione semilavorati attiva                    *
      *        *-------------------------------------------------------*
           05  w-prs-dps-snx              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Si/No gestione materie prime attiva                   *
      *        *-------------------------------------------------------*
           05  w-prs-dpm-snx              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Si/No gestione materiali vari attiva                  *
      *        *-------------------------------------------------------*
           05  w-prs-mtv-snx              pic  x(01)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo prodotto                              *
      *        *-------------------------------------------------------*
           05  w-exp-tip-mag.
               10  w-exp-tip-mag-num      pic  9(02)       value 04   .
               10  w-exp-tip-mag-lun      pic  9(02)       value 25   .
               10  w-exp-tip-mag-tbl.
                   15  filler             pic  x(25) value
                            "Prodotti di vendita      "               .
                   15  filler             pic  x(25) value
                            "Semilavorati             "               .
                   15  filler             pic  x(25) value
                            "Materie prime            "               .
                   15  filler             pic  x(25) value
                            "Materiali vari           "               .
               10  w-exp-tip-mag-tbr redefines
                   w-exp-tip-mag-tbl.
                   15  w-exp-tip-mag-ele occurs 04
                                          pic  x(25)                  .
               10  w-exp-tip-mag-ast.
                   15  filler             pic  x(08) value
                            "01020304"                                .
               10  w-exp-tip-mag-ass redefines
                   w-exp-tip-mag-ast.
                   15  w-exp-tip-mag-tpm occurs 04
                                          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per : Tipo magazzino limitato ai soli tipi am-   *
      *        *            messi                                      *
      *        *-------------------------------------------------------*
           05  w-exp-tpm-amm.
               10  w-exp-tpm-amm-num      pic  9(02)                  .
               10  w-exp-tpm-amm-lun      pic  9(02) value 25         .
               10  w-exp-tpm-amm-tbl.
                   15  w-exp-tpm-amm-ele occurs 04
                                          pic  x(25)                  .
               10  w-exp-tpm-amm-ass.
                   15  w-exp-tpm-amm-tpm occurs 04
                                          pic  9(02)                  .
               10  w-exp-tpm-amm-i01      pic  9(02)                  .
               10  w-exp-tpm-amm-c01      pic  9(02)                  .
               10  w-exp-tpm-amm-c02      pic  9(02)                  .

      *    *===========================================================*
      *    * Work per accettazione anno per esteso                     *
      *    *-----------------------------------------------------------*
       01  w-acc-ann-est.
      *        *-------------------------------------------------------*
      *        * Comodo per accettazione                               *
      *        *-------------------------------------------------------*
           05  w-acc-ann-est-ann          pic  9(04)                  .

      *    *===========================================================*
      *    * Work per Determinazioni                                   *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per determinazione anno di esercizio attuale     *
      *        *-------------------------------------------------------*
           05  w-det-uec-chi.
      *            *---------------------------------------------------*
      *            * Esercizio attuale                                 *
      *            *---------------------------------------------------*
               10  w-det-uec-chi-ese      pic  9(03)                  .

      *    *===========================================================*
      *    * Work per visualizzazione indicatore di linea              *
      *    *-----------------------------------------------------------*
       01  w-ind-lin.
      *        *-------------------------------------------------------*
      *        * Linea attuale                                         *
      *        *-------------------------------------------------------*
           05  w-ind-lin-att              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea precedente                                      *
      *        *-------------------------------------------------------*
           05  w-ind-lin-pre              pic  9(03)                  .

      *    *===========================================================*
      *    * Work per routine 'pre-exe-pgm-000/999'                    *
      *    *-----------------------------------------------------------*
       01  w-pre-exe.
      *        *-------------------------------------------------------*
      *        * Flag per accettazioni preliminari                     *
      *        *-------------------------------------------------------*
           05  w-pre-exe-acc-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcp.
               10  w-let-arc-dcp-flg      pic  x(01)                  .
               10  w-let-arc-dcp-num      pic  9(07)                  .
               10  w-let-arc-dcp-alf      pic  x(14)                  .
               10  w-let-arc-dcp-des      pic  x(40)                  .
               10  w-let-arc-dcp-umi      pic  x(03)                  .
               10  w-let-arc-dcp-ndq      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dps]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dps.
               10  w-let-arc-dps-flg      pic  x(01)                  .
               10  w-let-arc-dps-num      pic  9(07)                  .
               10  w-let-arc-dps-alf      pic  x(14)                  .
               10  w-let-arc-dps-des      pic  x(40)                  .
               10  w-let-arc-dps-umi      pic  x(03)                  .
               10  w-let-arc-dps-ndq      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dpm]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dpm.
               10  w-let-arc-dpm-flg      pic  x(01)                  .
               10  w-let-arc-dpm-num      pic  9(07)                  .
               10  w-let-arc-dpm-alf      pic  x(14)                  .
               10  w-let-arc-dpm-des      pic  x(40)                  .
               10  w-let-arc-dpm-umi      pic  x(03)                  .
               10  w-let-arc-dpm-ndq      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [mtv]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-mtv.
               10  w-let-arc-mtv-flg      pic  x(01)                  .
               10  w-let-arc-mtv-num      pic  9(07)                  .
               10  w-let-arc-mtv-alf      pic  x(14)                  .
               10  w-let-arc-mtv-des      pic  x(40)                  .
               10  w-let-arc-mtv-umi      pic  x(03)                  .
               10  w-let-arc-mtv-ndq      pic  9(01)                  .
               10  w-let-arc-mtv-snm      pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per defaults                                    *
      *    *-----------------------------------------------------------*
       01  w-def.
      *        *-------------------------------------------------------*
      *        * Default per anno di esercizio                         *
      *        *-------------------------------------------------------*
           05  w-def-ann-ese              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Default per codice di magazzino                       *
      *        *-------------------------------------------------------*
           05  w-def-alf-mag              pic  x(14)                  .

      *    *===========================================================*
      *    * Link-area per accettazione codice prodotto 'dcp'          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acoddcp0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice semilavorato            *
      *    *-----------------------------------------------------------*
           copy      "pgm/dps/prg/cpy/acoddps0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice materia prima           *
      *    *-----------------------------------------------------------*
           copy      "pgm/dpm/prg/cpy/acoddpm0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice materiale vario 'mtv'   *
      *    *-----------------------------------------------------------*
           copy      "pgm/mtv/prg/cpy/acodmtv0.acl"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale                         *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di visualizzazione titolo  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-tit      .
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
       main-050.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-800.
       main-100.
      *              *-------------------------------------------------*
      *              * Accettazione campi chiave                       *
      *              *-------------------------------------------------*
           perform   acc-key-reg-000      thru acc-key-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita "E" : fine programma         *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-key    =    "E"
                     go to main-800.
      *              *-------------------------------------------------*
      *              * Lettura registrazione pre-esistente             *
      *              *-------------------------------------------------*
           perform   rou-let-reg-000      thru rou-let-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se esito negativo : riciclo su chiave       *
      *                  *---------------------------------------------*
           if        w-cnt-rou-let-reg    not  = spaces
                     go to main-100.
      *              *-------------------------------------------------*
      *              * Routine pre-accettazione campi non chiave       *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     go to main-130
           else if   w-cnt-mfu-tip-fun    =    "M"
                     go to main-140
           else if   w-cnt-mfu-tip-fun    =    "V"
                     go to main-150
           else      go to main-100.
       main-130.
           move      spaces               to   w-cnt-pre-acc-ins      .
           perform   pre-acc-ins-000      thru pre-acc-ins-999        .
           if        w-cnt-pre-acc-ins    =    spaces
                     go to main-180
           else      go to main-100.
       main-140.
           move      spaces               to   w-cnt-pre-acc-mod      .
           perform   pre-acc-mod-000      thru pre-acc-mod-999        .
           if        w-cnt-pre-acc-mod    =    spaces
                     go to main-180
           else      go to main-100.
       main-150.
           move      spaces               to   w-cnt-pre-acc-vis      .
           perform   pre-acc-vis-000      thru pre-acc-vis-999        .
           if        w-cnt-pre-acc-vis    =    spaces
                     go to main-180
           else      go to main-100.
       main-180.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di modifica di almeno un   *
      *              * campo non chiave                                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-flg-aum      .
      *              *-------------------------------------------------*
      *              * Accettazione campi non chiave                   *
      *              *-------------------------------------------------*
           perform   acc-nok-reg-000      thru acc-nok-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "E"
                     go to main-200.
      *                      *-----------------------------------------*
      *                      * Routine post-exit su campi non chiave   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se Inserimento                      *
      *                          *-------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-exi-ins-000
                                          thru pos-exi-ins-999
      *                          *-------------------------------------*
      *                          * Se Modifica                         *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-exi-mod-000
                                          thru pos-exi-mod-999
      *                          *-------------------------------------*
      *                          * Se Visualizzazione                  *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "V"
                     perform   pos-exi-vis-000
                                          thru pos-exi-vis-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-200.
      *                  *---------------------------------------------*
      *                  * Se uscita per annullamento                  *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "X"
                     go to main-300.
      *                      *-----------------------------------------*
      *                      * Routine post-conferma di annullamento   *
      *                      *-----------------------------------------*
           perform   pos-cnf-ann-000      thru pos-cnf-ann-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-300.
      *                  *---------------------------------------------*
      *                  * Se uscita per conferma                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Routine post-conferma                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se post-conferma di Inserimento     *
      *                          *-------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-cnf-ins-000
                                          thru pos-cnf-ins-999
      *                          *-------------------------------------*
      *                          * Se post-conferma di Modifica        *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-cnf-mod-000
                                          thru pos-cnf-mod-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione routine post-esecuzione programma    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-exe-pgm      .
           perform   pos-exe-pgm-000      thru pos-exe-pgm-999        .
           if        w-cnt-pos-exe-pgm    not  = spaces
                     go to main-050.
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Prsc :                        *
      *              * - se in tipo impostazione testata e su pagina   *
      *              *   maggiore di 1 : abilitato                     *
      *              * - altrimenti    : invariato                     *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "T" and
                     w-cnt-sts-imp-npt    >    1
                     move  "PRSC"         to   v-pfk (07)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Nxsc :                        *
      *              * - se in tipo impostazione testata e se pagina   *
      *              *   gia' completamente impostata o testata gia'   *
      *              *   completamente impostata : abilitato           *
      *              *  - altrimenti             : invariato           *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    not  = "T"
                     go to exe-acc-cmp-050.
           if        w-cnt-sts-imp-tes    not  = spaces or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     move  "NXSC"         to   v-pfk (08)             .
       exe-acc-cmp-050.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Delt :                        *
      *              *  - se Impostazione chiave    : non abilitato    *
      *              *  - se Inserimento            : non abilitato    *
      *              *  - se Visualizzazione        : non abilitato    *
      *              *  - se Almeno una modifica    : non abilitato    *
      *              *  - altrimenti                : abilitato        *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "K"   or
                     w-cnt-mfu-tip-fun    =    "I"   or
                     w-cnt-mfu-tip-fun    =    "V"   or
                     w-cnt-acc-flg-aum    not  = spaces
                     go to exe-acc-cmp-100.
           move      "DELT"               to   v-pfk (19)             .
       exe-acc-cmp-100.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Do :                          *
      *              *  - se Visualizzazione     : disabilitati        *
      *              *  - altrimenti             : inalterati          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     move  spaces         to   v-pfk (05)             .
      *              *-------------------------------------------------*
      *              * Salvataggio parametri di accettazione           *
      *              *-------------------------------------------------*
           move      v-tip                to   w-cnt-acc-sav-tip      .
           move      v-car                to   w-cnt-acc-sav-car      .
           move      v-lin                to   w-cnt-acc-sav-lin      .
           move      v-pos                to   w-cnt-acc-sav-pos      .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  v-alf          to   w-cnt-acc-sav-alf      .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  v-dec          to   w-cnt-acc-sav-dec
                     move  v-sgn          to   w-cnt-acc-sav-sgn
                     move  v-edm          to   w-cnt-acc-sav-edm
                     move  v-msk          to   w-cnt-acc-sav-msk
                     move  v-num          to   w-cnt-acc-sav-num      .
           if        v-tip                =    "D"
                     move  v-dat          to   w-cnt-acc-sav-dat      .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  v-ldt          to   w-cnt-acc-sav-ldt
                     move  v-txt          to   w-cnt-acc-sav-txt      .
           move      v-ufk                to   w-cnt-acc-sav-ufk      .
       exe-acc-cmp-200.
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Memorizzazione segnale di campo modificato      *
      *              *-------------------------------------------------*
           move      v-mod                to   w-cnt-acc-sav-mod      .
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-600.
      *              *-------------------------------------------------*
      *              * Se il campo impostato ha modificato il valore   *
      *              * precedente : ripetizione impostazione           *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     go to exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Routine pre-richiesta di ratifica tasto Delete  *
      *              *-------------------------------------------------*
           perform   pre-snx-del-000      thru pre-snx-del-999        .
      *              *-------------------------------------------------*
      *              * Se errore : a ripristino                        *
      *              *-------------------------------------------------*
           if        w-cnt-pre-snx-del    not  = spaces
                     go to exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Salvataggio linee 23 e 24 di note operative     *
      *              *-------------------------------------------------*
           move      "GL"                 to   v-ope                  .
           move      23                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l23      .
           move      "GL"                 to   v-ope                  .
           move      24                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l24      .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative attuali            *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      spaces               to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Richiesta conferma annullamento                 *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#DEL"               to   v-not                  .
           move      "N"                  to   v-alf                  .
           move      "SN"                 to   v-msk                  .
           move      "DELT"               to   v-pfk (19)             .
           move      "UP  "               to   v-pfk (02)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                =    spaces
                     if      v-alf        =    "S"
                             move  "DELT" to   v-key
                     else    move  "UP  " to   v-key                  .
      *              *-------------------------------------------------*
      *              * Se non function key DELT si ripristina          *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Routine post-richiesta di ratifica tasto Delete *
      *              *-------------------------------------------------*
           perform   pos-snx-del-000      thru pos-snx-del-999        .
      *              *-------------------------------------------------*
      *              * Se errore : a ripristino                        *
      *              *-------------------------------------------------*
           if        w-cnt-pos-snx-del    not  = spaces
                     go to exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Altrimenti : uscita                             *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-999.
       exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Ripristino linee 23 e 24 di note operative      *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      w-cnt-acc-sav-l23    to   v-nt1                  .
           move      w-cnt-acc-sav-l24    to   v-nt2                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Ripristino parametri di impostazione            *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      w-cnt-acc-sav-tip    to   v-tip                  .
           move      w-cnt-acc-sav-car    to   v-car                  .
           move      w-cnt-acc-sav-lin    to   v-lin                  .
           move      w-cnt-acc-sav-pos    to   v-pos                  .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-alf
                                          to   v-alf                  .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-dec
                                          to   v-dec
                     move  w-cnt-acc-sav-sgn
                                          to   v-sgn
                     move  w-cnt-acc-sav-edm
                                          to   v-edm
                     move  w-cnt-acc-sav-msk
                                          to   v-msk
                     move  w-cnt-acc-sav-num
                                          to   v-num                  .
           if        v-tip                =    "D"
                     move  w-cnt-acc-sav-dat
                                          to   v-dat                  .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-ldt
                                          to   v-ldt
                     move  w-cnt-acc-sav-txt
                                          to   v-txt                  .
           move      w-cnt-acc-sav-ufk    to   v-ufk                  .
      *              *-------------------------------------------------*
      *              * Ritorno alla impostazione                       *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-200.
       exe-acc-cmp-600.
      *              *-------------------------------------------------*
      *              * Flag globale di avvenuta almeno una modifica    *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     move  "#"            to   w-cnt-acc-flg-aum      .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           perform   vis-tip-fun-000      thru vis-tip-fun-999        .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Flag di eventuale visualizzazione forzata       *
      *              *-------------------------------------------------*
           move      s-sts                to   w-cnt-mfu-vis-sgr      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Test su flag di visualizzazione titolo          *
      *              *-------------------------------------------------*
           if        w-cnt-sts-vis-tit    not  = spaces
                     move  spaces         to   w-cnt-sts-vis-tit
                     go to vis-tit-pgm-999.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-100.
       vis-tit-pgm-200.
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-300.
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione tipo funzionamento                        *
      *    *-----------------------------------------------------------*
       vis-tip-fun-000.
           move      "TF"                 to   v-ope                  .
           move      w-cnt-mfu-tip-fun    to   v-tfu                  .
           move      w-cnt-acc-flg-aum    to   v-tfm                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-tes-tip-mag          .
           move      zero                 to   w-tes-ann-ese          .
           move      zero                 to   w-tes-uec-chi          .
      *              *-------------------------------------------------*
      *              * Visualizzazione titolo programma                *
      *              *-------------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
           move      "#"                  to   w-cnt-sts-vis-tit      .
       pre-exe-pgm-100.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Si/No gestione semilavorati attiva          *
      *                  *---------------------------------------------*
           perform   prs-dps-snx-000      thru prs-dps-snx-999        .
      *                  *---------------------------------------------*
      *                  * Si/No gestione materie prime attiva         *
      *                  *---------------------------------------------*
           perform   prs-dpm-snx-000      thru prs-dpm-snx-999        .
      *                  *---------------------------------------------*
      *                  * Si/No gestione materiale vario attiva       *
      *                  *---------------------------------------------*
           perform   prs-mtv-snx-000      thru prs-mtv-snx-999        .
       pre-exe-pgm-120.
      *              *-------------------------------------------------*
      *              * Determinazione tipi magazzino ammessi           *
      *              *-------------------------------------------------*
           perform   det-tpm-amm-000      thru det-tpm-amm-999        .
      *              *-------------------------------------------------*
      *              * Determinazione dell'ultimo esercizio completa-  *
      *              * mente chiuso                                    *
      *              *-------------------------------------------------*
           perform   det-uec-chi-000      thru det-uec-chi-999        .
           move      w-det-uec-chi-ese    to   w-tes-uec-chi          .
       pre-exe-pgm-400.
      *              *-------------------------------------------------*
      *              * Open moduli accettazione                        *
      *              *-------------------------------------------------*
           perform   opn-mdl-acc-000      thru opn-mdl-acc-999        .
       pre-exe-pgm-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     pre-exe-pgm-999.
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Routine post-esecuzione programma                         *
      *    *-----------------------------------------------------------*
       pos-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Close moduli accettazione                       *
      *              *-------------------------------------------------*
           perform   cls-mdl-acc-000      thru cls-mdl-acc-999        .
       pos-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Si/No gestione semilavorati   *
      *    *                             attiva                        *
      *    *-----------------------------------------------------------*
       prs-dps-snx-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/dps[snx]"       to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-dps-snx
           else      move  spaces         to   w-prs-dps-snx          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-dps-snx        =    "S" or
                     w-prs-dps-snx        =    "N"
                     go to prs-dps-snx-999.
           move      "N"                  to   w-prs-dps-snx          .
       prs-dps-snx-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Si/No gestione materie prime  *
      *    *                             attiva                        *
      *    *-----------------------------------------------------------*
       prs-dpm-snx-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/dpm[snx]"       to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-dpm-snx
           else      move  spaces         to   w-prs-dpm-snx          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-dpm-snx        =    "S" or
                     w-prs-dpm-snx        =    "N"
                     go to prs-dpm-snx-999.
           move      "N"                  to   w-prs-dpm-snx          .
       prs-dpm-snx-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Si/No gestione materiali vari *
      *    *                             attiva                        *
      *    *-----------------------------------------------------------*
       prs-mtv-snx-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/mtv[snx]"       to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-mtv-snx
           else      move  spaces         to   w-prs-mtv-snx          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-mtv-snx        =    "S" or
                     w-prs-mtv-snx        =    "N"
                     go to prs-mtv-snx-999.
           move      "N"                  to   w-prs-mtv-snx          .
       prs-mtv-snx-999.
           exit.

      *    *===========================================================*
      *    * Open moduli di accettazione                               *
      *    *-----------------------------------------------------------*
       opn-mdl-acc-000.
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice prodotto        *
      *              *-------------------------------------------------*
           perform   cod-cod-dcp-opn-000  thru cod-cod-dcp-opn-999    .
       opn-mdl-acc-100.
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice semilavorato    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione semilavorati attiva        *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        not  = "S"
                     go to opn-mdl-acc-200.
      *                  *---------------------------------------------*
      *                  * Open modulo                                 *
      *                  *---------------------------------------------*
           perform   cod-cod-dps-opn-000  thru cod-cod-dps-opn-999    .
       opn-mdl-acc-200.
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice materia prima   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione materie prime attiva       *
      *                  *---------------------------------------------*
           if        w-prs-dpm-snx        not  = "S"
                     go to opn-mdl-acc-300.
      *                  *---------------------------------------------*
      *                  * Open modulo                                 *
      *                  *---------------------------------------------*
           perform   cod-cod-dpm-opn-000  thru cod-cod-dpm-opn-999    .
       opn-mdl-acc-300.
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice materiale vario *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione materiali vari attiva      *
      *                  *---------------------------------------------*
           if        w-prs-mtv-snx        not  = "S"
                     go to opn-mdl-acc-900.
      *                  *---------------------------------------------*
      *                  * Open modulo                                 *
      *                  *---------------------------------------------*
           perform   cod-cod-mtv-opn-000  thru cod-cod-mtv-opn-999    .
       opn-mdl-acc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     opn-mdl-acc-999.
       opn-mdl-acc-999.
           exit.

      *    *===========================================================*
      *    * Close moduli di accettazione                              *
      *    *-----------------------------------------------------------*
       cls-mdl-acc-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice prodotto       *
      *              *-------------------------------------------------*
           perform   cod-cod-dcp-cls-000  thru cod-cod-dcp-cls-999    .
       cls-mdl-acc-100.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice semilavorato   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione semilavorati attiva        *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        not  = "S"
                     go to cls-mdl-acc-200.
      *                  *---------------------------------------------*
      *                  * Close modulo                                *
      *                  *---------------------------------------------*
           perform   cod-cod-dps-cls-000  thru cod-cod-dps-cls-999    .
       cls-mdl-acc-200.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice materia prima  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione materie prime attiva       *
      *                  *---------------------------------------------*
           if        w-prs-dpm-snx        not  = "S"
                     go to cls-mdl-acc-300.
      *                  *---------------------------------------------*
      *                  * Close modulo                                *
      *                  *---------------------------------------------*
           perform   cod-cod-dpm-cls-000  thru cod-cod-dpm-cls-999    .
       cls-mdl-acc-300.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice materiali vari *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione materiali vari attiva      *
      *                  *---------------------------------------------*
           if        w-prs-mtv-snx        not  = "S"
                     go to cls-mdl-acc-900.
      *                  *---------------------------------------------*
      *                  * Close modulo                                *
      *                  *---------------------------------------------*
           perform   cod-cod-mtv-cls-000  thru cod-cod-mtv-cls-999    .
       cls-mdl-acc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     cls-mdl-acc-999.
       cls-mdl-acc-999.
           exit.

      *    *===========================================================*
      *    * Open files                                                *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [mmv]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmv                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
       rou-opn-fls-100.
      *              *-------------------------------------------------*
      *              * [dps]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione semilavorati attiva        *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        not  = "S"
                     go to rou-opn-fls-120.
      *                  *---------------------------------------------*
      *                  * Apertura file                               *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
       rou-opn-fls-120.
      *              *-------------------------------------------------*
      *              * [dpm]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione materie prime attiva       *
      *                  *---------------------------------------------*
           if        w-prs-dpm-snx        not  = "S"
                     go to rou-opn-fls-140.
      *                  *---------------------------------------------*
      *                  * Apertura file                               *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
       rou-opn-fls-140.
      *              *-------------------------------------------------*
      *              * [mtv]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione materiali vari attiva      *
      *                  *---------------------------------------------*
           if        w-prs-mtv-snx        not  = "S"
                     go to rou-opn-fls-900.
      *                  *---------------------------------------------*
      *                  * Apertura file                               *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mtv/fls/ioc/obj/iofmtv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mtv                 .
       rou-opn-fls-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     rou-opn-fls-999.
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files                                               *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [mmv]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmv                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
       rou-cls-fls-100.
      *              *-------------------------------------------------*
      *              * [dps]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione semilavorati attiva        *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        not  = "S"
                     go to rou-cls-fls-120.
      *                  *---------------------------------------------*
      *                  * Chiusura file                               *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
       rou-cls-fls-120.
      *              *-------------------------------------------------*
      *              * [dpm]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione materie prime attiva       *
      *                  *---------------------------------------------*
           if        w-prs-dpm-snx        not  = "S"
                     go to rou-cls-fls-140.
      *                  *---------------------------------------------*
      *                  * Chiusura file                               *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
       rou-cls-fls-140.
      *              *-------------------------------------------------*
      *              * [mtv]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione materiali vari attiva      *
      *                  *---------------------------------------------*
           if        w-prs-mtv-snx        not  = "S"
                     go to rou-cls-fls-900.
      *                  *---------------------------------------------*
      *                  * Chiusura file                               *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mtv/fls/ioc/obj/iofmtv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mtv                 .
       rou-cls-fls-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     rou-cls-fls-999.
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi chiave della registrazione             *
      *    *-----------------------------------------------------------*
       acc-key-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-fun      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo impostazione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-sts-imp-npt      .
           move      spaces               to   w-cnt-sts-imp-key
                                               w-cnt-sts-imp-tes
                                               w-cnt-sts-imp-pte
                                               w-cnt-sts-ing-pte      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key
                                               w-cnt-sts-pmt-tes
                                               w-cnt-sts-pmt-pte      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-key
                                               w-cnt-sts-vis-tes
                                               w-cnt-sts-vis-pte      .
      *              *-------------------------------------------------*
      *              * Normalizzazione registrazione                   *
      *              *-------------------------------------------------*
           perform   nor-key-nok-000      thru nor-key-nok-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           perform   pmt-key-reg-000      thru pmt-key-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per prima pagina testata            *
      *                  *---------------------------------------------*
           perform   pmt-tes-reg-000      thru pmt-tes-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : chiave                      *
      *              *-------------------------------------------------*
           move      "K"                  to   w-cnt-mfu-tip-imp      .
       acc-key-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Tipo voce di magazzino                      *
      *                  *---------------------------------------------*
           perform   acc-tip-mag-000      thru acc-tip-mag-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
       acc-key-reg-200.
      *                  *---------------------------------------------*
      *                  * Codice di magazzino                         *
      *                  *---------------------------------------------*
           perform   acc-num-mag-000      thru acc-num-mag-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-100.
       acc-key-reg-300.
      *                  *---------------------------------------------*
      *                  * Anno di esercizio                           *
      *                  *---------------------------------------------*
           perform   acc-ann-ese-000      thru acc-ann-ese-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-100.
       acc-key-reg-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-key      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visual. dati chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-key      .
      *              *-------------------------------------------------*
      *              * Test se chiave vuota                            *
      *              *-------------------------------------------------*
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-key-reg-999.
      *              *-------------------------------------------------*
      *              * Controllo globale su tasto Do su chiave         *
      *              *-------------------------------------------------*
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-key-reg-100.
           move      "S"                  to   w-cnt-tus-acc-key      .
       acc-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campi chiave della registrazione          *
      *    *-----------------------------------------------------------*
       vis-key-reg-000.
      *              *-------------------------------------------------*
      *              * Tipo voce di magazzino                          *
      *              *-------------------------------------------------*
           perform   vis-tip-mag-000      thru vis-tip-mag-999        .
      *              *-------------------------------------------------*
      *              * Codice di magazzino                             *
      *              *-------------------------------------------------*
           perform   vis-num-mag-000      thru vis-num-mag-999        .
      *              *-------------------------------------------------*
      *              * Codice di magazzino, descrizione                *
      *              *-------------------------------------------------*
           perform   vis-num-mag-des-000  thru vis-num-mag-des-999    .
      *              *-------------------------------------------------*
      *              * Anno di esercizio                               *
      *              *-------------------------------------------------*
           perform   vis-ann-ese-000      thru vis-ann-ese-999        .
       vis-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per campi chiave                  *
      *    *-----------------------------------------------------------*
       pmt-key-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate                           *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      07                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Tipo voce di magazzino                          *
      *              *-------------------------------------------------*
           perform   pmt-tip-mag-000      thru pmt-tip-mag-999        .
      *              *-------------------------------------------------*
      *              * Codice di magazzino                             *
      *              *-------------------------------------------------*
           perform   pmt-num-mag-000      thru pmt-num-mag-999        .
      *              *-------------------------------------------------*
      *              * Anno di esercizio                               *
      *              *-------------------------------------------------*
           perform   pmt-ann-ese-000      thru pmt-ann-ese-999        .
      *              *-------------------------------------------------*
      *              * Linea di trattini                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per Tipo voce di magazzino        *
      *    *-----------------------------------------------------------*
       pmt-tip-mag-000.
      *              *-------------------------------------------------*
      *              * Se la tabella dei tipi voce di magazzino ammes- *
      *              * si e' formata da un solo elemento : uscita      *
      *              *-------------------------------------------------*
           if        w-exp-tpm-amm-num    not  = 1
                     go to pmt-tip-mag-100
           else      go to pmt-tip-mag-999.
       pmt-tip-mag-100.
      *              *-------------------------------------------------*
      *              * Visualizzazione prompt                          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo voce magazzino   :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-tip-mag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per Codice di magazzino           *
      *    *-----------------------------------------------------------*
       pmt-num-mag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
      *
           if        w-tes-tip-mag        =    01
                     move  "Codice prodotto       :"
                                          to   v-alf
           else if   w-tes-tip-mag        =    02
                     move  "Codice semilavorato   :"
                                          to   v-alf
           else if   w-tes-tip-mag        =    03
                     move  "Codice materia prima  :"
                                          to   v-alf
           else if   w-tes-tip-mag        =    04
                     move  "Codice del materiale  :"
                                          to   v-alf
           else      move  "Codice .............  :"
                                          to   v-alf                  .
      *
           if        w-exp-tpm-amm-num    =    01
                     move  "Codice prodotto       :"
                                          to   v-alf                  .
      *
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-num-mag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per Anno di esercizio             *
      *    *-----------------------------------------------------------*
       pmt-ann-ese-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Anno di esercizio     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-ann-ese-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Tipo voce di magazzino               *
      *    *-----------------------------------------------------------*
       acc-tip-mag-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se la tabella dei tipi magazzino ammessi e' *
      *                  * formata da un solo elemento : si forza il   *
      *                  * valore corrispondente e si esce             *
      *                  *---------------------------------------------*
           if        w-exp-tpm-amm-num    not  = 1
                     go to acc-tip-mag-100.
           move      w-exp-tip-mag-tpm (1)
                                          to   w-tes-tip-mag          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     acc-tip-mag-999.
       acc-tip-mag-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tpm-amm-lun    to   v-car                  .
           move      w-exp-tpm-amm-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-tpm-amm-tbl    to   v-txt                  .
           move      04                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      zero                 to   w-exp-tpm-amm-c01      .
       acc-tip-mag-102.
           add       1                    to   w-exp-tpm-amm-c01      .
           if        w-exp-tpm-amm-c01    >    w-exp-tpm-amm-num
                     move  zero           to   v-num
                     go to acc-tip-mag-104.
           if        w-tes-tip-mag        =    w-exp-tpm-amm-tpm
                                              (w-exp-tpm-amm-c01)
                     move  w-exp-tpm-amm-c01
                                          to   v-num
                     go to acc-tip-mag-104.
           go to     acc-tip-mag-102.
       acc-tip-mag-104.
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-tip-mag-999.
       acc-tip-mag-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-exp-tpm-amm-i01      .
           if        w-exp-tpm-amm-i01    =    zero
                     move  zero           to   w-tes-tip-mag
           else      move  w-exp-tpm-amm-tpm
                          (w-exp-tpm-amm-i01)
                                          to   w-tes-tip-mag          .
       acc-tip-mag-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test che il valore sia accettabile          *
      *                  *---------------------------------------------*
           if        w-tes-tip-mag        =    zero
                     go to acc-tip-mag-100.
       acc-tip-mag-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Rivisualizzazione prompt                    *
      *                  *---------------------------------------------*
           perform   pmt-num-mag-000      thru pmt-num-mag-999        .
       acc-tip-mag-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-tip-mag-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-tip-mag-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-tip-mag-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-tip-mag-999.
       acc-tip-mag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Tipo voce di magazzino            *
      *    *-----------------------------------------------------------*
       vis-tip-mag-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-mag-lun    to   v-car                  .
           move      w-exp-tip-mag-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-tip-mag-tbl    to   v-txt                  .
           move      04                   to   v-lin                  .
           move      25                   to   v-pos                  .
      *
           if        w-tes-tip-mag        =    99
                     move  01             to   v-num
           else if   w-tes-tip-mag        =    01
                     move  02             to   v-num
           else if   w-tes-tip-mag        =    02
                     move  03             to   v-num
           else if   w-tes-tip-mag        =    03
                     move  04             to   v-num
           else if   w-tes-tip-mag        =    04
                     move  05             to   v-num
           else      move  zero           to   v-num                  .
      *
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-mag-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice magazzino                     *
      *    *-----------------------------------------------------------*
       acc-num-mag-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione eventuale default              *
      *                  *---------------------------------------------*
           if        w-tes-num-mag-alf    not  = spaces
                     go to acc-num-mag-100.
           if        w-def-alf-mag        =    spaces
                     go to acc-num-mag-100.
           move      w-def-alf-mag        to   w-tes-num-mag-alf      .
       acc-num-mag-100.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo codice di magaz-  *
      *              * zino                                            *
      *              *-------------------------------------------------*
           if        w-tes-tip-mag        =    01
                     go to acc-num-mag-200
           else if   w-tes-tip-mag        =    02
                     go to acc-num-mag-400
           else if   w-tes-tip-mag        =    03
                     go to acc-num-mag-600
           else if   w-tes-tip-mag        =    04
                     go to acc-num-mag-800
           else      go to acc-num-mag-999.
       acc-num-mag-200.
      *              *-------------------------------------------------*
      *              * Se tipo codice di magazzino : Prodotto finito   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Accettazione codice Prodotto finito         *
      *                  *---------------------------------------------*
           perform   acc-cod-dcp-000      thru acc-cod-dcp-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     acc-num-mag-900.
       acc-num-mag-400.
      *              *-------------------------------------------------*
      *              * Se tipo codice di magazzino : Semilavorato      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Accettazione codice Semilavorato            *
      *                  *---------------------------------------------*
           perform   acc-cod-dps-000      thru acc-cod-dps-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     acc-num-mag-900.
       acc-num-mag-600.
      *              *-------------------------------------------------*
      *              * Se tipo codice di magazzino : Materia prima     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Accettazione codice Materia prima           *
      *                  *---------------------------------------------*
           perform   acc-cod-dpm-000      thru acc-cod-dpm-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     acc-num-mag-900.
       acc-num-mag-800.
      *              *-------------------------------------------------*
      *              * Se tipo codice di magazzino : Materiale vario   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Accettazione codice Materiale vario         *
      *                  *---------------------------------------------*
           perform   acc-cod-mtv-000      thru acc-cod-mtv-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     acc-num-mag-900.
       acc-num-mag-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Aggiornamento default                       *
      *                  *---------------------------------------------*
           move      w-tes-num-mag-alf    to   w-def-alf-mag          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     acc-num-mag-999.
       acc-num-mag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice di magazzino               *
      *    *-----------------------------------------------------------*
       vis-num-mag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      w-tes-num-mag-alf    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-num-mag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Descrizione di magazzino          *
      *    *-----------------------------------------------------------*
       vis-num-mag-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-num-mag-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-num-mag-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice Prodotto finito               *
      *    *-----------------------------------------------------------*
       acc-cod-dcp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-dcp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-dcp-ope      .
           move      "A"                  to   w-cod-cod-dcp-tac      .
           move      w-tes-num-mag        to   w-cod-cod-dcp-num      .
           move      w-tes-num-mag-alf    to   w-cod-cod-dcp-alf      .
           move      05                   to   w-cod-cod-dcp-lin      .
           move      25                   to   w-cod-cod-dcp-pos      .
           move      05                   to   w-cod-cod-dcp-dln      .
           move      41                   to   w-cod-cod-dcp-dps      .
           move      spaces               to   v-edm                  .
      *                  *---------------------------------------------*
      *                  * Se la tabella dei tipi voce di magazzino    *
      *                  * ammessi e' formata da un solo elemento :    *
      *                  * disabilitazione tasto 'Up'                  *
      *                  *---------------------------------------------*
           if        w-exp-tpm-amm-num    not  = 1
                     move  "UP  "         to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dcp-cll-000  thru cod-cod-dcp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcp-foi-000  thru cod-cod-dcp-foi-999    .
       acc-cod-dcp-110.
           perform   cod-cod-dcp-cll-000  thru cod-cod-dcp-cll-999    .
           if        w-cod-cod-dcp-ope    =    "F+"
                     go to acc-cod-dcp-115.
           if        w-cod-cod-dcp-ope    =    "AC"
                     go to acc-cod-dcp-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-dcp-115.
           perform   cod-cod-dcp-foi-000  thru cod-cod-dcp-foi-999    .
           go to     acc-cod-dcp-110.
       acc-cod-dcp-120.
           move      w-cod-cod-dcp-alf    to   v-alf                  .
           move      w-cod-cod-dcp-num    to   v-num                  .
       acc-cod-dcp-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-dcp-999.
      *              *-------------------------------------------------*
      *              * Valore impostato in destinazione                *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-num-mag          .
           move      v-alf                to   w-tes-num-mag-alf      .
       acc-cod-dcp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcp]                      *
      *                  *---------------------------------------------*
           move      w-tes-num-mag        to   w-let-arc-dcp-num      .
           move      w-tes-num-mag-alf    to   w-let-arc-dcp-alf      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione valori letti                 *
      *                  *---------------------------------------------*
           move      w-let-arc-dcp-des    to   w-tes-num-mag-des      .
           move      w-let-arc-dcp-umi    to   w-tes-num-mag-udm      .
           move      w-let-arc-dcp-ndq    to   w-tes-num-mag-ndq      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-num-mag-des-000  thru vis-num-mag-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice a zero : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-tes-num-mag        =    zero
                     go to acc-cod-dcp-100.
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-dcp-flg    not  = spaces
                     go to acc-cod-dcp-100.
       acc-cod-dcp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-dcp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-dcp-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-dcp-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-dcp-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-dcp-999.
       acc-cod-dcp-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice Semilavorato                  *
      *    *-----------------------------------------------------------*
       acc-cod-dps-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-dps-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-dps-ope      .
           move      "A"                  to   w-cod-cod-dps-tac      .
           move      w-tes-num-mag        to   w-cod-cod-dps-num      .
           move      w-tes-num-mag-alf    to   w-cod-cod-dps-alf      .
           move      05                   to   w-cod-cod-dps-lin      .
           move      25                   to   w-cod-cod-dps-pos      .
           move      05                   to   w-cod-cod-dps-dln      .
           move      41                   to   w-cod-cod-dps-dps      .
           move      spaces               to   v-edm                  .
      *                  *---------------------------------------------*
      *                  * Se la tabella dei tipi voce di magazzino    *
      *                  * ammessi e' formata da un solo elemento :    *
      *                  * disabilitazione tasto 'Up'                  *
      *                  *---------------------------------------------*
           if        w-exp-tpm-amm-num    not  = 1
                     move  "UP  "         to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dps-cll-000  thru cod-cod-dps-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dps-foi-000  thru cod-cod-dps-foi-999    .
       acc-cod-dps-110.
           perform   cod-cod-dps-cll-000  thru cod-cod-dps-cll-999    .
           if        w-cod-cod-dps-ope    =    "F+"
                     go to acc-cod-dps-115.
           if        w-cod-cod-dps-ope    =    "AC"
                     go to acc-cod-dps-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-dps-115.
           perform   cod-cod-dps-foi-000  thru cod-cod-dps-foi-999    .
           go to     acc-cod-dps-110.
       acc-cod-dps-120.
           move      w-cod-cod-dps-alf    to   v-alf                  .
           move      w-cod-cod-dps-num    to   v-num                  .
       acc-cod-dps-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-dps-999.
      *              *-------------------------------------------------*
      *              * Valore impostato in destinazione                *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-num-mag          .
           move      v-alf                to   w-tes-num-mag-alf      .
       acc-cod-dps-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dps]                      *
      *                  *---------------------------------------------*
           move      w-tes-num-mag        to   w-let-arc-dps-num      .
           move      w-tes-num-mag-alf    to   w-let-arc-dps-alf      .
           perform   let-arc-dps-000      thru let-arc-dps-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione valori letti                 *
      *                  *---------------------------------------------*
           move      w-let-arc-dps-des    to   w-tes-num-mag-des      .
           move      w-let-arc-dps-umi    to   w-tes-num-mag-udm      .
           move      w-let-arc-dps-ndq    to   w-tes-num-mag-ndq      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-num-mag-des-000  thru vis-num-mag-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice a zero : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-tes-num-mag        =    zero
                     go to acc-cod-dps-100.
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-dps-flg    not  = spaces
                     go to acc-cod-dps-100.
       acc-cod-dps-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-dps-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-dps-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-dps-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-dps-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-dps-999.
       acc-cod-dps-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice Materia prima                 *
      *    *-----------------------------------------------------------*
       acc-cod-dpm-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-dpm-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-dpm-ope      .
           move      "A"                  to   w-cod-cod-dpm-tac      .
           move      w-tes-num-mag        to   w-cod-cod-dpm-num      .
           move      w-tes-num-mag-alf    to   w-cod-cod-dpm-alf      .
           move      05                   to   w-cod-cod-dpm-lin      .
           move      25                   to   w-cod-cod-dpm-pos      .
           move      05                   to   w-cod-cod-dpm-dln      .
           move      41                   to   w-cod-cod-dpm-dps      .
           move      spaces               to   v-edm                  .
      *                  *---------------------------------------------*
      *                  * Se la tabella dei tipi voce di magazzino    *
      *                  * ammessi e' formata da un solo elemento :    *
      *                  * disabilitazione tasto 'Up'                  *
      *                  *---------------------------------------------*
           if        w-exp-tpm-amm-num    not  = 1
                     move  "UP  "         to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dpm-cll-000  thru cod-cod-dpm-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dpm-foi-000  thru cod-cod-dpm-foi-999    .
       acc-cod-dpm-110.
           perform   cod-cod-dpm-cll-000  thru cod-cod-dpm-cll-999    .
           if        w-cod-cod-dpm-ope    =    "F+"
                     go to acc-cod-dpm-115.
           if        w-cod-cod-dpm-ope    =    "AC"
                     go to acc-cod-dpm-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-dpm-115.
           perform   cod-cod-dpm-foi-000  thru cod-cod-dpm-foi-999    .
           go to     acc-cod-dpm-110.
       acc-cod-dpm-120.
           move      w-cod-cod-dpm-alf    to   v-alf                  .
           move      w-cod-cod-dpm-num    to   v-num                  .
       acc-cod-dpm-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-dpm-999.
      *              *-------------------------------------------------*
      *              * Valore impostato in destinazione                *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-num-mag          .
           move      v-alf                to   w-tes-num-mag-alf      .
       acc-cod-dpm-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dpm]                      *
      *                  *---------------------------------------------*
           move      w-tes-num-mag        to   w-let-arc-dpm-num      .
           move      w-tes-num-mag-alf    to   w-let-arc-dpm-alf      .
           perform   let-arc-dpm-000      thru let-arc-dpm-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione valori letti                 *
      *                  *---------------------------------------------*
           move      w-let-arc-dpm-des    to   w-tes-num-mag-des      .
           move      w-let-arc-dpm-umi    to   w-tes-num-mag-udm      .
           move      w-let-arc-dpm-ndq    to   w-tes-num-mag-ndq      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-num-mag-des-000  thru vis-num-mag-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice a zero : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-tes-num-mag        =    zero
                     go to acc-cod-dpm-100.
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-dpm-flg    not  = spaces
                     go to acc-cod-dpm-100.
       acc-cod-dpm-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-dpm-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-dpm-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-dpm-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-dpm-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-dpm-999.
       acc-cod-dpm-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice Materiale vario               *
      *    *-----------------------------------------------------------*
       acc-cod-mtv-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-mtv-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-mtv-ope      .
           move      "A"                  to   w-cod-cod-mtv-tac      .
           move      w-tes-num-mag        to   w-cod-cod-mtv-num      .
           move      w-tes-num-mag-alf    to   w-cod-cod-mtv-alf      .
           move      05                   to   w-cod-cod-mtv-lin      .
           move      25                   to   w-cod-cod-mtv-pos      .
           move      05                   to   w-cod-cod-mtv-dln      .
           move      41                   to   w-cod-cod-mtv-dps      .
           move      spaces               to   v-edm                  .
      *                  *---------------------------------------------*
      *                  * Se la tabella dei tipi voce di magazzino    *
      *                  * ammessi e' formata da un solo elemento :    *
      *                  * disabilitazione tasto 'Up'                  *
      *                  *---------------------------------------------*
           if        w-exp-tpm-amm-num    not  = 1
                     move  "UP  "         to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-mtv-cll-000  thru cod-cod-mtv-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-mtv-foi-000  thru cod-cod-mtv-foi-999    .
       acc-cod-mtv-110.
           perform   cod-cod-mtv-cll-000  thru cod-cod-mtv-cll-999    .
           if        w-cod-cod-mtv-ope    =    "F+"
                     go to acc-cod-mtv-115.
           if        w-cod-cod-mtv-ope    =    "AC"
                     go to acc-cod-mtv-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-mtv-115.
           perform   cod-cod-mtv-foi-000  thru cod-cod-mtv-foi-999    .
           go to     acc-cod-mtv-110.
       acc-cod-mtv-120.
           move      w-cod-cod-mtv-alf    to   v-alf                  .
           move      w-cod-cod-mtv-num    to   v-num                  .
       acc-cod-mtv-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-mtv-999.
      *              *-------------------------------------------------*
      *              * Valore impostato in destinazione                *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-num-mag          .
           move      v-alf                to   w-tes-num-mag-alf      .
       acc-cod-mtv-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [mtv]                      *
      *                  *---------------------------------------------*
           move      w-tes-num-mag        to   w-let-arc-mtv-num      .
           move      w-tes-num-mag-alf    to   w-let-arc-mtv-alf      .
           perform   let-arc-mtv-000      thru let-arc-mtv-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione valori letti                 *
      *                  *---------------------------------------------*
           move      w-let-arc-mtv-des    to   w-tes-num-mag-des      .
           move      w-let-arc-mtv-umi    to   w-tes-num-mag-udm      .
           move      w-let-arc-mtv-ndq    to   w-tes-num-mag-ndq      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-num-mag-des-000  thru vis-num-mag-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice a zero : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-tes-num-mag        =    zero
                     go to acc-cod-mtv-100.
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-mtv-flg    not  = spaces
                     go to acc-cod-mtv-100.
       acc-cod-mtv-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-mtv-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-mtv-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-mtv-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-mtv-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-mtv-999.
       acc-cod-mtv-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Anno di esercizio                    *
      *    *-----------------------------------------------------------*
       acc-ann-ese-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione eventuale default              *
      *                  *---------------------------------------------*
           if        w-tes-ann-ese        not  = zero
                     go to acc-ann-ese-050.
      *                      *-----------------------------------------*
      *                      * Date and time da segreteria             *
      *                      *-----------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Si propone l'anno in corso come default *
      *                      *-----------------------------------------*
           move      s-saa                to   w-def-ann-ese          .
           move      w-def-ann-ese        to   w-tes-ann-ese          .
       acc-ann-ese-050.
      *                  *---------------------------------------------*
      *                  * Preparazione campo di accettazione          *
      *                  *---------------------------------------------*
           move      w-tes-ann-ese        to   w-acc-ann-est-ann      .
           if        w-acc-ann-est-ann    =    zero
                     go to acc-ann-ese-100.
           add       1900                 to   w-acc-ann-est-ann      .
       acc-ann-ese-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      06                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-acc-ann-est-ann    to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-ann-ese-999.
       acc-ann-ese-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-acc-ann-est-ann      .
       acc-ann-ese-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Anno a zero non accettabile                 *
      *                  *---------------------------------------------*
           if        w-acc-ann-est-ann    not  = zero
                     go to acc-ann-ese-420.
      *                      *-----------------------------------------*
      *                      * Normalizzazione campo reale             *
      *                      *-----------------------------------------*
           move      zero                 to   w-tes-ann-ese          .
      *                      *-----------------------------------------*
      *                      * A reimpostazione a meno che non sia     *
      *                      * stato impostato il tasto 'Up'           *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-ann-ese-800
           else      go to acc-ann-ese-100.
       acc-ann-ese-420.
      *                  *---------------------------------------------*
      *                  * Anno inferiore al 1911 : non accettabile    *
      *                  *---------------------------------------------*
           if        w-acc-ann-est-ann    >    1911
                     go to acc-ann-ese-450.
      *                      *-----------------------------------------*
      *                      * Preparazione messaggio di errore        *
      *                      *-----------------------------------------*
           move      "Anno di esercizio non accettabile !           "
                                          to   w-err-box-err-msg      .
      *                      *-----------------------------------------*
      *                      * Box di errore                           *
      *                      *-----------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-ann-ese-100.
       acc-ann-ese-450.
      *                  *---------------------------------------------*
      *                  * Anno superiore a quello attuale : non       *
      *                  * accettabile                                 *
      *                  *---------------------------------------------*
           subtract  1900                 from w-acc-ann-est-ann
                                        giving w-tes-ann-ese          .
           if        w-tes-ann-ese        not  > w-def-ann-ese
                     go to acc-ann-ese-600.
      *                      *-----------------------------------------*
      *                      * Preparazione messaggio di errore        *
      *                      *-----------------------------------------*
           move      "Anno di esercizio non accettabile !           "
                                          to   w-err-box-err-msg      .
      *                      *-----------------------------------------*
      *                      * Box di errore                           *
      *                      *-----------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-ann-ese-100.
       acc-ann-ese-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Anno di esercizio in campo reale            *
      *                  *---------------------------------------------*
           subtract  1900                 from w-acc-ann-est-ann      .
           move      w-acc-ann-est-ann    to   w-tes-ann-ese          .
       acc-ann-ese-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-ann-ese-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-ann-ese-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-ann-ese-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-ann-ese-999.
       acc-ann-ese-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Anno di esercizio                 *
      *    *-----------------------------------------------------------*
       vis-ann-ese-000.
      *              *-------------------------------------------------*
      *              * Preparazione campo da visualizzare              *
      *              *-------------------------------------------------*
           move      w-tes-ann-ese        to   w-acc-ann-est-ann      .
           if        w-acc-ann-est-ann    =    zero
                     go to vis-ann-ese-100.
           add       1900                 to   w-acc-ann-est-ann      .
       vis-ann-ese-100.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      06                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      w-acc-ann-est-ann    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-ann-ese-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi non chiave della registrazione         *
      *    *-----------------------------------------------------------*
       acc-nok-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-nok      .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           perform   vis-tip-fun-000      thru vis-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione se in modi- *
      *              * fica o visualizzazione, per testata             *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M" or
                     w-cnt-mfu-tip-fun    =    "V"
                     move  "#"            to   w-cnt-sts-imp-tes
                     move  all "#"        to   w-cnt-sts-imp-pte
                     move  all "#"        to   w-cnt-sts-ing-pte      .
       acc-nok-reg-200.
      *              *-------------------------------------------------*
      *              * Trattamento testata                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione del numero di pagine che     *
      *                  * compongono la testata                       *
      *                  *---------------------------------------------*
           perform   dmp-tes-reg-000      thru dmp-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-key    =    spaces
                     perform pmt-key-reg-000
                                          thru pmt-key-reg-999
                     move    "#"          to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati campi chiave           *
      *                  *---------------------------------------------*
           if        w-cnt-sts-vis-key    =    spaces
                     perform vis-key-reg-000
                                          thru vis-key-reg-999
                     move    "#"          to   w-cnt-sts-vis-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per pagina di testata               *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-ptx
                    (w-cnt-sts-imp-npt)   =    spaces
                     perform pmt-tes-reg-000
                                          thru pmt-tes-reg-999
                     move    "#"          to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati pagina testata         *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M"      or
                     w-cnt-mfu-tip-fun    =    "V"      or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces or
                     w-cnt-sts-ing-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     if    w-cnt-sts-vis-ptx
                          (w-cnt-sts-imp-npt)
                                          =    spaces
                           perform vis-tes-reg-000
                                          thru vis-tes-reg-999
                           move    "#"    to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Flag di ingresso in pagina di testata       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-ing-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione dati testata                   *
      *                  *---------------------------------------------*
           perform   acc-tes-reg-000      thru acc-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita definitivo                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "S" or
                     w-cnt-tus-acc-tes    =    "X" or
                     w-cnt-tus-acc-tes    =    "E"
                     move  w-cnt-tus-acc-tes
                                          to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999.
      *                  *---------------------------------------------*
      *                  * Se spostamento di pagina                    *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "-"
                     go to acc-nok-reg-300
           else      go to acc-nok-reg-400.
       acc-nok-reg-300.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina precedente      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' 1 si ignora *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  > 1
                     go to acc-nok-reg-200.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina attuale a : no    *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
       acc-nok-reg-325.
      *                          *-------------------------------------*
      *                          * Decremento numero pagina attuale    *
      *                          *-------------------------------------*
           subtract  1                    from w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : decremento ulteriore        *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces and
                     w-cnt-sts-imp-npt    >    1
                     go to acc-nok-reg-325.
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-400.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina successiva      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Salvataggio numero pagina attuale   *
      *                          *-------------------------------------*
           move      w-cnt-sts-imp-npt    to   w-cnt-sts-imp-svp      .
       acc-nok-reg-425.
      *                          *-------------------------------------*
      *                          * Status di impostazione dati della   *
      *                          * della pagina attuale a : si'        *
      *                          *-------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si pone lo status di impostazione   *
      *                          * dati generale testata a si'         *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  "#"            to   w-cnt-sts-imp-tes      .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si va' a conferma impostazioni      *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  w-cnt-sts-imp-svp
                                          to   w-cnt-sts-imp-npt
                     go to acc-nok-reg-800.
      *                          *-------------------------------------*
      *                          * Incremento numero pagina attuale    *
      *                          *-------------------------------------*
           add       1                    to   w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : a re-incremento             *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces
                     go to acc-nok-reg-425.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina impostata a : no  *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-svp)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-svp)     .
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-800.
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-nok-reg-810.
      *                  *---------------------------------------------*
      *                  * Test se sola visualizzazione                *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to acc-nok-reg-820
           else      go to acc-nok-reg-830.
       acc-nok-reg-820.
      *                      *-----------------------------------------*
      *                      * Accettazione se sola visualizzazione    *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#VIS"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "E"                  to   v-msk                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "E"
                     move  "EXIT"         to   v-key                  .
           go to     acc-nok-reg-840.
       acc-nok-reg-830.
      *                      *-----------------------------------------*
      *                      * Accettazione se inserimento o modifica  *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#SAV"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-nok-reg-840.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-nok-reg-850
           else if   v-key                =    "EXIT"
                     go to acc-nok-reg-860
           else if   v-key                =    "UP  "
                     go to acc-nok-reg-870
           else      go to acc-nok-reg-810.
       acc-nok-reg-850.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   cnt-tdo-nok-000      thru cnt-tdo-nok-999        .
           if        w-cnt-tdo-nok-flg    =    spaces
                     move  "S"            to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999
           else      move  spaces         to   w-cnt-tdo-nok-flg
                     go to acc-nok-reg-800.
       acc-nok-reg-860.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-nok      .
           go to     acc-nok-reg-999.
       acc-nok-reg-870.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazione testata                 *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
           go to     acc-nok-reg-200.
       acc-nok-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione numero pagine che compongono la testata    *
      *    *-----------------------------------------------------------*
       dmp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * La testata e' composta di nr. 1 pagine          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-sts-imp-mpt      .
       dmp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione si/no pagina w-cnt-sts-imp-npt da trattare *
      *    *-----------------------------------------------------------*
       snp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-snp      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del numero pagina        *
      *              *-------------------------------------------------*
           go to     snp-tes-reg-100
                     depending            on   w-cnt-sts-imp-npt      .
           go to     snp-tes-reg-999.
       snp-tes-reg-100.
      *              *-------------------------------------------------*
      *              * Test per pagina 1                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     snp-tes-reg-999.
       snp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione testata registrazione                        *
      *    *-----------------------------------------------------------*
       acc-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-tes      .
      *              *-------------------------------------------------*
      *              * Normalizzazione function-key                    *
      *              *-------------------------------------------------*
           move      spaces               to   v-key                  .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : testata                     *
      *              *-------------------------------------------------*
           move      "T"                  to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Normalizzazione indicatore di linea precedente  *
      *              *-------------------------------------------------*
           move      zero                 to   w-ind-lin-pre          .
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del numero pagina    *
      *                  *---------------------------------------------*
           go to     acc-tes-reg-100
                     depending            on   w-cnt-sts-imp-npt      .
           go to     acc-tes-reg-999.
       acc-tes-reg-100.
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Esercizio attuale : valore normale del bene *
      *                  * nell'ultimo trimestre                       *
      *                  *---------------------------------------------*
           perform   acc-vnb-gea-000      thru acc-vnb-gea-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "DOWN"
                     go to acc-tes-reg-110.
       acc-tes-reg-105.
      *                  *---------------------------------------------*
      *                  * Esercizio attuale : flag di rivalutazione   *
      *                  *---------------------------------------------*
           perform   acc-fdr-gea-000      thru acc-fdr-gea-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-100.
       acc-tes-reg-110.
      *                  *---------------------------------------------*
      *                  * Esercizio precedente : ciclo 1..10          *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-ctr-pre          .
       acc-tes-reg-120.
           add       1                    to   w-tes-ctr-pre          .
           if        w-tes-ctr-pre        >    10
                     go to acc-tes-reg-190.
       acc-tes-reg-140.
      *                      *-----------------------------------------*
      *                      * Rimanenza finale                        *
      *                      *-----------------------------------------*
           perform   acc-rim-pre-000      thru acc-rim-pre-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-150.
           if        v-key                =    "DOWN"
                     go to acc-tes-reg-180.
       acc-tes-reg-142.
      *                      *-----------------------------------------*
      *                      * Costo medio ponderato                   *
      *                      *-----------------------------------------*
           perform   acc-ump-pre-000      thru acc-ump-pre-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-140.
       acc-tes-reg-144.
      *                      *-----------------------------------------*
      *                      * Valore normale del bene                 *
      *                      *-----------------------------------------*
           perform   acc-vnb-pre-000      thru acc-vnb-pre-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-142.
       acc-tes-reg-146.
      *                      *-----------------------------------------*
      *                      * Flag di rivalutazione                   *
      *                      *-----------------------------------------*
           perform   acc-fdr-pre-000      thru acc-fdr-pre-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-144.
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     acc-tes-reg-180.
       acc-tes-reg-150.
      *                      *-----------------------------------------*
      *                      * Se 'Up' dal primo campo                 *
      *                      *-----------------------------------------*
           subtract  1                    from w-tes-ctr-pre          .
           if        w-tes-ctr-pre        >    zero
                     go to acc-tes-reg-140
           else      go to acc-tes-reg-100.
       acc-tes-reg-180.
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     acc-tes-reg-120.
       acc-tes-reg-190.
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di linea         *
      *                  *---------------------------------------------*
           if        w-tes-ctr-pre        <    11
                     go to acc-tes-reg-900.
           move      10                   to   w-ind-lin-pre          .
           add       w-tes-ctr-pre        to   w-ind-lin-pre          .
           move      zero                 to   w-ind-lin-att          .
           perform   vis-ind-lin-000      thru vis-ind-lin-999        .
       acc-tes-reg-900.
      *                  *---------------------------------------------*
      *                  * Fine Pagina                                 *
      *                  *---------------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-tes      .
           go to     acc-tes-reg-999.
       acc-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione testata registrazione                     *
      *    *-----------------------------------------------------------*
       vis-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del numero pagina        *
      *              *-------------------------------------------------*
           go to     vis-tes-reg-100
                     depending            on   w-cnt-sts-imp-npt      .
           go to     vis-tes-reg-999.
       vis-tes-reg-100.
      *              *-------------------------------------------------*
      *              * Pagina 1                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Esercizio attuale : anno                    *
      *                  *---------------------------------------------*
           perform   vis-ann-gea-000      thru vis-ann-gea-999        .
      *                  *---------------------------------------------*
      *                  * Esercizio attuale : valore normale del bene *
      *                  * nell'ultimo trimestre                       *
      *                  *---------------------------------------------*
           perform   vis-vnb-gea-000      thru vis-vnb-gea-999        .
      *                  *---------------------------------------------*
      *                  * Esercizio attuale : flag di rivalutazione   *
      *                  *---------------------------------------------*
           perform   vis-fdr-gea-000      thru vis-fdr-gea-999        .
      *                  *---------------------------------------------*
      *                  * Esercizio precedente : ciclo 1..10          *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-ctr-pre          .
       vis-tes-reg-120.
           add       1                    to   w-tes-ctr-pre          .
           if        w-tes-ctr-pre        >    10
                     go to vis-tes-reg-900.
       vis-tes-reg-140.
      *                      *-----------------------------------------*
      *                      * Anno                                    *
      *                      *-----------------------------------------*
           perform   vis-ann-pre-000      thru vis-ann-pre-999        .
      *                      *-----------------------------------------*
      *                      * Unita' di misura                        *
      *                      *-----------------------------------------*
           perform   vis-udm-pre-000      thru vis-udm-pre-999        .
      *                      *-----------------------------------------*
      *                      * Rimanenza finale                        *
      *                      *-----------------------------------------*
           perform   vis-rim-pre-000      thru vis-rim-pre-999        .
      *                      *-----------------------------------------*
      *                      * Costo medio ponderato                   *
      *                      *-----------------------------------------*
           perform   vis-ump-pre-000      thru vis-ump-pre-999        .
      *                      *-----------------------------------------*
      *                      * Valore normale del bene                 *
      *                      *-----------------------------------------*
           perform   vis-vnb-pre-000      thru vis-vnb-pre-999        .
      *                      *-----------------------------------------*
      *                      * Flag di rivalutazione                   *
      *                      *-----------------------------------------*
           perform   vis-fdr-pre-000      thru vis-fdr-pre-999        .
       vis-tes-reg-180.
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     vis-tes-reg-120.
       vis-tes-reg-900.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     vis-tes-reg-999.
       vis-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts testata                           *
      *    *-----------------------------------------------------------*
       pmt-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate                           *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del numero pagina        *
      *              *-------------------------------------------------*
           go to     pmt-tes-reg-100
                     depending            on   w-cnt-sts-imp-npt      .
           go to     pmt-tes-reg-999.
       pmt-tes-reg-100.
      *              *-------------------------------------------------*
      *              * Pagina 1                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Fincatura per campi di testata              *
      *                  *---------------------------------------------*
           perform   pmt-fin-tes-000      thru pmt-fin-tes-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pmt-tes-reg-999.
       pmt-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Fincatura per campi di testata   *
      *    *-----------------------------------------------------------*
       pmt-fin-tes-000.
      *              *-------------------------------------------------*
      *              * 1. linea di fincatura                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "                Rimanenza       Costo medio     Va
      -              "lore normale   Segnale di     "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * 2. linea di fincatura                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Anno   Udm        finale         ponderato      ul
      -              "timo trim.     rivalutazione  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sottolinetura per la fincatura                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "----   ---   ---------------   --------------   --
      -              "------------   -------------  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-fin-tes-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Presa visione per pagina     *
      *    *-----------------------------------------------------------*
       acc-pre-vpg-000.
      *              *-------------------------------------------------*
      *              * Se non esiste alcuna pagina attiva successiva   *
      *              * alla pagina attuale : uscita                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio numero pagina attuale           *
      *                  *---------------------------------------------*
           move      w-cnt-sts-imp-npt    to   w-cnt-sts-imp-svp      .
       acc-pre-vpg-100.
      *                  *---------------------------------------------*
      *                  * Se all'ultima pagina : ripristino pagina    *
      *                  * salvata ed uscita                           *
      *                  *---------------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  w-cnt-sts-imp-svp
                                          to   w-cnt-sts-imp-npt
                     go to acc-pre-vpg-999.
      *                  *---------------------------------------------*
      *                  * Incremento numero pagina                    *
      *                  *---------------------------------------------*
           add       1                    to   w-cnt-sts-imp-npt      .
      *                  *---------------------------------------------*
      *                  * Test se pagina da trattare                  *
      *                  *---------------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se no : a re-incremento                     *
      *                  *---------------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces
                     go to acc-pre-vpg-100.
      *                  *---------------------------------------------*
      *                  * Se si : ripristino pagina salvata e accet-  *
      *                  * tazione presa visione                       *
      *                  *---------------------------------------------*
           move      w-cnt-sts-imp-svp    to   w-cnt-sts-imp-npt      .
       acc-pre-vpg-200.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      spaces               to   v-msk                  .
           move      spaces               to   v-alf                  .
           move      spaces               to   v-not                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-pre-vpg-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-pre-vpg-000.
       acc-pre-vpg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Esercizio attuale - anno          *
      *    *-----------------------------------------------------------*
       vis-ann-gea-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "B"                  to   v-edm                  .
           move      11                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-tes-ann-ese        to   v-num                  .
           add       1900                 to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-ann-gea-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Esercizio attuale - valore del bene  *
      *    *                      nell'ultimo trimestre                *
      *    *-----------------------------------------------------------*
       acc-vnb-gea-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di linea         *
      *                  *---------------------------------------------*
           move      11                   to   w-ind-lin-att          .
           perform   vis-ind-lin-000      thru vis-ind-lin-999        .
       acc-vnb-gea-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           add       02                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "GD"                 to   v-edm                  .
           move      11                   to   v-lin                  .
           move      49                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-vnb-gea (1)    to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-vnb-gea-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-vnb-gea-999.
       acc-vnb-gea-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-vnb-gea (1)      .
       acc-vnb-gea-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-vnb-gea-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di rivalutazione       *
      *                  *---------------------------------------------*
           if        w-tes-vnb-gea (1)    =    zero
                     move  spaces         to   w-tes-fdr-gea (1)      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione flag di rivalutazione       *
      *                  *---------------------------------------------*
           perform   vis-fdr-gea-000      thru vis-fdr-gea-999        .
       acc-vnb-gea-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-vnb-gea-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-vnb-gea-100.
       acc-vnb-gea-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Esercizio attuale - valore del    *
      *    *                         bene nell'ultimo trimestre        *
      *    *-----------------------------------------------------------*
       vis-vnb-gea-000.
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           add       02                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "GD"                 to   v-edm                  .
           move      11                   to   v-lin                  .
           move      49                   to   v-pos                  .
           move      w-tes-vnb-gea (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-vnb-gea-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Esercizio attuale - flag di rivalu-  *
      *    *                      tazione                              *
      *    *-----------------------------------------------------------*
       acc-fdr-gea-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-tes-vnb-gea (1)    =    zero
                     go to acc-fdr-gea-999.
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di linea         *
      *                  *---------------------------------------------*
           move      11                   to   w-ind-lin-att          .
           perform   vis-ind-lin-000      thru vis-ind-lin-999        .
       acc-fdr-gea-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      72                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-fdr-gea (1)    to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-fdr-gea-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-fdr-gea-999.
       acc-fdr-gea-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-fdr-gea (1)      .
       acc-fdr-gea-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se valore accettabile                  *
      *                  *---------------------------------------------*
           if        w-tes-vnb-gea (1)    =    zero
                     go to acc-fdr-gea-420
           else      go to acc-fdr-gea-600.
       acc-fdr-gea-420.
      *                      *-----------------------------------------*
      *                      * Se valore del bene a zero               *
      *                      *-----------------------------------------*
           if        w-tes-fdr-gea (1)    =    spaces
                     go to acc-fdr-gea-600
           else      go to acc-fdr-gea-100.
       acc-fdr-gea-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Eventuale conversione del valore in 'S'     *
      *                  *---------------------------------------------*
           if        w-tes-fdr-gea (1)    =    spaces
                     go to acc-fdr-gea-800.
           if        w-tes-fdr-gea (1)    =    "S"
                     go to acc-fdr-gea-800.
           move      "S"                  to   w-tes-fdr-gea (1)      .
      *                  *---------------------------------------------*
      *                  * Rivisualizzazione flag di rivalutazione     *
      *                  *---------------------------------------------*
           perform   vis-fdr-gea-000      thru vis-fdr-gea-999        .
       acc-fdr-gea-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-fdr-gea-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-fdr-gea-100.
       acc-fdr-gea-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Esercizio attuale - flag di ri-   *
      *    *                         valutazione                       *
      *    *-----------------------------------------------------------*
       vis-fdr-gea-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      72                   to   v-pos                  .
           move      w-tes-fdr-gea (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-fdr-gea-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Esercizio precedente - anno       *
      *    *-----------------------------------------------------------*
       vis-ann-pre-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "B"                  to   v-edm                  .
           move      11                   to   v-lin                  .
           add       w-tes-ctr-pre        to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-tes-ese-pre-ann
                    (1, w-tes-ctr-pre)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-ann-pre-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Esercizio precedente - unita' di  *
      *    *                         misura                            *
      *    *-----------------------------------------------------------*
       vis-udm-pre-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      11                   to   v-lin                  .
           add       w-tes-ctr-pre        to   v-lin                  .
           move      08                   to   v-pos                  .
           move      w-tes-ese-pre-udm
                    (1, w-tes-ctr-pre)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-udm-pre-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Esercizio precedente - rimanenza     *
      *    *                      finale                               *
      *    *-----------------------------------------------------------*
       acc-rim-pre-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di linea         *
      *                  *---------------------------------------------*
           move      11                   to   w-ind-lin-att          .
           add       w-tes-ctr-pre        to   w-ind-lin-att          .
           perform   vis-ind-lin-000      thru vis-ind-lin-999        .
       acc-rim-pre-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      w-tes-ese-pre-ndq
                    (1, w-tes-ctr-pre)    to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GD"                 to   v-edm                  .
           move      11                   to   v-lin                  .
           add       w-tes-ctr-pre        to   v-lin                  .
           move      14                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           if        w-tes-ctr-pre        >    1
                     move  "[1] "         to   v-pfk (14)             .
           move      w-tes-rim-pre
                    (1, w-tes-ctr-pre)    to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-rim-pre-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-rim-pre-999.
       acc-rim-pre-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-rim-pre
                                              (1, w-tes-ctr-pre)      .
       acc-rim-pre-300.
      *              *-------------------------------------------------*
      *              * Se 'Pf1'                                        *
      *              *-------------------------------------------------*
           if        v-key                not  = "[1] "
                     go to acc-rim-pre-400.
       acc-rim-pre-320.
      *                  *---------------------------------------------*
      *                  * Copia della linea precedente                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione contatore di comodo        *
      *                      *-----------------------------------------*
           move      w-tes-ctr-pre        to   w-tes-ctr-p01          .
           subtract  1                    from w-tes-ctr-p01          .
      *                      *-----------------------------------------*
      *                      * Rimanenza finale                        *
      *                      *-----------------------------------------*
           move      w-tes-rim-pre
                    (1, w-tes-ctr-p01)    to   w-tes-rim-pre
                                              (1, w-tes-ctr-pre)      .
      *                      *-----------------------------------------*
      *                      * Costo medio ponderato                   *
      *                      *-----------------------------------------*
           move      w-tes-ump-pre
                    (1, w-tes-ctr-p01)    to   w-tes-ump-pre
                                              (1, w-tes-ctr-pre)      .
      *                      *-----------------------------------------*
      *                      * Valore normale del bene                 *
      *                      *-----------------------------------------*
           move      w-tes-vnb-pre
                    (1, w-tes-ctr-p01)    to   w-tes-vnb-pre
                                              (1, w-tes-ctr-pre)      .
       acc-rim-pre-340.
      *                  *---------------------------------------------*
      *                  * Visualizzazione della linea attuale         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Rimanenza finale                        *
      *                      *-----------------------------------------*
           perform   vis-rim-pre-000      thru vis-rim-pre-999        .
      *                      *-----------------------------------------*
      *                      * Costo medio ponderato                   *
      *                      *-----------------------------------------*
           perform   vis-ump-pre-000      thru vis-ump-pre-999        .
      *                      *-----------------------------------------*
      *                      * Valore normale del bene                 *
      *                      *-----------------------------------------*
           perform   vis-vnb-pre-000      thru vis-vnb-pre-999        .
       acc-rim-pre-360.
      *                  *---------------------------------------------*
      *                  * Forzatura tasto 'Down'                      *
      *                  *---------------------------------------------*
           move      "DOWN"               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A tasto 'Do'                                *
      *                  *---------------------------------------------*
           go to     acc-rim-pre-800.
       acc-rim-pre-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-rim-pre-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rim-pre-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-rim-pre-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-rim-pre-100.
       acc-rim-pre-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Esercizio precedente - rimanenza  *
      *    *                         finale                            *
      *    *-----------------------------------------------------------*
       vis-rim-pre-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      w-tes-ese-pre-ndq
                    (1, w-tes-ctr-pre)    to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GD"                 to   v-edm                  .
           move      11                   to   v-lin                  .
           add       w-tes-ctr-pre        to   v-lin                  .
           move      14                   to   v-pos                  .
           move      w-tes-rim-pre
                    (1, w-tes-ctr-pre)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rim-pre-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Esercizio precedente - costo medio   *
      *    *                      ponderato                            *
      *    *-----------------------------------------------------------*
       acc-ump-pre-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di linea         *
      *                  *---------------------------------------------*
           move      11                   to   w-ind-lin-att          .
           add       w-tes-ctr-pre        to   w-ind-lin-att          .
           perform   vis-ind-lin-000      thru vis-ind-lin-999        .
       acc-ump-pre-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           add       02                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "GD"                 to   v-edm                  .
           move      11                   to   v-lin                  .
           add       w-tes-ctr-pre        to   v-lin                  .
           move      32                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-ump-pre
                    (1, w-tes-ctr-pre)    to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-ump-pre-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-ump-pre-999.
       acc-ump-pre-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-ump-pre
                                              (1, w-tes-ctr-pre)      .
       acc-ump-pre-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-ump-pre-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-ump-pre-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-ump-pre-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-ump-pre-100.
       acc-ump-pre-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Esercizio precedente - costo      *
      *    *                         medio ponderato                   *
      *    *-----------------------------------------------------------*
       vis-ump-pre-000.
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           add       02                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "GD"                 to   v-edm                  .
           move      11                   to   v-lin                  .
           add       w-tes-ctr-pre        to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-tes-ump-pre
                    (1, w-tes-ctr-pre)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-ump-pre-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Esercizio precedente - valore del    *
      *    *                      bene nell'ultimo trimestre           *
      *    *-----------------------------------------------------------*
       acc-vnb-pre-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di linea         *
      *                  *---------------------------------------------*
           move      11                   to   w-ind-lin-att          .
           add       w-tes-ctr-pre        to   w-ind-lin-att          .
           perform   vis-ind-lin-000      thru vis-ind-lin-999        .
       acc-vnb-pre-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           add       02                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "GD"                 to   v-edm                  .
           move      11                   to   v-lin                  .
           add       w-tes-ctr-pre        to   v-lin                  .
           move      49                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-vnb-pre
                    (1, w-tes-ctr-pre)    to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-vnb-pre-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-vnb-pre-999.
       acc-vnb-pre-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-vnb-pre
                                              (1, w-tes-ctr-pre)      .
       acc-vnb-pre-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-vnb-pre-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di rivalutazione       *
      *                  *---------------------------------------------*
           if        w-tes-vnb-pre
                    (1, w-tes-ctr-pre)    =    zero
                     move  spaces         to   w-tes-fdr-pre
                                              (1, w-tes-ctr-pre)      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione flag di rivalutazione       *
      *                  *---------------------------------------------*
           perform   vis-fdr-pre-000      thru vis-fdr-pre-999        .
       acc-vnb-pre-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-vnb-pre-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-vnb-pre-100.
       acc-vnb-pre-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Esercizio precedente - valore del *
      *    *                         bene nell'ultimo trimestre        *
      *    *-----------------------------------------------------------*
       vis-vnb-pre-000.
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           add       02                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "GD"                 to   v-edm                  .
           move      11                   to   v-lin                  .
           add       w-tes-ctr-pre        to   v-lin                  .
           move      49                   to   v-pos                  .
           move      w-tes-vnb-pre
                    (1, w-tes-ctr-pre)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-vnb-pre-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Esercizio precedente - flag di ri-   *
      *    *                      valutazione                          *
      *    *-----------------------------------------------------------*
       acc-fdr-pre-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-tes-vnb-pre
                    (1, w-tes-ctr-pre)    =    zero
                     go to acc-fdr-pre-999.
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di linea         *
      *                  *---------------------------------------------*
           move      11                   to   w-ind-lin-att          .
           add       w-tes-ctr-pre        to   w-ind-lin-att          .
           perform   vis-ind-lin-000      thru vis-ind-lin-999        .
       acc-fdr-pre-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      11                   to   v-lin                  .
           add       w-tes-ctr-pre        to   v-lin                  .
           move      72                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-fdr-pre
                    (1, w-tes-ctr-pre)    to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-fdr-pre-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-fdr-pre-999.
       acc-fdr-pre-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-fdr-pre
                                              (1, w-tes-ctr-pre)      .
       acc-fdr-pre-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se valore accettabile                  *
      *                  *---------------------------------------------*
           if        w-tes-vnb-pre
                    (1, w-tes-ctr-pre)    =    zero
                     go to acc-fdr-pre-420
           else      go to acc-fdr-pre-600.
       acc-fdr-pre-420.
      *                      *-----------------------------------------*
      *                      * Se valore del bene a zero               *
      *                      *-----------------------------------------*
           if        w-tes-fdr-pre
                    (1, w-tes-ctr-pre)    =    spaces
                     go to acc-fdr-pre-600
           else      go to acc-fdr-pre-100.
       acc-fdr-pre-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Eventuale conversione del valore in 'S'     *
      *                  *---------------------------------------------*
           if        w-tes-fdr-pre
                    (1, w-tes-ctr-pre)    =    spaces
                     go to acc-fdr-pre-800.
           if        w-tes-fdr-pre
                    (1, w-tes-ctr-pre)    =    "S"
                     go to acc-fdr-pre-800.
           move      "S"                  to   w-tes-fdr-pre
                                              (1, w-tes-ctr-pre)      .
      *                  *---------------------------------------------*
      *                  * Rivisualizzazione flag di rivalutazione     *
      *                  *---------------------------------------------*
           perform   vis-fdr-pre-000      thru vis-fdr-pre-999        .
       acc-fdr-pre-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-fdr-pre-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-fdr-pre-100.
       acc-fdr-pre-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Esercizio precedente - flag di    *
      *    *                         rivalutazione                     *
      *    *-----------------------------------------------------------*
       vis-fdr-pre-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      11                   to   v-lin                  .
           add       w-tes-ctr-pre        to   v-lin                  .
           move      72                   to   v-pos                  .
           move      w-tes-fdr-pre
                    (1, w-tes-ctr-pre)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-fdr-pre-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Esercizio precedente - indicatore *
      *    *                         di linea                          *
      *    *-----------------------------------------------------------*
       vis-ind-lin-000.
      *              *-------------------------------------------------*
      *              * Se linea attuale uguale alla precedente : nes-  *
      *              * suna azione                                     *
      *              *-------------------------------------------------*
           if        w-ind-lin-att        =    w-ind-lin-pre
                     go to vis-ind-lin-999.
      *              *-------------------------------------------------*
      *              * Se linea precedente a zero : nessuna visualiz-  *
      *              * zazione                                         *
      *              *-------------------------------------------------*
           if        w-ind-lin-pre        =    zero
                     go to vis-ind-lin-200.
      *              *-------------------------------------------------*
      *              * Visualizzazione indicatore alla linea preceden- *
      *              * te a spazi                                      *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      w-ind-lin-pre        to   v-lin                  .
           move      06                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-ind-lin-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione linea attuale in linea pre-     *
      *              * cedente                                         *
      *              *-------------------------------------------------*
           move      w-ind-lin-att        to   w-ind-lin-pre          .
      *              *-------------------------------------------------*
      *              * Se linea attuale a zero : nessuna visualizza-   *
      *              * zione                                           *
      *              *-------------------------------------------------*
           if        w-ind-lin-att        =    zero
                     go to vis-ind-lin-999.
      *              *-------------------------------------------------*
      *              * Visualizzazione indicatore alla linea attuale   *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      w-ind-lin-att        to   v-lin                  .
           move      06                   to   v-pos                  .
           move      "<"                  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-ind-lin-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi chiave           *
      *    *-----------------------------------------------------------*
       cnt-tdo-key-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-key-flg      .
       cnt-tdo-key-999.
           exit.
           
      *    *===========================================================*
      *    * Controllo se chiave vuota                                 *
      *    *-----------------------------------------------------------*
       cnt-key-vuo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-key-vuo-flg      .
      *              *-------------------------------------------------*
      *              * Test                                            *
      *              *-------------------------------------------------*
           if        w-tes-num-mag        =    zero
                     move  "#"            to   w-cnt-key-vuo-flg      .
       cnt-key-vuo-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi non chiave       *
      *    *-----------------------------------------------------------*
       cnt-tdo-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-nok-flg      .
       cnt-tdo-nok-999.
           exit.
           
      *    *===========================================================*
      *    * Normalizzazione dati chiave e non chiave                  *
      *    *-----------------------------------------------------------*
       nor-key-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione dati chiave                     *
      *              *-------------------------------------------------*
           perform   nor-key-reg-000      thru nor-key-reg-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave testata         *
      *              *-------------------------------------------------*
           perform   nor-nok-tes-000      thru nor-nok-tes-999        .
       nor-key-nok-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati chiave                               *
      *    *-----------------------------------------------------------*
       nor-key-reg-000.
           move      zero                 to   w-tes-num-mag          .
           move      spaces               to   w-tes-num-mag-alf      .
           move      spaces               to   w-tes-num-mag-des      .
           move      spaces               to   w-tes-num-mag-udm      .
           move      zero                 to   w-tes-num-mag-ndq      .
       nor-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave testata                   *
      *    *-----------------------------------------------------------*
       nor-nok-tes-000.
           move      zero                 to   w-tes-vnb-gea (1)      .
           move      spaces               to   w-tes-fdr-gea (1)      .
       nor-nok-tes-200.
           move      zero                 to   w-tes-ctr-pre          .
       nor-nok-tes-220.
           add       1                    to   w-tes-ctr-pre          .
           if        w-tes-ctr-pre        >    10
                     go to nor-nok-tes-999.
           move      zero                 to   w-tes-ese-pre-ann
                                              (1, w-tes-ctr-pre)      .
           move      spaces               to   w-tes-ese-pre-udm
                                              (1, w-tes-ctr-pre)      .
           move      zero                 to   w-tes-ese-pre-ndq
                                              (1, w-tes-ctr-pre)      .
           move      zero                 to   w-tes-rim-pre
                                              (1, w-tes-ctr-pre)      .
           move      zero                 to   w-tes-ump-pre
                                              (1, w-tes-ctr-pre)      .
           move      zero                 to   w-tes-vnb-pre
                                              (1, w-tes-ctr-pre)      .
           move      spaces               to   w-tes-fdr-pre
                                              (1, w-tes-ctr-pre)      .
           go to     nor-nok-tes-220.
       nor-nok-tes-999.
           exit.

      *    *===========================================================*
      *    * Lettura registrazione pre-esistente                       *
      *    *-----------------------------------------------------------*
       rou-let-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-let-reg      .
       rou-let-reg-020.
      *              *-------------------------------------------------*
      *              * Lettura                                         *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "ESECOD    "         to   f-key                  .
           move      w-tes-ann-ese        to   rf-mmv-ann-ese         .
           move      w-tes-tip-mag        to   rf-mmv-tip-mag         .
           move      w-tes-num-mag        to   rf-mmv-num-mag         .
           move      "pgm/mag/fls/ioc/obj/iofmmv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmv                 .
      *                  *---------------------------------------------*
      *                  * Test su esito lettura                       *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to rou-let-reg-100.
       rou-let-reg-040.
      *                  *---------------------------------------------*
      *                  * Se record non trovato                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           if        w-tes-tip-mag        =    01
                     go to rou-let-reg-041
           else if   w-tes-tip-mag        =    02
                     go to rou-let-reg-042
           else if   w-tes-tip-mag        =    03
                     go to rou-let-reg-043
           else if   w-tes-tip-mag        =    04
                     go to rou-let-reg-044.
       rou-let-reg-041.
      *                          *-------------------------------------*
      *                          * Se prodotto                         *
      *                          *-------------------------------------*
           move      "Scheda L.I.F.O. relativa al codice prodotto non es
      -              "istente !      "    to   w-err-box-err-msg      .
      *                              *---------------------------------*
      *                              * A box di errore                 *
      *                              *---------------------------------*
           go to     rou-let-reg-050.
       rou-let-reg-042.
      *                          *-------------------------------------*
      *                          * Se semilavorato                     *
      *                          *-------------------------------------*
           move      "Scheda L.I.F.O. relativa al codice semilavorato no
      -              "n esistente !  "    to   w-err-box-err-msg      .
      *                              *---------------------------------*
      *                              * A box di errore                 *
      *                              *---------------------------------*
           go to     rou-let-reg-050.
       rou-let-reg-043.
      *                          *-------------------------------------*
      *                          * Se materia prima                    *
      *                          *-------------------------------------*
           move      "Scheda L.I.F.O. relativa alla materia prima non es
      -              "istente !      "    to   w-err-box-err-msg      .
      *                              *---------------------------------*
      *                              * A box di errore                 *
      *                              *---------------------------------*
           go to     rou-let-reg-050.
       rou-let-reg-044.
      *                          *-------------------------------------*
      *                          * Se materiale vario                  *
      *                          *-------------------------------------*
           move      "Scheda L.I.F.O. relativa al codice del materiale n
      -              "on esistente ! "    to   w-err-box-err-msg      .
      *                              *---------------------------------*
      *                              * A box di errore                 *
      *                              *---------------------------------*
           go to     rou-let-reg-050.
       rou-let-reg-050.
      *                      *-----------------------------------------*
      *                      * Box di errore                           *
      *                      *-----------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * Flag di errore                          *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-rou-let-reg      .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     rou-let-reg-900.
       rou-let-reg-100.
      *                  *---------------------------------------------*
      *                  * Se record trovato                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo funzionamento : Modifica           *
      *                      *-----------------------------------------*
           move      "M"                  to   w-cnt-mfu-tip-fun      .
      *                      *-----------------------------------------*
      *                      * Determinazione valori attuali           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Valori contenuti direttamente in    *
      *                          * record [mmv]                        *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Esercizio attuale               *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Valore normale del bene     *
      *                                  *-----------------------------*
           move      rf-mmv-vnb-gea       to   w-tes-vnb-gea (1)      .
      *                                  *-----------------------------*
      *                                  * Flag di rivalutazione       *
      *                                  *-----------------------------*
           move      rf-mmv-fdr-gea       to   w-tes-fdr-gea (1)      .
      *                              *---------------------------------*
      *                              * 10 esercizi precedenti          *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Preparazione anno           *
      *                                  *-----------------------------*
           move      w-tes-ann-ese        to   w-acc-ann-est-ann      .
           add       1900                 to   w-acc-ann-est-ann      .
      *                                  *-----------------------------*
      *                                  * Ciclo 1..10                 *
      *                                  *-----------------------------*
           move      zero                 to   w-tes-ctr-pre          .
       rou-let-reg-220.
           add       1                    to   w-tes-ctr-pre          .
           if        w-tes-ctr-pre        >    10
                     go to rou-let-reg-300.
      *                                  *-----------------------------*
      *                                  * Anno                        *
      *                                  *-----------------------------*
           subtract  1                    from w-acc-ann-est-ann      .
           move      w-acc-ann-est-ann    to   w-tes-ese-pre-ann
                                              (1, w-tes-ctr-pre)      .
      *                                  *-----------------------------*
      *                                  * Unita' di misura            *
      *                                  *-----------------------------*
           move      w-tes-num-mag-udm    to   w-tes-ese-pre-udm
                                              (1, w-tes-ctr-pre)      .
      *                                  *-----------------------------*
      *                                  * Decimali quantita'          *
      *                                  *-----------------------------*
           move      w-tes-num-mag-ndq    to   w-tes-ese-pre-ndq
                                              (1, w-tes-ctr-pre)      .
      *                                  *-----------------------------*
      *                                  * Rimanenza finale            *
      *                                  *-----------------------------*
           move      rf-mmv-rim-pre
                    (w-tes-ctr-pre)       to   w-tes-rim-pre
                                              (1, w-tes-ctr-pre)      .
      *                                  *-----------------------------*
      *                                  * Costo medio ponderato       *
      *                                  *-----------------------------*
           move      rf-mmv-ump-pre
                    (w-tes-ctr-pre)       to   w-tes-ump-pre
                                              (1, w-tes-ctr-pre)      .
      *                                  *-----------------------------*
      *                                  * Valore normale del bene     *
      *                                  *-----------------------------*
           move      rf-mmv-vnb-pre
                    (w-tes-ctr-pre)       to   w-tes-vnb-pre
                                              (1, w-tes-ctr-pre)      .
      *                                  *-----------------------------*
      *                                  * Flag di rivalutazione       *
      *                                  *-----------------------------*
           move      rf-mmv-fdr-pre
                    (w-tes-ctr-pre)       to   w-tes-fdr-pre
                                              (1, w-tes-ctr-pre)      .
      *                                  *-----------------------------*
      *                                  * Riciclo                     *
      *                                  *-----------------------------*
           go to     rou-let-reg-220.
       rou-let-reg-300.
      *                      *-----------------------------------------*
      *                      * Valori precedenti anagrafica            *
      *                      *-----------------------------------------*
           move      w-tes-val-aep (1)    to   w-tes-val-aep (2)      .
       rou-let-reg-800.
      *              *-------------------------------------------------*
      *              * Test per visualizzazione                        *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-vis-sgr    =    "V"
                     move  "V"            to   w-cnt-mfu-tip-fun      .
       rou-let-reg-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per inserimento                  *
      *    *-----------------------------------------------------------*
       pre-acc-ins-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-ins      .
       pre-acc-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per modifica                     *
      *    *-----------------------------------------------------------*
       pre-acc-mod-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-mod      .
       pre-acc-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per visualizzazione              *
      *    *-----------------------------------------------------------*
       pre-acc-vis-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-vis      .
       pre-acc-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-richiesta di ratifica tasto Delete            *
      *    *-----------------------------------------------------------*
       pre-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-snx-del      .
       pre-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-richiesta di ratifica tasto Delete           *
      *    *-----------------------------------------------------------*
       pos-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-snx-del      .
       pos-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su inserimento                          *
      *    *-----------------------------------------------------------*
       pos-exi-ins-000.
       pos-exi-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su modifica                             *
      *    *-----------------------------------------------------------*
       pos-exi-mod-000.
       pos-exi-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su visualizzazione                      *
      *    *-----------------------------------------------------------*
       pos-exi-vis-000.
       pos-exi-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di inserimento                      *
      *    *-----------------------------------------------------------*
       pos-cnf-ins-000.
      *              *-------------------------------------------------*
      *              * Scrittura movimento su files                    *
      *              *-------------------------------------------------*
           perform   scr-mov-fil-000      thru scr-mov-fil-999        .
       pos-cnf-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di modifica                         *
      *    *-----------------------------------------------------------*
       pos-cnf-mod-000.
      *              *-------------------------------------------------*
      *              * Scrittura movimento su files                    *
      *              *-------------------------------------------------*
           perform   scr-mov-fil-000      thru scr-mov-fil-999        .
       pos-cnf-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di annullamento                     *
      *    *-----------------------------------------------------------*
       pos-cnf-ann-000.
      *              *-------------------------------------------------*
      *              * Delete movimento da files                       *
      *              *-------------------------------------------------*
           perform   del-mov-fil-000      thru del-mov-fil-999        .
       pos-cnf-ann-999.
           exit.

      *    *===========================================================*
      *    * Scrittura movimento su file                               *
      *    *-----------------------------------------------------------*
       scr-mov-fil-000.
      *              *-------------------------------------------------*
      *              * Update file [mmv] per l'esercizio richiesto     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione della chiave                   *
      *                  *---------------------------------------------*
           move      w-tes-ann-ese        to   rf-mmv-ann-ese         .
           move      w-tes-tip-mag        to   rf-mmv-tip-mag         .
           move      w-tes-num-mag        to   rf-mmv-num-mag         .
      *                  *---------------------------------------------*
      *                  * Update record [mmv]                         *
      *                  *---------------------------------------------*
           perform   upd-rec-mmv-000      thru upd-rec-mmv-999        .
       scr-mov-fil-200.
      *              *-------------------------------------------------*
      *              * Se l'esercizio richiesto corrisponde all'ultimo *
      *              * completamente chiuso, si aggiorna il record re- *
      *              * lativo all'esercizio successivo a quello com-   *
      *              * pletamente chiuso, se esiste                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se determinato l'ultimo esercizio com- *
      *                  * pletamente chiuso                           *
      *                  *---------------------------------------------*
           if        w-tes-uec-chi        =    zero
                     go to scr-mov-fil-900.
      *                  *---------------------------------------------*
      *                  * Confronto con quello richiesto              *
      *                  *---------------------------------------------*
           if        w-tes-ann-ese        not  = w-tes-uec-chi
                     go to scr-mov-fil-900.
      *                  *---------------------------------------------*
      *                  * Composizione della chiave                   *
      *                  *---------------------------------------------*
           move      w-tes-ann-ese        to   rf-mmv-ann-ese         .
           add       1                    to   rf-mmv-ann-ese         .
           move      w-tes-tip-mag        to   rf-mmv-tip-mag         .
           move      w-tes-num-mag        to   rf-mmv-num-mag         .
      *                  *---------------------------------------------*
      *                  * Update record [mmv] per l'esercizio succes- *
      *                  * sivo rispetto a quello richiesto            *
      *                  *---------------------------------------------*
           perform   upd-att-mmv-000      thru upd-att-mmv-999        .
       scr-mov-fil-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     scr-mov-fil-999.
       scr-mov-fil-999.
           exit.

      *    *===========================================================*
      *    * Delete movimento da file                                  *
      *    *-----------------------------------------------------------*
       del-mov-fil-000.
       del-mov-fil-999.
           exit.

      *    *===========================================================*
      *    * Update record [mmv]                                       *
      *    *-----------------------------------------------------------*
       upd-rec-mmv-000.
      *              *-------------------------------------------------*
      *              * Lettura, con lock, del record [mmv]             *
      *              *-------------------------------------------------*
           perform   gtk-rec-mmv-000      thru gtk-rec-mmv-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to upd-rec-mmv-200.
       upd-rec-mmv-100.
      *              *-------------------------------------------------*
      *              * Se record [mmv] non esistente                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Scheda L.I.F.O. relativa al codice magazzino non t
      -              "rovata !       "    to   w-err-box-err-msg      .
      *                  *---------------------------------------------*
      *                  * Box di errore                               *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     upd-rec-mmv-900.
       upd-rec-mmv-200.
      *              *-------------------------------------------------*
      *              * Se record [mmv] esistente                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione nuovi dati nel record          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Esercizio attuale                       *
      *                      *-----------------------------------------*
           move      w-tes-vnb-gea (1)    to   rf-mmv-vnb-gea         .
           move      w-tes-fdr-gea (1)    to   rf-mmv-fdr-gea         .
      *                      *-----------------------------------------*
      *                      * Esercizio precedente : ciclo 1..10      *
      *                      *-----------------------------------------*
           move      zero                 to   w-tes-ctr-pre          .
       upd-rec-mmv-220.
           add       1                    to   w-tes-ctr-pre          .
           if        w-tes-ctr-pre        >    10
                     go to upd-rec-mmv-820.
      *                          *-------------------------------------*
      *                          * Rimanenza finale                    *
      *                          *-------------------------------------*
           move      w-tes-rim-pre
                    (1, w-tes-ctr-pre)    to   rf-mmv-rim-pre
                                              (w-tes-ctr-pre)         .
      *                          *-------------------------------------*
      *                          * Costo medio ponderato               *
      *                          *-------------------------------------*
           move      w-tes-ump-pre
                    (1, w-tes-ctr-pre)    to   rf-mmv-ump-pre
                                              (w-tes-ctr-pre)         .
      *                          *-------------------------------------*
      *                          * Valore normale del bene             *
      *                          *-------------------------------------*
           move      w-tes-vnb-pre
                    (1, w-tes-ctr-pre)    to   rf-mmv-vnb-pre
                                              (w-tes-ctr-pre)         .
      *                          *-------------------------------------*
      *                          * Flag di rivalutazione               *
      *                          *-------------------------------------*
           move      w-tes-fdr-pre
                    (1, w-tes-ctr-pre)    to   rf-mmv-fdr-pre
                                              (w-tes-ctr-pre)         .
       upd-rec-mmv-800.
      *                          *-------------------------------------*
      *                          * Riciclo                             *
      *                          *-------------------------------------*
           go to     upd-rec-mmv-220.
       upd-rec-mmv-820.
      *                  *---------------------------------------------*
      *                  * Update e release record [mmv]               *
      *                  *---------------------------------------------*
           perform   uer-rec-mmv-000      thru uer-rec-mmv-999        .
       upd-rec-mmv-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     upd-rec-mmv-999.
       upd-rec-mmv-999.
           exit.

      *    *===========================================================*
      *    * Update record [mmv] per l'esercizio attuale               *
      *    *-----------------------------------------------------------*
       upd-att-mmv-000.
      *              *-------------------------------------------------*
      *              * Lettura, con lock, del record [mmv]             *
      *              *-------------------------------------------------*
           perform   gtk-rec-mmv-000      thru gtk-rec-mmv-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to upd-att-mmv-200.
       upd-att-mmv-100.
      *              *-------------------------------------------------*
      *              * Se record [mmv] non esistente                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     upd-att-mmv-900.
       upd-att-mmv-200.
      *              *-------------------------------------------------*
      *              * Se record [mmv] esistente                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione nuovi dati nel record          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * I valori dell'esercizio attuale vanno   *
      *                      * posti nel 1. elemento del castelletto   *
      *                      * L.I.F.O.                                *
      *                      *-----------------------------------------*
           move      w-tes-vnb-gea (1)    to   rf-mmv-vnb-pre (1)     .
           move      w-tes-fdr-gea (1)    to   rf-mmv-fdr-pre (1)     .
       upd-att-mmv-210.
      *                      *-----------------------------------------*
      *                      * Esercizio precedente : ciclo 1..10 ma a *
      *                      * partire dal secondo elemento            *
      *                      *-----------------------------------------*
           move      1                    to   w-tes-ctr-pre          .
       upd-att-mmv-220.
           add       1                    to   w-tes-ctr-pre          .
           move      w-tes-ctr-pre        to   w-tes-ctr-p09          .
           subtract  1                    from w-tes-ctr-p09          .
           if        w-tes-ctr-pre        >    10
                     go to upd-att-mmv-820.
      *                  *---------------------------------------------*
      *                  * Rimanenza finale                            *
      *                  *---------------------------------------------*
           move      w-tes-rim-pre
                    (1, w-tes-ctr-p09)    to   rf-mmv-rim-pre
                                              (w-tes-ctr-pre)         .
      *                  *---------------------------------------------*
      *                  * Costo medio ponderato                       *
      *                  *---------------------------------------------*
           move      w-tes-ump-pre
                    (1, w-tes-ctr-p09)    to   rf-mmv-ump-pre
                                              (w-tes-ctr-pre)         .
      *                  *---------------------------------------------*
      *                  * Valore normale del bene                     *
      *                  *---------------------------------------------*
           move      w-tes-vnb-pre
                    (1, w-tes-ctr-p09)    to   rf-mmv-vnb-pre
                                              (w-tes-ctr-pre)         .
      *                  *---------------------------------------------*
      *                  * Flag di rivalutazione                       *
      *                  *---------------------------------------------*
           move      w-tes-fdr-pre
                    (1, w-tes-ctr-p09)    to   rf-mmv-fdr-pre
                                              (w-tes-ctr-pre)         .
       upd-att-mmv-800.
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     upd-att-mmv-220.
       upd-att-mmv-820.
      *                  *---------------------------------------------*
      *                  * Update e release record [mmv]               *
      *                  *---------------------------------------------*
           perform   uer-rec-mmv-000      thru uer-rec-mmv-999        .
       upd-att-mmv-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     upd-att-mmv-999.
       upd-att-mmv-999.
           exit.

      *    *===========================================================*
      *    * Get key record [mmv]                                      *
      *    *-----------------------------------------------------------*
       gtk-rec-mmv-000.
      *              *-------------------------------------------------*
      *              * Lettura, con lock, del record [mmv]             *
      *              *-------------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "ESECOD    "         to   f-key                  .
           move      "pgm/mag/fls/ioc/obj/iofmmv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmv                 .
       gtk-rec-mmv-999.
           exit.

      *    *===========================================================*
      *    * Update e release record [mmv]                             *
      *    *-----------------------------------------------------------*
       uer-rec-mmv-000.
      *              *-------------------------------------------------*
      *              * Update record [mmv]                             *
      *              *-------------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmv                 .
      *              *-------------------------------------------------*
      *              * Unlock record [mmv]                             *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmv                 .
       uer-rec-mmv-999.
           exit.

      *    *===========================================================*
      *    * Determinazione tipi magazzino ammessi                     *
      *    *-----------------------------------------------------------*
       det-tpm-amm-000.
      *              *-------------------------------------------------*
      *              * Preparazione area w-exp limitata ai soli tipi   *
      *              * magazzino previsti                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se e' attiva solamente la gestione dei      *
      *                  * Prodotti di vendita si forza come unico     *
      *                  * elemento nella lista                        *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        not  = "S" and
                     w-prs-dpm-snx        not  = "S" and
                     w-prs-mtv-snx        not  = "S"
                     move  01             to   w-exp-tip-mag-tpm (1)
                     move  01             to   w-exp-tpm-amm-num
                     go to det-tpm-amm-999.
      *                  *---------------------------------------------*
      *                  * Tipo magazzino 'Prodotto di vendita' :      *
      *                  * - Sempre ammesso                            *
      *                  *---------------------------------------------*
           move      01                   to   w-exp-tpm-amm-tpm (1)  .
      *                  *---------------------------------------------*
      *                  * Tipo magazzino 'Semilavorato' :             *
      *                  * - Se gestione semilavorati attiva lo si     *
      *                  *   inserisce nella lista, altrimenti no      *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        =    "S"
                     move  02             to   w-exp-tpm-amm-tpm (2)
           else      move  zero           to   w-exp-tpm-amm-tpm (2)  .
      *                  *---------------------------------------------*
      *                  * Tipo magazzino 'Materia Prima' :            *
      *                  * - Se gestione materie prime attiva lo si    *
      *                  *   inserisce nella lista, altrimenti no      *
      *                  *---------------------------------------------*
           if        w-prs-dpm-snx        =    "S"
                     move  03             to   w-exp-tpm-amm-tpm (3)
           else      move  zero           to   w-exp-tpm-amm-tpm (3)  .
      *                  *---------------------------------------------*
      *                  * Tipo magazzino 'Materiale Vario' :          *
      *                  * - Se gestione materiale vario attiva lo si  *
      *                  *   inserisce nella lista, altrimenti no      *
      *                  *---------------------------------------------*
           if        w-prs-mtv-snx        =    "S"
                     move  04             to   w-exp-tpm-amm-tpm (4)
           else      move  zero           to   w-exp-tpm-amm-tpm (4)  .
       det-tpm-amm-010.
      *              *-------------------------------------------------*
      *              * Compattamento della lista dei tipi magazzino    *
      *              * ammessi                                         *
      *              *-------------------------------------------------*
           if        w-exp-tpm-amm-tpm (1)
                                          =    zero
                     move  w-exp-tpm-amm-tpm (2)
                                          to   w-exp-tpm-amm-tpm (1)
                     move  w-exp-tpm-amm-tpm (3)
                                          to   w-exp-tpm-amm-tpm (2)
                     move  w-exp-tpm-amm-tpm (4)
                                          to   w-exp-tpm-amm-tpm (3)
                     move  zero           to   w-exp-tpm-amm-tpm (4)  .
           if        w-exp-tpm-amm-tpm (2)
                                          =    zero
                     move  w-exp-tpm-amm-tpm (3)
                                          to   w-exp-tpm-amm-tpm (2)
                     move  w-exp-tpm-amm-tpm (4)
                                          to   w-exp-tpm-amm-tpm (3)
                     move  zero           to   w-exp-tpm-amm-tpm (4)  .
           if        w-exp-tpm-amm-tpm (3)
                                          =    zero
                     move  w-exp-tpm-amm-tpm (4)
                                          to   w-exp-tpm-amm-tpm (3)
                     move  zero           to   w-exp-tpm-amm-tpm (4)  .
      *              *-------------------------------------------------*
      *              * Preparazione del numero di elementi in tabella  *
      *              * tipi magazzino ammessi                          *
      *              *-------------------------------------------------*
           move      zero                 to   w-exp-tpm-amm-num      .
       det-tpm-amm-020.
           add       1                    to   w-exp-tpm-amm-num      .
           if        w-exp-tpm-amm-num    >    4
                     move  4              to   w-exp-tpm-amm-num
                     go to det-tpm-amm-040.
           if        w-exp-tpm-amm-tpm
                    (w-exp-tpm-amm-num)   not  = zero
                     go to det-tpm-amm-020.
           subtract  1                    from w-exp-tpm-amm-num      .
       det-tpm-amm-040.
      *              *-------------------------------------------------*
      *              * Preparazione delle descrizioni relative ai tipi *
      *              * magazzino ammessi                               *
      *              *-------------------------------------------------*
           move      zero                 to   w-exp-tpm-amm-c01      .
       det-tpm-amm-100.
           add       1                    to   w-exp-tpm-amm-c01      .
           if        w-exp-tpm-amm-c01    >    w-exp-tip-mag-num
                     go to det-tpm-amm-999.
           move      zero                 to   w-exp-tpm-amm-c02      .
       det-tpm-amm-120.
           add       1                    to   w-exp-tpm-amm-c02      .
           if        w-exp-tpm-amm-c02    >    4
                     go to det-tpm-amm-100.
           if        w-exp-tpm-amm-tpm
                    (w-exp-tpm-amm-c01)   not  = w-exp-tip-mag-tpm
                                                (w-exp-tpm-amm-c02)
                     go to det-tpm-amm-120.
           move      w-exp-tip-mag-ele
                    (w-exp-tpm-amm-c02)   to   w-exp-tpm-amm-ele
                                              (w-exp-tpm-amm-c01)     .
           go to     det-tpm-amm-100.
       det-tpm-amm-999.
           exit.

      *    *===========================================================*
      *    * Determinazione dell'ultimo esercizio completamente chiuso *
      *    *-----------------------------------------------------------*
       det-uec-chi-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valore in uscita                *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-uec-chi-ese      .
       det-uec-chi-100.
      *              *-------------------------------------------------*
      *              * Open numerazione [datife]                       *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
       det-uec-chi-200.
      *              *-------------------------------------------------*
      *              * Determinazione dati relativi all'ultimo inven-  *
      *              * tario di fine esercizio                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [datife]             *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
      *                  *---------------------------------------------*
      *                  * Lettura record [datife]                     *
      *                  *---------------------------------------------*
           move      "RD"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
      *                  *---------------------------------------------*
      *                  * Se record non trovato : uscita con zero     *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-uec-chi-900.
       det-uec-chi-300.
      *              *-------------------------------------------------*
      *              * Test sull'anno di esercizio dell'inventario di  *
      *              * fine esercizio                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se a zero : uscita con zero                 *
      *                  *---------------------------------------------*
           if        rn-dat-ife-ese-ife   =    zero
                     go to det-uec-chi-900.
       det-uec-chi-400.
      *              *-------------------------------------------------*
      *              * Test sul flag di avanzamento inventario di fine *
      *              * esercizio                                       *
      *              *-------------------------------------------------*
           if        rn-dat-ife-flg-ife   not  = spaces
                     go to det-uec-chi-500.
       det-uec-chi-420.
      *                  *---------------------------------------------*
      *                  * Se inventario completamente eseguito        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Memorizzazione dell'ultimo esercizio    *
      *                      * chiuso                                  *
      *                      *-----------------------------------------*
           move      rn-dat-ife-ese-ife   to   w-det-uec-chi-ese      .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     det-uec-chi-900.
       det-uec-chi-500.
      *                  *---------------------------------------------*
      *                  * Se inventario in progresso                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Uscita con zero                         *
      *                      *-----------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     det-uec-chi-900.
       det-uec-chi-900.
      *              *-------------------------------------------------*
      *              * Close numerazione [datife]                      *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-uec-chi-999.
       det-uec-chi-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [dcp]                            *
      *    *-----------------------------------------------------------*
       let-arc-dcp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice Prodotto di vendita a zero       *
      *              *-------------------------------------------------*
           if        w-let-arc-dcp-num    =    zero
                     go to let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      w-let-arc-dcp-num    to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcp-400.
       let-arc-dcp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcp-alf-pro       to   w-let-arc-dcp-alf      .
           move      rf-dcp-des-pro       to   w-let-arc-dcp-des      .
           move      rf-dcp-umi-ven       to   w-let-arc-dcp-umi      .
           move      rf-dcp-dec-qta       to   w-let-arc-dcp-ndq      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcp-999.
       let-arc-dcp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcp-flg      .
           move      all   "."            to   w-let-arc-dcp-des      .
           go to     let-arc-dcp-600.
       let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-des      .
       let-arc-dcp-600.
           move      spaces               to   w-let-arc-dcp-alf      .
           move      spaces               to   w-let-arc-dcp-umi      .
           move      zero                 to   w-let-arc-dcp-ndq      .
       let-arc-dcp-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [dps]                            *
      *    *-----------------------------------------------------------*
       let-arc-dps-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dps-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice Prodotto di vendita a zero       *
      *              *-------------------------------------------------*
           if        w-let-arc-dps-num    =    zero
                     go to let-arc-dps-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMSEM    "         to   f-key                  .
           move      w-let-arc-dps-num    to   rf-dps-num-sem         .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dps-400.
       let-arc-dps-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dps-alf-sem       to   w-let-arc-dps-alf      .
           move      rf-dps-des-sem       to   w-let-arc-dps-des      .
           move      rf-dps-umi-prd       to   w-let-arc-dps-umi      .
           move      rf-dps-dec-qta       to   w-let-arc-dps-ndq      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dps-999.
       let-arc-dps-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dps-flg      .
           move      all   "."            to   w-let-arc-dps-des      .
           go to     let-arc-dps-600.
       let-arc-dps-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dps-des      .
       let-arc-dps-600.
           move      spaces               to   w-let-arc-dps-alf      .
           move      spaces               to   w-let-arc-dps-umi      .
           move      zero                 to   w-let-arc-dps-ndq      .
       let-arc-dps-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [dpm]                            *
      *    *-----------------------------------------------------------*
       let-arc-dpm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dpm-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice Prodotto di vendita a zero       *
      *              *-------------------------------------------------*
           if        w-let-arc-dpm-num    =    zero
                     go to let-arc-dpm-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMMAP    "         to   f-key                  .
           move      w-let-arc-dpm-num    to   rf-dpm-num-map         .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dpm-400.
       let-arc-dpm-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dpm-alf-map       to   w-let-arc-dpm-alf      .
           move      rf-dpm-des-map       to   w-let-arc-dpm-des      .
           move      rf-dpm-umi-prd       to   w-let-arc-dpm-umi      .
           move      rf-dpm-dec-qta       to   w-let-arc-dpm-ndq      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dpm-999.
       let-arc-dpm-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dpm-flg      .
           move      all   "."            to   w-let-arc-dpm-des      .
           go to     let-arc-dpm-600.
       let-arc-dpm-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dpm-des      .
       let-arc-dpm-600.
           move      spaces               to   w-let-arc-dpm-alf      .
           move      spaces               to   w-let-arc-dpm-umi      .
           move      zero                 to   w-let-arc-dpm-ndq      .
       let-arc-dpm-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [mtv]                            *
      *    *-----------------------------------------------------------*
       let-arc-mtv-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-mtv-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice Materiale vario a zero           *
      *              *-------------------------------------------------*
           if        w-let-arc-mtv-num    =    zero
                     go to let-arc-mtv-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMMTV    "         to   f-key                  .
           move      w-let-arc-mtv-num    to   rf-mtv-num-mtv         .
           move      "pgm/mtv/fls/ioc/obj/iofmtv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mtv                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-mtv-400.
       let-arc-mtv-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-mtv-alf-mtv       to   w-let-arc-mtv-alf      .
           move      rf-mtv-des-mtv       to   w-let-arc-mtv-des      .
           move      rf-mtv-umi-gst       to   w-let-arc-mtv-umi      .
           move      rf-mtv-dec-qta       to   w-let-arc-mtv-ndq      .
           move      rf-mtv-snx-mag       to   w-let-arc-mtv-snm      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-mtv-999.
       let-arc-mtv-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-mtv-flg      .
           move      all   "."            to   w-let-arc-mtv-des      .
           go to     let-arc-mtv-600.
       let-arc-mtv-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-mtv-des      .
       let-arc-mtv-600.
           move      spaces               to   w-let-arc-mtv-alf      .
           move      spaces               to   w-let-arc-mtv-umi      .
           move      zero                 to   w-let-arc-mtv-ndq      .
           move      spaces               to   w-let-arc-mtv-snm      .
       let-arc-mtv-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

      *    *===========================================================*
      *    * Subroutines per accettazione codice prodotto 'dcp'        *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acoddcp0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per accettazione codice semilavorato          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dps/prg/cpy/acoddps0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per accettazione codice materia prima         *
      *    *-----------------------------------------------------------*
           copy      "pgm/dpm/prg/cpy/acoddpm0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per accettazione codice materiale vario       *
      *    *-----------------------------------------------------------*
           copy      "pgm/mtv/prg/cpy/acodmtv0.acs"                   .
