       Identification division.
       Program-Id.                                 pmag3341           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    mag                 *
      *                                Settore:    mov                 *
      *                                   Fase:    mag334              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 30/11/98    *
      *                       Ultima revisione:    NdK del 07/06/22    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione stampa per il programma pmag3340 *
      *                                                                *
      *                    Stampa riepilogo movimenti materie prime    *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "mag"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "mov"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "mag334"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pmag3341"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "STAMPA RIEPILOGO MOVIMENTI MATERIE PRIME"       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records logici                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [dpm]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dpm/fls/rec/rfdpm"                          .
      *        *-------------------------------------------------------*
      *        * [mmr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmmr"                          .
      *        *-------------------------------------------------------*
      *        * [zmc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfzmc"                          .
      *        *-------------------------------------------------------*
      *        * [zmm]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfzmm"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [age]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/age/fls/rec/rfage"                          .

      *    *===========================================================*
      *    * Area di interfaccia per sottoprogramma         "pazi000d" *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/pazi000d.pgl"                   .

      *    *===========================================================*
      *    * Work-area richieste                                       *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Mese di chiusura esercizio                            *
      *        *-------------------------------------------------------*
           05  rr-mes-chi                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza in uso                              *
      *        *-------------------------------------------------------*
           05  rr-dpz-inu                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Denominazione dipendenza in uso                       *
      *        *-------------------------------------------------------*
           05  rr-dpz-inu-den             pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Numero globale dipendenze                             *
      *        *-------------------------------------------------------*
           05  rr-dpz-ctr-dpz             pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice filtro di selezione                            *
      *        *-------------------------------------------------------*
           05  rr-fso-dpm                 pic  9(08)                  .
           05  rr-fso-dpm-alf redefines
               rr-fso-dpm                 pic  x(08)                  .
           05  rr-fso-dpm-des             pic  x(40)                  .
           05  rr-fso-dpm-ord             pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Data minima movimenti da stampare                     *
      *        *-------------------------------------------------------*
           05  rr-dat-min                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Data massima movimenti da stampare                    *
      *        *-------------------------------------------------------*
           05  rr-dat-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Esercizio relativo alla data minima                   *
      *        *-------------------------------------------------------*
           05  rr-ese-min                 pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Esercizio relativo alla data massima                  *
      *        *-------------------------------------------------------*
           05  rr-ese-max                 pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Si/No solo se esiste almeno un movimento nel periodo  *
      *        * - 01 : Stampa solo materie prime movimentate          *
      *        * - 02 : Materie prime movimentate o con sola giacenza  *
      *        * - 03 : Nessuna selezione su quantita'                 *
      *        *-------------------------------------------------------*
           05  rr-snx-aum                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Si/No stampa riepiloghi                               *
      *        * - 1 : No                                              *
      *        * - 2 : Si                                              *
      *        *-------------------------------------------------------*
           05  rr-snx-rie                 pic  9(01)                  .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  filler                 pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per stampa scheda movimenti di magazzino rela-  *
      *    * tivi alle anagrafiche di [dpm]                            *
      *    *-----------------------------------------------------------*
       01  w-ssm-dpm.
      *        *-------------------------------------------------------*
      *        * Dati in input di carattere generale                   *
      *        *-------------------------------------------------------*
           05  w-ssm-dpm-inp-gen.
      *            *---------------------------------------------------*
      *            * Ragione sociale azienda allineata a sinistra      *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-des-azi      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza interessata                     *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-cod-dpz      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Descrizione per codice dipendenza interessata     *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-des-dpz      pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Numero dipendenze esistenti per l'azienda         *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-ctr-dpz      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Descrizione per la stampa relativa al codice di-  *
      *            * pendenza interessata                              *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-des-dds      pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Data minima movimenti da stampare                 *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-dat-min      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data minima movimenti da stampare diminuita di un *
      *            * giorno                                            *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-dat-mmu      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data massima movimenti da stampare                *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-dat-max      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Si/No solo se esiste almeno un movimento nel pe-  *
      *            * riodo selezionato                                 *
      *            *                                                   *
      *            * - 01 : Stampa solo materie prime movimentate      *
      *            * - 02 : Materie prime movimentate o con giacenza   *
      *            * - 03 : Nessuna selezione su quantita'             *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-snx-aum      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Si/No interlinea di separazione tra i singoli mo- *
      *            * vimenti di una scheda                             *
      *            *  - 01 : No                                        *
      *            *  - 02 : Si                                        *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-snx-ids      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Indici elementi in tabella per 'Riferimenti ed    *
      *            * Annotazioni' : se zero non si stampa l'elemento   *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-iit-rea.
      *                *-----------------------------------------------*
      *                * Valore movimento e valore unitario            *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-iit-vmu  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Ragione sociale archivio                      *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-iit-arc  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Data e numero documento                       *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-iit-doc  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Data e numero documento di riferimento        *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-iit-rif  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Unita' di misura di espressione del movimento *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-iit-umi  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Conto merce                                   *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-iit-mic  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Numero partita di magazzino                   *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-iit-pam  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Sigla variante di magazzino                   *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-iit-vam  pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Dati in input relativi all'anagrafica in esame        *
      *        *-------------------------------------------------------*
           05  w-ssm-dpm-inp-ana.
      *            *---------------------------------------------------*
      *            * Tipo codice di magazzino                          *
      *            *   - 01 : Prodotto di vendita                      *
      *            *   - 02 : Semilavorato                             *
      *            *   - 03 : Materia prima                            *
      *            *   - 04 : Materiale vario                          *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-tip-mag      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice numerico di magazzino                      *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-num-mag      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice alfanumerico di magazzino                  *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-alf-mag      pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Descrizione per il codice di magazzino            *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-des-mag      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice classe merceologica di appartenenza        *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-cla-mag      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice gruppo merceologico di appartenenza        *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-gru-mag      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice sottogruppo merceologico di appartenenza   *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-sgr-mag      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo di elemento                                  *
      *            *   - Se prodotto di vendita                        *
      *            *       - 01 : Merce                                *
      *            *       - 02 : Servizio                             *
      *            *       - 03 : Imballo                              *
      *            *       - 04 : Extra attivita' aziendale            *
      *            *   - Se semilavorato                               *
      *            *       - 00 : Semilavorato intermedio di un ciclo  *
      *            *              di lavorazione                       *
      *            *       - 01 : Semilavorato finale di un ciclo di   *
      *            *              lavorazione                          *
      *            *   - Se materia prima                              *
      *            *       - 00 : Valore fisso, non significativo      *
      *            *   - Se materiale vario                            *
      *            *       - 00 : Valore fisso, non significativo      *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-tip-psm      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Unita' di misura per la gestione magazzino        *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-umi-mag      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Numero decimali quantita' per la gestione magaz-  *
      *            * zino                                              *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-dec-qta      pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo di variante per la gestione magazzino        *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-tdv-mag      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Area libera per espansioni speciali associata al- *
      *            * l'anagrafica dell'elemento                        *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-alx-ana      pic  x(80)                  .
      *        *-------------------------------------------------------*
      *        * Work per la routine di selezione                      *
      *        *-------------------------------------------------------*
           05  w-ssm-dpm-sel-rec.
      *            *---------------------------------------------------*
      *            * Flag di uscita da routine di selezione            *
      *            *   - Spaces : Selezione superata                   *
      *            *   - #      : Selezione non superata               *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-flg-sel      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag che indica se esiste almeno un movimento nel *
      *            * periodo                                           *
      *            *   - Spaces : No, non esiste nemmeno un movimento  *
      *            *              tra la data minima e massima         *
      *            *   - #      : Si, esiste almeno un movimento       *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-aum-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per la routine di stampa                         *
      *        *-------------------------------------------------------*
           05  w-ssm-dpm-stp-rec.
      *            *---------------------------------------------------*
      *            * Flag di uscita da routine di stampa               *
      *            *   - Spaces : Tutto Ok                             *
      *            *   - #      : Interruzione forzata della stampa    *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-flg-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina per la stampa                       *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-npg-stp      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero movimenti stampati in totale per il codice *
      *            * di magazzino                                      *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-nmc-stp      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero linee per righe movimenti stampate nella   *
      *            * pagina                                            *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-nlp-stp      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per i valori relativi al singolo movimento       *
      *        *-------------------------------------------------------*
           05  w-ssm-dpm-mov-mag.
      *            *---------------------------------------------------*
      *            * Data di registrazione                             *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-dtr      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice causale di magazzino                       *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-ccm      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione causale di magazzino                  *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-dcm      pic  x(30)                  .
      *            *---------------------------------------------------*
      *            * Quantita' del movimento                           *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-qdm      pic s9(08)v9(03)            .
      *            *---------------------------------------------------*
      *            * Quantita' di carico                               *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-qdc      pic s9(08)v9(03)            .
      *            *---------------------------------------------------*
      *            * Quantita' di scarico                              *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-qds      pic s9(08)v9(03)            .
      *            *---------------------------------------------------*
      *            * Tipo di archivio                                  *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-ati      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice archivio                                   *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-aco      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza per il codice archivio          *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-adp      pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Descrizione per codice archivio/dipendenza        *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-ade      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Data documento                                    *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-ddo      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero documento                                  *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-ndo      pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Data documento di riferimento                     *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-dri      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero documento di riferimento                   *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-nri      pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Unita' di misura contenuta in anagrafica al mo-   *
      *            * mento della registrazione del movimento           *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-uma      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Unita' di misura utilizzata per il movimento      *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-umm      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Tipo di movimento                                 *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-tmo      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Trattamento merce in conto                        *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-tmc      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo merce in conto                               *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-xmc      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice merce in conto                             *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-cmc      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Descrizione merce in conto                        *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-dmc      pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Numero partita di magazzino                       *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-npm      pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Variante di magazzino                             *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-vdm      pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Costo unitario per movimento di magazzino         *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-cun      pic  9(09)v9(02)            .
      *            *---------------------------------------------------*
      *            * Valore totale per movimento di magazzino          *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-mov-vto      pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Work per la totalizzatori per codice di magazzino     *
      *        *-------------------------------------------------------*
           05  w-ssm-dpm-tpc-tot.
      *            *---------------------------------------------------*
      *            * Totali 'Magazzino fisico'                         *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-tpc-mag.
      *                *-----------------------------------------------*
      *                * 'Inizio periodo'                              *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-mfi  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Carichi periodo'                             *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-mfc  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Scarichi periodo'                            *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-mfs  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Fine periodo'                                *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-mff  pic s9(08)v9(03)            .
      *            *---------------------------------------------------*
      *            * Totali 'Proprieta' inizio periodo'                *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-tpc-pri.
      *                *-----------------------------------------------*
      *                * 'Magazzino fisico'                            *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-pim  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Presso terzi'                                *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-pin  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Di terzi'                                    *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-pit  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Di proprieta''                               *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-pip  pic s9(08)v9(03)            .
      *            *---------------------------------------------------*
      *            * Totali 'Proprieta' fine periodo'                  *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-tpc-prf.
      *                *-----------------------------------------------*
      *                * 'Magazzino fisico'                            *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-pfm  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Presso terzi'                                *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-pfn  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Di terzi'                                    *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-pft  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Di proprieta''                               *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-pfp  pic s9(08)v9(03)            .
      *            *---------------------------------------------------*
      *            * Work-area locale per totalizzazioni               *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-tpc-war.
      *                *-----------------------------------------------*
      *                * Giacenza fisica inizio periodo                *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-wgf  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * Quantita' presso terzi inizio periodo         *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-wqn  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * Quantita' di terzi inizio periodo             *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-wqt  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * Saldo alla data minima per singola scheda di  *
      *                * saldi magazzino [mms]                         *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-wss  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * Indice di comodo 01..12                       *
      *                *-----------------------------------------------*
                   15  w-ssm-dpm-tpc-wix  pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Contatori ed indici di comodo                         *
      *        *-------------------------------------------------------*
           05  w-ssm-dpm-ctr-inx.
      *            *---------------------------------------------------*
      *            * Contatore per trailing blanks                     *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-ctr-t01      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Indice per istruzione 'move' parziale             *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-inx-m01      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Comodo per linee residue                          *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-ctr-res      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Aree di comodo per concatenamenti literals            *
      *        *-------------------------------------------------------*
           05  w-ssm-dpm-cct-ltr.
      *            *---------------------------------------------------*
      *            * Origine                                           *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-cct-org      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Destinazione                                      *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-cct-dst      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * 1. contatore                                      *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-cct-c01      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * 2. contatore                                      *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-cct-c02      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Indice                                            *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-cct-inx      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Aree di comodo per ridefinizioni                      *
      *        *-------------------------------------------------------*
           05  w-ssm-dpm-red-rex.
      *            *---------------------------------------------------*
      *            * Formato s.aa.dd.nnnnnn                            *
      *            *---------------------------------------------------*
               10  w-ssm-dpm-red-sad      pic  9(11)                  .
               10  w-ssm-dpm-rex-sad-rrr  redefines
                   w-ssm-dpm-red-sad.
                   15  w-ssm-dpm-red-sad-scl
                                          pic  9(01)                  .
                   15  w-ssm-dpm-red-sad-ann
                                          pic  9(02)                  .
                   15  w-ssm-dpm-red-sad-dpz
                                          pic  9(02)                  .
                   15  w-ssm-dpm-red-sad-nnn
                                          pic  9(06)                  .
               10  w-ssm-dpm-red-san      pic  9(09)                  .
               10  w-ssm-dpm-rex-san-rrr  redefines
                   w-ssm-dpm-red-san.
                   15  w-ssm-dpm-red-san-scl
                                          pic  9(01)                  .
                   15  w-ssm-dpm-red-san-ann
                                          pic  9(02)                  .
                   15  w-ssm-dpm-red-san-nnn
                                          pic  9(06)                  .

      *    *===========================================================*
      *    * Work-area per totali                                      *
      *    *-----------------------------------------------------------*
       01  w-tot.
      *        *-------------------------------------------------------*
      *        * Totali generali                                       *
      *        *-------------------------------------------------------*
           05  w-tot-gen.
      *            *---------------------------------------------------*
      *            * Numero di elementi 'Magazzino fisico'             *
      *            *---------------------------------------------------*
               10  w-tot-gen-map-fis      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero di elementi 'Di terzi'                     *
      *            *---------------------------------------------------*
               10  w-tot-gen-map-dtz      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero di elementi 'Presso terzi'                 *
      *            *---------------------------------------------------*
               10  w-tot-gen-map-ptz      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero di elementi 'Di proprieta''                *
      *            *---------------------------------------------------*
               10  w-tot-gen-map-dpr      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Totali 'Magazzino fisico'                         *
      *            *---------------------------------------------------*
               10  w-tot-gen-fis.
      *                *-----------------------------------------------*
      *                * 'Inizio periodo'                              *
      *                *-----------------------------------------------*
                   15  w-tot-gen-fis-ini  pic s9(11)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Carichi'                                     *
      *                *-----------------------------------------------*
                   15  w-tot-gen-fis-car  pic s9(11)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Scarichi'                                    *
      *                *-----------------------------------------------*
                   15  w-tot-gen-fis-sca  pic s9(11)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Fine periodo'                                *
      *                *-----------------------------------------------*
                   15  w-tot-gen-fis-fin  pic s9(11)v9(03)            .
      *            *---------------------------------------------------*
      *            * Totali 'Di terzi'                                 *
      *            *---------------------------------------------------*
               10  w-tot-gen-dtz.
      *                *-----------------------------------------------*
      *                * 'Inizio periodo'                              *
      *                *-----------------------------------------------*
                   15  w-tot-gen-dtz-ini  pic s9(11)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Carichi'                                     *
      *                *-----------------------------------------------*
                   15  w-tot-gen-dtz-car  pic s9(11)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Scarichi'                                    *
      *                *-----------------------------------------------*
                   15  w-tot-gen-dtz-sca  pic s9(11)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Fine periodo'                                *
      *                *-----------------------------------------------*
                   15  w-tot-gen-dtz-fin  pic s9(11)v9(03)            .
      *            *---------------------------------------------------*
      *            * Totali 'Presso terzi'                             *
      *            *---------------------------------------------------*
               10  w-tot-gen-ptz.
      *                *-----------------------------------------------*
      *                * 'Inizio periodo'                              *
      *                *-----------------------------------------------*
                   15  w-tot-gen-ptz-ini  pic s9(11)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Carichi'                                     *
      *                *-----------------------------------------------*
                   15  w-tot-gen-ptz-car  pic s9(11)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Scarichi'                                    *
      *                *-----------------------------------------------*
                   15  w-tot-gen-ptz-sca  pic s9(11)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Fine periodo'                                *
      *                *-----------------------------------------------*
                   15  w-tot-gen-ptz-fin  pic s9(11)v9(03)            .
      *            *---------------------------------------------------*
      *            * Totali 'Di proprieta''                            *
      *            *---------------------------------------------------*
               10  w-tot-gen-dpr.
      *                *-----------------------------------------------*
      *                * 'Inizio periodo'                              *
      *                *-----------------------------------------------*
                   15  w-tot-gen-dpr-ini  pic s9(11)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Carichi'                                     *
      *                *-----------------------------------------------*
                   15  w-tot-gen-dpr-car  pic s9(11)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Scarichi'                                    *
      *                *-----------------------------------------------*
                   15  w-tot-gen-dpr-sca  pic s9(11)v9(03)            .
      *                *-----------------------------------------------*
      *                * 'Fine periodo'                                *
      *                *-----------------------------------------------*
                   15  w-tot-gen-dpr-fin  pic s9(11)v9(03)            .
      *            *---------------------------------------------------*
      *            * Comodo per il calcolo delle linee residue         *
      *            *---------------------------------------------------*
               10  w-tot-gen-lin-res      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Comodo per decimali quantita'                     *
      *            *---------------------------------------------------*
               10  w-tot-gen-dec-qta      pic  9(01)                  .

      *    *===========================================================*
      *    * Work-area per stampa                                      *
      *    *-----------------------------------------------------------*
       01  w-stp.
      *        *-------------------------------------------------------*
      *        * Work-area per stampa quantita'                        *
      *        *-------------------------------------------------------*
           05  w-stp-qta.
      *            *---------------------------------------------------*
      *            * Posizione di stampa                               *
      *            *---------------------------------------------------*
               10  w-stp-qta-pos          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Decimali quantita' da stampare                    *
      *            *---------------------------------------------------*
               10  w-stp-qta-dec          pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Quantita' da stampare                             *
      *            *---------------------------------------------------*
               10  w-stp-qta-qta          pic s9(11)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Work-area per stampa intestazione pagina              *
      *        *-------------------------------------------------------*
           05  w-stp-int.
      *            *---------------------------------------------------*
      *            * Flag di intestazione pagina da stampare           *
      *            *---------------------------------------------------*
               10  w-stp-int-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zmc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zmc.
               10  w-let-arc-zmc-flg      pic  x(01)                  .
               10  w-let-arc-zmc-cod      pic  9(05)                  .
               10  w-let-arc-zmc-des      pic  x(30)                  .
               10  w-let-arc-zmc-e10.
                   15  w-let-arc-zmc-e11  pic  z(04)9(01)             .
               10  w-let-arc-zmc-e20      pic  x(05)                  .
               10  w-let-arc-zmc-e30      pic  x(30)                  .
               10  w-let-arc-zmc-e90      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zmm]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zmm.
               10  w-let-arc-zmm-flg      pic  x(01)                  .
               10  w-let-arc-zmm-cod      pic  x(03)                  .
               10  w-let-arc-zmm-des      pic  x(20)                  .
               10  w-let-arc-zmm-e30      pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcc] o [cli]                *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcx.
               10  w-let-arc-dcx-flg      pic  x(01)                  .
               10  w-let-arc-dcx-cod      pic  9(07)                  .
               10  w-let-arc-dcx-dpz      pic  x(04)                  .
               10  w-let-arc-dcx-rag      pic  x(40)                  .
               10  w-let-arc-dcx-e10.
                   15  w-let-arc-dcx-e11  pic  z(06)9(01)             .
               10  w-let-arc-dcx-e20      pic  x(07)                  .
               10  w-let-arc-dcx-e30      pic  x(40)                  .
               10  w-let-arc-dcx-e90      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcf] o [fnt]                *
      *        *-------------------------------------------------------*
           05  w-let-arc-dfx.
               10  w-let-arc-dfx-flg      pic  x(01)                  .
               10  w-let-arc-dfx-cod      pic  9(07)                  .
               10  w-let-arc-dfx-dpz      pic  x(04)                  .
               10  w-let-arc-dfx-rag      pic  x(40)                  .
               10  w-let-arc-dfx-e10.
                   15  w-let-arc-dfx-e11  pic  z(06)9(01)             .
               10  w-let-arc-dfx-e20      pic  x(07)                  .
               10  w-let-arc-dfx-e30      pic  x(40)                  .
               10  w-let-arc-dfx-e90      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dpz]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dpz.
               10  w-let-arc-dpz-flg      pic  x(01)                  .
               10  w-let-arc-dpz-cod      pic  9(02)                  .
               10  w-let-arc-dpz-des      pic  x(20)                  .
               10  w-let-arc-dpz-e10.
                   15  w-let-arc-dpz-e11  pic  z(01)9(01)             .
               10  w-let-arc-dpz-e20      pic  x(02)                  .
               10  w-let-arc-dpz-e30      pic  x(20)                  .
               10  w-let-arc-dpz-e90      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [age]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-age.
               10  w-let-arc-age-flg      pic  x(01)                  .
               10  w-let-arc-age-cod      pic  9(07)                  .
               10  w-let-arc-age-nom      pic  x(20)                  .
               10  w-let-arc-age-rag      pic  x(40)                  .
               10  w-let-arc-age-via      pic  x(40)                  .
               10  w-let-arc-age-loc      pic  x(40)                  .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione saldi magazzino  *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldmag0.dtl"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Determinazione codici dipendenze per l'azienda  *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      "DA"                 to   w-dpz-tip-ope          .
           move      s-ter                to   w-dpz-ide-ter          .
           move      s-ute                to   w-dpz-ide-ute          .
           move      s-azi                to   w-dpz-ide-azi          .
           move      s-sap                to   w-dpz-ide-sap          .
           move      s-arg                to   w-dpz-ide-arg          .
           move      s-set                to   w-dpz-ide-set          .
           move      s-fas                to   w-dpz-ide-fas          .
           move      i-ide-des            to   w-dpz-ide-des          .
           move      s-pro                to   w-dpz-ide-pro          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [dpm]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * [mmr]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmr                 .
      *              *-------------------------------------------------*
      *              * [zmc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzmc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmc                 .
      *              *-------------------------------------------------*
      *              * [zmm]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzmm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmm                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [age]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *              *-------------------------------------------------*
      *              * Filtro per selezione ed ordinamento [dpm]       *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dpm/prg/obj/bzosdpm0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * Open modulo per la determinazione dei saldi di  *
      *              * magazzino                                       *
      *              *-------------------------------------------------*
           perform   det-sld-mag-opn-000  thru det-sld-mag-opn-999    .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [dpm]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * [mmr]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmr                 .
      *              *-------------------------------------------------*
      *              * [zmc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzmc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmc                 .
      *              *-------------------------------------------------*
      *              * [zmm]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzmm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmm                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [age]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *              *-------------------------------------------------*
      *              * Filtro per selezione ed ordinamento [dpm]       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dpm/prg/obj/bzosdpm0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *                  *---------------------------------------------*
      *                  * Cancel                                      *
      *                  *---------------------------------------------*
           move      "pgm/dpm/prg/obj/bzosdpm0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * Close modulo per la determinazione dei saldi di *
      *              * magazzino                                       *
      *              *-------------------------------------------------*
           perform   det-sld-mag-cls-000  thru det-sld-mag-cls-999    .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : No                    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-exe-rou-srt      .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-str-ini-300.
      *              *-------------------------------------------------*
      *              * Preparazione parametri in input generali per la *
      *              * work area per stampa scheda movimenti           *
      *              *-------------------------------------------------*
       prn-str-ini-310.
      *                  *---------------------------------------------*
      *                  * Ragione sociale azienda allineata a sini-   *
      *                  * stra                                        *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-ssm-dpm-des-azi      .
       prn-str-ini-320.
      *                  *---------------------------------------------*
      *                  * Codice dipendenza interessata               *
      *                  *---------------------------------------------*
           move      rr-dpz-inu           to   w-ssm-dpm-cod-dpz      .
       prn-str-ini-330.
      *                  *---------------------------------------------*
      *                  * Descrizione per codice dipendenza           *
      *                  *---------------------------------------------*
           move      rr-dpz-inu-den       to   w-ssm-dpm-des-dpz      .
       prn-str-ini-340.
      *                  *---------------------------------------------*
      *                  * Numero dipendenze esistenti per l'azienda   *
      *                  *---------------------------------------------*
           move      rr-dpz-ctr-dpz       to   w-ssm-dpm-ctr-dpz      .
       prn-str-ini-350.
      *                  *---------------------------------------------*
      *                  * Descrizione per la stampa relativa al codi- *
      *                  * ce dipendenza interessata                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se esistono meno di sue dipendenze per  *
      *                      * l'azienda : descrizione a Spaces e nes- *
      *                      * suna ulteriore elaborazione             *
      *                      *-----------------------------------------*
           if        w-ssm-dpm-ctr-dpz    <    2
                     move  spaces         to   w-ssm-dpm-des-dds
                     go to prn-str-ini-360.
      *                      *-----------------------------------------*
      *                      * Se descrizione gia' a Spaces : sposta-  *
      *                      * mento in area descrizione per la stampa *
      *                      * e nessuna ulteriore elaborazione        *
      *                      *-----------------------------------------*
           if        w-ssm-dpm-des-dpz    =    spaces
                     move  spaces         to   w-ssm-dpm-des-dds
                     go to prn-str-ini-360.
      *                      *-----------------------------------------*
      *                      * Spostamento della descrizione in area   *
      *                      * descrizione per la stampa con allinea-  *
      *                      * mento a destra                          *
      *                      *-----------------------------------------*
           move      spaces               to   w-ssm-dpm-des-dds      .
           move      zero                 to   w-ssm-dpm-ctr-t01      .
           inspect   w-ssm-dpm-des-dpz
                                      tallying w-ssm-dpm-ctr-t01
                                  for trailing spaces                 .
           move      w-ssm-dpm-ctr-t01    to   w-ssm-dpm-inx-m01      .
           add       1                    to   w-ssm-dpm-inx-m01      .
           move      w-ssm-dpm-des-dpz    to   w-ssm-dpm-des-dds
                                              (w-ssm-dpm-inx-m01 :)   .
       prn-str-ini-360.
      *                  *---------------------------------------------*
      *                  * Data minima movimenti da stampare           *
      *                  *---------------------------------------------*
           move      rr-dat-min           to   w-ssm-dpm-dat-min      .
       prn-str-ini-370.
      *                  *---------------------------------------------*
      *                  * Data minima movimenti da stampare diminuita *
      *                  * di un giorno                                *
      *                  *---------------------------------------------*
           move      rr-dat-min           to   s-dat                  .
       prn-str-ini-371.
           if        s-mes                =    01 and
                     s-gio                =    01
                     subtract 1           from s-saa
                     move     12          to   s-mes
                     move     31          to   s-gio
                     go to prn-str-ini-375.
       prn-str-ini-372.
           subtract  1                    from s-gio                  .
           if        s-gio                >    zero
                     go to prn-str-ini-375.
       prn-str-ini-373.
           subtract  01                   from s-mes                  .
           move      31                   to   s-gio                  .
       prn-str-ini-374.
           move      "CD"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-sts                not  = spaces
                     subtract 1           from s-gio
                     go to prn-str-ini-374.
       prn-str-ini-375.
           move      s-dat                to   w-ssm-dpm-dat-mmu      .
       prn-str-ini-380.
      *                  *---------------------------------------------*
      *                  * Data massima movimenti da stampare          *
      *                  *---------------------------------------------*
           move      rr-dat-max           to   w-ssm-dpm-dat-max      .
       prn-str-ini-390.
      *                  *---------------------------------------------*
      *                  * Si/No solo se esiste almeno un movimento    *
      *                  * nel periodo selezionato                     *
      *                  *---------------------------------------------*
           move      rr-snx-aum           to   w-ssm-dpm-snx-aum      .
       prn-str-ini-400.
      *                  *---------------------------------------------*
      *                  * Si/No interlinea di separazione tra i sin-  *
      *                  * goli movimenti di una scheda                *
      *                  *---------------------------------------------*
           move      01                   to   w-ssm-dpm-snx-ids      .
       prn-str-ini-420.
      *                  *---------------------------------------------*
      *                  * Indici elementi in tabella per 'Riferimenti *
      *                  * ed Annotazioni'                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Valore movimento e valore unitario      *
      *                      *-----------------------------------------*
           move      01                   to   w-ssm-dpm-iit-vmu      .
      *                      *-----------------------------------------*
      *                      * Ragione sociale archivio                *
      *                      *-----------------------------------------*
           move      02                   to   w-ssm-dpm-iit-arc      .
      *                      *-----------------------------------------*
      *                      * Data e numero documento                 *
      *                      *-----------------------------------------*
           move      03                   to   w-ssm-dpm-iit-doc      .
      *                      *-----------------------------------------*
      *                      * Data e numero documento di riferimento  *
      *                      *-----------------------------------------*
           move      04                   to   w-ssm-dpm-iit-rif      .
      *                      *-----------------------------------------*
      *                      * Unita' di misura di espressione del mo- *
      *                      * vimento                                 *
      *                      *-----------------------------------------*
           move      05                   to   w-ssm-dpm-iit-umi      .
      *                      *-----------------------------------------*
      *                      * Conto merce                             *
      *                      *-----------------------------------------*
           move      06                   to   w-ssm-dpm-iit-mic      .
      *                      *-----------------------------------------*
      *                      * Numero partita di magazzino             *
      *                      *-----------------------------------------*
           move      07                   to   w-ssm-dpm-iit-pam      .
      *                      *-----------------------------------------*
      *                      * Sigla variante di magazzino             *
      *                      *-----------------------------------------*
           move      08                   to   w-ssm-dpm-iit-vam      .
       prn-str-ini-800.
      *              *-------------------------------------------------*
      *              * Start filtro di ordinamento e selezione per il  *
      *              * file [dpm]                                      *
      *              *-------------------------------------------------*
           move      "ST"                 to   f-ope                  .
           move      rr-fso-dpm           to   f-key                  .
           move      "pgm/dpm/prg/obj/bzosdpm0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * Se errore su Start : uscita con flag a Eof      *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-cnt-prn-flg-sub
                     go to prn-str-ini-999.
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessuna scheda movimenti da stampare entro i limit
      -              "i assegnati !                 "
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Read Next filtro di ordinamento e selezione per *
      *              * file [dpm]                                      *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dpm/prg/obj/bzosdpm0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * Se At End : uscita con flag a Eof               *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-cnt-prn-flg-sub
                     go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-300.
      *              *-------------------------------------------------*
      *              * Preparazione parametri in input particolari per *
      *              * la scheda anagrafica in esame, per la work area *
      *              * per stampa scheda movimenti                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo codice di magazzino : Materia prima    *
      *                  *---------------------------------------------*
           move      03                   to   w-ssm-dpm-tip-mag      .
      *                  *---------------------------------------------*
      *                  * Codice numerico di magazzino                *
      *                  *---------------------------------------------*
           move      rf-dpm-num-map       to   w-ssm-dpm-num-mag      .
      *                  *---------------------------------------------*
      *                  * Codice alfanumerico di magazzino            *
      *                  *---------------------------------------------*
           move      rf-dpm-alf-map       to   w-ssm-dpm-alf-mag      .
      *                  *---------------------------------------------*
      *                  * Descrizione per il codice di magazzino      *
      *                  *---------------------------------------------*
           move      rf-dpm-des-map       to   w-ssm-dpm-des-mag      .
      *                  *---------------------------------------------*
      *                  * Codice classe merceologica                  *
      *                  *---------------------------------------------*
           move      rf-dpm-cla-map       to   w-ssm-dpm-cla-mag      .
      *                  *---------------------------------------------*
      *                  * Codice sottogruppo merceologico             *
      *                  *---------------------------------------------*
           move      rf-dpm-sgr-map       to   w-ssm-dpm-sgr-mag      .
      *                  *---------------------------------------------*
      *                  * Tipo di elemento                            *
      *                  *---------------------------------------------*
           move      rf-dpm-tip-map       to   w-ssm-dpm-tip-psm      .
      *                  *---------------------------------------------*
      *                  * Unita' di misura per la gestione magazzino  *
      *                  *---------------------------------------------*
           move      rf-dpm-umi-prd       to   w-ssm-dpm-umi-mag      .
      *                  *---------------------------------------------*
      *                  * Numero decimali quantita' per la gestione   *
      *                  * magazzino                                   *
      *                  *---------------------------------------------*
           move      rf-dpm-dec-qta       to   w-ssm-dpm-dec-qta      .
      *                  *---------------------------------------------*
      *                  * Tipo di variante per la gestione magazzino  *
      *                  *---------------------------------------------*
           move      rf-dpm-tip-vpr       to   w-ssm-dpm-tdv-mag      .
      *                  *---------------------------------------------*
      *                  * Area libera per espansioni speciali asso-   *
      *                  * ciata all'anagrafica dell'elemento          *
      *                  *---------------------------------------------*
           move      rf-dpm-alx-exp       to   w-ssm-dpm-alx-ana      .
       prn-sel-rec-600.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Esecuzione routine di selezione             *
      *                  *---------------------------------------------*
           perform   ssm-dpm-sel-000      thru ssm-dpm-sel-999        .
      *                  *---------------------------------------------*
      *                  * Set del flag di uscita in funzione del ti-  *
      *                  * po di uscita dalla routine di selezione e-  *
      *                  * seguita                                     *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-flg-sel    =    spaces
                     move  spaces         to   w-cnt-prn-flg-sub
           else      move  "#"            to   w-cnt-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Normalizzazione totali generali                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-gen-map-fis      .
           move      zero                 to   w-tot-gen-map-dtz      .
           move      zero                 to   w-tot-gen-map-ptz      .
           move      zero                 to   w-tot-gen-map-dpr      .
           move      zero                 to   w-tot-gen-fis-ini      .
           move      zero                 to   w-tot-gen-fis-car      .
           move      zero                 to   w-tot-gen-fis-sca      .
           move      zero                 to   w-tot-gen-fis-fin      .
           move      zero                 to   w-tot-gen-dtz-ini      .
           move      zero                 to   w-tot-gen-dtz-car      .
           move      zero                 to   w-tot-gen-dtz-sca      .
           move      zero                 to   w-tot-gen-dtz-fin      .
           move      zero                 to   w-tot-gen-ptz-ini      .
           move      zero                 to   w-tot-gen-ptz-car      .
           move      zero                 to   w-tot-gen-ptz-sca      .
           move      zero                 to   w-tot-gen-ptz-fin      .
           move      zero                 to   w-tot-gen-dpr-ini      .
           move      zero                 to   w-tot-gen-dpr-car      .
           move      zero                 to   w-tot-gen-dpr-sca      .
           move      zero                 to   w-tot-gen-dpr-fin      .
           move      zero                 to   w-tot-gen-dec-qta      .
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag                        *
      *                  *---------------------------------------------*
           move      spaces               to   w-stp-int-flg          .
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Test se intestazione pagina non ancora eseguita *
      *              *-------------------------------------------------*
           if        w-stp-int-flg        not  = spaces
                     go to prn-fin-cic-200.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
      *              *-------------------------------------------------*
      *              * Ad uscita                                       *
      *              *-------------------------------------------------*
           go to     prn-fin-cic-999.
       prn-fin-cic-200.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Linea di chiusura                               *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "+-------------------------------------------------
      -              "---------+---+----------------+----------------+--
      -              "--------------+----------------+"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Stampa totali generali                          *
      *              *-------------------------------------------------*
           perform   ssm-dpm-stp-tot-000  thru ssm-dpm-stp-tot-999    .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Esecuzione routine di stampa scheda             *
      *              *-------------------------------------------------*
           perform   ssm-dpm-stp-000      thru ssm-dpm-stp-999        .
      *              *-------------------------------------------------*
      *              * Set del flag di uscita in funzione del tipo di  *
      *              * uscita dalla routine di stampa eseguita         *
      *              *-------------------------------------------------*
           if        w-ssm-dpm-flg-stp    =    spaces
                     move  spaces         to   w-cnt-prn-flg-int
           else      move  "#"            to   w-cnt-prn-flg-int      .
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Selezione su elemento in esame                            *
      *    *-----------------------------------------------------------*
       ssm-dpm-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita dalla routine    *
      *              *-------------------------------------------------*
           move      spaces               to   w-ssm-dpm-flg-sel      .
       ssm-dpm-sel-010.
       ssm-dpm-sel-100.
      *              *-------------------------------------------------*
      *              * Set del flag che indica se esiste almeno un mo- *
      *              * vimento nel periodo compreso tra la data minima *
      *              * e la data massima, relativo all'elemento in e-  *
      *              * same                                            *
      *              *-------------------------------------------------*
       ssm-dpm-sel-125.
      *                  *---------------------------------------------*
      *                  * Normalizzazione iniziale del flag a : No    *
      *                  *---------------------------------------------*
           move      spaces               to   w-ssm-dpm-aum-sel      .
       ssm-dpm-sel-150.
      *                  *---------------------------------------------*
      *                  * Start su archivio movimenti di magazzino,   *
      *                  * file [mmr], sull'elemento in esame, rela-   *
      *                  * tivamente alla data minima, per la dipen-   *
      *                  * denza interessata                           *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "DPZMAG    "         to   f-key                  .
           move      w-ssm-dpm-cod-dpz    to   rf-mmr-cod-dpz         .
           move      w-ssm-dpm-tip-mag    to   rf-mmr-tip-mag         .
           move      w-ssm-dpm-num-mag    to   rf-mmr-num-mag         .
           move      w-ssm-dpm-dat-min    to   rf-mmr-dat-reg         .
           move      zero                 to   rf-mmr-num-prt         .
           move      zero                 to   rf-mmr-num-prg         .
           move      "pgm/mag/fls/ioc/obj/iofmmr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmr                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata non si esegue alcuna ulte-  *
      *                  * riore lettura                               *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to ssm-dpm-sel-300.
       ssm-dpm-sel-175.
      *                  *---------------------------------------------*
      *                  * Read Next su archivio movimenti di magazzi- *
      *                  * no, file [mmr]                              *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmr                 .
      *                  *---------------------------------------------*
      *                  * Se At End non si esegue alcuna ulteriore    *
      *                  * lettura                                     *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to ssm-dpm-sel-300.
       ssm-dpm-sel-200.
      *                  *---------------------------------------------*
      *                  * Test Max su archivio movimenti di magazzi-  *
      *                  * no, file [mmr]; se non superato non si e-   *
      *                  * segue alcuna ulteriore lettura              *
      *                  *---------------------------------------------*
           if        rf-mmr-cod-dpz       not  = w-ssm-dpm-cod-dpz or
                     rf-mmr-tip-mag       not  = w-ssm-dpm-tip-mag or
                     rf-mmr-num-mag       not  = w-ssm-dpm-num-mag
                     go to ssm-dpm-sel-300.
           if        rf-mmr-dat-reg       >    w-ssm-dpm-dat-max
                     go to ssm-dpm-sel-300.
       ssm-dpm-sel-225.
      *                  *---------------------------------------------*
      *                  * Set del flag a : Si, esiste almeno un movi- *
      *                  * mento                                       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-ssm-dpm-aum-sel      .
       ssm-dpm-sel-300.
      *              *-------------------------------------------------*
      *              * Selezioni effettive                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     ssm-dpm-sel-900.
       ssm-dpm-sel-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ssm-dpm-sel-999.
       ssm-dpm-sel-999.
           exit.

      *    *===========================================================*
      *    * Stampa scheda elemento in esame                           *
      *    *-----------------------------------------------------------*
       ssm-dpm-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita dalla routine,   *
      *              * relativo all'interruzione forzata della stampa  *
      *              *-------------------------------------------------*
           move      spaces               to   w-ssm-dpm-flg-stp      .
      *              *-------------------------------------------------*
      *              * Preparazioni iniziali                           *
      *              *-------------------------------------------------*
           perform   ssm-dpm-stp-pin-000  thru ssm-dpm-stp-pin-999    .
       ssm-dpm-stp-050.
      *              *-------------------------------------------------*
      *              * Determinazione valori di inizio periodo per il  *
      *              * codice di magazzino                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione valori di inizio periodo     *
      *                  *---------------------------------------------*
           perform   ssm-dpm-stp-vit-000  thru ssm-dpm-stp-vit-999    .
       ssm-dpm-stp-100.
      *              *-------------------------------------------------*
      *              * Start su archivio movimenti di magazzino, file  *
      *              * [mmr], sull'elemento in esame, relativamente    *
      *              * alla data minima, per la dipendenza interessata *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "DPZMAG    "         to   f-key                  .
           move      w-ssm-dpm-cod-dpz    to   rf-mmr-cod-dpz         .
           move      w-ssm-dpm-tip-mag    to   rf-mmr-tip-mag         .
           move      w-ssm-dpm-num-mag    to   rf-mmr-num-mag         .
           move      w-ssm-dpm-dat-min    to   rf-mmr-dat-reg         .
           move      zero                 to   rf-mmr-num-prt         .
           move      zero                 to   rf-mmr-num-prg         .
           move      "pgm/mag/fls/ioc/obj/iofmmr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmr                 .
      *              *-------------------------------------------------*
      *              * Se Start errata : a stampa riepilogo finale     *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to ssm-dpm-stp-700.
       ssm-dpm-stp-200.
      *              *-------------------------------------------------*
      *              * Read Next su archivio movimenti di magazzino,   *
      *              * file [mmr]                                      *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmr                 .
      *              *-------------------------------------------------*
      *              * Se At End : a stampa chiusura movimenti         *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to ssm-dpm-stp-600.
       ssm-dpm-stp-300.
      *              *-------------------------------------------------*
      *              * Test Max su archivio movimenti di magazzino,    *
      *              * file [mmr]; se non superato : a stampa chiu-    *
      *              * sura movimenti                                  *
      *              *-------------------------------------------------*
           if        rf-mmr-cod-dpz       not  = w-ssm-dpm-cod-dpz or
                     rf-mmr-tip-mag       not  = w-ssm-dpm-tip-mag or
                     rf-mmr-num-mag       not  = w-ssm-dpm-num-mag
                     go to ssm-dpm-stp-600.
           if        rf-mmr-dat-reg       >    w-ssm-dpm-dat-max
                     go to ssm-dpm-stp-600.
       ssm-dpm-stp-400.
      *              *-------------------------------------------------*
      *              * Selezione sul record                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su trattamento valore per la causale   *
      *                  *---------------------------------------------*
           if        rf-mmr-trt-val       =    "C" or
                     rf-mmr-trt-val       =    "X" or
                     rf-mmr-trt-val       =    "R" or
                     rf-mmr-trt-val       =    "Y"
                     go to ssm-dpm-stp-200.
      *              *-------------------------------------------------*
      *              * Raccolta preliminare dei valori relativi al mo- *
      *              * vimento                                         *
      *              *-------------------------------------------------*
           perform   ssm-dpm-rpv-mov-000  thru ssm-dpm-rpv-mov-999    .
       ssm-dpm-stp-420.
      *              *-------------------------------------------------*
      *              * Accumulo su totali per codice di magazzino      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Accumulo su totali                          *
      *                  *---------------------------------------------*
           perform   ssm-dpm-stp-act-000  thru ssm-dpm-stp-act-999    .
       ssm-dpm-stp-460.
      *              *-------------------------------------------------*
      *              * Riciclo a lettura movimento successivo          *
      *              *-------------------------------------------------*
           go to     ssm-dpm-stp-200.
       ssm-dpm-stp-600.
      *              *-------------------------------------------------*
      *              * Stampa chiusura movimenti                       *
      *              *-------------------------------------------------*
       ssm-dpm-stp-700.
      *              *-------------------------------------------------*
      *              * Stampa riepilogo finale                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Calcolo finale totali per codice di magaz-  *
      *                  * zino                                        *
      *                  *---------------------------------------------*
           perform   ssm-dpm-stp-cft-000  thru ssm-dpm-stp-cft-999    .
      *                  *---------------------------------------------*
      *                  * Stampa del riepilogo                        *
      *                  *---------------------------------------------*
           perform   ssm-dpm-stp-rie-000  thru ssm-dpm-stp-rie-999    .
      *                  *---------------------------------------------*
      *                  * Se flag di uscita ad interruzione forzata : *
      *                  * si pone in On il flag corrispondente, e si  *
      *                  * esce                                        *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-flg-stp    not  = spaces
                     move  "#"            to   w-cnt-prn-flg-int
                     go to ssm-dpm-stp-999.
       ssm-dpm-stp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ssm-dpm-stp-999.
       ssm-dpm-stp-999.
           exit.

      *    *===========================================================*
      *    * Stampa scheda elemento in esame, preparazioni iniziali    *
      *    *-----------------------------------------------------------*
       ssm-dpm-stp-pin-000.
      *              *-------------------------------------------------*
      *              * Numero pagina per la stampa a zero              *
      *              *-------------------------------------------------*
           move      zero                 to   w-ssm-dpm-npg-stp      .
      *              *-------------------------------------------------*
      *              * Numero movimenti stampati in totale per il co-  *
      *              * dice di magazzino a zero                        *
      *              *-------------------------------------------------*
           move      zero                 to   w-ssm-dpm-nmc-stp      .
      *              *-------------------------------------------------*
      *              * Numero linee per righe movimenti stampate nella *
      *              * prima pagina a zero                             *
      *              *-------------------------------------------------*
           move      zero                 to   w-ssm-dpm-nlp-stp      .
      *              *-------------------------------------------------*
      *              * Azzeramento totalizzatori per codice di magaz-  *
      *              * zino                                            *
      *              *-------------------------------------------------*
           perform   ssm-dpm-stp-azt-000  thru ssm-dpm-stp-azt-999    .
       ssm-dpm-stp-pin-999.
           exit.

      *    *===========================================================*
      *    * Stampa scheda elemento in esame, raccolta preliminare dei *
      *    * valori relativi al singolo movimento                      *
      *    *-----------------------------------------------------------*
       ssm-dpm-rpv-mov-000.
      *              *-------------------------------------------------*
      *              * Data di registrazione                           *
      *              *-------------------------------------------------*
           move      rf-mmr-dat-reg       to   w-ssm-dpm-mov-dtr      .
       ssm-dpm-rpv-mov-025.
      *              *-------------------------------------------------*
      *              * Codice causale di magazzino                     *
      *              *-------------------------------------------------*
           move      rf-mmr-cod-cau       to   w-ssm-dpm-mov-ccm      .
       ssm-dpm-rpv-mov-050.
      *              *-------------------------------------------------*
      *              * Descrizione causale di magazzino                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiamo routine lettura archivio [zmc]     *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-mov-ccm    to   w-let-arc-zmc-cod      .
           perform   let-arc-zmc-000      thru let-arc-zmc-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione ottenuta         *
      *                  *---------------------------------------------*
           move      w-let-arc-zmc-des    to   w-ssm-dpm-mov-dcm      .
       ssm-dpm-rpv-mov-075.
      *              *-------------------------------------------------*
      *              * Quantita' del movimento                         *
      *              *-------------------------------------------------*
           move      rf-mmr-qta-mov       to   w-ssm-dpm-mov-qdm      .
       ssm-dpm-rpv-mov-100.
      *              *-------------------------------------------------*
      *              * Quantita' per la colonna 'Carico'               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se tipo movimento di Carico o di Movimenta- *
      *                  * zione interna si pone la quantita' del mo-  *
      *                  * vimento, altrimenti si pone a zero          *
      *                  *---------------------------------------------*
           if        rf-mmr-tip-mdm       =    01 or
                     rf-mmr-tip-mdm       =    03
                     move  rf-mmr-qta-mov to   w-ssm-dpm-mov-qdc
           else      move  zero           to   w-ssm-dpm-mov-qdc      .
       ssm-dpm-rpv-mov-125.
      *              *-------------------------------------------------*
      *              * Quantita' per la colonna 'Scarico'              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se tipo movimento di Scarico o di Movimen-  *
      *                  * tazione interna si pone la quantita' del    *
      *                  * movimento, altrimenti si pone a zero        *
      *                  *---------------------------------------------*
           if        rf-mmr-tip-mdm       =    02 or
                     rf-mmr-tip-mdm       =    03
                     move  rf-mmr-qta-mov to   w-ssm-dpm-mov-qds
           else      move  zero           to   w-ssm-dpm-mov-qds      .
       ssm-dpm-rpv-mov-150.
      *              *-------------------------------------------------*
      *              * Tipo archivio                                   *
      *              *-------------------------------------------------*
           move      rf-mmr-tip-arc       to   w-ssm-dpm-mov-ati      .
       ssm-dpm-rpv-mov-175.
      *              *-------------------------------------------------*
      *              * Codice archivio                                 *
      *              *-------------------------------------------------*
           move      rf-mmr-cod-arc       to   w-ssm-dpm-mov-aco      .
           if        w-ssm-dpm-mov-ati    not  = "C" and
                     w-ssm-dpm-mov-ati    not  = "F" and
                     w-ssm-dpm-mov-ati    not  = "D" and
                     w-ssm-dpm-mov-ati    not  = "V"
                     move  zero           to   w-ssm-dpm-mov-aco      .
       ssm-dpm-rpv-mov-200.
      *              *-------------------------------------------------*
      *              * Codice dipendenza per il codice archivio        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non si tratta ne' di un cliente, ne' di  *
      *                  * un fornitore lo si pone a Spaces            *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-mov-ati    not  = "C" and
                     w-ssm-dpm-mov-ati    not  = "F"
                     move  spaces         to   w-ssm-dpm-mov-adp
                     go to ssm-dpm-rpv-mov-225.
      *                  *---------------------------------------------*
      *                  * Se il codice cliente o fornitore e' a zero  *
      *                  * lo si pone a Spaces                         *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-mov-aco    =    zero
                     move  spaces         to   w-ssm-dpm-mov-adp
                     go to ssm-dpm-rpv-mov-225.
      *                  *---------------------------------------------*
      *                  * Memorizzazione codice dipendenza per il co- *
      *                  * dice archivio                               *
      *                  *---------------------------------------------*
           move      rf-mmr-dpz-arc       to   w-ssm-dpm-mov-adp      .
       ssm-dpm-rpv-mov-225.
      *              *-------------------------------------------------*
      *              * Descrizione per codice archivio/dipendenza      *
      *              *-------------------------------------------------*
       ssm-dpm-rpv-mov-227.
      *                  *---------------------------------------------*
      *                  * Normalizzazione preliminare a Spaces        *
      *                  *---------------------------------------------*
           move      spaces               to   w-ssm-dpm-mov-ade      .
       ssm-dpm-rpv-mov-229.
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo archivio    *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-mov-ati    =    "C"
                     go to ssm-dpm-rpv-mov-231
           else if   w-ssm-dpm-mov-ati    =    "F"
                     go to ssm-dpm-rpv-mov-233
           else if   w-ssm-dpm-mov-ati    =    "D"
                     go to ssm-dpm-rpv-mov-235
           else if   w-ssm-dpm-mov-ati    =    "V"
                     go to ssm-dpm-rpv-mov-237
           else      go to ssm-dpm-rpv-mov-239.
       ssm-dpm-rpv-mov-231.
      *                  *---------------------------------------------*
      *                  * Se tipo archivio : Cliente                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiamo routine lettura archivio [dcc] *
      *                      * o [cli]                                 *
      *                      *-----------------------------------------*
           move      w-ssm-dpm-mov-aco    to   w-let-arc-dcx-cod      .
           move      w-ssm-dpm-mov-adp    to   w-let-arc-dcx-dpz      .
           perform   let-arc-dcx-000      thru let-arc-dcx-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione ragione sociale ottenuta *
      *                      *-----------------------------------------*
           move      w-let-arc-dcx-rag    to   w-ssm-dpm-mov-ade      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     ssm-dpm-rpv-mov-250.
       ssm-dpm-rpv-mov-233.
      *                  *---------------------------------------------*
      *                  * Se tipo archivio : Fornitore                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiamo routine lettura archivio [dcf] *
      *                      * o [fnt]                                 *
      *                      *-----------------------------------------*
           move      w-ssm-dpm-mov-aco    to   w-let-arc-dfx-cod      .
           move      w-ssm-dpm-mov-adp    to   w-let-arc-dfx-dpz      .
           perform   let-arc-dfx-000      thru let-arc-dfx-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione ragione sociale ottenuta *
      *                      *-----------------------------------------*
           move      w-let-arc-dfx-rag    to   w-ssm-dpm-mov-ade      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     ssm-dpm-rpv-mov-250.
       ssm-dpm-rpv-mov-235.
      *                  *---------------------------------------------*
      *                  * Se tipo archivio : Dipendenza               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiamo routine lettura archivio [dpz] *
      *                      *-----------------------------------------*
           move      w-ssm-dpm-mov-aco    to   w-let-arc-dpz-cod      .
           perform   let-arc-dpz-000      thru let-arc-dpz-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione descrizione ottenuta     *
      *                      *-----------------------------------------*
           move      w-let-arc-dpz-des    to   w-ssm-dpm-mov-ade      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     ssm-dpm-rpv-mov-250.
       ssm-dpm-rpv-mov-237.
      *                  *---------------------------------------------*
      *                  * Se tipo archivio : Agente                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiamo routine lettura archivio [age] *
      *                      *-----------------------------------------*
           move      w-ssm-dpm-mov-aco    to   w-let-arc-age-cod      .
           perform   let-arc-age-000      thru let-arc-age-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione ragione sociale ottenuta *
      *                      *-----------------------------------------*
           move      w-let-arc-age-nom    to   w-ssm-dpm-mov-ade      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     ssm-dpm-rpv-mov-250.
       ssm-dpm-rpv-mov-239.
      *                  *---------------------------------------------*
      *                  * Se tipo archivio : Nessuno                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nessuna azione, continuazione           *
      *                      *-----------------------------------------*
           go to     ssm-dpm-rpv-mov-250.
       ssm-dpm-rpv-mov-250.
      *              *-------------------------------------------------*
      *              * Data documento                                  *
      *              *-------------------------------------------------*
           move      rf-mmr-dat-doc       to   w-ssm-dpm-mov-ddo      .
       ssm-dpm-rpv-mov-275.
      *              *-------------------------------------------------*
      *              * Numero documento                                *
      *              *-------------------------------------------------*
           move      rf-mmr-num-doc       to   w-ssm-dpm-mov-ndo      .
       ssm-dpm-rpv-mov-300.
      *              *-------------------------------------------------*
      *              * Data documento di riferimento                   *
      *              *-------------------------------------------------*
           move      rf-mmr-ddo-rif       to   w-ssm-dpm-mov-dri      .
       ssm-dpm-rpv-mov-325.
      *              *-------------------------------------------------*
      *              * Numero documento di riferimento                 *
      *              *-------------------------------------------------*
           move      rf-mmr-ndo-rif       to   w-ssm-dpm-mov-nri      .
       ssm-dpm-rpv-mov-350.
      *              *-------------------------------------------------*
      *              * Unita' di misura contenuta in anagrafica al mo- *
      *              * mento della registrazione del movimento         *
      *              *-------------------------------------------------*
           move      rf-mmr-udm-ana       to   w-ssm-dpm-mov-uma      .
       ssm-dpm-rpv-mov-375.
      *              *-------------------------------------------------*
      *              * Unita' di misura utilizzata per il movimento    *
      *              * mento della registrazione del movimento         *
      *              *-------------------------------------------------*
           move      rf-mmr-udm-mov       to   w-ssm-dpm-mov-umm      .
       ssm-dpm-rpv-mov-400.
      *              *-------------------------------------------------*
      *              * Tipo di movimento                               *
      *              *-------------------------------------------------*
           move      rf-mmr-tip-mdm       to   w-ssm-dpm-mov-tmo      .
       ssm-dpm-rpv-mov-425.
      *              *-------------------------------------------------*
      *              * Trattamento merce in conto                      *
      *              *-------------------------------------------------*
           move      rf-mmr-trt-mic       to   w-ssm-dpm-mov-tmc      .
       ssm-dpm-rpv-mov-450.
      *              *-------------------------------------------------*
      *              * Tipo merce in conto                             *
      *              *-------------------------------------------------*
           move      rf-mmr-tip-mic       to   w-ssm-dpm-mov-xmc      .
       ssm-dpm-rpv-mov-475.
      *              *-------------------------------------------------*
      *              * Codice merce in conto                           *
      *              *-------------------------------------------------*
           move      rf-mmr-cod-ctm       to   w-ssm-dpm-mov-cmc      .
       ssm-dpm-rpv-mov-500.
      *              *-------------------------------------------------*
      *              * Descrizione merce in conto                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiamo routine lettura archivio [zmm]     *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-mov-cmc    to   w-let-arc-zmm-cod      .
           perform   let-arc-zmm-000      thru let-arc-zmm-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione ottenuta         *
      *                  *---------------------------------------------*
           move      w-let-arc-zmm-des    to   w-ssm-dpm-mov-dmc      .
       ssm-dpm-rpv-mov-525.
      *              *-------------------------------------------------*
      *              * Numero partita di magazzino                     *
      *              *-------------------------------------------------*
           move      rf-mmr-num-pmg       to   w-ssm-dpm-mov-npm      .
       ssm-dpm-rpv-mov-550.
      *              *-------------------------------------------------*
      *              * Variante di magazzino                           *
      *              *-------------------------------------------------*
           move      rf-mmr-var-mag       to   w-ssm-dpm-mov-vdm      .
       ssm-dpm-rpv-mov-575.
      *              *-------------------------------------------------*
      *              * Costo unitario e valore totale movimento        *
      *              *-------------------------------------------------*
           move      rf-mmr-cun-mov       to   w-ssm-dpm-mov-cun      .
           move      rf-mmr-val-mov       to   w-ssm-dpm-mov-vto      .
       ssm-dpm-rpv-mov-600.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ssm-dpm-rpv-mov-999.
       ssm-dpm-rpv-mov-999.
           exit.

      *    *===========================================================*
      *    * Stampa scheda elemento in esame, subroutine di concatena- *
      *    * mento literals                                            *
      *    *-----------------------------------------------------------*
       ssm-dpm-sub-cct-000.
      *              *-------------------------------------------------*
      *              * Se origine a spaces : uscita                    *
      *              *-------------------------------------------------*
           if        w-ssm-dpm-cct-org    =    spaces
                     go to ssm-dpm-sub-cct-999.
      *              *-------------------------------------------------*
      *              * Conteggio leading blanks in origine             *
      *              *-------------------------------------------------*
           move      zero                 to   w-ssm-dpm-cct-c01      .
           inspect   w-ssm-dpm-cct-org
                                      tallying w-ssm-dpm-cct-c01
                                   for leading spaces                 .
      *              *-------------------------------------------------*
      *              * Determinazione 1. carattere significativo in o- *
      *              * rigine                                          *
      *              *-------------------------------------------------*
           add       1                    to   w-ssm-dpm-cct-c01      .
      *              *-------------------------------------------------*
      *              * Conteggio trailing blanks in destinazione       *
      *              *-------------------------------------------------*
           move      zero                 to   w-ssm-dpm-cct-c02      .
           inspect   w-ssm-dpm-cct-dst
                                      tallying w-ssm-dpm-cct-c02
                                  for trailing spaces                 .
      *              *-------------------------------------------------*
      *              * Determinazione indice per destinazione          *
      *              *-------------------------------------------------*
           if        w-ssm-dpm-cct-c02    =    40
                     move     01          to   w-ssm-dpm-cct-inx
           else      move     40          to   w-ssm-dpm-cct-inx
                     subtract w-ssm-dpm-cct-c02
                                          from w-ssm-dpm-cct-inx
                     add      02          to   w-ssm-dpm-cct-inx      .
      *              *-------------------------------------------------*
      *              * Se indice oltre il massimo : uscita             *
      *              *-------------------------------------------------*
           if        w-ssm-dpm-cct-inx    >    40
                     go to ssm-dpm-sub-cct-999.
      *              *-------------------------------------------------*
      *              * Concatenamento                                  *
      *              *-------------------------------------------------*
           move      w-ssm-dpm-cct-org
                    (w-ssm-dpm-cct-c01 :) to   w-ssm-dpm-cct-dst
                                              (w-ssm-dpm-cct-inx :)   .
       ssm-dpm-sub-cct-999.
           exit.

      *    *===========================================================*
      *    * Stampa scheda elemento in esame, stampa riepilogo         *
      *    *-----------------------------------------------------------*
       ssm-dpm-stp-rie-000.
      *              *-------------------------------------------------*
      *              * Test su selezioni su quantita'                  *
      *              *-------------------------------------------------*
           if        w-ssm-dpm-snx-aum    =    03
                     go to ssm-dpm-stp-rie-050.
       ssm-dpm-stp-rie-020.
      *                  *---------------------------------------------*
      *                  * Se solo materie prime movimentate           *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-snx-aum    =    02
                     go to ssm-dpm-stp-rie-030.
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        w-ssm-dpm-tpc-mfc    =    zero and
                     w-ssm-dpm-tpc-mfs    =    zero
                     go to ssm-dpm-stp-rie-900.
      *                      *-----------------------------------------*
      *                      * Ad aggiornamento totali                 *
      *                      *-----------------------------------------*
           go to     ssm-dpm-stp-rie-050.
       ssm-dpm-stp-rie-030.
      *                  *---------------------------------------------*
      *                  * Se solo materie prime movimentate o con     *
      *                  * sola giacenza                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        w-ssm-dpm-tpc-mfi    =    zero and
                     w-ssm-dpm-tpc-mfc    =    zero and
                     w-ssm-dpm-tpc-mfs    =    zero and
                     w-ssm-dpm-tpc-mff    =    zero and
                     w-ssm-dpm-tpc-pin    =    zero and
                     w-ssm-dpm-tpc-pit    =    zero and
                     w-ssm-dpm-tpc-pfn    =    zero and
                     w-ssm-dpm-tpc-pft    =    zero
                     go to ssm-dpm-stp-rie-900.
      *                      *-----------------------------------------*
      *                      * Ad aggiornamento totali                 *
      *                      *-----------------------------------------*
           go to     ssm-dpm-stp-rie-050.
       ssm-dpm-stp-rie-050.
      *              *-------------------------------------------------*
      *              * Aggiornamento totali generali                   *
      *              *-------------------------------------------------*
           perform   agg-tot-gen-000      thru agg-tot-gen-999        .
      *              *-------------------------------------------------*
      *              * Eventuale intestazione pagina se non ancora     *
      *              * eseguita                                        *
      *              *-------------------------------------------------*
           if        w-stp-int-flg        not  = spaces
                     go to ssm-dpm-stp-rie-100.
      *                  *---------------------------------------------*
      *                  * Set del flag                                *
      *                  *---------------------------------------------*
           move      "#"                  to   w-stp-int-flg          .
      *                  *---------------------------------------------*
      *                  * Ad intestazione pagina                      *
      *                  *---------------------------------------------*
           go to     ssm-dpm-stp-rie-180.
       ssm-dpm-stp-rie-100.
      *              *-------------------------------------------------*
      *              * Test se numero linee residue sufficienti        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Calcolo delle linee necessarie              *
      *                  *---------------------------------------------*
           move      2                    to   w-ssm-dpm-ctr-res      .
           if        w-ssm-dpm-tpc-pit    =    zero  and
                     w-ssm-dpm-tpc-pit    =    w-ssm-dpm-tpc-pft
                     go to ssm-dpm-stp-rie-110.
           add       1                    to   w-ssm-dpm-ctr-res      .
       ssm-dpm-stp-rie-110.
           if        w-ssm-dpm-tpc-pin    =    zero  and
                     w-ssm-dpm-tpc-pin    =    w-ssm-dpm-tpc-pfn
                     go to ssm-dpm-stp-rie-120.
           add       1                    to   w-ssm-dpm-ctr-res      .
       ssm-dpm-stp-rie-120.
           if        w-ssm-dpm-tpc-pip    =    w-ssm-dpm-tpc-mfi  and
                     w-ssm-dpm-tpc-pfp    =    w-ssm-dpm-tpc-mff
                     go to ssm-dpm-stp-rie-130.
           add       1                    to   w-ssm-dpm-ctr-res      .
       ssm-dpm-stp-rie-130.
           if        p-res                >    w-ssm-dpm-ctr-res
                     go to ssm-dpm-stp-rie-200.
       ssm-dpm-stp-rie-150.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Linea di chiusura                               *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "+-------------------------------------------------
      -              "---------+---+----------------+----------------+--
      -              "--------------+----------------+"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       ssm-dpm-stp-rie-180.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   ssm-dpm-stp-its-000  thru ssm-dpm-stp-its-999    .
      *              *-------------------------------------------------*
      *              * Se flag di uscita ad interruzione forzata : si  *
      *              * pone in On il flag corrispondente e si esce     *
      *              *-------------------------------------------------*
           if        w-ssm-dpm-flg-stp    not  = spaces
                     move  "#"            to   w-cnt-prn-flg-int
                     go to ssm-dpm-stp-rie-999.
       ssm-dpm-stp-rie-200.
      *              *-------------------------------------------------*
      *              * Stampa intestazione castelletto                 *
      *              *-------------------------------------------------*
       ssm-dpm-stp-rie-300.
      *              *-------------------------------------------------*
      *              * Linea 01                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Griglia vuota                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "|                                                 
      -              "         |   |                |                |  
      -              "              |                |"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Codice materia prima                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      003                  to   p-pos                  .
           move      w-ssm-dpm-alf-mag    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Descrizione materia prima                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      019                  to   p-pos                  .
           move      w-ssm-dpm-des-mag    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Unita' di misura materia prima              *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      061                  to   p-pos                  .
           move      w-ssm-dpm-umi-mag    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico, inizio periodo'          *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-dec-qta    to   w-stp-qta-dec          .
           move      066                  to   w-stp-qta-pos          .
           move      w-ssm-dpm-tpc-mfi    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico, Carichi nel periodo'     *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-dec-qta    to   w-stp-qta-dec          .
           move      083                  to   w-stp-qta-pos          .
           move      w-ssm-dpm-tpc-mfc    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico, Scarichi nel periodo'    *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-dec-qta    to   w-stp-qta-dec          .
           move      100                  to   w-stp-qta-pos          .
           move      w-ssm-dpm-tpc-mfs    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico, Fine periodo'            *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-dec-qta    to   w-stp-qta-dec          .
           move      117                  to   w-stp-qta-pos          .
           move      w-ssm-dpm-tpc-mff    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
       ssm-dpm-stp-rie-400.
      *              *-------------------------------------------------*
      *              * Linea 02                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da stampare                         *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-tpc-pit    =    zero  and
                     w-ssm-dpm-tpc-pit    =    w-ssm-dpm-tpc-pft
                     go to ssm-dpm-stp-rie-500.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Griglia vuota                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "|                                                 
      -              "         |   |                |                |  
      -              "              |                |"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      19                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      040                  to   p-pos                  .
           move      "Di terzi          >"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 'Proprieta' inizio periodo, Di terzi'       *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-dec-qta    to   w-stp-qta-dec          .
           move      066                  to   w-stp-qta-pos          .
           move      w-ssm-dpm-tpc-pit    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
      *                  *---------------------------------------------*
      *                  * 'Proprieta' fine periodo, Di terzi'         *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-dec-qta    to   w-stp-qta-dec          .
           move      117                  to   w-stp-qta-pos          .
           move      w-ssm-dpm-tpc-pft    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
       ssm-dpm-stp-rie-500.
      *              *-------------------------------------------------*
      *              * Linea 03                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da stampare                         *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-tpc-pin    =    zero  and
                     w-ssm-dpm-tpc-pin    =    w-ssm-dpm-tpc-pfn
                     go to ssm-dpm-stp-rie-600.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Griglia vuota                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "|                                                 
      -              "         |   |                |                |  
      -              "              |                |"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      19                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      040                  to   p-pos                  .
           move      "Presso terzi      >"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 'Proprieta' inizio periodo, Presso terzi'   *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-dec-qta    to   w-stp-qta-dec          .
           move      066                  to   w-stp-qta-pos          .
           move      w-ssm-dpm-tpc-pin    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
      *                  *---------------------------------------------*
      *                  * 'Proprieta' fine periodo, Presso terzi'     *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-dec-qta    to   w-stp-qta-dec          .
           move      117                  to   w-stp-qta-pos          .
           move      w-ssm-dpm-tpc-pfn    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
       ssm-dpm-stp-rie-600.
      *              *-------------------------------------------------*
      *              * Linea 04                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da stampare                         *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-tpc-pip    =    w-ssm-dpm-tpc-mfi  and
                     w-ssm-dpm-tpc-pfp    =    w-ssm-dpm-tpc-mff
                     go to ssm-dpm-stp-rie-900.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Griglia vuota                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "|                                                 
      -              "         |   |                |                |  
      -              "              |                |"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      19                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      040                  to   p-pos                  .
           move      "Di proprieta'     >"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 'Proprieta' inizio periodo, Di proprieta''  *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-dec-qta    to   w-stp-qta-dec          .
           move      066                  to   w-stp-qta-pos          .
           move      w-ssm-dpm-tpc-pip    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
      *                  *---------------------------------------------*
      *                  * 'Proprieta' fine periodo, Di proprieta'     *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-dec-qta    to   w-stp-qta-dec          .
           move      117                  to   w-stp-qta-pos          .
           move      w-ssm-dpm-tpc-pfp    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
       ssm-dpm-stp-rie-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ssm-dpm-stp-rie-999.
       ssm-dpm-stp-rie-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento totali generali                             *
      *    *-----------------------------------------------------------*
       agg-tot-gen-000.
      *              *-------------------------------------------------*
      *              * Aggiornamento contatori elementi                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico'                          *
      *                  *---------------------------------------------*
           add       1                    to   w-tot-gen-map-fis      .
      *                  *---------------------------------------------*
      *                  * 'Di terzi'                                  *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-tpc-pit    not  = zero  or
                     w-ssm-dpm-tpc-pft    not  = zero
                     add   1              to   w-tot-gen-map-dtz      .
      *                  *---------------------------------------------*
      *                  * 'Presso terzi'                              *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-tpc-pin    not  = zero  or
                     w-ssm-dpm-tpc-pfn    not  = zero
                     add   1              to   w-tot-gen-map-ptz      .
      *                  *---------------------------------------------*
      *                  * 'Di proprieta''                             *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-tpc-pip    not  = w-ssm-dpm-tpc-mfi or
                     w-ssm-dpm-tpc-pfp    not  = w-ssm-dpm-tpc-mff
                     add   1              to   w-tot-gen-map-dpr      .
       agg-tot-gen-500.
      *              *-------------------------------------------------*
      *              * Aggiornamento quantita'                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico'                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Inizio periodo                          *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-tpc-mfi    to   w-tot-gen-fis-ini      .
      *                      *-----------------------------------------*
      *                      * Carichi                                 *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-tpc-mfc    to   w-tot-gen-fis-car      .
      *                      *-----------------------------------------*
      *                      * Scarichi                                *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-tpc-mfs    to   w-tot-gen-fis-sca      .
      *                      *-----------------------------------------*
      *                      * Fine periodo                            *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-tpc-mff    to   w-tot-gen-fis-fin      .
      *                  *---------------------------------------------*
      *                  * 'Di terzi'                                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Inizio periodo                          *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-tpc-pit    to   w-tot-gen-dtz-ini      .
      *                      *-----------------------------------------*
      *                      * Fine periodo                            *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-tpc-pft    to   w-tot-gen-dtz-fin      .
      *                  *---------------------------------------------*
      *                  * 'Presso terzi'                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Inizio periodo                          *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-tpc-pin    to   w-tot-gen-ptz-ini      .
      *                      *-----------------------------------------*
      *                      * Fine periodo                            *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-tpc-pfn    to   w-tot-gen-ptz-fin      .
      *                  *---------------------------------------------*
      *                  * 'Di proprieta''                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Inizio periodo                          *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-tpc-pip    to   w-tot-gen-dpr-ini      .
      *                      *-----------------------------------------*
      *                      * Fine periodo                            *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-tpc-pfp    to   w-tot-gen-dpr-fin      .
       agg-tot-gen-800.
      *              *-------------------------------------------------*
      *              * Aggiornamento decimali quantita'                *
      *              *-------------------------------------------------*
           if        w-ssm-dpm-dec-qta    >    w-tot-gen-dec-qta
                     move  w-ssm-dpm-dec-qta
                                          to   w-tot-gen-dec-qta      .
       agg-tot-gen-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     agg-tot-gen-999.
       agg-tot-gen-999.
           exit.

      *    *===========================================================*
      *    * Stampa totali generali                                    *
      *    *-----------------------------------------------------------*
       ssm-dpm-stp-tot-000.
      *              *-------------------------------------------------*
      *              * Test se totali generali da stampare             *
      *              *-------------------------------------------------*
           if        rr-snx-rie           not  = 2
                     go to ssm-dpm-stp-tot-900.
      *              *-------------------------------------------------*
      *              * Calcolo delle linee necessarie                  *
      *              *-------------------------------------------------*
           move      1                    to   w-tot-gen-lin-res      .
           if        w-tot-gen-map-dtz    >    zero
                     add   1              to   w-tot-gen-lin-res      .
           if        w-tot-gen-map-ptz    >    zero
                     add   1              to   w-tot-gen-lin-res      .
           if        w-tot-gen-map-dpr    >    zero
                     add   1              to   w-tot-gen-lin-res      .
       ssm-dpm-stp-tot-100.
      *              *-------------------------------------------------*
      *              * Test se numero linee residue sufficienti        *
      *              *-------------------------------------------------*
           if        p-res                >    w-tot-gen-lin-res
                     go to ssm-dpm-stp-tot-200.
       ssm-dpm-stp-tot-150.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Linea di chiusura                               *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "+-------------------------------------------------
      -              "---------+---+----------------+----------------+--
      -              "--------------+----------------+"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   ssm-dpm-stp-its-000  thru ssm-dpm-stp-its-999    .
      *              *-------------------------------------------------*
      *              * Se flag di uscita ad interruzione forzata : si  *
      *              * pone in On il flag corrispondente e si esce     *
      *              *-------------------------------------------------*
           if        w-ssm-dpm-flg-stp    not  = spaces
                     move  "#"            to   w-cnt-prn-flg-int
                     go to ssm-dpm-stp-tot-999.
       ssm-dpm-stp-tot-200.
      *              *-------------------------------------------------*
      *              * Stampa intestazione totali                      *
      *              *-------------------------------------------------*
       ssm-dpm-stp-tot-300.
      *              *-------------------------------------------------*
      *              * Linea 01                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      25                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      040                  to   p-pos                  .
           move      "Totale Magazzino fisico :"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico, inizio periodo'          *
      *                  *---------------------------------------------*
           move      w-tot-gen-dec-qta    to   w-stp-qta-dec          .
           move      066                  to   w-stp-qta-pos          .
           move      w-tot-gen-fis-ini    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico, Carichi nel periodo'     *
      *                  *---------------------------------------------*
           move      w-tot-gen-dec-qta    to   w-stp-qta-dec          .
           move      083                  to   w-stp-qta-pos          .
           move      w-tot-gen-fis-car    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico, Scarichi nel periodo'    *
      *                  *---------------------------------------------*
           move      w-tot-gen-dec-qta    to   w-stp-qta-dec          .
           move      100                  to   w-stp-qta-pos          .
           move      w-tot-gen-fis-sca    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico, Fine periodo'            *
      *                  *---------------------------------------------*
           move      w-tot-gen-dec-qta    to   w-stp-qta-dec          .
           move      117                  to   w-stp-qta-pos          .
           move      w-tot-gen-fis-fin    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
       ssm-dpm-stp-tot-400.
      *              *-------------------------------------------------*
      *              * Linea 02                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da stampare                         *
      *                  *---------------------------------------------*
           if        w-tot-gen-map-dtz    =    zero
                     go to ssm-dpm-stp-tot-500.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      25                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      040                  to   p-pos                  .
           move      "Totale Di terzi         :"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 'Proprieta' inizio periodo, Di terzi'       *
      *                  *---------------------------------------------*
           move      w-tot-gen-dec-qta    to   w-stp-qta-dec          .
           move      066                  to   w-stp-qta-pos          .
           move      w-tot-gen-dtz-ini    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
      *                  *---------------------------------------------*
      *                  * 'Proprieta' fine periodo, Di terzi'         *
      *                  *---------------------------------------------*
           move      w-tot-gen-dec-qta    to   w-stp-qta-dec          .
           move      117                  to   w-stp-qta-pos          .
           move      w-tot-gen-dtz-fin    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
       ssm-dpm-stp-tot-500.
      *              *-------------------------------------------------*
      *              * Linea 03                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da stampare                         *
      *                  *---------------------------------------------*
           if        w-tot-gen-map-ptz    =    zero
                     go to ssm-dpm-stp-tot-600.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      25                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      040                  to   p-pos                  .
           move      "Totale Presso terzi     :"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 'Proprieta' inizio periodo, Presso terzi'   *
      *                  *---------------------------------------------*
           move      w-tot-gen-dec-qta    to   w-stp-qta-dec          .
           move      066                  to   w-stp-qta-pos          .
           move      w-tot-gen-ptz-ini    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
      *                  *---------------------------------------------*
      *                  * 'Proprieta' fine periodo, Presso terzi'     *
      *                  *---------------------------------------------*
           move      w-tot-gen-dec-qta    to   w-stp-qta-dec          .
           move      117                  to   w-stp-qta-pos          .
           move      w-tot-gen-ptz-fin    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
       ssm-dpm-stp-tot-600.
      *              *-------------------------------------------------*
      *              * Linea 04                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da stampare                         *
      *                  *---------------------------------------------*
           if        w-tot-gen-map-dpr    =    zero
                     go to ssm-dpm-stp-tot-900.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      25                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      040                  to   p-pos                  .
           move      "Totale Di proprieta'    :"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 'Proprieta' inizio periodo, Di proprieta''  *
      *                  *---------------------------------------------*
           move      w-tot-gen-dec-qta    to   w-stp-qta-dec          .
           move      066                  to   w-stp-qta-pos          .
           move      w-tot-gen-dpr-ini    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
      *                  *---------------------------------------------*
      *                  * 'Proprieta' fine periodo, Di proprieta'     *
      *                  *---------------------------------------------*
           move      w-tot-gen-dec-qta    to   w-stp-qta-dec          .
           move      117                  to   w-stp-qta-pos          .
           move      w-tot-gen-dpr-fin    to   w-stp-qta-qta          .
           perform   stp-qta-mag-000      thru stp-qta-mag-999        .
       ssm-dpm-stp-tot-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ssm-dpm-stp-tot-999.
       ssm-dpm-stp-tot-999.
           exit.

      *    *===========================================================*
      *    * Stampa scheda elemento in esame, intestazione pagina      *
      *    *-----------------------------------------------------------*
       ssm-dpm-stp-its-000.
      *              *-------------------------------------------------*
      *              * Preliminari di inizio pagina                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento numero pagina                    *
      *                  *---------------------------------------------*
           move      p-pag                to   w-cnt-tit-num-pag      .
           add       1                    to   w-cnt-tit-num-pag      .
      *                  *---------------------------------------------*
      *                  * Numero linee per righe movimenti stampate   *
      *                  * nella pagina a zero                         *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-nlp-stp      .
       ssm-dpm-stp-its-100.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Se errore grave di i-o su stampa si pone in On  *
      *              * il flag di interruzione forzata e si esce       *
      *              *-------------------------------------------------*
           if        p-rsc                not  = spaces
                     move  "#"            to   w-ssm-dpm-flg-stp
                     go to ssm-dpm-stp-its-999.
       ssm-dpm-stp-its-200.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       ssm-dpm-stp-its-300.
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
       ssm-dpm-stp-its-310.
      *                  *---------------------------------------------*
      *                  * Ragione sociale azienda                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-ssm-dpm-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       ssm-dpm-stp-its-320.
      *                  *---------------------------------------------*
      *                  * Titolo centrale per lo stampato             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      049                  to   p-pos                  .
           move      "SCHEDA RIEPILOGATIVA MATERIE PRIME"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       ssm-dpm-stp-its-330.
      *                  *---------------------------------------------*
      *                  * Data minima movimenti da stampare           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      094                  to   p-pos                  .
           move      "Dal"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      098                  to   p-pos                  .
           move      w-ssm-dpm-dat-min    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       ssm-dpm-stp-its-340.
      *                  *---------------------------------------------*
      *                  * Data massima movimenti da stampare          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      108                  to   p-pos                  .
           move      "Al"                 to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      111                  to   p-pos                  .
           move      w-ssm-dpm-dat-max    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       ssm-dpm-stp-its-350.
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           if        w-cnt-tit-num-pag    >    9999
                     move  123            to   p-pos
           else if   w-cnt-tit-num-pag    >    999
                     move  124            to   p-pos
           else if   w-cnt-tit-num-pag    >    99
                     move  125            to   p-pos
           else if   w-cnt-tit-num-pag    >    9
                     move  126            to   p-pos
           else      move  127            to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           if        w-cnt-tit-num-pag    >    9999
                     move  5              to   p-car
           else if   w-cnt-tit-num-pag    >    999
                     move  4              to   p-car
           else if   w-cnt-tit-num-pag    >    99
                     move  3              to   p-car
           else if   w-cnt-tit-num-pag    >    9
                     move  2              to   p-car
           else      move  1              to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           if        w-cnt-tit-num-pag    >    9999
                     move  128            to   p-pos
           else if   w-cnt-tit-num-pag    >    999
                     move  129            to   p-pos
           else if   w-cnt-tit-num-pag    >    99
                     move  130            to   p-pos
           else if   w-cnt-tit-num-pag    >    9
                     move  131            to   p-pos
           else      move  132            to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       ssm-dpm-stp-its-400.
       ssm-dpm-stp-its-600.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       ssm-dpm-stp-its-700.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       ssm-dpm-stp-its-750.
      *              *-------------------------------------------------*
      *              * Subtitolo a pagina 1                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-pag    not  = 1
                     go to ssm-dpm-stp-its-800.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Subtitolo                                       *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      040                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           if        rr-snx-aum           =    01
                     move  "Solo materie prime movimentate          "
                                          to   p-alf
           else if   rr-snx-aum           =    02
                     move  "Materie prime movimentate o con giacenza"
                                          to   p-alf
           else      move  "Tutte le materie prime                  "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       ssm-dpm-stp-its-770.
      *              *-------------------------------------------------*
      *              * Intestazione dipendenza                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su contatore globale dipendenze        *
      *                  *---------------------------------------------*
           if        rr-dpz-ctr-dpz       not  > 1
                     go to ssm-dpm-stp-its-800.
      *                  *---------------------------------------------*
      *                  * Test se dipendenza selezionata a zero       *
      *                  *---------------------------------------------*
           if        rr-dpz-inu           =    zero
                     go to ssm-dpm-stp-its-800.
      *                      *-----------------------------------------*
      *                      * Editing codice dipendenza               *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      rr-dpz-inu           to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Composizione literal                    *
      *                      *-----------------------------------------*
           move      36                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      "Dipendenza"         to   w-all-str-cat (1)      .
           move      p-edt                to   w-all-str-cat (2)      .
           move      ":"                  to   w-all-str-cat (3)      .
           move      rr-dpz-inu-den       to   w-all-str-cat (4)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Allineamento a destra                   *
      *                      *-----------------------------------------*
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      36                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      097                  to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       ssm-dpm-stp-its-800.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura iniziale per riepilogo                *
      *              *-------------------------------------------------*
           perform   ssm-dpm-stp-fim-000  thru ssm-dpm-stp-fim-999    .
       ssm-dpm-stp-its-999.
           exit.

      *    *===========================================================*
      *    * Stampa scheda elemento in esame, fincatura iniziale per   *
      *    * riepilogo                                                 *
      *    *-----------------------------------------------------------*
       ssm-dpm-stp-fim-000.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * 1. linea di fincatura                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "+-------------------------------------------------
      -              "---------+---+----------------+----------------+--
      -              "--------------+----------------+"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * 2. linea di fincatura                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "| Codice e descrizione materia prima   Magazzino f
      -              "isico  > |Udm| Inizio periodo |     Carichi    |  
      -              "  Scarichi    |  Fine periodo  |"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * 3. linea di fincatura                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "+-------------------------------------------------
      -              "---------+---+----------------+----------------+--
      -              "--------------+----------------+"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       ssm-dpm-stp-fim-999.
           exit.

      *    *===========================================================*
      *    * Stampa scheda elemento in esame, azzeramento totali       *
      *    *-----------------------------------------------------------*
       ssm-dpm-stp-azt-000.
      *              *-------------------------------------------------*
      *              * Totali 'Magazzino fisico'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * 'Inizio periodo'                            *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-tpc-mfi      .
      *                  *---------------------------------------------*
      *                  * 'Carichi periodo'                           *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-tpc-mfc      .
      *                  *---------------------------------------------*
      *                  * 'Scarichi periodo'                          *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-tpc-mfs      .
      *                  *---------------------------------------------*
      *                  * 'Fine periodo'                              *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-tpc-mff      .
       ssm-dpm-stp-azt-100.
      *              *-------------------------------------------------*
      *              * Totali 'Proprieta' inizio periodo'              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico'                          *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-tpc-pim      .
      *                  *---------------------------------------------*
      *                  * 'Presso terzi'                              *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-tpc-pin      .
      *                  *---------------------------------------------*
      *                  * 'Di terzi'                                  *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-tpc-pit      .
      *                  *---------------------------------------------*
      *                  * 'Di proprieta''                             *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-tpc-pip      .
       ssm-dpm-stp-azt-200.
      *              *-------------------------------------------------*
      *              * Totali 'Proprieta' fine periodo'                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico'                          *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-tpc-pfm      .
      *                  *---------------------------------------------*
      *                  * 'Presso terzi'                              *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-tpc-pfn      .
      *                  *---------------------------------------------*
      *                  * 'Di terzi'                                  *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-tpc-pft      .
      *                  *---------------------------------------------*
      *                  * 'Di proprieta''                             *
      *                  *---------------------------------------------*
           move      zero                 to   w-ssm-dpm-tpc-pfp      .
       ssm-dpm-stp-azt-999.
           exit.

      *    *===========================================================*
      *    * Stampa scheda elemento in esame, determinazione valori    *
      *    * di inizio periodo per stampa riepilogo finale             *
      *    *                                                           *
      *    * Vengono determinati i seguenti valori :                   *
      *    *                                                           *
      *    * - w-ssm-dpm-tpc-mfi : 'Magazzino fisico, Inizio periodo'  *
      *    *                                                           *
      *    * - w-ssm-dpm-tpc-pin : 'Inizio periodo, Presso terzi'      *
      *    * - w-ssm-dpm-tpc-pit : 'Inizio periodo, Di terzi'          *
      *    *                                                           *
      *    * - w-ssm-dpm-tpc-pfn : 'Fine periodo, Presso terzi'        *
      *    * - w-ssm-dpm-tpc-pft : 'Fine periodo, Di terzi'            *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       ssm-dpm-stp-vit-000.
      *              *-------------------------------------------------*
      *              * Richiamo della routine di determinazione dei    *
      *              * saldi di magazzino per la determinazione del-   *
      *              * la giacenza di proprieta' alla data di inizio   *
      *              * periodo                                         *
      *              *-------------------------------------------------*
       ssm-dpm-stp-vit-010.
      *                  *---------------------------------------------*
      *                  * Preparazione parametri                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo operazione                         *
      *                      *-----------------------------------------*
           move      "SL"                 to   d-sld-mag-tip-ope      .
      *                      *-----------------------------------------*
      *                      * Tipo si saldo : giacenza di proprieta'  *
      *                      *-----------------------------------------*
           move      0100                 to   d-sld-mag-tip-sld      .
      *                      *-----------------------------------------*
      *                      * Data saldo : data minima movimenti di-  *
      *                      *              minuita di un giorno       *
      *                      *-----------------------------------------*
           move      w-ssm-dpm-dat-mmu    to   d-sld-mag-dat-sld      .
      *                      *-----------------------------------------*
      *                      * Una o tutte le dipendenze               *
      *                      *-----------------------------------------*
           move      "U"                  to   d-sld-mag-uot-dpz      .
      *                      *-----------------------------------------*
      *                      * Codice dipendenza                       *
      *                      *-----------------------------------------*
           move      w-ssm-dpm-cod-dpz    to   d-sld-mag-cod-dpz      .
      *                      *-----------------------------------------*
      *                      * Tipo codice di magazzino                *
      *                      *-----------------------------------------*
           move      w-ssm-dpm-tip-mag    to   d-sld-mag-tip-mag      .
      *                      *-----------------------------------------*
      *                      * Codice di magazzino                     *
      *                      *-----------------------------------------*
           move      w-ssm-dpm-num-mag    to   d-sld-mag-num-mag      .
      *                      *-----------------------------------------*
      *                      * Una o tutte le varianti                 *
      *                      *-----------------------------------------*
           move      "T"                  to   d-sld-mag-uot-var      .
      *                      *-----------------------------------------*
      *                      * Codice variante                         *
      *                      *-----------------------------------------*
           move      spaces               to   d-sld-mag-var-mag      .
       ssm-dpm-stp-vit-020.
      *                  *---------------------------------------------*
      *                  * Richiamo del sottoprogramma                 *
      *                  *---------------------------------------------*
           perform   det-sld-mag-cll-000  thru det-sld-mag-cll-999    .
       ssm-dpm-stp-vit-100.
      *              *-------------------------------------------------*
      *              * Saldi determinati in campi di destinazione      *
      *              *-------------------------------------------------*
       ssm-dpm-stp-vit-110.
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico, Inizio periodo'          *
      *                  *---------------------------------------------*
           move      d-sld-mag-sub-s01    to   w-ssm-dpm-tpc-mfi      .
       ssm-dpm-stp-vit-120.
      *                  *---------------------------------------------*
      *                  * 'Inizio periodo, Presso terzi'              *
      *                  *---------------------------------------------*
           move      d-sld-mag-sub-s02    to   w-ssm-dpm-tpc-pin      .
       ssm-dpm-stp-vit-130.
      *                  *---------------------------------------------*
      *                  * 'Inizio periodo, Di terzi'                  *
      *                  *---------------------------------------------*
           move      d-sld-mag-sub-s03    to   w-ssm-dpm-tpc-pit      .
       ssm-dpm-stp-vit-140.
      *                  *---------------------------------------------*
      *                  * 'Fine periodo, Presso terzi'                *
      *                  *---------------------------------------------*
           move      d-sld-mag-sub-s02    to   w-ssm-dpm-tpc-pfn      .
       ssm-dpm-stp-vit-150.
      *                  *---------------------------------------------*
      *                  * 'Fine periodo, Di terzi'                    *
      *                  *---------------------------------------------*
           move      d-sld-mag-sub-s03    to   w-ssm-dpm-tpc-pft      .
       ssm-dpm-stp-vit-200.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ssm-dpm-stp-vit-999.
       ssm-dpm-stp-vit-999.
           exit.

      *    *===========================================================*
      *    * Stampa scheda elemento in esame, accumulo su totali       *
      *    *-----------------------------------------------------------*
       ssm-dpm-stp-act-000.
      *              *-------------------------------------------------*
      *              * Aggiornamento magazzino fisico                  *
      *              *-------------------------------------------------*
       ssm-dpm-stp-act-050.
      *                  *---------------------------------------------*
      *                  * Se il tipo trattamento conto merce indicato *
      *                  * nel movimento e' 01, cioe' il movimento     *
      *                  * puo' riferirsi ad un altro movimento di     *
      *                  * merce in conto, ed inoltre e' citato un co- *
      *                  * dice di merce in conto, allora non si ese-  *
      *                  * gue nessun aggiornamento, in quanto saranno *
      *                  * aggiornati esclusivamente i correttivi di   *
      *                  * proprieta'                                  *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-mov-tmc    =    01   and
                     w-ssm-dpm-mov-cmc    not  = spaces
                     go to ssm-dpm-stp-act-400.
       ssm-dpm-stp-act-100.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo di movimento  *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-mov-tmo    =    01
                     go to ssm-dpm-stp-act-150
           else if   w-ssm-dpm-mov-tmo    =    02
                     go to ssm-dpm-stp-act-200
           else if   w-ssm-dpm-mov-tmo    =    03
                     go to ssm-dpm-stp-act-250
           else      go to ssm-dpm-stp-act-300.
       ssm-dpm-stp-act-150.
      *                  *---------------------------------------------*
      *                  * Se tipo di movimento 01 : Carico            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento 'Magazzino fisico, cari-  *
      *                      * chi nel periodo'                        *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-mov-qdm    to   w-ssm-dpm-tpc-mfc      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     ssm-dpm-stp-act-350.
       ssm-dpm-stp-act-200.
      *                  *---------------------------------------------*
      *                  * Se tipo di movimento 02 : Scarico           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento 'Magazzino fisico, scari- *
      *                      * chi nel periodo'                        *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-mov-qdm    to   w-ssm-dpm-tpc-mfs      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     ssm-dpm-stp-act-350.
       ssm-dpm-stp-act-250.
      *                  *---------------------------------------------*
      *                  * Se tipo di movimento 03 : Movimentazione    *
      *                  * interna                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento 'Magazzino fisico, cari-  *
      *                      * chi nel periodo'                        *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-mov-qdm    to   w-ssm-dpm-tpc-mfc      .
      *                      *-----------------------------------------*
      *                      * Aggiornamento 'Magazzino fisico, scari- *
      *                      * chi nel periodo'                        *
      *                      *-----------------------------------------*
           add       w-ssm-dpm-mov-qdm    to   w-ssm-dpm-tpc-mfs      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     ssm-dpm-stp-act-350.
       ssm-dpm-stp-act-300.
      *                  *---------------------------------------------*
      *                  * Se tipo di movimento non riconosciuto       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     ssm-dpm-stp-act-350.
       ssm-dpm-stp-act-350.
      *                  *---------------------------------------------*
      *                  * Ad aggiornamento correttivi di proprieta'   *
      *                  *---------------------------------------------*
           go to     ssm-dpm-stp-act-400.
       ssm-dpm-stp-act-400.
      *              *-------------------------------------------------*
      *              * Aggiornamento Correttivi di proprieta'          *
      *              *-------------------------------------------------*
       ssm-dpm-stp-act-450.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo di trattamen- *
      *                  * to merce in conto                           *
      *                  *---------------------------------------------*
           if        w-ssm-dpm-mov-tmc    =    01
                     go to ssm-dpm-stp-act-475
           else if   w-ssm-dpm-mov-tmc    =    02
                     go to ssm-dpm-stp-act-500
           else if   w-ssm-dpm-mov-tmc    =    03
                     go to ssm-dpm-stp-act-525.
       ssm-dpm-stp-act-475.
      *                  *---------------------------------------------*
      *                  * Se tipo di trattamento merce in conto : 01, *
      *                  * cioe' il movimento puo' riferirsi ad un al- *
      *                  * tro movimento di merce in conto             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se e' citato un codice di merce in con- *
      *                      * to si esegue l'aggiornamento correttivi *
      *                      * di proprieta', altrimenti no            *
      *                      *-----------------------------------------*
           if        w-ssm-dpm-mov-cmc    not  = spaces
                     go to ssm-dpm-stp-act-600
           else      go to ssm-dpm-stp-act-900.
       ssm-dpm-stp-act-500.
      *                  *---------------------------------------------*
      *                  * Se tipo di trattamento merce in conto : 02, *
      *                  * cioe' il movimento non puo' riferirsi a     *
      *                  * merce in conto                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Non si esegue alcun aggiornamento       *
      *                      *-----------------------------------------*
           go to     ssm-dpm-stp-act-900.
       ssm-dpm-stp-act-525.
      *                  *---------------------------------------------*
      *                  * Se tipo di trattamento merce in conto : 03, *
      *                  * cioe' il movimento stesso e' una movimenta- *
      *                  * zione di merce in conto                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Si esegue l'aggiornamento               *
      *                      *-----------------------------------------*
           go to     ssm-dpm-stp-act-600.
       ssm-dpm-stp-act-600.
      *                  *---------------------------------------------*
      *                  * Aggiornamento correttivi di proprieta'      *
      *                  *---------------------------------------------*
       ssm-dpm-stp-act-650.
      *                      *-----------------------------------------*
      *                      * Se il tipo conto merce non e' tra quel- *
      *                      * li previsti : no aggiornamento          *
      *                      *-----------------------------------------*
           if        w-ssm-dpm-mov-xmc    not  = "N" and
                     w-ssm-dpm-mov-xmc    not  = "T"
                     go to ssm-dpm-stp-act-900.
      *                      *-----------------------------------------*
      *                      * Se manca il codice conto merce : no ag- *
      *                      * giornamento                             *
      *                      *-----------------------------------------*
           if        w-ssm-dpm-mov-cmc    =    spaces
                     go to ssm-dpm-stp-act-900.
      *                      *-----------------------------------------*
      *                      * Se il tipo archivio non e' tra quelli   *
      *                      * previsti : no aggiornamento             *
      *                      *-----------------------------------------*
           if        w-ssm-dpm-mov-ati    not  = "C" and
                     w-ssm-dpm-mov-ati    not  = "F" and
                     w-ssm-dpm-mov-ati    not  = "V"
                     go to ssm-dpm-stp-act-900.
      *                      *-----------------------------------------*
      *                      * Se il codice archivio e' a zero : no    *
      *                      * aggiornamento                           *
      *                      *-----------------------------------------*
           if        w-ssm-dpm-mov-aco    =    zero
                     go to ssm-dpm-stp-act-900.
       ssm-dpm-stp-act-700.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del tipo movimento *
      *                      *-----------------------------------------*
           if        w-ssm-dpm-mov-tmo    =    01
                     go to ssm-dpm-stp-act-750
           else if   w-ssm-dpm-mov-tmo    =    02
                     go to ssm-dpm-stp-act-800
           else      go to ssm-dpm-stp-act-850.
       ssm-dpm-stp-act-750.
      *                      *-----------------------------------------*
      *                      * Se tipo di movimento 01 : Carico        *
      *                      *-----------------------------------------*
       ssm-dpm-stp-act-755.
      *                          *-------------------------------------*
      *                          * Deviazione a seconda del tipo conto *
      *                          * merce                               *
      *                          *-------------------------------------*
           if        w-ssm-dpm-mov-xmc    =    "N"
                     go to ssm-dpm-stp-act-760
           else      go to ssm-dpm-stp-act-765.
       ssm-dpm-stp-act-760.
      *                          *-------------------------------------*
      *                          * Se merce Presso terzi               *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Aggiornamento 'Proprieta' fine  *
      *                              * periodo, Presso terzi'          *
      *                              *---------------------------------*
           if        w-ssm-dpm-mov-tmc    =    01
                     add      w-ssm-dpm-mov-qdm
                                          to   w-ssm-dpm-tpc-pfn
           else      subtract w-ssm-dpm-mov-qdm
                                          from w-ssm-dpm-tpc-pfn      .
      *                              *---------------------------------*
      *                              * Continuazione                   *
      *                              *---------------------------------*
           go to     ssm-dpm-stp-act-900.
       ssm-dpm-stp-act-765.
      *                          *-------------------------------------*
      *                          * Se merce Di terzi presso di noi     *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Aggiornamento 'Proprieta' fine  *
      *                              * periodo, Di terzi'              *
      *                              *---------------------------------*
           if        w-ssm-dpm-mov-tmc    =    01
                     subtract w-ssm-dpm-mov-qdm
                                          from w-ssm-dpm-tpc-pft
           else      add      w-ssm-dpm-mov-qdm
                                          to   w-ssm-dpm-tpc-pft      .
      *                              *---------------------------------*
      *                              * Continuazione                   *
      *                              *---------------------------------*
           go to     ssm-dpm-stp-act-900.
       ssm-dpm-stp-act-800.
      *                      *-----------------------------------------*
      *                      * Se tipo di movimento 02 : Scarico       *
      *                      *-----------------------------------------*
       ssm-dpm-stp-act-805.
      *                          *-------------------------------------*
      *                          * Deviazione a seconda del tipo conto *
      *                          * merce                               *
      *                          *-------------------------------------*
           if        w-ssm-dpm-mov-xmc    =    "N"
                     go to ssm-dpm-stp-act-810
           else      go to ssm-dpm-stp-act-815.
       ssm-dpm-stp-act-810.
      *                          *-------------------------------------*
      *                          * Se merce Presso terzi               *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Aggiornamento 'Proprieta' fine  *
      *                              * periodo, Presso terzi'          *
      *                              *---------------------------------*
           if        w-ssm-dpm-mov-tmc    =    01
                     subtract w-ssm-dpm-mov-qdm
                                          from w-ssm-dpm-tpc-pfn
           else      add      w-ssm-dpm-mov-qdm
                                          to   w-ssm-dpm-tpc-pfn      .
      *                              *---------------------------------*
      *                              * Continuazione                   *
      *                              *---------------------------------*
           go to     ssm-dpm-stp-act-900.
       ssm-dpm-stp-act-815.
      *                          *-------------------------------------*
      *                          * Se merce Di terzi presso di noi     *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Aggiornamento 'Proprieta' fine  *
      *                              * periodo, Di terzi'              *
      *                              *---------------------------------*
           if        w-ssm-dpm-mov-tmc    =    01
                     add      w-ssm-dpm-mov-qdm
                                          to   w-ssm-dpm-tpc-pft
           else      subtract w-ssm-dpm-mov-qdm
                                          from w-ssm-dpm-tpc-pft      .
      *                              *---------------------------------*
      *                              * Continuazione                   *
      *                              *---------------------------------*
           go to     ssm-dpm-stp-act-900.
       ssm-dpm-stp-act-850.
      *                      *-----------------------------------------*
      *                      * Se tipo di movimento non riconosciuto   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Continuazione                       *
      *                          *-------------------------------------*
           go to     ssm-dpm-stp-act-900.
       ssm-dpm-stp-act-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ssm-dpm-stp-act-999.
       ssm-dpm-stp-act-999.
           exit.

      *    *===========================================================*
      *    * Stampa scheda elemento in esame, calcolo finale totali    *
      *    *-----------------------------------------------------------*
       ssm-dpm-stp-cft-000.
      *              *-------------------------------------------------*
      *              * Totali 'Magazzino fisico'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * 'Fine periodo'                              *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-tpc-mfi    to   w-ssm-dpm-tpc-mff      .
           add       w-ssm-dpm-tpc-mfc    to   w-ssm-dpm-tpc-mff      .
           subtract  w-ssm-dpm-tpc-mfs    from w-ssm-dpm-tpc-mff      .
       ssm-dpm-stp-cft-100.
      *              *-------------------------------------------------*
      *              * Totali 'Proprieta' inizio periodo'              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico'                          *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-tpc-mfi    to   w-ssm-dpm-tpc-pim      .
      *                  *---------------------------------------------*
      *                  * 'Di proprieta''                             *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-tpc-pim    to   w-ssm-dpm-tpc-pip      .
           add       w-ssm-dpm-tpc-pin    to   w-ssm-dpm-tpc-pip      .
           subtract  w-ssm-dpm-tpc-pit    from w-ssm-dpm-tpc-pip      .
       ssm-dpm-stp-cft-200.
      *              *-------------------------------------------------*
      *              * Totali 'Proprieta' fine periodo'                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * 'Magazzino fisico'                          *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-tpc-mff    to   w-ssm-dpm-tpc-pfm      .
      *                  *---------------------------------------------*
      *                  * 'Di proprieta''                             *
      *                  *---------------------------------------------*
           move      w-ssm-dpm-tpc-pfm    to   w-ssm-dpm-tpc-pfp      .
           add       w-ssm-dpm-tpc-pfn    to   w-ssm-dpm-tpc-pfp      .
           subtract  w-ssm-dpm-tpc-pft    from w-ssm-dpm-tpc-pfp      .
       ssm-dpm-stp-cft-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [zmc]                            *
      *    *-----------------------------------------------------------*
       let-arc-zmc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zmc-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione descrizione in uscita           *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zmc-des      .
      *              *-------------------------------------------------*
      *              * Se codice a zero : uscita                       *
      *              *-------------------------------------------------*
           if        w-let-arc-zmc-cod    =    zero
                     go to let-arc-zmc-999.
       let-arc-zmc-100.
      *              *-------------------------------------------------*
      *              * Lettura archivio [zmc]                          *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCAU    "         to   f-key                  .
           move      w-let-arc-zmc-cod    to   rf-zmc-cod-cau         .
           move      "pgm/mag/fls/ioc/obj/iofzmc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmc                 .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-zmc-900.
       let-arc-zmc-200.
      *              *-------------------------------------------------*
      *              * Se record esistente in [zmc]                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione da [zmc]         *
      *                  *---------------------------------------------*
           move      rf-zmc-des-cau       to   w-let-arc-zmc-des      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-zmc-999.
       let-arc-zmc-900.
      *              *-------------------------------------------------*
      *              * Record non esistente                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita a : non esistente            *
      *                  *---------------------------------------------*
           move      "#"                  to   w-let-arc-zmc-flg      .
      *                  *---------------------------------------------*
      *                  * Preparazione descrizione per record non e-  *
      *                  * sistente : 'Codice : (99999) ......'        *
      *                  *---------------------------------------------*
           move      w-let-arc-zmc-cod    to   w-let-arc-zmc-e11      .
           move      zero                 to   w-let-arc-zmc-e90      .
           inspect   w-let-arc-zmc-e10
                                      tallying w-let-arc-zmc-e90
                                  for leading spaces                  .
           add       1                    to   w-let-arc-zmc-e90      .
           move      spaces               to   w-let-arc-zmc-e20      .
           move      w-let-arc-zmc-e10
                    (w-let-arc-zmc-e90 :) to   w-let-arc-zmc-e20      .
           move      all   "."            to   w-let-arc-zmc-e30      .
           move      spaces               to   w-let-arc-zmc-des      .
           string    "Codice : ("
                                delimited by   size
                     w-let-arc-zmc-e20
                                delimited by   spaces
                     ") "
                                delimited by   size
                     w-let-arc-zmc-e30
                                delimited by   size
                                          into w-let-arc-zmc-des      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-zmc-999.
       let-arc-zmc-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [zmm]                            *
      *    *-----------------------------------------------------------*
       let-arc-zmm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zmm-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione descrizione in uscita           *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zmm-des      .
      *              *-------------------------------------------------*
      *              * Se codice a spaces : uscita                     *
      *              *-------------------------------------------------*
           if        w-let-arc-zmm-cod    =    spaces
                     go to let-arc-zmm-999.
       let-arc-zmm-100.
      *              *-------------------------------------------------*
      *              * Lettura archivio [zmm]                          *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCTM    "         to   f-key                  .
           move      w-let-arc-zmm-cod    to   rf-zmm-cod-ctm         .
           move      "pgm/mag/fls/ioc/obj/iofzmm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmm                 .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-zmm-900.
       let-arc-zmm-200.
      *              *-------------------------------------------------*
      *              * Se record esistente in [zmm]                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione da [zmm]         *
      *                  *---------------------------------------------*
           move      rf-zmm-des-ctm       to   w-let-arc-zmm-des      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-zmm-999.
       let-arc-zmm-900.
      *              *-------------------------------------------------*
      *              * Record non esistente                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita a : non esistente            *
      *                  *---------------------------------------------*
           move      "#"                  to   w-let-arc-zmm-flg      .
      *                  *---------------------------------------------*
      *                  * Preparazione descrizione per record non e-  *
      *                  * sistente : 'Codice : (XXX) ......'          *
      *                  *---------------------------------------------*
           move      all   "."            to   w-let-arc-zmm-e30      .
           move      spaces               to   w-let-arc-zmm-des      .
           string    "Codice : ("
                                delimited by   size
                     w-let-arc-zmm-cod
                                delimited by   spaces
                     ") "
                                delimited by   size
                     w-let-arc-zmm-e30
                                delimited by   size
                                          into w-let-arc-zmm-des      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-zmm-999.
       let-arc-zmm-999.
           exit.

      *    *===========================================================*
      *    * Lettura archivio [dcc] o [cli]                            *
      *    *-----------------------------------------------------------*
       let-arc-dcx-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcx-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione ragione sociale in uscita       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcx-rag      .
      *              *-------------------------------------------------*
      *              * Se codice a zero : uscita                       *
      *              *-------------------------------------------------*
           if        w-let-arc-dcx-cod    =    zero
                     go to let-arc-dcx-999.
       let-arc-dcx-100.
      *              *-------------------------------------------------*
      *              * Lettura archivio [dcc]                          *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-let-arc-dcx-cod    to   rf-dcc-cod-cli         .
           move      w-let-arc-dcx-dpz    to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-dcx-300.
       let-arc-dcx-200.
      *              *-------------------------------------------------*
      *              * Se record esistente in [dcc]                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Memorizzazione ragione sociale da [dcc]     *
      *                  *---------------------------------------------*
           move      rf-dcc-rag-soc       to   w-let-arc-dcx-rag      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-dcx-999.
       let-arc-dcx-300.
      *              *-------------------------------------------------*
      *              * Se record non esistente in [dcc]                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se il tentativo di lettura da [dcc] si ri-  *
      *                  * feriva ad una dipendenza, allora si prova   *
      *                  * a leggere l'anagrafica principale da [dcc], *
      *                  * altrimenti si prova a leggere l'anagrafica  *
      *                  * da [cli]                                    *
      *                  *---------------------------------------------*
           if        w-let-arc-dcx-dpz    =    spaces
                     go to let-arc-dcx-700.
       let-arc-dcx-400.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcc], per l'anagrafica    *
      *                  * principale                                  *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-let-arc-dcx-cod    to   rf-dcc-cod-cli         .
           move      spaces               to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito della let-  *
      *                  * tura                                        *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-dcx-600.
       let-arc-dcx-500.
      *                  *---------------------------------------------*
      *                  * Se record esistente in [dcc]                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Memorizzazione ragione sociale da [dcc] *
      *                      *-----------------------------------------*
           move      rf-dcc-rag-soc       to   w-let-arc-dcx-rag      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-dcx-999.
       let-arc-dcx-600.
      *                  *---------------------------------------------*
      *                  * Se record non esistente in [dcc]            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * A lettura record da [cli]               *
      *                      *-----------------------------------------*
           go to     let-arc-dcx-700.
       let-arc-dcx-700.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [cli]                      *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-let-arc-dcx-cod    to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito della let-  *
      *                  * tura                                        *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-dcx-900.
       let-arc-dcx-800.
      *                  *---------------------------------------------*
      *                  * Se record esistente in [cli]                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Memorizzazione ragione sociale da [cli] *
      *                      *-----------------------------------------*
           move      rf-cli-rag-soc       to   w-let-arc-dcx-rag      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-dcx-999.
       let-arc-dcx-900.
      *                  *---------------------------------------------*
      *                  * Se record non esistente in [cli]            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di uscita a : non esistente        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-let-arc-dcx-flg      .
      *                      *-----------------------------------------*
      *                      * Preparazione ragione sociale per record *
      *                      * non esistente : 'Codice : (9999999) ..' *
      *                      *-----------------------------------------*
           move      w-let-arc-dcx-cod    to   w-let-arc-dcx-e11      .
           move      zero                 to   w-let-arc-dcx-e90      .
           inspect   w-let-arc-dcx-e10
                                      tallying w-let-arc-dcx-e90
                                  for leading spaces                  .
           add       1                    to   w-let-arc-dcx-e90      .
           move      spaces               to   w-let-arc-dcx-e20      .
           move      w-let-arc-dcx-e10
                    (w-let-arc-dcx-e90 :) to   w-let-arc-dcx-e20      .
           move      all   "."            to   w-let-arc-dcx-e30      .
           move      spaces               to   w-let-arc-dcx-rag      .
           string    "Codice : ("
                                delimited by   size
                     w-let-arc-dcx-e20
                                delimited by   spaces
                     ") "
                                delimited by   size
                     w-let-arc-dcx-e30
                                delimited by   size
                                          into w-let-arc-dcx-rag      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-dcx-999.
       let-arc-dcx-999.
           exit.

      *    *===========================================================*
      *    * Lettura archivio [dcf] o [fnt]                            *
      *    *-----------------------------------------------------------*
       let-arc-dfx-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dfx-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione ragione sociale in uscita       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dfx-rag      .
      *              *-------------------------------------------------*
      *              * Se codice a zero : uscita                       *
      *              *-------------------------------------------------*
           if        w-let-arc-dfx-cod    =    zero
                     go to let-arc-dfx-999.
       let-arc-dfx-100.
      *              *-------------------------------------------------*
      *              * Lettura archivio [dcf]                          *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      w-let-arc-dfx-cod    to   rf-dcf-cod-fnt         .
           move      w-let-arc-dfx-dpz    to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-dfx-300.
       let-arc-dfx-200.
      *              *-------------------------------------------------*
      *              * Se record esistente in [dcf]                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Memorizzazione ragione sociale da [dcf]     *
      *                  *---------------------------------------------*
           move      rf-dcf-rag-soc       to   w-let-arc-dfx-rag      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-dfx-999.
       let-arc-dfx-300.
      *              *-------------------------------------------------*
      *              * Se record non esistente in [dcf]                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se il tentativo di lettura da [dcf] si ri-  *
      *                  * feriva ad una dipendenza, allora si prova   *
      *                  * a leggere l'anagrafica principale da [dcf], *
      *                  * altrimenti si prova a leggere l'anagrafica  *
      *                  * da [fnt]                                    *
      *                  *---------------------------------------------*
           if        w-let-arc-dfx-dpz    =    spaces
                     go to let-arc-dfx-700.
       let-arc-dfx-400.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcf], per l'anagrafica    *
      *                  * principale                                  *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      w-let-arc-dfx-cod    to   rf-dcf-cod-fnt         .
           move      spaces               to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito della let-  *
      *                  * tura                                        *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-dfx-600.
       let-arc-dfx-500.
      *                  *---------------------------------------------*
      *                  * Se record esistente in [dcf]                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Memorizzazione ragione sociale da [dcf] *
      *                      *-----------------------------------------*
           move      rf-dcf-rag-soc       to   w-let-arc-dfx-rag      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-dfx-999.
       let-arc-dfx-600.
      *                  *---------------------------------------------*
      *                  * Se record non esistente in [dcf]            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * A lettura record da [fnt]               *
      *                      *-----------------------------------------*
           go to     let-arc-dfx-700.
       let-arc-dfx-700.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [fnt]                      *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      w-let-arc-dfx-cod    to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito della let-  *
      *                  * tura                                        *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-dfx-900.
       let-arc-dfx-800.
      *                  *---------------------------------------------*
      *                  * Se record esistente in [fnt]                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Memorizzazione ragione sociale da [fnt] *
      *                      *-----------------------------------------*
           move      rf-fnt-rag-soc       to   w-let-arc-dfx-rag      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-dfx-999.
       let-arc-dfx-900.
      *                  *---------------------------------------------*
      *                  * Se record non esistente in [fnt]            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di uscita a : non esistente        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-let-arc-dfx-flg      .
      *                      *-----------------------------------------*
      *                      * Preparazione ragione sociale per record *
      *                      * non esistente : 'Codice : (9999999) ..' *
      *                      *-----------------------------------------*
           move      w-let-arc-dfx-cod    to   w-let-arc-dfx-e11      .
           move      zero                 to   w-let-arc-dfx-e90      .
           inspect   w-let-arc-dfx-e10
                                      tallying w-let-arc-dfx-e90
                                  for leading spaces                  .
           add       1                    to   w-let-arc-dfx-e90      .
           move      spaces               to   w-let-arc-dfx-e20      .
           move      w-let-arc-dfx-e10
                    (w-let-arc-dfx-e90 :) to   w-let-arc-dfx-e20      .
           move      all   "."            to   w-let-arc-dfx-e30      .
           move      spaces               to   w-let-arc-dfx-rag      .
           string    "Codice : ("
                                delimited by   size
                     w-let-arc-dfx-e20
                                delimited by   spaces
                     ") "
                                delimited by   size
                     w-let-arc-dfx-e30
                                delimited by   size
                                          into w-let-arc-dfx-rag      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-dfx-999.
       let-arc-dfx-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [dpz]                            *
      *    *                                                           *
      *    * Si presume che il programma chiamante abbia preventiva-   *
      *    * mente richiamato la funzione di  "determinazione dipen-   *
      *    * denze esistenti per l'azienda" e che pertanto la tabel-   *
      *    * la dipendenze w-dpz-tbl-dpz risulti carica di valori      *
      *    *-----------------------------------------------------------*
       let-arc-dpz-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dpz-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione descrizione in uscita           *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dpz-des      .
      *              *-------------------------------------------------*
      *              * Se codice a zero : uscita                       *
      *              *-------------------------------------------------*
           if        w-let-arc-dpz-cod    =    zero
                     go to let-arc-dpz-999.
       let-arc-dpz-100.
      *              *-------------------------------------------------*
      *              * Se codice dipendenza non accettabile : come per *
      *              * record non esistente                            *
      *              *-------------------------------------------------*
           if        w-let-arc-dpz-cod    <    01 or
                     w-let-arc-dpz-cod    >    99
                     go to let-arc-dpz-900.
      *              *-------------------------------------------------*
      *              * Se dipendenza non memorizzata : come per record *
      *              * non esistente                                   *
      *              *-------------------------------------------------*
           if        w-dpz-ele-flg
                    (w-let-arc-dpz-cod)   =    spaces
                     go to let-arc-dpz-900.
       let-arc-dpz-200.
      *              *-------------------------------------------------*
      *              * Record esistente                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione da tabella pre-  *
      *                  * caricata                                    *
      *                  *---------------------------------------------*
           move      w-dpz-ele-den
                    (w-let-arc-dpz-cod)   to   w-let-arc-dpz-des      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-dpz-999.
       let-arc-dpz-900.
      *              *-------------------------------------------------*
      *              * Record non esistente                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita a : non esistente            *
      *                  *---------------------------------------------*
           move      "#"                  to   w-let-arc-dpz-flg      .
      *                  *---------------------------------------------*
      *                  * Preparazione descrizione per record non e-  *
      *                  * sistente : 'Codice : (99) ......'           *
      *                  *---------------------------------------------*
           move      w-let-arc-dpz-cod    to   w-let-arc-dpz-e11      .
           move      zero                 to   w-let-arc-dpz-e90      .
           inspect   w-let-arc-dpz-e10
                                      tallying w-let-arc-dpz-e90
                                  for leading spaces                  .
           add       1                    to   w-let-arc-dpz-e90      .
           move      spaces               to   w-let-arc-dpz-e20      .
           move      w-let-arc-dpz-e10
                    (w-let-arc-dpz-e90 :) to   w-let-arc-dpz-e20      .
           move      all   "."            to   w-let-arc-dpz-e30      .
           move      spaces               to   w-let-arc-dpz-des      .
           string    "Codice : ("
                                delimited by   size
                     w-let-arc-dpz-e20
                                delimited by   spaces
                     ") "
                                delimited by   size
                     w-let-arc-dpz-e30
                                delimited by   size
                                          into w-let-arc-dpz-des      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-dpz-999.
       let-arc-dpz-999.
           exit.

      *    *===========================================================*
      *    * Subroutine per la stampa di una quantita'                 *
      *    *-----------------------------------------------------------*
       stp-qta-mag-000.
      *              *-------------------------------------------------*
      *              * Stampa                                          *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           if        w-stp-qta-qta        >    99999999 or
                     w-stp-qta-qta        <   -99999999
                     move  10             to   p-car
                     move  "D"            to   p-edm
           else      move  08             to   p-car
                     move  "G"            to   p-edm                  .
           move      w-stp-qta-dec        to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-qta-pos        to   p-pos                  .
           move      w-stp-qta-qta        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-qta-mag-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-qta-mag-999.
       stp-qta-mag-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [age]                         *
      *    *-----------------------------------------------------------*
       let-arc-age-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-age-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-age-cod    =    zero
                     go to let-arc-age-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODAGE"             to   f-key                  .
           move      w-let-arc-age-cod    to   rf-age-cod-age         .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-age-400.
       let-arc-age-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-age-nom-age       to   w-let-arc-age-nom      .
           move      rf-age-rag-soc       to   w-let-arc-age-rag      .
           move      rf-age-via-age       to   w-let-arc-age-via      .
           move      rf-age-loc-age       to   w-let-arc-age-loc      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-age-999.
       let-arc-age-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-age-flg      .
           move      all   "."            to   w-let-arc-age-nom      .
           go to     let-arc-age-600.
       let-arc-age-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-age-nom      .
       let-arc-age-600.
           move      spaces               to   w-let-arc-age-rag      .
           move      spaces               to   w-let-arc-age-via      .
           move      spaces               to   w-let-arc-age-loc      .
       let-arc-age-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per determinazione saldo di magazzino         *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldmag0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

