       Identification Division.
       Program-Id.                                 pmag6800           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    mag                 *
      *                                Settore:    inv                 *
      *                                   Fase:    mag680              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 03/12/92    *
      *                       Ultima revisione:    NdK del 01/01/25    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Generazione differenze inventariali         *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "mag"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "inv"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "mag680"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pmag6800"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "   GENERAZIONE DIFFERENZE INVENTARIALI  "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "msegrt" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine qry-rou-pri-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-qry-rou-pri      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su modalita' di funzionamento      *
      *        *-------------------------------------------------------*
           05  w-cnt-mfu.
      *            *---------------------------------------------------*
      *            * Visualizzazione forzata da segreteria             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-vis-sgr      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste pre esecuzione interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico interrogazione        *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento automatico interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-aut      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di Si/No primo giro di esecuzione            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-prm-gir      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento qry-routine       *
      *        *-------------------------------------------------------*
           05  w-cnt-qry.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-qry-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-liv.
                   15  w-cnt-qry-sav-l05  pic  x(64)                  .
                   15  w-cnt-qry-sav-l04  pic  x(64)                  .
                   15  w-cnt-qry-sav-l03  pic  x(64)                  .
                   15  w-cnt-qry-sav-l02  pic  x(64)                  .
                   15  w-cnt-qry-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Literals                                              *
      *        *-------------------------------------------------------*
           05  w-cnt-lit.
               10  w-cnt-lit-t80          pic  x(80) value all "="    .

      *    *===========================================================*
      *    * Record file                                               *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [mim]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmim"                          .
      *        *-------------------------------------------------------*
      *        * [miu]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmiu"                          .
      *        *-------------------------------------------------------*
      *        * [zmc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfzmc"                          .
      *        *-------------------------------------------------------*
      *        * [datinv]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/num/rec/rndatinv"                       .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .

      *    *===========================================================*
      *    * Work-area referenze                                       *
      *    *-----------------------------------------------------------*
       01  w-ref.
      *        *-------------------------------------------------------*
      *        * Referenze per causali di magazzino di differenza in-  *
      *        * ventariale                                            *
      *        *-------------------------------------------------------*
           05  w-ref-cau-mag.
               10  w-ref-cau-mag-str      pic  x(35)                  .
               10  w-ref-cau-mag-str-r    redefines
                   w-ref-cau-mag-str.
                   15  w-ref-cau-mag-dip  pic  9(05)                  .
                   15  filler             pic  x(01)                  .
                   15  w-ref-cau-mag-din  pic  9(05)                  .
                   15  filler             pic  x(01)                  .
                   15  w-ref-cau-mag-dpn  pic  9(05)                  .
                   15  filler             pic  x(01)                  .
                   15  w-ref-cau-mag-dnn  pic  9(05)                  .
                   15  filler             pic  x(01)                  .
                   15  w-ref-cau-mag-dpt  pic  9(05)                  .
                   15  filler             pic  x(01)                  .
                   15  w-ref-cau-mag-dnt  pic  9(05)                  .

      *    *===========================================================*
      *    * Work-area richieste per programma                         *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Tipo inventario                                       *
      *        *  - F : Inventario di fine esercizio                   *
      *        *  - I : Inventario infraannuale                        *
      *        *-------------------------------------------------------*
           05  rr-tip-inv                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Data inventario                                       *
      *        *-------------------------------------------------------*
           05  rr-dat-inv                 pic  9(07)                  .

      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Si/No gestione delle ubicazioni come dislocazioni     *
      *        *-------------------------------------------------------*
           05  w-prs-ucd-snx              pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det causali di magazzino                     *
      *        *-------------------------------------------------------*
           05  w-det-cau-mag.
      *            *---------------------------------------------------*
      *            * Flag di uscita                                    *
      *            *---------------------------------------------------*
               10  w-det-cau-mag-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Contatore                                         *
      *            *---------------------------------------------------*
               10  w-det-cau-mag-ctr      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione quantita' gia' rilevate prodotto   *
      *        * in altre ubicazioni                                   *
      *        *-------------------------------------------------------*
           05  w-det-qtu-pro.
      *            *---------------------------------------------------*
      *            * Codice numerico prodotto                          *
      *            *---------------------------------------------------*
               10  w-det-qtu-pro-num      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Quantita' presunta                                *
      *            *---------------------------------------------------*
               10  w-det-qtu-pro-prs      pic s9(10)v9(03)            .
      *            *---------------------------------------------------*
      *            * Quantita' rilevata                                *
      *            *---------------------------------------------------*
               10  w-det-qtu-pro-rlv      pic s9(10)v9(03)            .
      *            *---------------------------------------------------*
      *            * Flag di rilevazione eseguita                      *
      *            *---------------------------------------------------*
               10  w-det-qtu-pro-flg      pic  x(01)                  .

      *    *===========================================================*
      *    * Work per routine gen-aut-mdi-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-gen-aut-mdi.
      *        *-------------------------------------------------------*
      *        * Data registrazione per movimenti di magazzino         *
      *        *-------------------------------------------------------*
           05  w-gen-aut-mdi-dtr          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-gen-aut-mdi-ctr          pic  9(09)                  .

      *    *===========================================================*
      *    * Work per routine gen-mov-dip-000/999                      *
      *    *                                                           *
      *    * Generazione movimento per differenze inventariali positi- *
      *    * ve                                                        *
      *    *-----------------------------------------------------------*
       01  w-gen-mov-dip.
      *        *-------------------------------------------------------*
      *        * Contatori di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-gen-mov-dip-ctr          pic  9(05)                  .
           05  w-gen-mov-dip-max          pic  9(05) value 800        .

      *    *===========================================================*
      *    * Work per routine gen-mov-din-000/999                      *
      *    *                                                           *
      *    * Generazione movimento per differenze inventariali negati- *
      *    * ve                                                        *
      *    *-----------------------------------------------------------*
       01  w-gen-mov-din.
      *        *-------------------------------------------------------*
      *        * Contatori di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-gen-mov-din-ctr          pic  9(05)                  .
           05  w-gen-mov-din-max          pic  9(05) value 800        .

      *    *===========================================================*
      *    * Work per routine gen-mov-dpn-000/999                      *
      *    *                                                           *
      *    * Generazione movimento per differenze inventariali positi- *
      *    * ve merci presso di noi                                    *
      *    *-----------------------------------------------------------*
       01  w-gen-mov-dpn.
      *        *-------------------------------------------------------*
      *        * Contatori di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-gen-mov-dpn-ctr          pic  9(05)                  .
           05  w-gen-mov-dpn-max          pic  9(05) value 800        .

      *    *===========================================================*
      *    * Work per routine gen-mov-dnn-000/999                      *
      *    *                                                           *
      *    * Generazione movimento per differenze inventariali negati- *
      *    * ve merci presso di noi                                    *
      *    *-----------------------------------------------------------*
       01  w-gen-mov-dnn.
      *        *-------------------------------------------------------*
      *        * Contatori di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-gen-mov-dnn-ctr          pic  9(05)                  .
           05  w-gen-mov-dnn-max          pic  9(05) value 800        .

      *    *===========================================================*
      *    * Work per routine gen-mov-dpt-000/999                      *
      *    *                                                           *
      *    * Generazione movimento per differenze inventariali positi- *
      *    * ve merci presso terzi                                     *
      *    *-----------------------------------------------------------*
       01  w-gen-mov-dpt.
      *        *-------------------------------------------------------*
      *        * Contatori di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-gen-mov-dpt-ctr          pic  9(05)                  .
           05  w-gen-mov-dpt-max          pic  9(05) value 800        .

      *    *===========================================================*
      *    * Work per routine gen-mov-dnt-000/999                      *
      *    *                                                           *
      *    * Generazione movimento per differenze inventariali negati- *
      *    * ve merci presso terzi                                     *
      *    *-----------------------------------------------------------*
       01  w-gen-mov-dnt.
      *        *-------------------------------------------------------*
      *        * Contatori di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-gen-mov-dnt-ctr          pic  9(05)                  .
           05  w-gen-mov-dnt-max          pic  9(05) value 800        .

      *    *===========================================================*
      *    * Work per routine gen-mov-dcd-000/999                      *
      *    *                                                           *
      *    * Generazione movimenti per cambio dislocazione             *
      *    *-----------------------------------------------------------*
       01  w-gen-mov-dcd.
      *        *-------------------------------------------------------*
      *        * Contatori di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-gen-mov-dcd-ctr          pic  9(05)                  .
           05  w-gen-mov-dcd-max          pic  9(05) value 800        .

      *    *===========================================================*
      *    * Work parametri di rottura                                 *
      *    *-----------------------------------------------------------*
       01  w-rot.
           05  w-rot-cod-dpz              pic  9(02)                  .
           05  w-rot-tip-arc              pic  x(01)                  .
           05  w-rot-cod-arc              pic  9(07)                  .
           05  w-rot-dpz-arc              pic  x(04)                  .
           05  w-rot-cod-mic              pic  x(03)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo di inventario                         *
      *        *-------------------------------------------------------*
           05  w-exp-tip-inv.
               10  w-exp-tip-inv-num      pic  9(02)       value 2    .
               10  w-exp-tip-inv-lun      pic  9(02)       value 30   .
               10  w-exp-tip-inv-tbl.
                   15  filler             pic  x(30) value
                            "Inventario infra-annuale      "          .
                   15  filler             pic  x(30) value
                            "Inventario di fine esercizio  "          .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err su controllo tasto Do                    *
      *        *-------------------------------------------------------*
           05  w-box-msg-err.
               10  w-err-box-err-msg      pic  x(56)                  .

      *    *===========================================================*
      *    * Work-area per routine msg-pne-1rg-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-msg-pne-1rg.
           05  w-msg-pne-1rg-msg          pic  x(72)                  .

      *    *===========================================================*
      *    * Work-area per routine msg-pne-2rg-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-msg-pne-2rg.
           05  w-msg-pne-2rg-m01          pic  x(72)                  .
           05  w-msg-pne-2rg-m02          pic  x(72)                  .

      *    *===========================================================*
      *    * Area di comunicazione per movimento di magazzino          *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/pmag300z.pgl"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Se no richieste : a esecuzione programma        *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-500.
       main-250.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-500.
      *              *-------------------------------------------------*
      *              * Esecuzione in foreground                        *
      *              *-------------------------------------------------*
           perform   exe-pgm-frg-000      thru exe-pgm-frg-999        .
       main-750.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Flag di eventuale visualizzazione forzata       *
      *              *-------------------------------------------------*
           move      s-sts                to   w-cnt-mfu-vis-sgr      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Programma di esecuzione in foreground                     *
      *    *-----------------------------------------------------------*
       exe-pgm-frg-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione rullino messaggi di foreground *
      *              *-------------------------------------------------*
           move      "OF"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Se errore : uscita                          *
      *                  *---------------------------------------------*
            if       m-rsc                not  = spaces
                     go to exe-pgm-frg-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Esecuzione del programma                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Generazione automatica movimenti di diffe-  *
      *                  * renza inventariale                          *
      *                  *---------------------------------------------*
           perform   gen-aut-mdi-000      thru gen-aut-mdi-999        .
      *              *-------------------------------------------------*
      *              * Messaggio di fine programma in esecuzione       *
      *              *-------------------------------------------------*
           move      "FE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visual. eventuali errori di esecuzione      *
      *                  *---------------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "F"                  to   b-tfe                  .
           move      i-ide-des            to   b-chr                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
           cancel    "swd/mod/prg/obj/mbckgv"                         .
       exe-pgm-frg-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
       pre-exe-pgm-010.
      *              *-------------------------------------------------*
      *              * Test se programma eseguibile                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su flag di eventuale visualizzazione   *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-vis-sgr    not  = "V"
                     go to pre-exe-pgm-050.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Programma non eseguibile dall'utente !            
      -              "               "    to   w-err-box-err-msg      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione messaggio di errore         *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-exe-pgm      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-exe-pgm-999.
       pre-exe-pgm-050.
      *              *-------------------------------------------------*
      *              * Visualizzazione titolo programma                *
      *              *-------------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *              *-------------------------------------------------*
      *              * Lettura numerazione relativa agli inventari     *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
           move      "RD"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *              *-------------------------------------------------*
      *              * Se fase di inventario non ancora in corso       *
      *              *-------------------------------------------------*
           if        rn-dat-inv-tip-iic   not  = spaces
                     go to pre-exe-pgm-100.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Non esistono inventari in corso.                  
      -              "                      "
                                          to   w-msg-pne-1rg-msg      .
           perform   msg-pne-1rg-000      thru msg-pne-1rg-999        .
      *                  *---------------------------------------------*
      *                  * Uscita con errore                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-exe-pgm      .
           go to     pre-exe-pgm-999.
       pre-exe-pgm-100.
      *              *-------------------------------------------------*
      *              * Se generazione movimenti di differenza inventa- *
      *              * riale gia' eseguita                             *
      *              *-------------------------------------------------*
           if        rn-dat-inv-flg-gdi   =    spaces
                     go to pre-exe-pgm-200.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Questa fase e' gia' stata completata.             
      -              "                      "
                                          to   w-msg-pne-1rg-msg      .
           perform   msg-pne-1rg-000      thru msg-pne-1rg-999        .
      *                  *---------------------------------------------*
      *                  * Uscita con errore                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-exe-pgm      .
           go to     pre-exe-pgm-999.
       pre-exe-pgm-200.
      *              *-------------------------------------------------*
      *              * Memorizzazione tipo inventario                  *
      *              *-------------------------------------------------*
            move     rn-dat-inv-tip-iic   to   rr-tip-inv             .
      *              *-------------------------------------------------*
      *              * Memorizzazione data inizio inventario           *
      *              *-------------------------------------------------*
            move     rn-dat-inv-dat-ini   to   rr-dat-inv             .
      *              *-------------------------------------------------*
      *              * Determinazione causali di magazzino             *
      *              *-------------------------------------------------*
           perform   det-cau-mag-000      thru det-cau-mag-999        .
      *              *-------------------------------------------------*
      *              * Test su esito determinazione                    *
      *              *-------------------------------------------------*
           if        w-det-cau-mag-flg    =    spaces
                     go to pre-exe-pgm-300.
      *                  *---------------------------------------------*
      *                  * Uscita con errore                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-exe-pgm      .
           go to     pre-exe-pgm-999.
       pre-exe-pgm-300.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Si/No gestione delle ubicazioni come        *
      *                  * dislocazioni                                *
      *                  *---------------------------------------------*
           perform   prs-ucd-snx-000      thru prs-ucd-snx-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Si/No gestione ubicazioni     *
      *    *                             come dislocazioni             *
      *    *-----------------------------------------------------------*
       prs-ucd-snx-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/mag/dsl[snx-ubi]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-ucd-snx
           else      move  spaces         to   w-prs-ucd-snx          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-ucd-snx        not  = "S"
                     move  "N"            to   w-prs-ucd-snx          .
       prs-ucd-snx-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si richieste ad utente                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * No funzionamento ciclico                        *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-cic      .
      *              *-------------------------------------------------*
      *              * No funzionamento automatico                     *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-aut      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * Open modulo gestione movimenti di MAG           *
      *              *-------------------------------------------------*
           perform   mdl-agg-mag-opn-000  thru mdl-agg-mag-opn-999    .
      *              *-------------------------------------------------*
      *              * [mim]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *              *-------------------------------------------------*
      *              * [miu]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmiu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-miu                 .
      *              *-------------------------------------------------*
      *              * [datinv]                                        *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Close modulo gestione movimenti di MAG          *
      *              *-------------------------------------------------*
           perform   mdl-agg-mag-cls-000  thru mdl-agg-mag-cls-999    .
       rou-cls-fls-100.
      *              *-------------------------------------------------*
      *              * [mim]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *              *-------------------------------------------------*
      *              * [miu]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmiu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-miu                 .
      *              *-------------------------------------------------*
      *              * [datinv]                                        *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "Conferma esecuzione (S/E) ?"
                                          to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "SE"                 to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts per : Tipo inventario   *
      *              *-------------------------------------------------*
           perform   pmt-tip-inv-000      thru pmt-tip-inv-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione : Tipo di inventario            *
      *              *-------------------------------------------------*
           perform   vis-tip-inv-000      thru vis-tip-inv-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts per : Data inventario   *
      *              *-------------------------------------------------*
           perform   pmt-dat-inv-000      thru pmt-dat-inv-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione : Data inventario               *
      *              *-------------------------------------------------*
           perform   vis-dat-inv-000      thru vis-dat-inv-999        .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per : Tipo di inventario          *
      *    *-----------------------------------------------------------*
       pmt-tip-inv-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo di inventario         :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-tip-inv-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per : Data inventario             *
      *    *-----------------------------------------------------------*
       pmt-dat-inv-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data inventario            :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dat-inv-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo selezione : Tipo di inventario      *
      *    *-----------------------------------------------------------*
       vis-tip-inv-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-inv-lun    to   v-car                  .
           move      w-exp-tip-inv-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      05                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-tip-inv-tbl    to   v-txt                  .
           if        rr-tip-inv           =    "I"
                     move  01             to   v-num
           else if   rr-tip-inv           =    "F"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-inv-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo selezione : Data inventario         *
      *    *-----------------------------------------------------------*
       vis-dat-inv-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      ">"                  to   v-edm                  .
           move      08                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-dat-inv           to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dat-inv-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-800.
      *              *-------------------------------------------------*
      *              * Uscita con successo                             *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Uscita con errori                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Emissione messaggio di errore               *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      74                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      70                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      71                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Generazione automatica movimenti di differenza inventa-   *
      *    * riale                                                     *
      *    *-----------------------------------------------------------*
       gen-aut-mdi-000.
      *              *-------------------------------------------------*
      *              * Determinazione data registrazione per scrittura *
      *              * movimenti di magazzino                          *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-dat                <    rr-dat-inv
                     move  s-dat          to   w-gen-aut-mdi-dtr
           else      move  rr-dat-inv     to   w-gen-aut-mdi-dtr      .
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
           perform   vis-vdd-mnt-000      thru vis-vdd-mnt-999        .
      *              *-------------------------------------------------*
      *              * Generazione movimento per differenze inventa-   *
      *              * riali positive                                  *
      *              *-------------------------------------------------*
           perform   gen-mov-dip-000      thru gen-mov-dip-999        .
      *              *-------------------------------------------------*
      *              * Generazione movimento per differenze inventa-   *
      *              * riali negative                                  *
      *              *-------------------------------------------------*
           perform   gen-mov-din-000      thru gen-mov-din-999        .
      *              *-------------------------------------------------*
      *              * Generazione movimento per differenze inventa-   *
      *              * riali positive merci presso di noi              *
      *              *-------------------------------------------------*
           perform   gen-mov-dpn-000      thru gen-mov-dpn-999        .
      *              *-------------------------------------------------*
      *              * Generazione movimento per differenze inventa-   *
      *              * riali negative merci presso di noi              *
      *              *-------------------------------------------------*
           perform   gen-mov-dnn-000      thru gen-mov-dnn-999        .
      *              *-------------------------------------------------*
      *              * Generazione movimento per differenze inventa-   *
      *              * riali positive merci presso terzi               *
      *              *-------------------------------------------------*
           perform   gen-mov-dpt-000      thru gen-mov-dpt-999        .
      *              *-------------------------------------------------*
      *              * Generazione movimento per differenze inventa-   *
      *              * riali negative merci presso terzi               *
      *              *-------------------------------------------------*
           perform   gen-mov-dnt-000      thru gen-mov-dnt-999        .
      *              *-------------------------------------------------*
      *              * Generazione movimenti per cambio dislocazione   *
      *              *-------------------------------------------------*
           perform   gen-mov-dcd-000      thru gen-mov-dcd-999        .
      *              *-------------------------------------------------*
      *              * Aggiornamento numerazione [datinv]              *
      *              *-------------------------------------------------*
           perform   agg-dat-inv-000      thru agg-dat-inv-999        .
       gen-aut-mdi-999.
           exit.

      *    *===========================================================*
      *    * Video di monitoraggio                                     *
      *    *-----------------------------------------------------------*
       vis-vdd-mnt-000.
      *              *-------------------------------------------------*
      *              * Trattini                                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "REGISTRAZIONI IN CORSO"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-vdd-mnt-999.
           exit.

      *    *===========================================================*
      *    * Generazione movimento per differenze inventariali positi- *
      *    * ve                                                        *
      *    *-----------------------------------------------------------*
       gen-mov-dip-000.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      56                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Differenze inventariali positive .................
      -              ".....:"             to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore di monitoraggio       *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-aut-mdi-ctr      .
      *              *-------------------------------------------------*
      *              * Azzeramento contatore records                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-mov-dip-ctr      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area rottura                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-rot-cod-dpz          .
           move      spaces               to   w-rot-tip-arc          .
           move      zero                 to   w-rot-cod-arc          .
           move      spaces               to   w-rot-dpz-arc          .
           move      spaces               to   w-rot-cod-mic          .
      *              *-------------------------------------------------*
      *              * Start su file [mim]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "TGCARCMIC "         to   f-key                  .
           move      01                   to   rf-mim-tip-gia         .
           move      zero                 to   rf-mim-cod-dpz         .
           move      spaces               to   rf-mim-tip-arc         .
           move      zero                 to   rf-mim-cod-arc         .
           move      spaces               to   rf-mim-dpz-arc         .
           move      spaces               to   rf-mim-cod-mic         .
           move      zero                 to   rf-mim-tip-mag         .
           move      spaces               to   rf-mim-alf-mag         .
           move      zero                 to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *              *-------------------------------------------------*
      *              * Se Start errata : uscita                        *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-dip-900.
       gen-mov-dip-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [mim]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *              *-------------------------------------------------*
      *              * Test se 'At end'                                *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-dip-900.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-mim-tip-gia       not  = 01
                     go to gen-mov-dip-900.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su personalizzazione ubicazioni        *
      *                  *---------------------------------------------*
           if        w-prs-ucd-snx        not  = "S"
                     go to gen-mov-dip-200.
      *                  *---------------------------------------------*
      *                  * Determinazione quantita' presunta e quanti- *
      *                  * ta' rilevata per ubicazione                 *
      *                  *---------------------------------------------*
           move      rf-mim-num-mag       to   w-det-qtu-pro-num      .
           perform   det-qtu-pro-000      thru det-qtu-pro-999        .
      *                  *---------------------------------------------*
      *                  * Riaggancio a rilevazione standard           *
      *                  *---------------------------------------------*
           move      w-det-qtu-pro-flg    to   rf-mim-flg-ril         .
           move      w-det-qtu-pro-prs    to   rf-mim-qta-prs         .
           move      w-det-qtu-pro-rlv    to   rf-mim-qta-rlv         .
       gen-mov-dip-200.
      *                  *---------------------------------------------*
      *                  * Test se rilevazione eseguita                *
      *                  *---------------------------------------------*
           if        rf-mim-flg-ril       =    spaces
                     go to gen-mov-dip-100.
      *                  *---------------------------------------------*
      *                  * Test se differenza inventariale positiva    *
      *                  *---------------------------------------------*
           if        rf-mim-qta-rlv       not  > rf-mim-qta-prs
                     go to gen-mov-dip-100.
       gen-mov-dip-250.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore di monitoraggio        *
      *                  *---------------------------------------------*
           add       1                    to   w-gen-aut-mdi-ctr      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore di monitoraggio   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      15                   to   v-lin                  .
           move      58                   to   v-pos                  .
           move      w-gen-aut-mdi-ctr    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Incremento contatore righe movimento            *
      *              *-------------------------------------------------*
           add       1                    to   w-gen-mov-dip-ctr      .
      *              *-------------------------------------------------*
      *              * Test se oltre il massimo consentito per una re- *
      *              * gistrazione di magazzino                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-dip-ctr    >    w-gen-mov-dip-max
                     move  1              to   w-gen-mov-dip-ctr      .
      *              *-------------------------------------------------*
      *              * Se rottura registrazione                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-dip-ctr    not  = 1           and
                     rf-mim-cod-dpz       =    w-rot-cod-dpz and
                     rf-mim-tip-arc       =    w-rot-tip-arc and
                     rf-mim-cod-arc       =    w-rot-cod-arc and
                     rf-mim-dpz-arc       =    w-rot-dpz-arc and
                     rf-mim-cod-mic       =    w-rot-cod-mic
                     go to gen-mov-dip-300.
      *                  *---------------------------------------------*
      *                  * Aggiornamento area rottura                  *
      *                  *---------------------------------------------*
           move      rf-mim-cod-dpz       to   w-rot-cod-dpz          .
           move      rf-mim-tip-arc       to   w-rot-tip-arc          .
           move      rf-mim-cod-arc       to   w-rot-cod-arc          .
           move      rf-mim-dpz-arc       to   w-rot-dpz-arc          .
           move      rf-mim-cod-mic       to   w-rot-cod-mic          .
      *                  *---------------------------------------------*
      *                  * Scrittura testata movimento di magazzino    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione testata                 *
      *                      *-----------------------------------------*
           move      "NT"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Scrittura testata                       *
      *                      *-----------------------------------------*
           move      "WT"                 to   l-mag-300-tip-ope      .
           move      w-gen-aut-mdi-dtr    to   l-mag-300-dat-reg      .
           move      zero                 to   l-mag-300-num-prt      .
           move      rf-mim-cod-dpz       to   l-mag-300-cod-dpz      .
           move      w-ref-cau-mag-dip    to   l-mag-300-cod-cau      .
           move      spaces               to   l-mag-300-cod-ctm      .
           move      zero                 to   l-mag-300-dat-doc      .
           move      spaces               to   l-mag-300-num-doc      .
           move      spaces               to   l-mag-300-cod-dsl      .
           move      spaces               to   l-mag-300-cod-dsd      .
           move      "N"                  to   l-mag-300-tip-arc      .
           move      zero                 to   l-mag-300-cod-arc      .
           move      spaces               to   l-mag-300-dpz-arc      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
       gen-mov-dip-300.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento di magazzino           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione riga movimento di magazzino *
      *                  *---------------------------------------------*
           move      "NR"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                  *---------------------------------------------*
      *                  * Scrittura riga                              *
      *                  *---------------------------------------------*
           move      "WR"                 to   l-mag-300-tip-ope      .
           move      rf-mim-tip-mag       to   l-mag-300-tip-mag      .
           move      rf-mim-num-mag       to   l-mag-300-num-mag      .
           move      rf-mim-alf-mag       to   l-mag-300-alf-mag      .
           move      rf-mim-var-mag       to   l-mag-300-var-mag      .
           move      rf-mim-umi-mag       to   l-mag-300-udm-ana      .
           move      rf-mim-umi-mag       to   l-mag-300-udm-mov      .
           move      zero                 to   l-mag-300-num-pmg      .
           move      zero                 to   l-mag-300-ddo-rif      .
           move      spaces               to   l-mag-300-ndo-rif      .
           subtract  rf-mim-qta-prs       from rf-mim-qta-rlv
                                        giving l-mag-300-qta-mov      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale record [mim]     *
      *              *-------------------------------------------------*
           go to     gen-mov-dip-100.
       gen-mov-dip-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      69                   to   v-pos                  .
           move      "Eseguita"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     gen-mov-dip-999.
       gen-mov-dip-999.
           exit.

      *    *===========================================================*
      *    * Generazione movimento per differenze inventariali negati- *
      *    * ve                                                        *
      *    *-----------------------------------------------------------*
       gen-mov-din-000.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      56                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Differenze inventariali negative .................
      -              ".....:"             to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore di monitoraggio       *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-aut-mdi-ctr      .
      *              *-------------------------------------------------*
      *              * Azzeramento contatore records                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-mov-din-ctr      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area rottura                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-rot-cod-dpz          .
           move      spaces               to   w-rot-tip-arc          .
           move      zero                 to   w-rot-cod-arc          .
           move      spaces               to   w-rot-dpz-arc          .
           move      spaces               to   w-rot-cod-mic          .
      *              *-------------------------------------------------*
      *              * Start su file [mim]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "TGCARCMIC "         to   f-key                  .
           move      01                   to   rf-mim-tip-gia         .
           move      zero                 to   rf-mim-cod-dpz         .
           move      spaces               to   rf-mim-tip-arc         .
           move      zero                 to   rf-mim-cod-arc         .
           move      spaces               to   rf-mim-dpz-arc         .
           move      spaces               to   rf-mim-cod-mic         .
           move      zero                 to   rf-mim-tip-mag         .
           move      spaces               to   rf-mim-alf-mag         .
           move      zero                 to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *              *-------------------------------------------------*
      *              * Se Start errata : uscita                        *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-din-900.
       gen-mov-din-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [mim]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *              *-------------------------------------------------*
      *              * Test se 'At end'                                *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-din-900.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-mim-tip-gia       not  = 01
                     go to gen-mov-din-900.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su personalizzazione ubicazioni        *
      *                  *---------------------------------------------*
           if        w-prs-ucd-snx        not  = "S"
                     go to gen-mov-din-200.
      *                  *---------------------------------------------*
      *                  * Determinazione rilevazioni per ubicazioni   *
      *                  *---------------------------------------------*
           move      rf-mim-num-mag       to   w-det-qtu-pro-num      .
           perform   det-qtu-pro-000      thru det-qtu-pro-999        .
      *                  *---------------------------------------------*
      *                  * Riaggancio a rilevazione standard           *
      *                  *---------------------------------------------*
           move      w-det-qtu-pro-flg    to   rf-mim-flg-ril         .
           move      w-det-qtu-pro-prs    to   rf-mim-qta-prs         .
           move      w-det-qtu-pro-rlv    to   rf-mim-qta-rlv         .
       gen-mov-din-200.
      *                  *---------------------------------------------*
      *                  * Test se rilevazione eseguita                *
      *                  *---------------------------------------------*
           if        rf-mim-flg-ril       =    spaces
                     go to gen-mov-din-100.
      *                  *---------------------------------------------*
      *                  * Test se differenza inventariale positiva    *
      *                  *---------------------------------------------*
           if        rf-mim-qta-prs       not  > rf-mim-qta-rlv
                     go to gen-mov-din-100.
       gen-mov-din-250.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore di monitoraggio        *
      *                  *---------------------------------------------*
           add       1                    to   w-gen-aut-mdi-ctr      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore di monitoraggio   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      16                   to   v-lin                  .
           move      58                   to   v-pos                  .
           move      w-gen-aut-mdi-ctr    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Incremento contatore righe movimento            *
      *              *-------------------------------------------------*
           add       1                    to   w-gen-mov-din-ctr      .
      *              *-------------------------------------------------*
      *              * Test se oltre il massimo consentito per una re- *
      *              * gistrazione di magazzino                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-din-ctr    >    w-gen-mov-din-max
                     move  1              to   w-gen-mov-din-ctr      .
      *              *-------------------------------------------------*
      *              * Se rottura registrazione                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-din-ctr    not  = 1           and
                     rf-mim-cod-dpz       =    w-rot-cod-dpz and
                     rf-mim-tip-arc       =    w-rot-tip-arc and
                     rf-mim-cod-arc       =    w-rot-cod-arc and
                     rf-mim-dpz-arc       =    w-rot-dpz-arc and
                     rf-mim-cod-mic       =    w-rot-cod-mic
                     go to gen-mov-din-300.
      *                  *---------------------------------------------*
      *                  * Aggiornamento area rottura                  *
      *                  *---------------------------------------------*
           move      rf-mim-cod-dpz       to   w-rot-cod-dpz          .
           move      rf-mim-tip-arc       to   w-rot-tip-arc          .
           move      rf-mim-cod-arc       to   w-rot-cod-arc          .
           move      rf-mim-dpz-arc       to   w-rot-dpz-arc          .
           move      rf-mim-cod-mic       to   w-rot-cod-mic          .
      *                  *---------------------------------------------*
      *                  * Scrittura testata movimento di magazzino    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione testata                 *
      *                      *-----------------------------------------*
           move      "NT"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Scrittura testata                       *
      *                      *-----------------------------------------*
           move      "WT"                 to   l-mag-300-tip-ope      .
           move      w-gen-aut-mdi-dtr    to   l-mag-300-dat-reg      .
           move      zero                 to   l-mag-300-num-prt      .
           move      rf-mim-cod-dpz       to   l-mag-300-cod-dpz      .
           move      w-ref-cau-mag-din    to   l-mag-300-cod-cau      .
           move      spaces               to   l-mag-300-cod-ctm      .
           move      zero                 to   l-mag-300-dat-doc      .
           move      spaces               to   l-mag-300-num-doc      .
           move      spaces               to   l-mag-300-cod-dsl      .
           move      spaces               to   l-mag-300-cod-dsd      .
           move      "N"                  to   l-mag-300-tip-arc      .
           move      zero                 to   l-mag-300-cod-arc      .
           move      spaces               to   l-mag-300-dpz-arc      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
       gen-mov-din-300.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento di magazzino           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione riga movimento di magazzino *
      *                  *---------------------------------------------*
           move      "NR"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                  *---------------------------------------------*
      *                  * Scrittura riga                              *
      *                  *---------------------------------------------*
           move      "WR"                 to   l-mag-300-tip-ope      .
           move      rf-mim-tip-mag       to   l-mag-300-tip-mag      .
           move      rf-mim-num-mag       to   l-mag-300-num-mag      .
           move      rf-mim-alf-mag       to   l-mag-300-alf-mag      .
           move      rf-mim-var-mag       to   l-mag-300-var-mag      .
           move      rf-mim-umi-mag       to   l-mag-300-udm-ana      .
           move      rf-mim-umi-mag       to   l-mag-300-udm-mov      .
           move      zero                 to   l-mag-300-num-pmg      .
           move      zero                 to   l-mag-300-ddo-rif      .
           move      spaces               to   l-mag-300-ndo-rif      .
           subtract  rf-mim-qta-rlv       from rf-mim-qta-prs
                                        giving l-mag-300-qta-mov      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale record [mim]     *
      *              *-------------------------------------------------*
           go to     gen-mov-din-100.
       gen-mov-din-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      69                   to   v-pos                  .
           move      "Eseguita"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     gen-mov-din-999.
       gen-mov-din-999.
           exit.

      *    *===========================================================*
      *    * Generazione movimento per differenze inventariali positi- *
      *    * ve merci presso di noi                                    *
      *    *-----------------------------------------------------------*
       gen-mov-dpn-000.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      56                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Differenze inventariali positive merci c/o noi ...
      -              ".....:"             to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore di monitoraggio       *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-aut-mdi-ctr      .
      *              *-------------------------------------------------*
      *              * Azzeramento contatore records                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-mov-dpn-ctr      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area rottura                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-rot-cod-dpz          .
           move      spaces               to   w-rot-tip-arc          .
           move      zero                 to   w-rot-cod-arc          .
           move      spaces               to   w-rot-dpz-arc          .
           move      spaces               to   w-rot-cod-mic          .
      *              *-------------------------------------------------*
      *              * Start su file [mim]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "TGCARCMIC "         to   f-key                  .
           move      02                   to   rf-mim-tip-gia         .
           move      zero                 to   rf-mim-cod-dpz         .
           move      spaces               to   rf-mim-tip-arc         .
           move      zero                 to   rf-mim-cod-arc         .
           move      spaces               to   rf-mim-dpz-arc         .
           move      spaces               to   rf-mim-cod-mic         .
           move      zero                 to   rf-mim-tip-mag         .
           move      spaces               to   rf-mim-alf-mag         .
           move      zero                 to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-dpn-900.
       gen-mov-dpn-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [mim]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *              *-------------------------------------------------*
      *              * Test se 'At end'                                *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-dpn-900.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-mim-tip-gia       not  = 02
                     go to gen-mov-dpn-900.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se rilevazione eseguita                *
      *                  *---------------------------------------------*
           if        rf-mim-flg-ril       =    spaces
                     go to gen-mov-dpn-100.
      *                  *---------------------------------------------*
      *                  * Test se differenza inventariale positiva    *
      *                  *---------------------------------------------*
           if        rf-mim-qta-rlv       not  > rf-mim-qta-prs
                     go to gen-mov-dpn-100.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore di monitoraggio        *
      *                  *---------------------------------------------*
           add       1                    to   w-gen-aut-mdi-ctr      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore di monitoraggio   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      17                   to   v-lin                  .
           move      58                   to   v-pos                  .
           move      w-gen-aut-mdi-ctr    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Incremento contatore righe movimento            *
      *              *-------------------------------------------------*
           add       1                    to   w-gen-mov-dpn-ctr      .
      *              *-------------------------------------------------*
      *              * Test se oltre il massimo consentito per una re- *
      *              * gistrazione di magazzino                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-dpn-ctr    >    w-gen-mov-dpn-max
                     move  1              to   w-gen-mov-dpn-ctr      .
      *              *-------------------------------------------------*
      *              * Se rottura registrazione                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-dpn-ctr    not  = 1           and
                     rf-mim-cod-dpz       =    w-rot-cod-dpz and
                     rf-mim-tip-arc       =    w-rot-tip-arc and
                     rf-mim-cod-arc       =    w-rot-cod-arc and
                     rf-mim-dpz-arc       =    w-rot-dpz-arc and
                     rf-mim-cod-mic       =    w-rot-cod-mic
                     go to gen-mov-dpn-300.
      *                  *---------------------------------------------*
      *                  * Aggiornamento area rottura                  *
      *                  *---------------------------------------------*
           move      rf-mim-cod-dpz       to   w-rot-cod-dpz          .
           move      rf-mim-tip-arc       to   w-rot-tip-arc          .
           move      rf-mim-cod-arc       to   w-rot-cod-arc          .
           move      rf-mim-dpz-arc       to   w-rot-dpz-arc          .
           move      rf-mim-cod-mic       to   w-rot-cod-mic          .
      *                  *---------------------------------------------*
      *                  * Scrittura testata movimento di magazzino    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione testata                 *
      *                      *-----------------------------------------*
           move      "NT"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Scrittura testata                       *
      *                      *-----------------------------------------*
           move      "WT"                 to   l-mag-300-tip-ope      .
           move      w-gen-aut-mdi-dtr    to   l-mag-300-dat-reg      .
           move      zero                 to   l-mag-300-num-prt      .
           move      rf-mim-cod-dpz       to   l-mag-300-cod-dpz      .
           move      w-ref-cau-mag-dpn    to   l-mag-300-cod-cau      .
           move      rf-mim-cod-mic       to   l-mag-300-cod-ctm      .
           move      zero                 to   l-mag-300-dat-doc      .
           move      spaces               to   l-mag-300-num-doc      .
           move      spaces               to   l-mag-300-cod-dsl      .
           move      spaces               to   l-mag-300-cod-dsd      .
           move      rf-mim-tip-arc       to   l-mag-300-tip-arc      .
           move      rf-mim-cod-arc       to   l-mag-300-cod-arc      .
           move      rf-mim-dpz-arc       to   l-mag-300-dpz-arc      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
       gen-mov-dpn-300.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento di magazzino           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione riga movimento di magazzino *
      *                  *---------------------------------------------*
           move      "NR"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                  *---------------------------------------------*
      *                  * Scrittura riga                              *
      *                  *---------------------------------------------*
           move      "WR"                 to   l-mag-300-tip-ope      .
           move      rf-mim-tip-mag       to   l-mag-300-tip-mag      .
           move      rf-mim-num-mag       to   l-mag-300-num-mag      .
           move      rf-mim-alf-mag       to   l-mag-300-alf-mag      .
           move      rf-mim-var-mag       to   l-mag-300-var-mag      .
           move      rf-mim-umi-mag       to   l-mag-300-udm-ana      .
           move      rf-mim-umi-mag       to   l-mag-300-udm-mov      .
           move      zero                 to   l-mag-300-num-pmg      .
           move      zero                 to   l-mag-300-ddo-rif      .
           move      spaces               to   l-mag-300-ndo-rif      .
           subtract  rf-mim-qta-prs       from rf-mim-qta-rlv
                                        giving l-mag-300-qta-mov      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale record [mim]     *
      *              *-------------------------------------------------*
           go to     gen-mov-dpn-100.
       gen-mov-dpn-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      69                   to   v-pos                  .
           move      "Eseguita"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     gen-mov-dpn-999.
       gen-mov-dpn-999.
           exit.

      *    *===========================================================*
      *    * Generazione movimento per differenze inventariali negati- *
      *    * ve merci presso di noi                                    *
      *    *-----------------------------------------------------------*
       gen-mov-dnn-000.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      56                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Differenze inventariali negative merci c/o noi ...
      -              ".....:"             to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore di monitoraggio       *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-aut-mdi-ctr      .
      *              *-------------------------------------------------*
      *              * Azzeramento contatore records                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-mov-dnn-ctr      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area rottura                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-rot-cod-dpz          .
           move      spaces               to   w-rot-tip-arc          .
           move      zero                 to   w-rot-cod-arc          .
           move      spaces               to   w-rot-dpz-arc          .
           move      spaces               to   w-rot-cod-mic          .
      *              *-------------------------------------------------*
      *              * Start su file [mim]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "TGCARCMIC "         to   f-key                  .
           move      02                   to   rf-mim-tip-gia         .
           move      zero                 to   rf-mim-cod-dpz         .
           move      spaces               to   rf-mim-tip-arc         .
           move      zero                 to   rf-mim-cod-arc         .
           move      spaces               to   rf-mim-dpz-arc         .
           move      spaces               to   rf-mim-cod-mic         .
           move      zero                 to   rf-mim-tip-mag         .
           move      spaces               to   rf-mim-alf-mag         .
           move      zero                 to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-dnn-900.
       gen-mov-dnn-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [mim]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *              *-------------------------------------------------*
      *              * Test se 'At end'                                *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-dnn-900.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-mim-tip-gia       not  = 02
                     go to gen-mov-dnn-900.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se rilevazione eseguita                *
      *                  *---------------------------------------------*
           if        rf-mim-flg-ril       =    spaces
                     go to gen-mov-dnn-100.
      *                  *---------------------------------------------*
      *                  * Test se differenza inventariale negativa    *
      *                  *---------------------------------------------*
           if        rf-mim-qta-prs       not  > rf-mim-qta-rlv
                     go to gen-mov-dnn-100.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore di monitoraggio        *
      *                  *---------------------------------------------*
           add       1                    to   w-gen-aut-mdi-ctr      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore di monitoraggio   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      18                   to   v-lin                  .
           move      58                   to   v-pos                  .
           move      w-gen-aut-mdi-ctr    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Incremento contatore righe movimento            *
      *              *-------------------------------------------------*
           add       1                    to   w-gen-mov-dnn-ctr      .
      *              *-------------------------------------------------*
      *              * Test se oltre il massimo consentito per una re- *
      *              * gistrazione di magazzino                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-dnn-ctr    >    w-gen-mov-dnn-max
                     move  1              to   w-gen-mov-dnn-ctr      .
      *              *-------------------------------------------------*
      *              * Se rottura registrazione                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-dnn-ctr    not  = 1           and
                     rf-mim-cod-dpz       =    w-rot-cod-dpz and
                     rf-mim-tip-arc       =    w-rot-tip-arc and
                     rf-mim-cod-arc       =    w-rot-cod-arc and
                     rf-mim-dpz-arc       =    w-rot-dpz-arc and
                     rf-mim-cod-mic       =    w-rot-cod-mic
                     go to gen-mov-dnn-300.
      *                  *---------------------------------------------*
      *                  * Aggiornamento area rottura                  *
      *                  *---------------------------------------------*
           move      rf-mim-cod-dpz       to   w-rot-cod-dpz          .
           move      rf-mim-tip-arc       to   w-rot-tip-arc          .
           move      rf-mim-cod-arc       to   w-rot-cod-arc          .
           move      rf-mim-dpz-arc       to   w-rot-dpz-arc          .
           move      rf-mim-cod-mic       to   w-rot-cod-mic          .
      *                  *---------------------------------------------*
      *                  * Scrittura testata movimento di magazzino    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione testata                 *
      *                      *-----------------------------------------*
           move      "NT"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Scrittura testata                       *
      *                      *-----------------------------------------*
           move      "WT"                 to   l-mag-300-tip-ope      .
           move      w-gen-aut-mdi-dtr    to   l-mag-300-dat-reg      .
           move      zero                 to   l-mag-300-num-prt      .
           move      rf-mim-cod-dpz       to   l-mag-300-cod-dpz      .
           move      w-ref-cau-mag-dnn    to   l-mag-300-cod-cau      .
           move      rf-mim-cod-mic       to   l-mag-300-cod-ctm      .
           move      zero                 to   l-mag-300-dat-doc      .
           move      spaces               to   l-mag-300-num-doc      .
           move      spaces               to   l-mag-300-cod-dsl      .
           move      spaces               to   l-mag-300-cod-dsd      .
           move      rf-mim-tip-arc       to   l-mag-300-tip-arc      .
           move      rf-mim-cod-arc       to   l-mag-300-cod-arc      .
           move      rf-mim-dpz-arc       to   l-mag-300-dpz-arc      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
       gen-mov-dnn-300.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento di magazzino           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione riga movimento di magazzino *
      *                  *---------------------------------------------*
           move      "NR"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                  *---------------------------------------------*
      *                  * Scrittura riga                              *
      *                  *---------------------------------------------*
           move      "WR"                 to   l-mag-300-tip-ope      .
           move      rf-mim-tip-mag       to   l-mag-300-tip-mag      .
           move      rf-mim-num-mag       to   l-mag-300-num-mag      .
           move      rf-mim-alf-mag       to   l-mag-300-alf-mag      .
           move      rf-mim-var-mag       to   l-mag-300-var-mag      .
           move      rf-mim-umi-mag       to   l-mag-300-udm-ana      .
           move      rf-mim-umi-mag       to   l-mag-300-udm-mov      .
           move      zero                 to   l-mag-300-num-pmg      .
           move      zero                 to   l-mag-300-ddo-rif      .
           move      spaces               to   l-mag-300-ndo-rif      .
           subtract  rf-mim-qta-rlv       from rf-mim-qta-prs
                                        giving l-mag-300-qta-mov      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale record [mim]     *
      *              *-------------------------------------------------*
           go to     gen-mov-dnn-100.
       gen-mov-dnn-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      69                   to   v-pos                  .
           move      "Eseguita"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     gen-mov-dnn-999.
       gen-mov-dnn-999.
           exit.

      *    *===========================================================*
      *    * Generazione movimento per differenze inventariali positi- *
      *    * ve merci presso terzi                                     *
      *    *-----------------------------------------------------------*
       gen-mov-dpt-000.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      56                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Differenze inventariali positive merci c/o terzi .
      -              ".....:"             to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore di monitoraggio       *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-aut-mdi-ctr      .
      *              *-------------------------------------------------*
      *              * Azzeramento contatore records                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-mov-dpt-ctr      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area rottura                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-rot-cod-dpz          .
           move      spaces               to   w-rot-tip-arc          .
           move      zero                 to   w-rot-cod-arc          .
           move      spaces               to   w-rot-dpz-arc          .
           move      spaces               to   w-rot-cod-mic          .
      *              *-------------------------------------------------*
      *              * Start su file [mim]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "TGCARCMIC "         to   f-key                  .
           move      03                   to   rf-mim-tip-gia         .
           move      zero                 to   rf-mim-cod-dpz         .
           move      spaces               to   rf-mim-tip-arc         .
           move      zero                 to   rf-mim-cod-arc         .
           move      spaces               to   rf-mim-dpz-arc         .
           move      spaces               to   rf-mim-cod-mic         .
           move      zero                 to   rf-mim-tip-mag         .
           move      spaces               to   rf-mim-alf-mag         .
           move      zero                 to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-dpt-900.
       gen-mov-dpt-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [mim]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *              *-------------------------------------------------*
      *              * Test se 'At end'                                *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-dpt-900.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-mim-tip-gia       not  = 03
                     go to gen-mov-dpt-900.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se rilevazione eseguita                *
      *                  *---------------------------------------------*
           if        rf-mim-flg-ril       =    spaces
                     go to gen-mov-dpt-100.
      *                  *---------------------------------------------*
      *                  * Test se differenza inventariale positiva    *
      *                  *---------------------------------------------*
           if        rf-mim-qta-rlv       not  > rf-mim-qta-prs
                     go to gen-mov-dpt-100.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore di monitoraggio        *
      *                  *---------------------------------------------*
           add       1                    to   w-gen-aut-mdi-ctr      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore di monitoraggio   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      19                   to   v-lin                  .
           move      58                   to   v-pos                  .
           move      w-gen-aut-mdi-ctr    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Incremento contatore righe movimento            *
      *              *-------------------------------------------------*
           add       1                    to   w-gen-mov-dpt-ctr      .
      *              *-------------------------------------------------*
      *              * Test se oltre il massimo consentito per una re- *
      *              * gistrazione di magazzino                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-dpt-ctr    >    w-gen-mov-dpt-max
                     move  1              to   w-gen-mov-dpt-ctr      .
      *              *-------------------------------------------------*
      *              * Se rottura registrazione                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-dpt-ctr    not  = 1           and
                     rf-mim-cod-dpz       =    w-rot-cod-dpz and
                     rf-mim-tip-arc       =    w-rot-tip-arc and
                     rf-mim-cod-arc       =    w-rot-cod-arc and
                     rf-mim-dpz-arc       =    w-rot-dpz-arc and
                     rf-mim-cod-mic       =    w-rot-cod-mic
                     go to gen-mov-dpt-300.
      *                  *---------------------------------------------*
      *                  * Aggiornamento area rottura                  *
      *                  *---------------------------------------------*
           move      rf-mim-cod-dpz       to   w-rot-cod-dpz          .
           move      rf-mim-tip-arc       to   w-rot-tip-arc          .
           move      rf-mim-cod-arc       to   w-rot-cod-arc          .
           move      rf-mim-dpz-arc       to   w-rot-dpz-arc          .
           move      rf-mim-cod-mic       to   w-rot-cod-mic          .
      *                  *---------------------------------------------*
      *                  * Scrittura testata movimento di magazzino    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione testata                 *
      *                      *-----------------------------------------*
           move      "NT"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Scrittura testata                       *
      *                      *-----------------------------------------*
           move      "WT"                 to   l-mag-300-tip-ope      .
           move      w-gen-aut-mdi-dtr    to   l-mag-300-dat-reg      .
           move      zero                 to   l-mag-300-num-prt      .
           move      rf-mim-cod-dpz       to   l-mag-300-cod-dpz      .
           move      w-ref-cau-mag-dpt    to   l-mag-300-cod-cau      .
           move      rf-mim-cod-mic       to   l-mag-300-cod-ctm      .
           move      zero                 to   l-mag-300-dat-doc      .
           move      spaces               to   l-mag-300-num-doc      .
           move      spaces               to   l-mag-300-cod-dsl      .
           move      spaces               to   l-mag-300-cod-dsd      .
           move      rf-mim-tip-arc       to   l-mag-300-tip-arc      .
           move      rf-mim-cod-arc       to   l-mag-300-cod-arc      .
           move      rf-mim-dpz-arc       to   l-mag-300-dpz-arc      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
       gen-mov-dpt-300.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento di magazzino           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione riga movimento di magazzino *
      *                  *---------------------------------------------*
           move      "NR"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                  *---------------------------------------------*
      *                  * Scrittura riga                              *
      *                  *---------------------------------------------*
           move      "WR"                 to   l-mag-300-tip-ope      .
           move      rf-mim-tip-mag       to   l-mag-300-tip-mag      .
           move      rf-mim-num-mag       to   l-mag-300-num-mag      .
           move      rf-mim-alf-mag       to   l-mag-300-alf-mag      .
           move      rf-mim-var-mag       to   l-mag-300-var-mag      .
           move      rf-mim-umi-mag       to   l-mag-300-udm-ana      .
           move      rf-mim-umi-mag       to   l-mag-300-udm-mov      .
           move      zero                 to   l-mag-300-num-pmg      .
           move      zero                 to   l-mag-300-ddo-rif      .
           move      spaces               to   l-mag-300-ndo-rif      .
           subtract  rf-mim-qta-prs       from rf-mim-qta-rlv
                                        giving l-mag-300-qta-mov      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale record [mim]     *
      *              *-------------------------------------------------*
           go to     gen-mov-dpt-100.
       gen-mov-dpt-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      69                   to   v-pos                  .
           move      "Eseguita"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     gen-mov-dpt-999.
       gen-mov-dpt-999.
           exit.

      *    *===========================================================*
      *    * Generazione movimento per differenze inventariali negati- *
      *    * ve merci presso terzi                                     *
      *    *-----------------------------------------------------------*
       gen-mov-dnt-000.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      56                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Differenze inventariali negative merci c/o terzi .
      -              ".....:"             to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore di monitoraggio       *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-aut-mdi-ctr      .
      *              *-------------------------------------------------*
      *              * Azzeramento contatore records                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-mov-dnt-ctr      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area rottura                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-rot-cod-dpz          .
           move      spaces               to   w-rot-tip-arc          .
           move      zero                 to   w-rot-cod-arc          .
           move      spaces               to   w-rot-dpz-arc          .
           move      spaces               to   w-rot-cod-mic          .
      *              *-------------------------------------------------*
      *              * Start su file [mim]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "TGCARCMIC "         to   f-key                  .
           move      03                   to   rf-mim-tip-gia         .
           move      zero                 to   rf-mim-cod-dpz         .
           move      spaces               to   rf-mim-tip-arc         .
           move      zero                 to   rf-mim-cod-arc         .
           move      spaces               to   rf-mim-dpz-arc         .
           move      spaces               to   rf-mim-cod-mic         .
           move      zero                 to   rf-mim-tip-mag         .
           move      spaces               to   rf-mim-alf-mag         .
           move      zero                 to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-dnt-900.
       gen-mov-dnt-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [mim]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *              *-------------------------------------------------*
      *              * Test se 'At end'                                *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-dnt-900.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-mim-tip-gia       not  = 03
                     go to gen-mov-dnt-900.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se rilevazione eseguita                *
      *                  *---------------------------------------------*
           if        rf-mim-flg-ril       =    spaces
                     go to gen-mov-dnt-100.
      *                  *---------------------------------------------*
      *                  * Test se differenza inventariale negativa    *
      *                  *---------------------------------------------*
           if        rf-mim-qta-prs       not  > rf-mim-qta-rlv
                     go to gen-mov-dnt-100.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore di monitoraggio        *
      *                  *---------------------------------------------*
           add       1                    to   w-gen-aut-mdi-ctr      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore di monitoraggio   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      20                   to   v-lin                  .
           move      58                   to   v-pos                  .
           move      w-gen-aut-mdi-ctr    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Incremento contatore righe movimento            *
      *              *-------------------------------------------------*
           add       1                    to   w-gen-mov-dnt-ctr      .
      *              *-------------------------------------------------*
      *              * Test se oltre il massimo consentito per una re- *
      *              * gistrazione di magazzino                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-dnt-ctr    >    w-gen-mov-dnt-max
                     move  1              to   w-gen-mov-dnt-ctr      .
      *              *-------------------------------------------------*
      *              * Se rottura registrazione                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-dnt-ctr    not  = 1           and
                     rf-mim-cod-dpz       =    w-rot-cod-dpz and
                     rf-mim-tip-arc       =    w-rot-tip-arc and
                     rf-mim-cod-arc       =    w-rot-cod-arc and
                     rf-mim-dpz-arc       =    w-rot-dpz-arc and
                     rf-mim-cod-mic       =    w-rot-cod-mic
                     go to gen-mov-dnt-300.
      *                  *---------------------------------------------*
      *                  * Aggiornamento area rottura                  *
      *                  *---------------------------------------------*
           move      rf-mim-cod-dpz       to   w-rot-cod-dpz          .
           move      rf-mim-tip-arc       to   w-rot-tip-arc          .
           move      rf-mim-cod-arc       to   w-rot-cod-arc          .
           move      rf-mim-dpz-arc       to   w-rot-dpz-arc          .
           move      rf-mim-cod-mic       to   w-rot-cod-mic          .
      *                  *---------------------------------------------*
      *                  * Scrittura testata movimento di magazzino    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione testata                 *
      *                      *-----------------------------------------*
           move      "NT"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Scrittura testata                       *
      *                      *-----------------------------------------*
           move      "WT"                 to   l-mag-300-tip-ope      .
           move      w-gen-aut-mdi-dtr    to   l-mag-300-dat-reg      .
           move      zero                 to   l-mag-300-num-prt      .
           move      rf-mim-cod-dpz       to   l-mag-300-cod-dpz      .
           move      w-ref-cau-mag-dnt    to   l-mag-300-cod-cau      .
           move      rf-mim-cod-mic       to   l-mag-300-cod-ctm      .
           move      zero                 to   l-mag-300-dat-doc      .
           move      spaces               to   l-mag-300-num-doc      .
           move      spaces               to   l-mag-300-cod-dsl      .
           move      spaces               to   l-mag-300-cod-dsd      .
           move      rf-mim-tip-arc       to   l-mag-300-tip-arc      .
           move      rf-mim-cod-arc       to   l-mag-300-cod-arc      .
           move      rf-mim-dpz-arc       to   l-mag-300-dpz-arc      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
       gen-mov-dnt-300.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento di magazzino           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione riga movimento di magazzino *
      *                  *---------------------------------------------*
           move      "NR"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                  *---------------------------------------------*
      *                  * Scrittura riga                              *
      *                  *---------------------------------------------*
           move      "WR"                 to   l-mag-300-tip-ope      .
           move      rf-mim-tip-mag       to   l-mag-300-tip-mag      .
           move      rf-mim-num-mag       to   l-mag-300-num-mag      .
           move      rf-mim-alf-mag       to   l-mag-300-alf-mag      .
           move      rf-mim-var-mag       to   l-mag-300-var-mag      .
           move      rf-mim-umi-mag       to   l-mag-300-udm-ana      .
           move      rf-mim-umi-mag       to   l-mag-300-udm-mov      .
           move      zero                 to   l-mag-300-num-pmg      .
           move      zero                 to   l-mag-300-ddo-rif      .
           move      spaces               to   l-mag-300-ndo-rif      .
           subtract  rf-mim-qta-rlv       from rf-mim-qta-prs
                                        giving l-mag-300-qta-mov      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale record [mim]     *
      *              *-------------------------------------------------*
           go to     gen-mov-dnt-100.
       gen-mov-dnt-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      69                   to   v-pos                  .
           move      "Eseguita"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     gen-mov-dnt-999.
       gen-mov-dnt-999.
           exit.

      *    *===========================================================*
      *    * Generazione movimenti per dislocazioni                    *
      *    *-----------------------------------------------------------*
       gen-mov-dcd-000.
      *              *-------------------------------------------------*
      *              * Test su personalizzazione                       *
      *              *-------------------------------------------------*
           if        w-prs-ucd-snx        not  = "S"
                     go to gen-mov-dcd-999.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      56                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Ubicazioni .......................................
      -              ".....:"             to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore di monitoraggio       *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-aut-mdi-ctr      .
      *              *-------------------------------------------------*
      *              * Azzeramento contatore records                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-mov-dcd-ctr      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area rottura                   *
      *              *-------------------------------------------------*
       gen-mov-dcd-100.
      *              *-------------------------------------------------*
      *              * Start su file [miu]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "MAGUBI    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      01                   to   rf-miu-cod-dpz         .
           move      01                   to   rf-miu-tip-mag         .
           move      zero                 to   rf-miu-num-mag         .
           move      spaces               to   rf-miu-cod-ubi         .
           move      "pgm/mag/fls/ioc/obj/iofmiu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-miu                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-dcd-900.
       gen-mov-dcd-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [miu]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmiu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-miu                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to gen-mov-dcd-900.
       gen-mov-dcd-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su codice dipendenza                   *
      *                  *---------------------------------------------*
           if        rf-miu-cod-dpz       not  = 01
                     go to gen-mov-dcd-900.
       gen-mov-dcd-400.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se rilevazione eseguita                *
      *                  *---------------------------------------------*
______*    if        rf-miu-flg-spv       =    spaces
           if        rf-miu-flg-rlv       =    spaces
                     go to gen-mov-dcd-200.
      *                  *---------------------------------------------*
      *                  * Test su codice ubicazione                   *
      *                  *---------------------------------------------*
           if        rf-miu-cod-ubi       =    spaces
                     go to gen-mov-dcd-200.
      *                  *---------------------------------------------*
      *                  * Test su quantita'                           *
      *                  *---------------------------------------------*
           if        rf-miu-qta-rlv       =    rf-miu-qta-prs
                     go to gen-mov-dcd-200.
       gen-mov-dcd-500.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore di monitoraggio        *
      *                  *---------------------------------------------*
           add       1                    to   w-gen-aut-mdi-ctr      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore di monitoraggio   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      21                   to   v-lin                  .
           move      58                   to   v-pos                  .
           move      w-gen-aut-mdi-ctr    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Incremento contatore righe movimento            *
      *              *-------------------------------------------------*
           add       1                    to   w-gen-mov-dcd-ctr      .
      *              *-------------------------------------------------*
      *              * Test se oltre il massimo consentito per una re- *
      *              * gistrazione di magazzino                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-dcd-ctr    >    w-gen-mov-dcd-max
                     move  1              to   w-gen-mov-dcd-ctr      .
      *              *-------------------------------------------------*
      *              * Se rottura registrazione                        *
      *              *-------------------------------------------------*
           if        w-gen-mov-dcd-ctr    not  = 1
                     go to gen-mov-dcd-600.
      *                  *---------------------------------------------*
      *                  * Aggiornamento area rottura                  *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Scrittura testata movimento di magazzino    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione testata                 *
      *                      *-----------------------------------------*
           move      "NT"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Scrittura testata                       *
      *                      *-----------------------------------------*
           move      "WT"                 to   l-mag-300-tip-ope      .
           move      w-gen-aut-mdi-dtr    to   l-mag-300-dat-reg      .
           move      zero                 to   l-mag-300-num-prt      .
           move      rf-miu-cod-dpz       to   l-mag-300-cod-dpz      .
      *                      *-----------------------------------------*
      *                      * Causale cambio dislocazione             *
      *                      *-----------------------------------------*
           move      930                  to   l-mag-300-cod-cau      .
           move      spaces               to   l-mag-300-cod-ctm      .
           move      rr-dat-inv           to   l-mag-300-dat-doc      .
           move      "INVENTARIO"         to   l-mag-300-num-doc      .
           move      spaces               to   l-mag-300-cod-dsl      .
           move      spaces               to   l-mag-300-cod-dsd      .
           move      "N"                  to   l-mag-300-tip-arc      .
           move      zero                 to   l-mag-300-cod-arc      .
           move      spaces               to   l-mag-300-dpz-arc      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
       gen-mov-dcd-600.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento di magazzino           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione [dcp]                       *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Lettura per codice                          *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      rf-miu-num-mag       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Normalizzazione riga movimento di magazzino *
      *                  *---------------------------------------------*
           move      "NR"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                  *---------------------------------------------*
      *                  * Scrittura riga                              *
      *                  *---------------------------------------------*
           move      "WR"                 to   l-mag-300-tip-ope      .
           move      01                   to   l-mag-300-tip-mag      .
           move      rf-miu-num-mag       to   l-mag-300-num-mag      .
           move      rf-dcp-alf-pro       to   l-mag-300-alf-mag      .
           move      spaces               to   l-mag-300-var-mag      .
           move      rf-dcp-umi-ven       to   l-mag-300-udm-ana      .
           move      rf-dcp-umi-ven       to   l-mag-300-udm-mov      .
           move      zero                 to   l-mag-300-num-pmg      .
           move      zero                 to   l-mag-300-ddo-rif      .
           move      spaces               to   l-mag-300-ndo-rif      .
      *                  *---------------------------------------------*
      *                  * Trattamento quantita'                       *
      *                  *---------------------------------------------*
           subtract  rf-miu-qta-prs       from rf-miu-qta-rlv
                                        giving l-mag-300-qta-mov      .
      *


                     
                     
      *                  *---------------------------------------------*
      *                  * Test su codice ubicazione 'ZZZ'             *
      *                  *---------------------------------------------*
______*    if        rf-miu-cod-ubi       not  = "ZZZ    "
______*              go to gen-mov-dcd-700.
       gen-mov-dcd-700.





           move      spaces               to   l-mag-300-cod-dsl      .
           move      rf-miu-cod-ubi       to   l-mag-300-cod-dsd      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
       gen-mov-dcd-800.
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale record [miu]     *
      *              *-------------------------------------------------*
           go to     gen-mov-dcd-200.
       gen-mov-dcd-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      69                   to   v-pos                  .
           move      "Eseguita"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     gen-mov-dcd-999.
       gen-mov-dcd-999.
           exit.

      *    *===========================================================*
      *    * Determinazione rilevazioni per ubicazione                 *
      *    *-----------------------------------------------------------*
       det-qtu-pro-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-qtu-pro-prs      .
           move      zero                 to   w-det-qtu-pro-rlv      .
           move      spaces               to   w-det-qtu-pro-flg      .
       det-qtu-pro-100.
      *              *-------------------------------------------------*
      *              * Start su archivio [miu]                         *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "MAGUBI    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      01                   to   rf-miu-cod-dpz         .
           move      01                   to   rf-miu-tip-mag         .
           move      w-det-qtu-pro-num    to   rf-miu-num-mag         .
           move      spaces               to   rf-miu-cod-ubi         .
           move      "pgm/mag/fls/ioc/obj/iofmiu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-miu                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : ad uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-qtu-pro-900.
       det-qtu-pro-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio [miu]              *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmiu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-miu                 .
      *                  *---------------------------------------------*
      *                  * Se fine file : ad uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-qtu-pro-900.
       det-qtu-pro-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su codice dipendenza                   *
      *                  *---------------------------------------------*
           if        rf-miu-cod-dpz       not  = 01
                     go to  det-qtu-pro-900.
      *                  *---------------------------------------------*
      *                  * Test su codice numerico prodotto            *
      *                  *---------------------------------------------*
           if        rf-miu-num-mag       not  = w-det-qtu-pro-num
                     go to  det-qtu-pro-900.
       det-qtu-pro-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su flag di supervisione                *
      *                  *---------------------------------------------*
______*    if        rf-miu-flg-spv       =    spaces
           if        rf-miu-flg-rlv       =    spaces
                     go to  det-qtu-pro-200.
       det-qtu-pro-500.
      *              *-------------------------------------------------*
      *              * Aggiornamento quantita'                         *
      *              *-------------------------------------------------*
           add       rf-miu-qta-prs       to   w-det-qtu-pro-prs      .
           add       rf-miu-qta-rlv       to   w-det-qtu-pro-rlv      .
      *              *-------------------------------------------------*
      *              * Aggiornamento flag di rilevazione               *
      *              *-------------------------------------------------*
           move      rf-miu-flg-rlv       to   w-det-qtu-pro-flg      .
       det-qtu-pro-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     det-qtu-pro-200.
       det-qtu-pro-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-qtu-pro-999.
       det-qtu-pro-999.
           exit.

      *    *===========================================================*
      *    * Routine di aggiornamento numerazione [datinv]             *
      *    *-----------------------------------------------------------*
       agg-dat-inv-000.
      *              *-------------------------------------------------*
      *              * Ottenimento record [datinv]                     *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *              *-------------------------------------------------*
      *              * Se record non esistente                         *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to agg-dat-inv-100.
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [datinv]             *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *                  *---------------------------------------------*
      *                  * Scrittura record [datinv]                   *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *                  *---------------------------------------------*
      *                  * Riciclo a inizio operazione                 *
      *                  *---------------------------------------------*
           go to     agg-dat-inv-000.
       agg-dat-inv-100.
      *              *-------------------------------------------------*
      *              * Composizione record [datinv]                    *
      *              *-------------------------------------------------*
           move      rr-tip-inv           to   rn-dat-inv-tip-iic     .
           move      rr-dat-inv           to   rn-dat-inv-dat-ini     .
           move      "#"                  to   rn-dat-inv-flg-gdi     .
           move      zero                 to   rn-dat-inv-dat-fii     .
      *              *-------------------------------------------------*
      *              * Update record [datinv]                          *
      *              *-------------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *              *-------------------------------------------------*
      *              * Release record [datinv]                         *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
       agg-dat-inv-999.
           exit.

      *    *===========================================================*
      *    * Determinazione causali di magazzino per inventario        *
      *    *-----------------------------------------------------------*
       det-cau-mag-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-cau-mag-flg      .
      *              *-------------------------------------------------*
      *              * Lettura referenza relativa alle causali di ma-  *
      *              * gazzino                                         *
      *              *-------------------------------------------------*
           move      "R:"                 to   s-ope                  .
           move      "pgm/mag/inv/mag680[cau-mag]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Test su esito operazione                        *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     go to det-cau-mag-100.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Mancano le referenze relative alle causali di maga
      -              "zzino.                "
                                          to   w-msg-pne-1rg-msg      .
           perform   msg-pne-1rg-000      thru msg-pne-1rg-999        .
      *                  *---------------------------------------------*
      *                  * Uscita con errore                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-999.
       det-cau-mag-100.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valore referenza                *
      *              *-------------------------------------------------*
           move      s-alf                to   w-ref-cau-mag-str      .
      *              *-------------------------------------------------*
      *              * Controllo formale                               *
      *              *-------------------------------------------------*
           if        w-ref-cau-mag-dip    not  numeric or
                     w-ref-cau-mag-din    not  numeric or
                     w-ref-cau-mag-dpn    not  numeric or
                     w-ref-cau-mag-dnn    not  numeric or
                     w-ref-cau-mag-dpt    not  numeric or
                     w-ref-cau-mag-dnt    not  numeric
                     go to det-cau-mag-110
           else      go to det-cau-mag-200.
       det-cau-mag-110.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Le referenze relative alle causali di magazzino so
      -              "no formalmente errate."
                                          to   w-msg-pne-1rg-msg      .
           perform   msg-pne-1rg-000      thru msg-pne-1rg-999        .
      *                  *---------------------------------------------*
      *                  * Uscita con errore                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-999.
       det-cau-mag-200.
      *              *-------------------------------------------------*
      *              * Open file [zmc]                                 *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzmc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmc                 .
      *              *-------------------------------------------------*
      *              * Controllo causale per differenze inventariali   *
      *              * positive                                        *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCAU    "         to   f-key                  .
           move      w-ref-cau-mag-dip    to   rf-zmc-cod-cau         .
           move      "pgm/mag/fls/ioc/obj/iofzmc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmc                 .
      *                  *---------------------------------------------*
      *                  * Se lettura errata                           *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to det-cau-mag-220.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Causale di magazzino per differenze inventariali p
      -              "ositive non esistente "
                                          to   w-msg-pne-2rg-m01      .
           move      "in archivio.                                      
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-220.
      *                  *---------------------------------------------*
      *                  * Test se tipo movimentazione di magazzino e' *
      *                  * 01 : Carico                                 *
      *                  *---------------------------------------------*
           if        rf-zmc-tip-mdm       =    01
                     go to det-cau-mag-230.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive non e' de- "
                                          to   w-msg-pne-2rg-m01      .
           move      "finita 'di carico'.                               
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-230.
      *                  *---------------------------------------------*
      *                  * Test se trattamento conto merce e'          *
      *                  * 02 : Non puo' riferirsi ad un altro docu-   *
      *                  *      mento                                  *
      *                  *---------------------------------------------*
           if        rf-zmc-trt-mic       =    02
                     go to det-cau-mag-240.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive non puo'   "
                                          to   w-msg-pne-2rg-m01      .
           move      "essere 'di giroconto merce'.                      
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-240.
      *                  *---------------------------------------------*
      *                  * Test se tipo archivio di default e'         *
      *                  * N : No tipo archivio                        *
      *                  *---------------------------------------------*
           if        rf-zmc-def-tar       =    "N"
                     go to det-cau-mag-250.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive deve avere "
                                          to   w-msg-pne-2rg-m01      .
           move      "un tipo archivio pari a 'Nessun tipo archivio'.   
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-250.
      *                  *---------------------------------------------*
      *                  * Test se tipo archivio variabile e'          *
      *                  * N : No                                      *
      *                  *---------------------------------------------*
           if        rf-zmc-snv-tar       =    "N"
                     go to det-cau-mag-300.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive non puo'   "
                                          to   w-msg-pne-2rg-m01      .
           move      "avere il tipo archivio variabile.                 
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-300.
      *              *-------------------------------------------------*
      *              * Controllo causale per differenze inventariali   *
      *              * negative                                        *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCAU    "         to   f-key                  .
           move      w-ref-cau-mag-din    to   rf-zmc-cod-cau         .
           move      "pgm/mag/fls/ioc/obj/iofzmc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmc                 .
      *                  *---------------------------------------------*
      *                  * Se lettura errata                           *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to det-cau-mag-320.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Causale di magazzino per differenze inventariali n
      -              "egative non esistente "
                                          to   w-msg-pne-2rg-m01      .
           move      "in archivio.                                      
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-320.
      *                  *---------------------------------------------*
      *                  * Test se tipo movimentazione di magazzino e' *
      *                  * 02 : Scarico                                *
      *                  *---------------------------------------------*
           if        rf-zmc-tip-mdm       =    02
                     go to det-cau-mag-330.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative non e' de- "
                                          to   w-msg-pne-2rg-m01      .
           move      "finita 'di scarico'.                              
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-330.
      *                  *---------------------------------------------*
      *                  * Test se trattamento conto merce e'          *
      *                  * 02 : Non puo' riferirsi ad un altro docu-   *
      *                  *      mento                                  *
      *                  *---------------------------------------------*
           if        rf-zmc-trt-mic       =    02
                     go to det-cau-mag-340.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative non puo'   "
                                          to   w-msg-pne-2rg-m01      .
           move      "essere 'di giroconto merce'.                      
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-340.
      *                  *---------------------------------------------*
      *                  * Test se tipo archivio di default e'         *
      *                  * N : No tipo archivio                        *
      *                  *---------------------------------------------*
           if        rf-zmc-def-tar       =    "N"
                     go to det-cau-mag-350.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative deve avere "
                                          to   w-msg-pne-2rg-m01      .
           move      "un tipo archivio pari a 'Nessun tipo archivio'.   
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-350.
      *                  *---------------------------------------------*
      *                  * Test se tipo archivio variabile e'          *
      *                  * N : No                                      *
      *                  *---------------------------------------------*
           if        rf-zmc-snv-tar       =    "N"
                     go to det-cau-mag-400.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative non puo'   "
                                          to   w-msg-pne-2rg-m01      .
           move      "avere il tipo archivio variabile.                 
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-400.
      *              *-------------------------------------------------*
      *              * Controllo causale per differenze inventariali   *
      *              * positive merce presso di noi (o di terzi)       *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCAU    "         to   f-key                  .
           move      w-ref-cau-mag-dpn    to   rf-zmc-cod-cau         .
           move      "pgm/mag/fls/ioc/obj/iofzmc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmc                 .
      *                  *---------------------------------------------*
      *                  * Se lettura errata                           *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to det-cau-mag-420.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Causale di magazzino per differenze inventariali p
      -              "ositive merci presso  "
                                          to   w-msg-pne-2rg-m01      .
           move      "di noi, non esistente in archivio.                
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-420.
      *                  *---------------------------------------------*
      *                  * Test se tipo movimentazione di magazzino e' *
      *                  * 01 : Carico                                 *
      *                  *---------------------------------------------*
           if        rf-zmc-tip-mdm       =    01
                     go to det-cau-mag-430.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so di noi, non e' definita 'di carico'.           
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-430.
      *                  *---------------------------------------------*
      *                  * Test se trattamento conto merce e'          *
      *                  * 03 : Il documento stesso e' una movimenta-  *
      *                  *      zione di merce in conto                *
      *                  *---------------------------------------------*
           if        rf-zmc-trt-mic       =    03
                     go to det-cau-mag-440.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so di noi, deve essere 'per movimentazione merce i
      -              "n c/                  "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-440.
      *                  *---------------------------------------------*
      *                  * Test se tipo conto merce e'                 *
      *                  * T : Merce presso di noi ma non di nostra    *
      *                  *     proprieta'                              *
      *                  *---------------------------------------------*
           if        rf-zmc-tip-mic       =    "T"
                     go to det-cau-mag-450.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Il tipo conto merce della causale di magazzino per
      -              " differenze inventa-  "
                                          to   w-msg-pne-2rg-m01      .
           move      "riali positive merci presso di noi, deve essere 'M
      -              "erce presso di noi'.  "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-450.
      *                  *---------------------------------------------*
      *                  * Test se variabilita' tipo conto merce e'    *
      *                  * S : Si                                      *
      *                  *---------------------------------------------*
           if        rf-zmc-snv-mic       =    "S"
                     go to det-cau-mag-460.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Il tipo conto merce della causale di magazzino per
      -              " differenze inventa-  "
                                          to   w-msg-pne-2rg-m01      .
           move      "riali positive merci presso di noi, deve essere va
      -              "riabile.              "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-460.
      *                  *---------------------------------------------*
      *                  * Test se tipo archivio variabile e'          *
      *                  * S : Si                                      *
      *                  *---------------------------------------------*
           if        rf-zmc-snv-tar       =    "S"
                     go to det-cau-mag-470.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so di noi, deve avere il tipo archivio variabile. 
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-470.
      *                  *---------------------------------------------*
      *                  * Test se la lista tipi archivio contiene 'C' *
      *                  * e 'F'                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se lista tipi archivio a spazi : oltre  *
      *                      *-----------------------------------------*
           if        rf-zmc-lst-tar       =    spaces
                     go to det-cau-mag-500.
      *                      *-----------------------------------------*
      *                      * Controllo se esiste il tipo archivio 'C'*
      *                      *-----------------------------------------*
           move      zero                 to   w-det-cau-mag-ctr      .
           inspect   rf-zmc-lst-tar   tallying w-det-cau-mag-ctr
                                       for all "C"                    .
           if        w-det-cau-mag-ctr    not  = zero
                     go to det-cau-mag-475.
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so di noi, deve ammettere anche l'archivio clienti 
      -              ".                     "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                          *-------------------------------------*
      *                          * A close file e uscita con errore    *
      *                          *-------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-475.
      *                      *-----------------------------------------*
      *                      * Controllo se esiste il tipo archivio 'F'*
      *                      *-----------------------------------------*
           move      zero                 to   w-det-cau-mag-ctr      .
           inspect   rf-zmc-lst-tar   tallying w-det-cau-mag-ctr
                                       for all "F"                    .
           if        w-det-cau-mag-ctr    not  = zero
                     go to det-cau-mag-500.
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so di noi, deve ammettere anche l'archivio fornito
      -              "ri.                   "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                          *-------------------------------------*
      *                          * A close file e uscita con errore    *
      *                          *-------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-500.
      *              *-------------------------------------------------*
      *              * Controllo causale per differenze inventariali   *
      *              * negative merce presso di noi (o di terzi)       *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCAU    "         to   f-key                  .
           move      w-ref-cau-mag-dnn    to   rf-zmc-cod-cau         .
           move      "pgm/mag/fls/ioc/obj/iofzmc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmc                 .
      *                  *---------------------------------------------*
      *                  * Se lettura errata                           *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to det-cau-mag-520.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Causale di magazzino per differenze inventariali n
      -              "egative merci presso  "
                                          to   w-msg-pne-2rg-m01      .
           move      "di noi, non esistente in archivio.                
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-520.
      *                  *---------------------------------------------*
      *                  * Test se tipo movimentazione di magazzino e' *
      *                  * 02 : Scarico                                *
      *                  *---------------------------------------------*
           if        rf-zmc-tip-mdm       =    02
                     go to det-cau-mag-530.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so di noi non e' definita 'di scarico'.           
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-530.
      *                  *---------------------------------------------*
      *                  * Test se trattamento conto merce e'          *
      *                  * 03 : Il documento stesso e' una movimenta-  *
      *                  *      zione di merce in conto                *
      *                  *---------------------------------------------*
           if        rf-zmc-trt-mic       =    03
                     go to det-cau-mag-540.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so di noi, deve essere 'per movimentazione merce i
      -              "n c/                  "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-540.
      *                  *---------------------------------------------*
      *                  * Test se tipo conto merce e'                 *
      *                  * T : Merce presso di noi ma non di nostra    *
      *                  *     proprieta'                              *
      *                  *---------------------------------------------*
           if        rf-zmc-tip-mic       =    "T"
                     go to det-cau-mag-550.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Il tipo conto merce della causale di magazzino per
      -              " differenze inventa-  "
                                          to   w-msg-pne-2rg-m01      .
           move      "riali negative merci presso di noi, deve essere 'M
      -              "erce presso di noi'.  "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-550.
      *                  *---------------------------------------------*
      *                  * Test se variabilita' tipo conto merce e'    *
      *                  * S : Si                                      *
      *                  *---------------------------------------------*
           if        rf-zmc-snv-mic       =    "S"
                     go to det-cau-mag-560.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Il tipo conto merce della causale di magazzino per
      -              " differenze inventa-  "
                                          to   w-msg-pne-2rg-m01      .
           move      "riali negative merci presso di noi, deve essere va
      -              "riabile.              "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-560.
      *                  *---------------------------------------------*
      *                  * Test se tipo archivio variabile e'          *
      *                  * S : Si                                      *
      *                  *---------------------------------------------*
           if        rf-zmc-snv-tar       =    "S"
                     go to det-cau-mag-570.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so di noi, deve avere il tipo archivio variabile. 
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-570.
      *                  *---------------------------------------------*
      *                  * Test se la lista tipi archivio contiene 'C' *
      *                  * e 'F'                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se lista tipi archivio a spazi : oltre  *
      *                      *-----------------------------------------*
           if        rf-zmc-lst-tar       =    spaces
                     go to det-cau-mag-600.
      *                      *-----------------------------------------*
      *                      * Controllo se esiste il tipo archivio 'C'*
      *                      *-----------------------------------------*
           move      zero                 to   w-det-cau-mag-ctr      .
           inspect   rf-zmc-lst-tar   tallying w-det-cau-mag-ctr
                                       for all "C"                    .
           if        w-det-cau-mag-ctr    not  = zero
                     go to det-cau-mag-575.
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so di noi, deve ammettere anche l'archivio clienti 
      -              ".                     "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                          *-------------------------------------*
      *                          * A close file e uscita con errore    *
      *                          *-------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-575.
      *                      *-----------------------------------------*
      *                      * Controllo se esiste il tipo archivio 'F'*
      *                      *-----------------------------------------*
           move      zero                 to   w-det-cau-mag-ctr      .
           inspect   rf-zmc-lst-tar   tallying w-det-cau-mag-ctr
                                       for all "F"                    .
           if        w-det-cau-mag-ctr    not  = zero
                     go to det-cau-mag-600.
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so di noi, deve ammettere anche l'archivio fornito
      -              "ri.                   "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                          *-------------------------------------*
      *                          * A close file e uscita con errore    *
      *                          *-------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-600.
      *              *-------------------------------------------------*
      *              * Controllo causale per differenze inventariali   *
      *              * positive merce presso terzi (o nostra)          *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCAU    "         to   f-key                  .
           move      w-ref-cau-mag-dpt    to   rf-zmc-cod-cau         .
           move      "pgm/mag/fls/ioc/obj/iofzmc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmc                 .
      *                  *---------------------------------------------*
      *                  * Se lettura errata                           *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to det-cau-mag-620.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Causale di magazzino per differenze inventariali p
      -              "ositive merci presso  "
                                          to   w-msg-pne-2rg-m01      .
           move      "terzi, non esistente in archivio.                 
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-620.
      *                  *---------------------------------------------*
      *                  * Test se tipo movimentazione di magazzino e' *
      *                  * 01 : Carico                                 *
      *                  *---------------------------------------------*
           if        rf-zmc-tip-mdm       =    01
                     go to det-cau-mag-630.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so terzi, non e' definita 'di carico'.            
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-630.
      *                  *---------------------------------------------*
      *                  * Test se trattamento conto merce e'          *
      *                  * 01 : Puo' riferirsi ad un altro documento   *
      *                  *      di giroconto merce                     *
      *                  *---------------------------------------------*
           if        rf-zmc-trt-mic       =    01
                     go to det-cau-mag-640.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so terzi, deve contenere 'Puo' essere di giroconto
      -              " merce'.              "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-640.
      *                  *---------------------------------------------*
      *                  * Test se tipo conto merce e'                 *
      *                  * N : Merce presso terzi ma non di loro pro-  *
      *                  *     prieta'                                 *
      *                  *---------------------------------------------*
           if        rf-zmc-tip-mic       =    "N"
                     go to det-cau-mag-650.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Il tipo conto merce della causale di magazzino per
      -              " differenze inventa-  "
                                          to   w-msg-pne-2rg-m01      .
           move      "riali positive merci presso terzi, deve essere 'Me
      -              "rce presso terzi'.    "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-650.
      *                  *---------------------------------------------*
      *                  * Test se variabilita' tipo conto merce e'    *
      *                  * S : Si                                      *
      *                  *---------------------------------------------*
           if        rf-zmc-snv-mic       =    "S"
                     go to det-cau-mag-660.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Il tipo conto merce della causale di magazzino per
      -              " differenze inventa-  "
                                          to   w-msg-pne-2rg-m01      .
           move      "riali positive merci presso terzi, deve essere var
      -              "iabile.               "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-660.
      *                  *---------------------------------------------*
      *                  * Test se tipo archivio variabile e'          *
      *                  * S : Si                                      *
      *                  *---------------------------------------------*
           if        rf-zmc-snv-tar       =    "S"
                     go to det-cau-mag-670.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so terzi, deve avere il tipo archivio variabile.  
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-670.
      *                  *---------------------------------------------*
      *                  * Test se la lista tipi archivio contiene 'C' *
      *                  * e 'F'                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se lista tipi archivio a spazi : oltre  *
      *                      *-----------------------------------------*
           if        rf-zmc-lst-tar       =    spaces
                     go to det-cau-mag-700.
      *                      *-----------------------------------------*
      *                      * Controllo se esiste il tipo archivio 'C'*
      *                      *-----------------------------------------*
           move      zero                 to   w-det-cau-mag-ctr      .
           inspect   rf-zmc-lst-tar   tallying w-det-cau-mag-ctr
                                       for all "C"                    .
           if        w-det-cau-mag-ctr    not  = zero
                     go to det-cau-mag-675.
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so terzi, deve ammettere anche l'archivio clienti.
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                          *-------------------------------------*
      *                          * A close file e uscita con errore    *
      *                          *-------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-675.
      *                      *-----------------------------------------*
      *                      * Controllo se esiste il tipo archivio 'F'*
      *                      *-----------------------------------------*
           move      zero                 to   w-det-cau-mag-ctr      .
           inspect   rf-zmc-lst-tar   tallying w-det-cau-mag-ctr
                                       for all "F"                    .
           if        w-det-cau-mag-ctr    not  = zero
                     go to det-cau-mag-700.
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i positive merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so terzi, deve ammettere anche l'archivio fornitor
      -              "i.                    "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                          *-------------------------------------*
      *                          * A close file e uscita con errore    *
      *                          *-------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-700.
      *              *-------------------------------------------------*
      *              * Controllo causale per differenze inventariali   *
      *              * negative merce presso terzi (o nostra)          *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCAU    "         to   f-key                  .
           move      w-ref-cau-mag-dnt    to   rf-zmc-cod-cau         .
           move      "pgm/mag/fls/ioc/obj/iofzmc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmc                 .
      *                  *---------------------------------------------*
      *                  * Se lettura errata                           *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to det-cau-mag-720.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Causale di magazzino per differenze inventariali n
      -              "egative merci presso  "
                                          to   w-msg-pne-2rg-m01      .
           move      "terzi, non esistente in archivio.                 
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-720.
      *                  *---------------------------------------------*
      *                  * Test se tipo movimentazione di magazzino e' *
      *                  * 02 : Scarico                                *
      *                  *---------------------------------------------*
           if        rf-zmc-tip-mdm       =    02
                     go to det-cau-mag-730.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so terzi, non e' definita 'di scarico'.           
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-730.
      *                  *---------------------------------------------*
      *                  * Test se trattamento conto merce e'          *
      *                  * 01 : Puo' riferirsi ad un altro documento   *
      *                  *      di giroconto merce                     *
      *                  *---------------------------------------------*
           if        rf-zmc-trt-mic       =    01
                     go to det-cau-mag-740.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so terzi, deve contenere 'Puo' essere di giroconto
      -              " merce'.              "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-740.
      *                  *---------------------------------------------*
      *                  * Test se tipo conto merce e'                 *
      *                  * N : Merce presso terzi ma non di loro pro-  *
      *                  *     prieta'                                 *
      *                  *---------------------------------------------*
           if        rf-zmc-tip-mic       =    "N"
                     go to det-cau-mag-750.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Il tipo conto merce della causale di magazzino per
      -              " differenze inventa-  "
                                          to   w-msg-pne-2rg-m01      .
           move      "riali negative merci presso terzi, deve essere 'Me
      -              "rce presso terzi'.    "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-750.
      *                  *---------------------------------------------*
      *                  * Test se variabilita' tipo conto merce e'    *
      *                  * S : Si                                      *
      *                  *---------------------------------------------*
           if        rf-zmc-snv-mic       =    "S"
                     go to det-cau-mag-760.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Il tipo conto merce della causale di magazzino per
      -              " differenze inventa-  "
                                          to   w-msg-pne-2rg-m01      .
           move      "riali negative merci presso terzi, deve essere var
      -              "iabile.               "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-760.
      *                  *---------------------------------------------*
      *                  * Test se tipo archivio variabile e'          *
      *                  * S : Si                                      *
      *                  *---------------------------------------------*
           if        rf-zmc-snv-tar       =    "S"
                     go to det-cau-mag-770.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so terzi, deve avere il tipo archivio variabile.  
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                      *-----------------------------------------*
      *                      * A close file e uscita con errore        *
      *                      *-----------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-770.
      *                  *---------------------------------------------*
      *                  * Test se la lista tipi archivio contiene 'C' *
      *                  * e 'F'                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se lista tipi archivio a spazi : oltre  *
      *                      *-----------------------------------------*
           if        rf-zmc-lst-tar       =    spaces
                     go to det-cau-mag-800.
      *                      *-----------------------------------------*
      *                      * Controllo se esiste il tipo archivio 'C'*
      *                      *-----------------------------------------*
           move      zero                 to   w-det-cau-mag-ctr      .
           inspect   rf-zmc-lst-tar   tallying w-det-cau-mag-ctr
                                       for all "C"                    .
           if        w-det-cau-mag-ctr    not  = zero
                     go to det-cau-mag-775.
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so terzi, deve ammettere anche l'archivio clienti.
      -              "                      "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                          *-------------------------------------*
      *                          * A close file e uscita con errore    *
      *                          *-------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-775.
      *                      *-----------------------------------------*
      *                      * Controllo se esiste il tipo archivio 'F'*
      *                      *-----------------------------------------*
           move      zero                 to   w-det-cau-mag-ctr      .
           inspect   rf-zmc-lst-tar   tallying w-det-cau-mag-ctr
                                       for all "F"                    .
           if        w-det-cau-mag-ctr    not  = zero
                     go to det-cau-mag-800.
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "La causale di magazzino per differenze inventarial
      -              "i negative merci pres-"
                                          to   w-msg-pne-2rg-m01      .
           move      "so terzi, deve ammettere anche l'archivio fornitor
      -              "i.                    "
                                          to   w-msg-pne-2rg-m02      .
           perform   msg-pne-2rg-000      thru msg-pne-2rg-999        .
      *                          *-------------------------------------*
      *                          * A close file e uscita con errore    *
      *                          *-------------------------------------*
           move      "#"                  to   w-det-cau-mag-flg      .
           go to     det-cau-mag-900.
       det-cau-mag-800.
      *              *-------------------------------------------------*
      *              * Fine determinazione                             *
      *              *-------------------------------------------------*
       det-cau-mag-900.
      *              *-------------------------------------------------*
      *              * Close file [zmc]                                *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzmc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zmc                 .
       det-cau-mag-999.
           exit.

      *    *===========================================================*
      *    * Messaggio per programma non eseguibile su 1 riga          *
      *    *-----------------------------------------------------------*
       msg-pne-1rg-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      17                   to   v-lto                  .
           move      78                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggi nel box                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "                           A T T E N Z I O N E    
      -              "                      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Prima riga                                  *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "Programma non eseguibile !                        
      -              "                      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Seconda riga                                *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      w-msg-pne-1rg-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      74                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      75                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       msg-pne-1rg-999.
           exit.

      *    *===========================================================*
      *    * Messaggio per programma non eseguibile su 2 righe         *
      *    *-----------------------------------------------------------*
       msg-pne-2rg-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      07                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      18                   to   v-lto                  .
           move      78                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggi nel box                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "                           A T T E N Z I O N E    
      -              "                      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Messaggio standard                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "Programma non eseguibile !                        
      -              "                      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Prima riga di messaggio                     *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      w-msg-pne-2rg-m01    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Seconda riga di messaggio                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      w-msg-pne-2rg-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      74                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      17                   to   v-lin                  .
           move      75                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       msg-pne-2rg-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per modulo aggiornamento magazzino            *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/pmag300z.pgs"                   .
