       Identification division.
       Program-Id.                                 pmag4201           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    mag                 *
      *                                Settore:    sit                 *
      *                                   Fase:    mag420              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 03/07/92    *
      *                       Ultima revisione:    NdK del 07/06/22    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione stampa per il programma pmag4200 *
      *                                                                *
      *                    Situazione giacenze materie prime           *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "mag"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "sit"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "mag420"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pmag4201"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "    SITUAZIONE GIACENZE MATERIE PRIME   "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records logici                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [zm1]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dpm/fls/rec/rfzm1"                          .
      *        *-------------------------------------------------------*
      *        * [zm2]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dpm/fls/rec/rfzm2"                          .
      *        *-------------------------------------------------------*
      *        * [zm3]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dpm/fls/rec/rfzm3"                          .
      *        *-------------------------------------------------------*
      *        * [dpm]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dpm/fls/rec/rfdpm"                          .

      *    *===========================================================*
      *    * Record per le richieste                                   *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Codice dipendenza in uso                              *
      *        *-------------------------------------------------------*
           05  rr-dpz-inu                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Denominazione dipendenza in uso                       *
      *        *-------------------------------------------------------*
           05  rr-dpz-inu-den             pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Numero globale dipendenze                             *
      *        *-------------------------------------------------------*
           05  rr-dpz-ctr-dpz             pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Numero dipendenze selezionate                         *
      *        *-------------------------------------------------------*
           05  rr-dpz-ctr-sel             pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Tabella dipendenze selezionate                        *
      *        *-------------------------------------------------------*
           05  rr-dpz-tbl-dpz.
      *            *---------------------------------------------------*
      *            * Elementi della tabella dipendenze selezionate     *
      *            *---------------------------------------------------*
               10  rr-dpz-ele-dpz occurs 99.
      *                *-----------------------------------------------*
      *                * Codice dipendenza selezionato                 *
      *                *-----------------------------------------------*
                   15  rr-dpz-ele-cod     pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Denominazione dipendenza                      *
      *                *-----------------------------------------------*
                   15  rr-dpz-ele-den     pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Codice filtro di selezione                            *
      *        *-------------------------------------------------------*
           05  rr-fso-dpm                 pic  9(08)                  .
           05  rr-fso-dpm-alf redefines
               rr-fso-dpm                 pic  x(08)                  .
           05  rr-fso-dpm-des             pic  x(40)                  .
           05  rr-fso-dpm-ord             pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Tipo salto pagina                                     *
      *        * - 01 : No salto pagina                                *
      *        * - 02 : Ad ogni classe                                 *
      *        * - 03 : Ad ogni gruppo                                 *
      *        * - 04 : Ad ogni sottogruppo                            *
      *        *-------------------------------------------------------*
           05  rr-tip-slp                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Data situazione di magazzino                          *
      *        *-------------------------------------------------------*
           05  rr-dat-sit                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Si/No solo se saldo diverso da zero                   *
      *        * - 01 : Si                                             *
      *        * - 02 : No                                             *
      *        *-------------------------------------------------------*
           05  rr-snx-zer                 pic  9(01)                  .

      *    *===========================================================*
      *    * Work per tipo ordinamento                                 *
      *    *-----------------------------------------------------------*
       01  w-tip-ord.
      *        *-------------------------------------------------------*
      *        * Tipo ordinamento ottenuto da richiesta al modulo di   *
      *        * filtro, selezione, ordinamento, su file [dpm]         *
      *        * - 01 : Per classe, gruppo, sottogruppo, codice mate-  *
      *        *        ria prima                                      *
      *        * - 02 : Per classe, gruppo, sottogruppo, descrizione   *
      *        *        materia prima                                  *
      *        * - 03 : Per codice materia prima                       *
      *        * - 04 : Per descrizione materia prima                  *
      *        *-------------------------------------------------------*
           05  w-tip-ord-tip-ord          pic  9(02)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zm1]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zm1.
               10  w-let-arc-zm1-flg      pic  x(01)                  .
               10  w-let-arc-zm1-cla      pic  9(05)                  .
               10  w-let-arc-zm1-des      pic  x(40)                  .
               10  w-let-arc-zm1-mne      pic  x(05)                  .
               10  w-let-arc-zm1-sud      pic  9(02)                  .
               10  w-let-arc-zm1-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zm2]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zm2.
               10  w-let-arc-zm2-flg      pic  x(01)                  .
               10  w-let-arc-zm2-cla      pic  9(05)                  .
               10  w-let-arc-zm2-gru      pic  9(05)                  .
               10  w-let-arc-zm2-des      pic  x(40)                  .
               10  w-let-arc-zm2-mne      pic  x(05)                  .
               10  w-let-arc-zm2-sud      pic  9(02)                  .
               10  w-let-arc-zm2-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zm3]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zm3.
               10  w-let-arc-zm3-flg      pic  x(01)                  .
               10  w-let-arc-zm3-cla      pic  9(05)                  .
               10  w-let-arc-zm3-gru      pic  9(05)                  .
               10  w-let-arc-zm3-sgr      pic  9(05)                  .
               10  w-let-arc-zm3-des      pic  x(40)                  .
               10  w-let-arc-zm3-mne      pic  x(05)                  .
               10  w-let-arc-zm3-sud      pic  9(02)                  .
               10  w-let-arc-zm3-sqz      pic  9(05)                  .

      *    *===========================================================*
      *    * Work area per gestione classe, gruppo e sottogruppo       *
      *    *-----------------------------------------------------------*
       01  w-cgs.
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori generici                   *
      *        *-------------------------------------------------------*
           05  w-cgs-gen.
      *            *---------------------------------------------------*
      *            * Flag di prima intestazione pagina da eseguire     *
      *            *---------------------------------------------------*
               10  w-cgs-gen-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori classe                     *
      *        *-------------------------------------------------------*
           05  w-cgs-cla.
      *            *---------------------------------------------------*
      *            * Si/No intestazione ad inizio classe               *
      *            *---------------------------------------------------*
               10  w-cgs-cla-int          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice classe                                     *
      *            *---------------------------------------------------*
               10  w-cgs-cla-cod          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Mnemonico classe                                  *
      *            *---------------------------------------------------*
               10  w-cgs-cla-mne          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di sequenza classe                         *
      *            *---------------------------------------------------*
               10  w-cgs-cla-sqz          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione classe                                *
      *            *---------------------------------------------------*
               10  w-cgs-cla-des          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Segnale di classe ulteriormente suddivisa         *
      *            *---------------------------------------------------*
               10  w-cgs-cla-sud          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Flag di intestazione gia' eseguita                *
      *            *---------------------------------------------------*
               10  w-cgs-cla-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori gruppo                     *
      *        *-------------------------------------------------------*
           05  w-cgs-gru.
      *            *---------------------------------------------------*
      *            * Si/No intestazione ad inizio gruppo               *
      *            *---------------------------------------------------*
               10  w-cgs-gru-int          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice gruppo                                     *
      *            *---------------------------------------------------*
               10  w-cgs-gru-cod          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Mnemonico gruppo                                  *
      *            *---------------------------------------------------*
               10  w-cgs-gru-mne          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di sequenza gruppo                         *
      *            *---------------------------------------------------*
               10  w-cgs-gru-sqz          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione gruppo                                *
      *            *---------------------------------------------------*
               10  w-cgs-gru-des          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Segnale di gruppo ulteriormente suddiviso         *
      *            *---------------------------------------------------*
               10  w-cgs-gru-sud          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Flag di intestazione gia' eseguita                *
      *            *---------------------------------------------------*
               10  w-cgs-gru-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori sottogruppo                *
      *        *-------------------------------------------------------*
           05  w-cgs-sgr.
      *            *---------------------------------------------------*
      *            * Si/No intestazione ad inizio sottogruppo          *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-int          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice sottogruppo                                *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-cod          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Mnemonico sottogruppo                             *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-mne          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di sequenza sottogruppo                    *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-sqz          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione sottogruppo                           *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-des          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Flag di intestazione gia' eseguita                *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori dettaglio                  *
      *        *-------------------------------------------------------*
           05  w-cgs-det.
      *            *---------------------------------------------------*
      *            * Numero di linee effettive impegnate dalla finca-  *
      *            * tura per il dettaglio e la sottolineatura         *
      *            *---------------------------------------------------*
               10  w-cgs-det-idf          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Per work                                              *
      *        *-------------------------------------------------------*
           05  w-cgs-wrk.
               10  w-cgs-wrk-nln          pic  9(02)                  .
               10  w-cgs-wrk-inx          pic  9(03)                  .
               10  w-cgs-wrk-pnt          pic  9(03)                  .
               10  w-cgs-wrk-car          pic  9(03)                  .
               10  w-cgs-wrk-pos          pic  9(03)                  .
               10  w-cgs-wrk-pfn          pic  9(03)                  .
               10  w-cgs-wrk-des          pic  x(40)                  .

      *    *===========================================================*
      *    * Work area per saldi castelletto dipendenze selezionate    *
      *    *-----------------------------------------------------------*
       01  w-sdp.
      *        *-------------------------------------------------------*
      *        * Segnale di tutte le dipendenze con saldo zero         *
      *        *-------------------------------------------------------*
           05  w-sdp-flg-zer              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Contatore dipendenze stampate                         *
      *        *-------------------------------------------------------*
           05  w-sdp-dpz-stp              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-sdp-ctr-001              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Totale generale dipendenze                            *
      *        *-------------------------------------------------------*
           05  w-sdp-tot-dpz              pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Tabella saldi dipendenze selezionate                  *
      *        *-------------------------------------------------------*
           05  w-sdp-ele-dpz occurs 99.
      *            *---------------------------------------------------*
      *            * Flag di dipendenza selezionata per la stampa      *
      *            *---------------------------------------------------*
               10  w-sdp-flg-ele          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Unita' di misura per la dipendenza                *
      *            *---------------------------------------------------*
               10  w-sdp-umi-dpz          pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Saldo dipendenza                                  *
      *            *---------------------------------------------------*
               10  w-sdp-sld-mag          pic s9(08)v9(03)            .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  w-rot-l03-cod-cla      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  w-rot-l02-cod-gru      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  w-rot-l01-cod-sgr      pic  9(05)                  .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione saldi magazzino  *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldmag0.dtl"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-cnt-tit-des-azi      .
           move      40                   to   w-cnt-tit-ctr-azi      .
       int-pag-std-100.
           if        w-cnt-tit-chr-azi
                    (w-cnt-tit-ctr-azi)   =    spaces
                     if     w-cnt-tit-ctr-azi
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-cnt-tit-ctr-tit      .
       int-pag-std-200.
           if        w-cnt-tit-chr-tit
                    (w-cnt-tit-ctr-tit)   =    spaces
                     if     w-cnt-tit-ctr-tit
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-tit      .
           subtract  w-cnt-tit-ctr-tit    from w-cnt-tit-pos-tit      .
           divide    2                    into w-cnt-tit-pos-tit      .
           add       1                    to   w-cnt-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    =    zero
                     move  4              to   w-cnt-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-cnt-tit-ctr-wrk      .
           inspect   w-cnt-tit-num-pag
                                      tallying w-cnt-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-cnt-tit-ctr-wrk    from 27
                                        giving w-cnt-tit-ctr-dep      .
           subtract  w-cnt-tit-ctr-wrk    from 5
                                        giving w-cnt-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-dep      .
           subtract  w-cnt-tit-ctr-dep    from w-cnt-tit-pos-dep      .
           add       1                    to   w-cnt-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-cnt-tit-ctr-azi    to   w-cnt-tit-ctr-wrk      .
           add       2                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-tit
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      w-cnt-tit-pos-tit    to   w-cnt-tit-ctr-wrk      .
           add       w-cnt-tit-ctr-tit    to   w-cnt-tit-ctr-wrk      .
           add       1                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-dep
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-cnt-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-cnt-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-cnt-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-cnt-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione saldo di magazz.  *
      *              *-------------------------------------------------*
           perform   det-sld-mag-opn-000  thru det-sld-mag-opn-999    .
      *              *-------------------------------------------------*
      *              * [zm1]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofzm1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zm1                 .
      *              *-------------------------------------------------*
      *              * [zm2]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofzm2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zm2                 .
      *              *-------------------------------------------------*
      *              * [zm3]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofzm3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zm3                 .
      *              *-------------------------------------------------*
      *              * [dpm]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * Filtro per selezione ed ordinamento [dpm]       *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dpm/prg/obj/bzosdpm0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * Lettura tipo ordinamento da filtro di selezione *
      *              * ed ordinamento per file [dpm]                   *
      *              *-------------------------------------------------*
           move      "TO"                 to   f-ope                  .
           move      rr-fso-dpm-alf       to   f-key                  .
           move      "pgm/dpm/prg/obj/bzosdpm0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
           if        f-sts                =    "01"
                     move  01             to   w-tip-ord-tip-ord
           else if   f-sts                =    "02"
                     move  02             to   w-tip-ord-tip-ord
           else if   f-sts                =    "03"
                     move  03             to   w-tip-ord-tip-ord
           else if   f-sts                =    "04"
                     move  04             to   w-tip-ord-tip-ord
           else      move  01             to   w-tip-ord-tip-ord      .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione saldo di magazz. *
      *              *-------------------------------------------------*
           perform   det-sld-mag-cls-000  thru det-sld-mag-cls-999    .
       prn-cls-fls-100.
      *              *-------------------------------------------------*
      *              * [zm1]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofzm1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zm1                 .
      *              *-------------------------------------------------*
      *              * [zm2]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofzm2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zm2                 .
      *              *-------------------------------------------------*
      *              * [zm3]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofzm3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zm3                 .
      *              *-------------------------------------------------*
      *              * [dpm]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * Filtro per selezione ed ordinamento [dpm]       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dpm/prg/obj/bzosdpm0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *                  *---------------------------------------------*
      *                  * Cancel                                      *
      *                  *---------------------------------------------*
           move      "pgm/dpm/prg/obj/bzosdpm0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : No                    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-exe-rou-srt      .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Start filtro di ordinamento e selezione per il  *
      *              * file [dpm]                                      *
      *              *-------------------------------------------------*
           move      "ST"                 to   f-ope                  .
           move      rr-fso-dpm           to   f-key                  .
           move      "pgm/dpm/prg/obj/bzosdpm0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * Se errore su Start : uscita con flag a Eof      *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-cnt-prn-flg-sub
                     go to prn-str-ini-999.
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessuna materia prima da stampare entro i limiti a
      -              "ssegnati !"         to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Read Next filtro di ordinamento e selezione per *
      *              * file [dpm]                                      *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dpm/prg/obj/bzosdpm0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * Se At End : uscita con flag a Eof               *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-cnt-prn-flg-sub
                     go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Selezione su codici dipendenza richiesti        *
      *              *-------------------------------------------------*
           if        rr-dpz-inu           not  = zero
                     go to prn-sel-rec-500.
       prn-sel-rec-100.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo di magazzino per tutte *
      *                  * le dipendenze                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione segnale di tutti i      *
      *                      * saldi delle dipendenze a zero           *
      *                      *-----------------------------------------*
           move      spaces               to   w-sdp-flg-zer          .
      *                      *-----------------------------------------*
      *                      * Inizio scansione                        *
      *                      *-----------------------------------------*
           move      zero                 to   w-sdp-ctr-001          .
       prn-sel-rec-110.
           add       1                    to   w-sdp-ctr-001          .
           if        w-sdp-ctr-001        >    99
                     go to prn-sel-rec-200.
           if        w-sdp-ctr-001        >    rr-dpz-ctr-sel
                     go to prn-sel-rec-200.
      *                      *-----------------------------------------*
      *                      * Preparazione link-area                  *
      *                      *-----------------------------------------*
           move      "SL"                 to   d-sld-mag-tip-ope      .
           move      0000                 to   d-sld-mag-tip-sld      .
           move      rr-dat-sit           to   d-sld-mag-dat-sld      .
           move      "U"                  to   d-sld-mag-uot-dpz      .
           move      rr-dpz-ele-cod
                    (w-sdp-ctr-001)       to   d-sld-mag-cod-dpz      .
           move      03                   to   d-sld-mag-tip-mag      .
           move      rf-dpm-num-map       to   d-sld-mag-num-mag      .
           move      "T"                  to   d-sld-mag-uot-var      .
           move      spaces               to   d-sld-mag-var-mag      .
           move      "T"                  to   d-sld-mag-uot-dsl      .
           move      spaces               to   d-sld-mag-cod-dsl      .
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           perform   det-sld-mag-cll-000  thru det-sld-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Se saldo uguale a zero                  *
      *                      *-----------------------------------------*
           if        d-sld-mag-sld-mag    not  = zero
                     go to prn-sel-rec-130.
      *                          *-------------------------------------*
      *                          * Segnale di dipendenza non selezio-  *
      *                          * nata per la stampa                  *
      *                          *-------------------------------------*
           move      spaces               to   w-sdp-flg-ele
                                              (w-sdp-ctr-001)         .
      *                          *-------------------------------------*
      *                          * Riciclo                             *
      *                          *-------------------------------------*
           go to     prn-sel-rec-110.
       prn-sel-rec-130.
      *                      *-----------------------------------------*
      *                      * Se saldo diverso da zero                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Segnale di dipendenza selezionata   *
      *                          * per la stampa e memorizzazione      *
      *                          * saldo                               *
      *                          *-------------------------------------*
           move      "#"                  to   w-sdp-flg-ele
                                              (w-sdp-ctr-001)         .
           move      rf-dpm-umi-prd       to   w-sdp-umi-dpz
                                              (w-sdp-ctr-001)         .
           move      d-sld-mag-sld-mag    to   w-sdp-sld-mag
                                              (w-sdp-ctr-001)         .
      *                          *-------------------------------------*
      *                          * Attivazione segnale di almeno una   *
      *                          * dipendenza con saldo non zero       *
      *                          *-------------------------------------*
           move      "#"                  to   w-sdp-flg-zer          .
      *                          *-------------------------------------*
      *                          * Riciclo                             *
      *                          *-------------------------------------*
           go to     prn-sel-rec-110.
       prn-sel-rec-200.
      *                      *-----------------------------------------*
      *                      * Test sul flag di tutti i saldi a zero   *
      *                      *-----------------------------------------*
           if        rr-snx-zer           =    01 and
                     w-sdp-flg-zer        =    spaces
                     move  "#"            to   w-cnt-prn-flg-sub
                     go to prn-sel-rec-999.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     prn-sel-rec-999.
       prn-sel-rec-500.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo di magazzino per la    *
      *                  * dipendenza richiesta solo se unica          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione link-area                  *
      *                      *-----------------------------------------*
           move      "SL"                 to   d-sld-mag-tip-ope      .
           move      0000                 to   d-sld-mag-tip-sld      .
           move      rr-dat-sit           to   d-sld-mag-dat-sld      .
           move      "U"                  to   d-sld-mag-uot-dpz      .
           move      rr-dpz-inu           to   d-sld-mag-cod-dpz      .
           move      03                   to   d-sld-mag-tip-mag      .
           move      rf-dpm-num-map       to   d-sld-mag-num-mag      .
           move      "T"                  to   d-sld-mag-uot-var      .
           move      spaces               to   d-sld-mag-var-mag      .
           move      "T"                  to   d-sld-mag-uot-dsl      .
           move      spaces               to   d-sld-mag-cod-dsl      .
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           perform   det-sld-mag-cll-000  thru det-sld-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Selezione                               *
      *                      *-----------------------------------------*
           if        rr-snx-zer           =    01 and
                     d-sld-mag-sld-mag    =    zero
                     move  "#"            to   w-cnt-prn-flg-sub
                     go to prn-sel-rec-999.
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-cmp-rot-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-cmp-rot-600.
       prn-cmp-rot-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice mate- *
      *              *   ria prima                                     *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   materia prima                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione area per rottura classe        *
      *                  *---------------------------------------------*
           move      rf-dpm-cla-map       to   w-rot-l03-cod-cla      .
      *                  *---------------------------------------------*
      *                  * Composizione area per rottura gruppo        *
      *                  *---------------------------------------------*
           move      rf-dpm-gru-map       to   w-rot-l02-cod-gru      .
      *                  *---------------------------------------------*
      *                  * Composizione area per rottura sottogruppo   *
      *                  *---------------------------------------------*
           move      rf-dpm-sgr-map       to   w-rot-l01-cod-sgr      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-cmp-rot-999.
       prn-cmp-rot-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice materia prima                      *
      *              * - Per descrizione materia prima                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione area rottura classe         *
      *                  *---------------------------------------------*
           move      zero                 to   w-rot-l03-cod-cla      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione area rottura gruppo         *
      *                  *---------------------------------------------*
           move      zero                 to   w-rot-l02-cod-gru      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione area rottura sottogruppo    *
      *                  *---------------------------------------------*
           move      zero                 to   w-rot-l01-cod-sgr      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-cmp-rot-999.
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Azzeramento totali generali                     *
      *              *-------------------------------------------------*
           perform   azz-tot-gen-000      thru azz-tot-gen-999        .
       prn-ini-cic-100.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo ordinamento       *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-ini-cic-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-ini-cic-600.
       prn-ini-cic-300.
      *              *-------------------------------------------------*
      *              * Se ordinamento per Classe, gruppo e sottogruppo *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione numero di linee effettive im-  *
      *                  * pegnate dalla fincatura per il dettaglio e  *
      *                  * la relativa sottolineatura                  *
      *                  *---------------------------------------------*
           move      2                    to   w-cgs-det-idf          .
      *                  *---------------------------------------------*
      *                  * Preparazione segnali di richiesta intesta-  *
      *                  * zione per inizio classe gruppo sottogruppo  *
      *                  *---------------------------------------------*
           if        rr-tip-slp           =    02
                     move  "S"            to   w-cgs-cla-int
                     move  "N"            to   w-cgs-gru-int
                     move  "N"            to   w-cgs-sgr-int
           else if   rr-tip-slp           =    03
                     move  "S"            to   w-cgs-cla-int
                     move  "S"            to   w-cgs-gru-int
                     move  "N"            to   w-cgs-sgr-int
           else if   rr-tip-slp           =    04
                     move  "S"            to   w-cgs-cla-int
                     move  "S"            to   w-cgs-gru-int
                     move  "S"            to   w-cgs-sgr-int
           else      move  "N"            to   w-cgs-cla-int
                     move  "N"            to   w-cgs-gru-int
                     move  "N"            to   w-cgs-sgr-int          .
      *                  *---------------------------------------------*
      *                  * Flag di prima intestazione : non eseguita   *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-gen-fie          .
      *                  *---------------------------------------------*
      *                  * Flag di intestazione classe : non eseguita  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-cla-fie          .
      *                  *---------------------------------------------*
      *                  * Flag di intestazione gruppo : non eseguita  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-gru-fie          .
      *                  *---------------------------------------------*
      *                  * Flag di intestazione sottogruppo : non ese- *
      *                  * guita                                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-sgr-fie          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-999.
       prn-ini-cic-600.
      *              *-------------------------------------------------*
      *              * Se ordinamento per Codice o Descrizione         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Intestazione foglio                         *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                      *-----------------------------------------*
      *                      * Test se interruzione forzata            *
      *                      *-----------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-cic-999.
      *                  *---------------------------------------------*
      *                  * Fincatura per dettaglio                     *
      *                  *---------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-999.
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-ini-lr3-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-ini-lr3-600.
       prn-ini-lr3-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice mate- *
      *              *   ria prima                                     *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   materia prima                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati classe                         *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-cla    to   w-let-arc-zm1-cla      .
           perform   let-arc-zm1-000      thru let-arc-zm1-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione dati classe                 *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-cla    to   w-cgs-cla-cod          .
           move      w-let-arc-zm1-des    to   w-cgs-cla-des          .
           move      w-let-arc-zm1-mne    to   w-cgs-cla-mne          .
           move      w-let-arc-zm1-sqz    to   w-cgs-cla-sqz          .
           move      w-let-arc-zm1-sud    to   w-cgs-cla-sud          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di classe gia' inte-   *
      *                  * stata                                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-cla-fie          .
      *                  *---------------------------------------------*
      *                  * Azzeramento totali per classe               *
      *                  *---------------------------------------------*
           perform   azz-tot-cla-000      thru azz-tot-cla-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice materia prima                      *
      *              * - Per descrizione materia prima                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-ini-lr2-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-ini-lr2-600.
       prn-ini-lr2-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice mate- *
      *              *   ria prima                                     *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   materia prima                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati gruppo                         *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-cla    to   w-let-arc-zm2-cla      .
           move      w-rot-l02-cod-gru    to   w-let-arc-zm2-gru      .
           perform   let-arc-zm2-000      thru let-arc-zm2-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione dati gruppo                 *
      *                  *---------------------------------------------*
           move      w-rot-l02-cod-gru    to   w-cgs-gru-cod          .
           move      w-let-arc-zm2-des    to   w-cgs-gru-des          .
           move      w-let-arc-zm2-mne    to   w-cgs-gru-mne          .
           move      w-let-arc-zm2-sqz    to   w-cgs-gru-sqz          .
           move      w-let-arc-zm2-sud    to   w-cgs-gru-sud          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di gruppo gia' inte-   *
      *                  * stato                                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-gru-fie          .
      *                  *---------------------------------------------*
      *                  * Azzeramento totali per gruppo               *
      *                  *---------------------------------------------*
           perform   azz-tot-gru-000      thru azz-tot-gru-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-lr2-999.
       prn-ini-lr2-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice materia prima                      *
      *              * - Per descrizione materia prima                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     prn-ini-lr2-999.
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-ini-lr1-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-ini-lr1-600.
       prn-ini-lr1-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice mate- *
      *              *   ria prima                                     *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   materia prima                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati sottogruppo                    *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-cla    to   w-let-arc-zm3-cla      .
           move      w-rot-l02-cod-gru    to   w-let-arc-zm3-gru      .
           move      w-rot-l01-cod-sgr    to   w-let-arc-zm3-sgr      .
           perform   let-arc-zm3-000      thru let-arc-zm3-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione dati sottogruppo            *
      *                  *---------------------------------------------*
           move      w-rot-l01-cod-sgr    to   w-cgs-sgr-cod          .
           move      w-let-arc-zm3-des    to   w-cgs-sgr-des          .
           move      w-let-arc-zm3-mne    to   w-cgs-sgr-mne          .
           move      w-let-arc-zm3-sqz    to   w-cgs-sgr-sqz          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di sottogruppo gia'    *
      *                  * intestato                                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-sgr-fie          .
      *                  *---------------------------------------------*
      *                  * Azzeramento totali per sottogruppo          *
      *                  *---------------------------------------------*
           perform   azz-tot-sgr-000      thru azz-tot-sgr-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dei flags di intesta-  *
      *                  * zione gia' eseguita                         *
      *                  *---------------------------------------------*
           if        w-cgs-cla-fie        =    spaces
                     go to prn-ini-lr1-350
           else if   w-cgs-gru-fie        =    spaces
                     go to prn-ini-lr1-450
           else      go to prn-ini-lr1-500.
       prn-ini-lr1-350.
      *                  *---------------------------------------------*
      *                  * Se classe non ancora intestata              *
      *                  *---------------------------------------------*
       prn-ini-lr1-355.
      *                      *-----------------------------------------*
      *                      * Flag di intestazione eseguita per :     *
      *                      * - Classe                                *
      *                      * - Gruppo                                *
      *                      * - Sottogruppo                           *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cgs-cla-fie          .
           move      "#"                  to   w-cgs-gru-fie          .
           move      "#"                  to   w-cgs-sgr-fie          .
       prn-ini-lr1-360.
      *                      *-----------------------------------------*
      *                      * Se intestazione generale non ancora e-  *
      *                      * seguita                                 *
      *                      *-----------------------------------------*
           if        w-cgs-gen-fie        not  = spaces
                     go to prn-ini-lr1-370.
      *                          *-------------------------------------*
      *                          * Flag di intestazione generale gia'  *
      *                          * eseguita                            *
      *                          *-------------------------------------*
           move      "#"                  to   w-cgs-gen-fie          .
       prn-ini-lr1-365.
      *                          *-------------------------------------*
      *                          * Intestazione pagina                 *
      *                          *-------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * A test su suddivisione classe       *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-375.
       prn-ini-lr1-370.
      *                      *-----------------------------------------*
      *                      * Se intestazione generale gia' eseguita  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se richiesta comunque una intesta-  *
      *                          * zione ad inizio classe : ad inte-   *
      *                          * stazione pagina                     *
      *                          *-------------------------------------*
           if        w-cgs-cla-int        =    "S"
                     go to prn-ini-lr1-365.
       prn-ini-lr1-375.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se classe suddivi- *
      *                      * sa oppure no                            *
      *                      *-----------------------------------------*
           if        w-cgs-cla-sud        =    02
                     go to prn-ini-lr1-385
           else      go to prn-ini-lr1-380.
       prn-ini-lr1-380.
      *                      *-----------------------------------------*
      *                      * Se classe non suddivisa                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Intestazione per la sola classe     *
      *                          *-------------------------------------*
           perform   sta-int-cla-000      thru sta-int-cla-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-385.
      *                      *-----------------------------------------*
      *                      * Se classe suddivisa                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Deviazione a seconda se gruppo sud- *
      *                          * diviso oppure no                    *
      *                          *-------------------------------------*
           if        w-cgs-gru-sud        =    02
                     go to prn-ini-lr1-395
           else      go to prn-ini-lr1-390.
       prn-ini-lr1-390.
      *                          *-------------------------------------*
      *                          * Se gruppo non suddiviso             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Intestazione per classe e grup- *
      *                              * po                              *
      *                              *---------------------------------*
           perform   sta-int-gru-000      thru sta-int-gru-999        .
      *                              *---------------------------------*
      *                              * Se interruzione forzata : usci- *
      *                              * ta                              *
      *                              *---------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-395.
      *                          *-------------------------------------*
      *                          * Se gruppo suddiviso                 *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Intestazione per classe, grup-  *
      *                              * po, sottogruppo                 *
      *                              *---------------------------------*
           perform   sta-int-sgr-000      thru sta-int-sgr-999        .
      *                              *---------------------------------*
      *                              * Se interruzione forzata : usci- *
      *                              * ta                              *
      *                              *---------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-450.
      *                  *---------------------------------------------*
      *                  * Se gruppo non ancora intestato              *
      *                  *---------------------------------------------*
       prn-ini-lr1-455.
      *                      *-----------------------------------------*
      *                      * Flag di intestazione eseguita per :     *
      *                      * - Gruppo                                *
      *                      * - Sottogruppo                           *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cgs-gru-fie          .
           move      "#"                  to   w-cgs-sgr-fie          .
       prn-ini-lr1-460.
      *                      *-----------------------------------------*
      *                      * Se richiesta comunque una intestazione  *
      *                      * ad inizio gruppo                        *
      *                      *-----------------------------------------*
           if        w-cgs-gru-int        not  = "S"
                     go to prn-ini-lr1-465.
      *                          *-------------------------------------*
      *                          * Intestazione pagina                 *
      *                          *-------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
       prn-ini-lr1-465.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se gruppo suddivi- *
      *                      * so oppure no                            *
      *                      *-----------------------------------------*
           if        w-cgs-gru-sud        =    02
                     go to prn-ini-lr1-475
           else      go to prn-ini-lr1-470.
       prn-ini-lr1-470.
      *                      *-----------------------------------------*
      *                      * Se gruppo non suddiviso                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Intestazione per classe e gruppo    *
      *                          *-------------------------------------*
           perform   sta-int-gru-000      thru sta-int-gru-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-475.
      *                      *-----------------------------------------*
      *                      * Se gruppo suddiviso                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Intestazione per classe, gruppo, e  *
      *                          * sottogruppo                         *
      *                          *-------------------------------------*
           perform   sta-int-sgr-000      thru sta-int-sgr-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-500.
      *                  *---------------------------------------------*
      *                  * Se sottogruppo non ancora intestato         *
      *                  *---------------------------------------------*
       prn-ini-lr1-505.
      *                      *-----------------------------------------*
      *                      * Flag di intestazione eseguita per :     *
      *                      * - Sottogruppo                           *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cgs-sgr-fie          .
       prn-ini-lr1-510.
      *                      *-----------------------------------------*
      *                      * Se richiesta comunque una intestazione  *
      *                      * ad inizio sottogruppo                   *
      *                      *-----------------------------------------*
           if        w-cgs-sgr-int        not  = "S"
                     go to prn-ini-lr1-515.
      *                          *-------------------------------------*
      *                          * Intestazione pagina                 *
      *                          *-------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
       prn-ini-lr1-515.
      *                          *-------------------------------------*
      *                          * Intestazione per classe, gruppo, e  *
      *                          * sottogruppo                         *
      *                          *-------------------------------------*
           perform   sta-int-sgr-000      thru sta-int-sgr-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice materia prima                      *
      *              * - Per descrizione materia prima                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           if        p-res                >    2
                     go to prn-liv-det-100.
      *                  *---------------------------------------------*
      *                  * Intestazione pagina                         *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                  *---------------------------------------------*
      *                  * Test se interruzione forzata                *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
      *                  *---------------------------------------------*
      *                  * Fincatura per dettaglio                     *
      *                  *---------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       prn-liv-det-100.
      *              *-------------------------------------------------*
      *              * Se selezionate piu' dipendenze : interlinea     *
      *              * subordinata                                     *
      *              *-------------------------------------------------*
           if        rr-dpz-inu           not  = zero
                     go to prn-liv-det-120.
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale subordinato        *
      *                  *---------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           go to     prn-liv-det-200.
       prn-liv-det-120.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-200.
      *              *-------------------------------------------------*
      *              * Stampa elementi comuni                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice alfanumerico materia prima           *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      rf-dpm-alf-map       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Descrizione materia prima                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      017                  to   p-pos                  .
           move      rf-dpm-des-map       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-300.
      *              *-------------------------------------------------*
      *              * Selezione su codici dipendenza richiesti        *
      *              *-------------------------------------------------*
           if        rr-dpz-inu           not  = zero
                     go to prn-liv-det-600.
      *                  *---------------------------------------------*
      *                  * Test su segnale di almeno una dipendenza    *
      *                  * con saldo diverso da zero                   *
      *                  *---------------------------------------------*
           if        w-sdp-flg-zer        not  = spaces
                     go to prn-liv-det-400.
      *                      *-----------------------------------------*
      *                      * Unita' di misura                        *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      058                  to   p-pos                  .
           move      rf-dpm-umi-prd       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Giacenza a zero                         *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      rf-dpm-dec-qta       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      063                  to   p-pos                  .
           move      zero                 to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-400.
      *                  *---------------------------------------------*
      *                  * Stampa castelletto dipendenze con saldo     *
      *                  * diverso da zero                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione totale per dipendenze   *
      *                      *-----------------------------------------*
           move      zero                 to   w-sdp-tot-dpz          .
      *                      *-----------------------------------------*
      *                      * Normalizzazione contatore dipendenze    *
      *                      * stampate                                *
      *                      *-----------------------------------------*
           move      zero                 to   w-sdp-dpz-stp          .
      *                      *-----------------------------------------*
      *                      * Inizio ciclo di stampa                  *
      *                      *-----------------------------------------*
           move      zero                 to   w-sdp-ctr-001          .
       prn-liv-det-420.
           add       1                    to   w-sdp-ctr-001          .
           if        w-sdp-ctr-001        >    99
                     go to prn-liv-det-500.
           if        w-sdp-ctr-001        >    rr-dpz-ctr-sel
                     go to prn-liv-det-500.
      *                      *-----------------------------------------*
      *                      * Test se stampa da eseguire per la di-   *
      *                      * pendenza in corso di trattamento        *
      *                      *-----------------------------------------*
           if        w-sdp-flg-ele
                    (w-sdp-ctr-001)       =    spaces
                     go to prn-liv-det-420.
      *                      *-----------------------------------------*
      *                      * Test se righe residue sufficienti       *
      *                      *-----------------------------------------*
           if        p-res                >    1
                     go to prn-liv-det-460.
      *                      *-----------------------------------------*
      *                      * Intestazione pagina                     *
      *                      *-----------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Test se interruzione forzata        *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
      *                      *-----------------------------------------*
      *                      * Fincatura per dettaglio                 *
      *                      *-----------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       prn-liv-det-460.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Codice dipendenza                       *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      032                  to   p-pos                  .
           move      rr-dpz-ele-cod
                    (w-sdp-ctr-001)       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Denominazione dipendenza                *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      036                  to   p-pos                  .
           move      rr-dpz-ele-den
                    (w-sdp-ctr-001)       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Unita' di misura per la dipendenza      *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      058                  to   p-pos                  .
           move      w-sdp-umi-dpz
                    (w-sdp-ctr-001)       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Giacenza per la dipendenza              *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           if        w-sdp-sld-mag
                    (w-sdp-ctr-001)       >    999999  or
                     w-sdp-sld-mag
                    (w-sdp-ctr-001)       <    -999999
                     move  08             to   p-car
                     move  "B"            to   p-edm
                     move  062            to   p-pos
           else      move  06             to   p-car
                     move  "G"            to   p-edm
                     move  063            to   p-pos                  .
           move      rf-dpm-dec-qta       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-sdp-sld-mag
                    (w-sdp-ctr-001)       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Aggiornamento totale dipendenze         *
      *                      *-----------------------------------------*
           add       w-sdp-sld-mag
                    (w-sdp-ctr-001)       to   w-sdp-tot-dpz          .
      *                      *-----------------------------------------*
      *                      * Riciclo a dipendenza successiva         *
      *                      *-----------------------------------------*
           go to     prn-liv-det-420.
       prn-liv-det-500.
      *                  *---------------------------------------------*
      *                  * Stampa eventuale totale generale dipendenze *
      *                  *---------------------------------------------*
           if        w-sdp-dpz-stp        not  > 1
                     go to prn-liv-det-590.
      *                      *-----------------------------------------*
      *                      * Test se righe residue sufficienti       *
      *                      *-----------------------------------------*
           if        p-res                >    2
                     go to prn-liv-det-520.
      *                      *-----------------------------------------*
      *                      * Intestazione pagina                     *
      *                      *-----------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Test se interruzione forzata        *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
      *                      *-----------------------------------------*
      *                      * Fincatura per dettaglio                 *
      *                      *-----------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       prn-liv-det-520.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * 1. linea per totale dipendenze          *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      43                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      032                  to   p-pos                  .
           move      "-------------------------------------------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * 2. linea per totale dipendenze          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      24                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      032                  to   p-pos                  .
           move      "Giacenza totale        :"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Unita' di misura                    *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      058                  to   p-pos                  .
           move      rf-dpm-umi-prd       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Giacenza totale dipendenze              *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           if        w-sdp-tot-dpz        >    999999  or
                     w-sdp-tot-dpz        <    -999999
                     move  08             to   p-car
                     move  "B"            to   p-edm
                     move  062            to   p-pos
           else      move  06             to   p-car
                     move  "G"            to   p-edm
                     move  063            to   p-pos                  .
           move      rf-dpm-dec-qta       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-sdp-tot-dpz        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-590.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-600.
      *              *-------------------------------------------------*
      *              * Se richiesta solamente una dipendenza           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Unita' di misura                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      058                  to   p-pos                  .
           move      rf-dpm-umi-prd       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Giacenza per singola dipendenza             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           if        d-sld-mag-sld-mag    >    999999  or
                     d-sld-mag-sld-mag    <    -999999
                     move  08             to   p-car
                     move  "B"            to   p-edm
                     move  062            to   p-pos
           else      move  06             to   p-car
                     move  "G"            to   p-edm
                     move  063            to   p-pos                  .
           move      rf-dpm-dec-qta       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      d-sld-mag-sld-mag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri intestazione standard    *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      rr-dat-sit           to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      spaces               to   w-cnt-tit-des-tit      .
           string    "GIACENZA MATERIE PRIME AL "
                                delimited by   size
                     p-edt      delimited by   spaces
                                          into w-cnt-tit-des-tit      .
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-cnt-tit-dat-stp      .
           move      p-pag                to   w-cnt-tit-num-pag      .
           add       1                    to   w-cnt-tit-num-pag      .
      *              *-------------------------------------------------*
      *              * Intestazione standard                           *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                  *---------------------------------------------*
      *                  * Se interruzione forzata : uscita            *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to int-pag-sta-999.
       int-pag-sta-100.
      *              *-------------------------------------------------*
      *              * Eventuale intestazione dipendenza               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su contatore globale dipendenze        *
      *                  *---------------------------------------------*
           if        rr-dpz-ctr-dpz       not  > 1
                     go to int-pag-sta-999.
      *                  *---------------------------------------------*
      *                  * Test se dipendenza selezionata a zero       *
      *                  *---------------------------------------------*
           if        rr-dpz-inu           =    zero
                     go to int-pag-sta-999.
      *                  *---------------------------------------------*
      *                  * Test se pagina 1                            *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    not  = 1
                     go to int-pag-sta-999.
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale subordinato        *
      *                  *---------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal 'Dipendenza'                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Dipendenza"         to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Codice dipendenza                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      012                  to   p-pos                  .
           move      rr-dpz-inu           to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal ':'                                 *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      015                  to   p-pos                  .
           move      ":"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Denominazione dipendenza                    *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      017                  to   p-pos                  .
           move      rr-dpz-inu-den       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Fincatura dettaglio                                       *
      *    *-----------------------------------------------------------*
       int-fin-det-000.
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura generica                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "    Codice                    Descrizione         
      -              "       Udm    Giacenza        "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura generica               *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "--------------  ----------------------------------
      -              "------ ---  ------------      "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-fin-det-999.
           exit.

      *    *===========================================================*
      *    * Stampa intestazione classe                                *
      *    *-----------------------------------------------------------*
       sta-int-cla-000.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      8                    to   w-cgs-wrk-nln          .
           add       w-cgs-det-idf        to   w-cgs-wrk-nln          .
           if        p-res                >    w-cgs-wrk-nln
                     go to sta-int-cla-200.
       sta-int-cla-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Test se interruzione forzata                    *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-int-cla-999.
       sta-int-cla-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la fincatura       *
      *              *-------------------------------------------------*
           subtract  40                   from p-sel-als-sel
                                        giving w-cgs-wrk-pfn          .
           divide    2                    into w-cgs-wrk-pfn          .
           add       1                    to   w-cgs-wrk-pfn          .
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini superiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "="              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione classe                 *
      *              *-------------------------------------------------*
           move      w-cgs-cla-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione classe     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la classe          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione classe                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini inferiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       sta-int-cla-999.
           exit.

      *    *===========================================================*
      *    * Stampa intestazione classe e gruppo                       *
      *    *-----------------------------------------------------------*
       sta-int-gru-000.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      9                    to   w-cgs-wrk-nln          .
           add       w-cgs-det-idf        to   w-cgs-wrk-nln          .
           if        p-res                >    w-cgs-wrk-nln
                     go to sta-int-gru-200.
       sta-int-gru-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Test se interruzione forzata                    *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-int-gru-999.
       sta-int-gru-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la fincatura       *
      *              *-------------------------------------------------*
           subtract  40                   from p-sel-als-sel
                                        giving w-cgs-wrk-pfn          .
           divide    2                    into w-cgs-wrk-pfn          .
           add       1                    to   w-cgs-wrk-pfn          .
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini superiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "="              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione classe                 *
      *              *-------------------------------------------------*
           move      w-cgs-cla-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione classe     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la classe          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione classe                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione gruppo                 *
      *              *-------------------------------------------------*
           move      w-cgs-gru-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione gruppo     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per il gruppo          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione gruppo                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini inferiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       sta-int-gru-999.
           exit.

      *    *===========================================================*
      *    * Stampa intestazione classe, gruppo, sottogruppo           *
      *    *-----------------------------------------------------------*
       sta-int-sgr-000.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      10                   to   w-cgs-wrk-nln          .
           add       w-cgs-det-idf        to   w-cgs-wrk-nln          .
           if        p-res                >    w-cgs-wrk-nln
                     go to sta-int-sgr-200.
       sta-int-sgr-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Test se interruzione forzata                    *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-int-sgr-999.
       sta-int-sgr-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la fincatura       *
      *              *-------------------------------------------------*
           subtract  40                   from p-sel-als-sel
                                        giving w-cgs-wrk-pfn          .
           divide    2                    into w-cgs-wrk-pfn          .
           add       1                    to   w-cgs-wrk-pfn          .
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini superiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "="              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione classe                 *
      *              *-------------------------------------------------*
           move      w-cgs-cla-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione classe     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la classe          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione classe                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione gruppo                 *
      *              *-------------------------------------------------*
           move      w-cgs-gru-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione gruppo     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per il gruppo          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione gruppo                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione sottogruppo            *
      *              *-------------------------------------------------*
           move      w-cgs-sgr-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione sottogrup- *
      *              * po                                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per il sottogruppo     *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione sottogruppo                         *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini inferiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       sta-int-sgr-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali generali                               *
      *    *-----------------------------------------------------------*
       azz-tot-gen-000.
       azz-tot-gen-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali per classe                             *
      *    *-----------------------------------------------------------*
       azz-tot-cla-000.
       azz-tot-cla-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali per gruppo                             *
      *    *-----------------------------------------------------------*
       azz-tot-gru-000.
       azz-tot-gru-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali per sottogruppo                        *
      *    *-----------------------------------------------------------*
       azz-tot-sgr-000.
       azz-tot-sgr-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zm1]                             *
      *    *-----------------------------------------------------------*
       let-arc-zm1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zm1-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice classe a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-zm1-cla    =    zero
                     go to let-arc-zm1-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLA    "         to   f-key                  .
           move      w-let-arc-zm1-cla    to   rf-zm1-cod-cla         .
           move      "pgm/dpm/fls/ioc/obj/iofzm1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zm1                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zm1-400.
       let-arc-zm1-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zm1-des-cla       to   w-let-arc-zm1-des      .
           move      rf-zm1-mne-cla       to   w-let-arc-zm1-mne      .
           move      rf-zm1-ult-sud       to   w-let-arc-zm1-sud      .
           move      rf-zm1-sqz-num       to   w-let-arc-zm1-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zm1-999.
       let-arc-zm1-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zm1-flg      .
           move      all   "."            to   w-let-arc-zm1-des      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-zm1-cla    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-let-arc-zm1-mne      .
           go to     let-arc-zm1-600.
       let-arc-zm1-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zm1-des      .
           move      spaces               to   w-let-arc-zm1-mne      .
       let-arc-zm1-600.
           move      zero                 to   w-let-arc-zm1-sud      .
           move      zero                 to   w-let-arc-zm1-sqz      .
       let-arc-zm1-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zm2]                             *
      *    *-----------------------------------------------------------*
       let-arc-zm2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zm2-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice gruppo a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-zm2-gru    =    zero
                     go to let-arc-zm2-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODGRU    "         to   f-key                  .
           move      w-let-arc-zm2-cla    to   rf-zm2-cod-cla         .
           move      w-let-arc-zm2-gru    to   rf-zm2-cod-gru         .
           move      "pgm/dpm/fls/ioc/obj/iofzm2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zm2                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zm2-400.
       let-arc-zm2-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zm2-des-gru       to   w-let-arc-zm2-des      .
           move      rf-zm2-mne-gru       to   w-let-arc-zm2-mne      .
           move      rf-zm2-ult-sud       to   w-let-arc-zm2-sud      .
           move      rf-zm2-sqz-num       to   w-let-arc-zm2-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zm2-999.
       let-arc-zm2-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zm2-flg      .
           move      all   "."            to   w-let-arc-zm2-des      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-zm2-gru    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-let-arc-zm2-mne      .
           go to     let-arc-zm2-600.
       let-arc-zm2-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zm2-des      .
           move      spaces               to   w-let-arc-zm2-mne      .
       let-arc-zm2-600.
           move      zero                 to   w-let-arc-zm2-sud      .
           move      zero                 to   w-let-arc-zm2-sqz      .
       let-arc-zm2-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zm3]                             *
      *    *-----------------------------------------------------------*
       let-arc-zm3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zm3-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice sottogruppo a zero               *
      *              *-------------------------------------------------*
           if        w-let-arc-zm3-sgr    =    zero
                     go to let-arc-zm3-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODSGR    "         to   f-key                  .
           move      w-let-arc-zm3-cla    to   rf-zm3-cod-cla         .
           move      w-let-arc-zm3-gru    to   rf-zm3-cod-gru         .
           move      w-let-arc-zm3-sgr    to   rf-zm3-cod-sgr         .
           move      "pgm/dpm/fls/ioc/obj/iofzm3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zm3                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zm3-400.
       let-arc-zm3-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zm3-des-sgr       to   w-let-arc-zm3-des      .
           move      rf-zm3-mne-sgr       to   w-let-arc-zm3-mne      .
           move      rf-zm3-ult-sud       to   w-let-arc-zm3-sud      .
           move      rf-zm3-sqz-num       to   w-let-arc-zm3-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zm3-999.
       let-arc-zm3-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zm3-flg      .
           move      all   "."            to   w-let-arc-zm3-des      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-zm3-sgr    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-let-arc-zm3-mne      .
           go to     let-arc-zm3-600.
       let-arc-zm3-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zm3-des      .
           move      spaces               to   w-let-arc-zm3-mne      .
       let-arc-zm3-600.
           move      zero                 to   w-let-arc-zm3-sud      .
           move      zero                 to   w-let-arc-zm3-sqz      .
       let-arc-zm3-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per determinazione saldo di magazzino         *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldmag0.dts"                   .

