       Identification Division.
       Program-Id.                                 pmag6000           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    mag                 *
      *                                Settore:    inv                 *
      *                                   Fase:    mag600              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 11/11/92    *
      *                       Ultima revisione:    NdK del 14/11/24    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Dichiarazione di inizio fase di inventario  *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "mag"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "inv"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "mag600"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pmag6000"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "   DICHIARAZIONE DI INIZIO INVENTARIO   "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "msegrt" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine qry-rou-pri-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-qry-rou-pri      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su modalita' di funzionamento      *
      *        *-------------------------------------------------------*
           05  w-cnt-mfu.
      *            *---------------------------------------------------*
      *            * Visualizzazione forzata da segreteria             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-vis-sgr      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste pre esecuzione interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico interrogazione        *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento automatico interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-aut      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di Si/No primo giro di esecuzione            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-prm-gir      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento qry-routine       *
      *        *-------------------------------------------------------*
           05  w-cnt-qry.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-qry-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-liv.
                   15  w-cnt-qry-sav-l05  pic  x(64)                  .
                   15  w-cnt-qry-sav-l04  pic  x(64)                  .
                   15  w-cnt-qry-sav-l03  pic  x(64)                  .
                   15  w-cnt-qry-sav-l02  pic  x(64)                  .
                   15  w-cnt-qry-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Literals                                              *
      *        *-------------------------------------------------------*
           05  w-cnt-lit.
               10  w-cnt-lit-t80          pic  x(80) value all "="    .

      *    *===========================================================*
      *    * Record file                                               *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [mmt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmmt"                          .
      *        *-------------------------------------------------------*
      *        * [mmz]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmmz"                          .
      *        *-------------------------------------------------------*
      *        * [mmv]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmmv"                          .
      *        *-------------------------------------------------------*
      *        * [mau]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmau"                          .
      *        *-------------------------------------------------------*
      *        * [mim]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmim"                          .
      *        *-------------------------------------------------------*
      *        * [miu]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmiu"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [dps]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dps/fls/rec/rfdps"                          .
      *        *-------------------------------------------------------*
      *        * [dpm]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dpm/fls/rec/rfdpm"                          .
      *        *-------------------------------------------------------*
      *        * [mtv]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mtv/fls/rec/rfmtv"                          .
      *        *-------------------------------------------------------*
      *        * [datife]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/num/rec/rndatife"                       .
      *        *-------------------------------------------------------*
      *        * [datinv]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/num/rec/rndatinv"                       .

      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Mese di chiusura anno di esercizio                    *
      *        *-------------------------------------------------------*
           05  w-prs-mes-chi              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Si/No gestione semilavorati attiva                    *
      *        *-------------------------------------------------------*
           05  w-prs-dps-snx              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Si/No gestione materie prime attiva                   *
      *        *-------------------------------------------------------*
           05  w-prs-dpm-snx              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Si/No gestione materiali vari attiva                  *
      *        *-------------------------------------------------------*
           05  w-prs-mtv-snx              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Si/No controllo preliminare carichi valorizzati       *
      *        *-------------------------------------------------------*
           05  w-prs-snx-ccv              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Si/No gestione delle ubicazioni come dislocazioni     *
      *        *-------------------------------------------------------*
           05  w-prs-ucd-snx              pic  x(01)                  .

      *    *===========================================================*
      *    * Area di interfaccia per sottoprogramma         "pazi000d" *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/pazi000d.pgl"                   .

      *    *===========================================================*
      *    * Work-area richieste per programma                         *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Tipo inventario                                       *
      *        *  - F : Inventario di fine esercizio                   *
      *        *  - I : Inventario infraannuale                        *
      *        *-------------------------------------------------------*
           05  rr-tip-inv                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Data inventario                                       *
      *        *-------------------------------------------------------*
           05  rr-dat-inv                 pic  9(07)                  .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione saldi magazzino  *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldmag0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione saldi magazzino  *
      *    * per ubicazione                                            *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldubi0.dtl"                   .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det data per inventario di fine esercizio    *
      *        *-------------------------------------------------------*
           05  w-det-dat-ife.
      *            *---------------------------------------------------*
      *            * Flag di uscita                                    *
      *            * - Spaces : tutto Ok                               *
      *            * - #      : errore                                 *
      *            * - F      : tutto Ok ma con scelta obbligata per   *
      *            *            inventario di fine esercizio           *
      *            *---------------------------------------------------*
               10  w-det-dat-ife-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di record [datife] esistente                 *
      *            *---------------------------------------------------*
               10  w-det-dat-ife-fre      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Data attuale                                      *
      *            *---------------------------------------------------*
               10  w-det-dat-ife-att      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Anno di esercizio contabile relativo alla data    *
      *            * attuale                                           *
      *            *---------------------------------------------------*
               10  w-det-dat-ife-eda      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Anno di esercizio contabile relativo alla data    *
      *            * primo movimento di magazzino                      *
      *            *---------------------------------------------------*
               10  w-det-dat-ife-epm      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Data di fine esercizio                            *
      *            *---------------------------------------------------*
               10  w-det-dat-ife-dfe      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det saldo giacenza fisica                    *
      *        *-------------------------------------------------------*
           05  w-det-sld-gcf.
      *            *---------------------------------------------------*
      *            * Codice dipendenza                                 *
      *            *---------------------------------------------------*
               10  w-det-sld-gcf-dpz      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo codice di magazzino                          *
      *            *---------------------------------------------------*
               10  w-det-sld-gcf-tpm      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice numerico di magazzino                      *
      *            *---------------------------------------------------*
               10  w-det-sld-gcf-nrm      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data attuale                                      *
      *            *---------------------------------------------------*
               10  w-det-sld-gcf-dta      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data di riferimento                               *
      *            *---------------------------------------------------*
               10  w-det-sld-gcf-ddr      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Anno di esercizio contabile data di riferimento   *
      *            *---------------------------------------------------*
               10  w-det-sld-gcf-esa      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Mese di esercizio contabile data di riferimento   *
      *            *---------------------------------------------------*
               10  w-det-sld-gcf-esm      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Saldo magazzino in uscita                         *
      *            *---------------------------------------------------*
               10  w-det-sld-gcf-sld      pic s9(08)v9(03)            .
      *            *---------------------------------------------------*
      *            * Contatore di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-sld-gcf-ctr      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det saldo giacenza merce di terzi            *
      *        *-------------------------------------------------------*
           05  w-det-sld-mdt.
      *            *---------------------------------------------------*
      *            * Data di riferimento                               *
      *            *---------------------------------------------------*
               10  w-det-sld-mdt-ddr      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Anno di esercizio contabile data di riferimento   *
      *            *---------------------------------------------------*
               10  w-det-sld-mdt-esa      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza                                 *
      *            *---------------------------------------------------*
               10  w-det-sld-mdt-dpz      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo codice di magazzino                          *
      *            *---------------------------------------------------*
               10  w-det-sld-mdt-tpm      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice numerico di magazzino                      *
      *            *---------------------------------------------------*
               10  w-det-sld-mdt-nrm      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice alfanumerico di magazzino                  *
      *            *---------------------------------------------------*
               10  w-det-sld-mdt-afm      pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Descrizione di magazzino                          *
      *            *---------------------------------------------------*
               10  w-det-sld-mdt-des      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Unita' di misura                                  *
      *            *---------------------------------------------------*
               10  w-det-sld-mdt-umi      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Numero decimali quantita'                         *
      *            *---------------------------------------------------*
               10  w-det-sld-mdt-deq      pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Saldo magazzino in uscita                         *
      *            *---------------------------------------------------*
               10  w-det-sld-mdt-sld      pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Work per Det saldo giacenza merce presso terzi        *
      *        *-------------------------------------------------------*
           05  w-det-sld-mpt.
      *            *---------------------------------------------------*
      *            * Data di riferimento                               *
      *            *---------------------------------------------------*
               10  w-det-sld-mpt-ddr      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Anno di esercizio contabile data di riferimento   *
      *            *---------------------------------------------------*
               10  w-det-sld-mpt-esa      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza                                 *
      *            *---------------------------------------------------*
               10  w-det-sld-mpt-dpz      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo codice di magazzino                          *
      *            *---------------------------------------------------*
               10  w-det-sld-mpt-tpm      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice numerico di magazzino                      *
      *            *---------------------------------------------------*
               10  w-det-sld-mpt-nrm      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice alfanumerico di magazzino                  *
      *            *---------------------------------------------------*
               10  w-det-sld-mpt-afm      pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Descrizione di magazzino                          *
      *            *---------------------------------------------------*
               10  w-det-sld-mpt-des      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Unita' di misura                                  *
      *            *---------------------------------------------------*
               10  w-det-sld-mpt-umi      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Numero decimali quantita'                         *
      *            *---------------------------------------------------*
               10  w-det-sld-mpt-deq      pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Saldo magazzino in uscita                         *
      *            *---------------------------------------------------*
               10  w-det-sld-mpt-sld      pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Work per Det su giacenze per ubicazione               *
      *        *-------------------------------------------------------*
           05  w-det-gia-ubi.
      *            *---------------------------------------------------*
      *            * Contatori di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-gia-ubi-ctr      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Quantita' di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-gia-ubi-qta      pic s9(10)v9(03)            .

      *    *===========================================================*
      *    * Work per routine cnt-pre-mmv-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-cnt-pre-mmv.
           05  w-cnt-pre-mmv-flg          pic  x(01)                  .
           05  w-cnt-pre-mmv-ese          pic  9(03)                  .
           05  w-cnt-pre-mmv-ctr          pic  9(05)                  .
           05  w-cnt-pre-mmv-cte          pic  9(09)                  .

      *    *===========================================================*
      *    * Work per routine car-dti-dcp-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-car-dti-dcp.
      *        *-------------------------------------------------------*
      *        * Contatore su tabella dipendenze                       *
      *        *-------------------------------------------------------*
           05  w-car-dti-dcp-dpz          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Giacenza fisica                                       *
      *        *-------------------------------------------------------*
           05  w-car-dti-dcp-gcf          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Saldo merci di terzi                                  *
      *        *-------------------------------------------------------*
           05  w-car-dti-dcp-mdt          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Saldo merci presso terzi                              *
      *        *-------------------------------------------------------*
           05  w-car-dti-dcp-mpt          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Contatore di monitoraggio                             *
      *        *-------------------------------------------------------*
           05  w-car-dti-dcp-c01          pic  9(09)                  .
      *        *-------------------------------------------------------*
      *        * Contatori di monitoraggio ubicazioni                  *
      *        *-------------------------------------------------------*
           05  w-car-dti-dcp-cu1          pic  9(09)                  .
           05  w-car-dti-dcp-cu2          pic  9(01)                  .

      *    *===========================================================*
      *    * Work per routine car-dti-dps-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-car-dti-dps.
      *        *-------------------------------------------------------*
      *        * Contatore su tabella dipendenze                       *
      *        *-------------------------------------------------------*
           05  w-car-dti-dps-dpz          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Giacenza fisica                                       *
      *        *-------------------------------------------------------*
           05  w-car-dti-dps-gcf          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Saldo merci di terzi                                  *
      *        *-------------------------------------------------------*
           05  w-car-dti-dps-mdt          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Saldo merci presso terzi                              *
      *        *-------------------------------------------------------*
           05  w-car-dti-dps-mpt          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Contatore di monitoraggio                             *
      *        *-------------------------------------------------------*
           05  w-car-dti-dps-c01          pic  9(09)                  .

      *    *===========================================================*
      *    * Work per routine car-dti-dpm-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-car-dti-dpm.
      *        *-------------------------------------------------------*
      *        * Contatore su tabella dipendenze                       *
      *        *-------------------------------------------------------*
           05  w-car-dti-dpm-dpz          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Giacenza fisica                                       *
      *        *-------------------------------------------------------*
           05  w-car-dti-dpm-gcf          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Saldo merci di terzi                                  *
      *        *-------------------------------------------------------*
           05  w-car-dti-dpm-mdt          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Saldo merci presso terzi                              *
      *        *-------------------------------------------------------*
           05  w-car-dti-dpm-mpt          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Contatore di monitoraggio                             *
      *        *-------------------------------------------------------*
           05  w-car-dti-dpm-c01          pic  9(09)                  .

      *    *===========================================================*
      *    * Work per routine car-dti-mtv-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-car-dti-mtv.
      *        *-------------------------------------------------------*
      *        * Contatore su tabella dipendenze                       *
      *        *-------------------------------------------------------*
           05  w-car-dti-mtv-dpz          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Giacenza fisica                                       *
      *        *-------------------------------------------------------*
           05  w-car-dti-mtv-gcf          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Saldo merci di terzi                                  *
      *        *-------------------------------------------------------*
           05  w-car-dti-mtv-mdt          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Saldo merci presso terzi                              *
      *        *-------------------------------------------------------*
           05  w-car-dti-mtv-mpt          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Contatore di monitoraggio                             *
      *        *-------------------------------------------------------*
           05  w-car-dti-mtv-c01          pic  9(09)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo di inventario                         *
      *        *-------------------------------------------------------*
           05  w-exp-tip-inv.
               10  w-exp-tip-inv-num      pic  9(02)       value 2    .
               10  w-exp-tip-inv-lun      pic  9(02)       value 30   .
               10  w-exp-tip-inv-tbl.
                   15  filler             pic  x(30) value
                            "Inventario infra-annuale      "          .
                   15  filler             pic  x(30) value
                            "Inventario di fine esercizio  "          .

      *    *===========================================================*
      *    * Work per salvataggi                                       *
      *    *-----------------------------------------------------------*
       01  w-sav.
           05  w-sav-tip-inv              pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err su controllo tasto Do                    *
      *        *-------------------------------------------------------*
           05  w-box-msg-err.
               10  w-err-box-err-msg      pic  x(56)                  .

      *    *===========================================================*
      *    * Work-area per routine car-dti-inv-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-car-dti-inv.
           05  w-car-dti-inv-ctr          pic  9(05)                  .
           05  w-car-dti-inv-esa          pic  9(03)                  .
           05  w-car-dti-inv-esm          pic  9(02)                  .

      *    *===========================================================*
      *    * Work area per determinazione anno e mese di esercizio di  *
      *    * contabilita' generale                                     *
      *    *-----------------------------------------------------------*
       01  w-ese-cge.
      *        *-------------------------------------------------------*
      *        * Mese di chiusura anno di esercizio                    *
      *        *-------------------------------------------------------*
           05  w-ese-cge-mce              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Data registrazione movimento                          *
      *        *-------------------------------------------------------*
           05  w-ese-cge-dtr              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Anno di esercizio movimento                           *
      *        *-------------------------------------------------------*
           05  w-ese-cge-esa              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Mese di esercizio movimento                           *
      *        *-------------------------------------------------------*
           05  w-ese-cge-esm              pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Se no richieste : a esecuzione programma        *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-500.
       main-250.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-500.
      *              *-------------------------------------------------*
      *              * Esecuzione in foreground                        *
      *              *-------------------------------------------------*
           perform   exe-pgm-frg-000      thru exe-pgm-frg-999        .
       main-750.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Flag di eventuale visualizzazione forzata       *
      *              *-------------------------------------------------*
           move      s-sts                to   w-cnt-mfu-vis-sgr      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Programma di esecuzione in foreground                     *
      *    *-----------------------------------------------------------*
       exe-pgm-frg-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione rullino messaggi di foreground *
      *              *-------------------------------------------------*
           move      "OF"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Se errore : uscita                          *
      *                  *---------------------------------------------*
            if       m-rsc                not  = spaces
                     go to exe-pgm-frg-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Esecuzione del programma                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Esecuzione di inizio inventario             *
      *                  *---------------------------------------------*
           perform   exe-ini-inv-000      thru exe-ini-inv-999        .
      *              *-------------------------------------------------*
      *              * Messaggio di fine programma in esecuzione       *
      *              *-------------------------------------------------*
           move      "FE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visual. eventuali errori di esecuzione      *
      *                  *---------------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "F"                  to   b-tfe                  .
           move      i-ide-des            to   b-chr                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
           cancel    "swd/mod/prg/obj/mbckgv"                         .
       exe-pgm-frg-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
       pre-exe-pgm-010.
      *              *-------------------------------------------------*
      *              * Test se programma eseguibile                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su flag di eventuale visualizzazione   *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-vis-sgr    not  = "V"
                     go to pre-exe-pgm-015.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Programma non eseguibile dall'utente !            
      -              "               "    to   w-err-box-err-msg      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione messaggio di errore         *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-exe-pgm      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-exe-pgm-999.
       pre-exe-pgm-015.
      *              *-------------------------------------------------*
      *              * Visualizzazione titolo programma                *
      *              *-------------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Mese di chiusura esercizio                  *
      *                  *---------------------------------------------*
           perform   prs-mes-chi-000      thru prs-mes-chi-999        .
      *                  *---------------------------------------------*
      *                  * Si/No gestione semilavorati attiva          *
      *                  *---------------------------------------------*
           perform   prs-dps-snx-000      thru prs-dps-snx-999        .
      *                  *---------------------------------------------*
      *                  * Si/No gestione materie prime attiva         *
      *                  *---------------------------------------------*
           perform   prs-dpm-snx-000      thru prs-dpm-snx-999        .
      *                  *---------------------------------------------*
      *                  * Si/No gestione materiali vari attiva        *
      *                  *---------------------------------------------*
           perform   prs-mtv-snx-000      thru prs-mtv-snx-999        .
      *                  *---------------------------------------------*
      *                  * Si/No controllo carichi valorizzati         *
      *                  *---------------------------------------------*
           perform   prs-snx-ccv-000      thru prs-snx-ccv-999        .
      *                  *---------------------------------------------*
      *                  * Si/No gestione delle ubicazioni come        *
      *                  * dislocazioni                                *
      *                  *---------------------------------------------*
           perform   prs-ucd-snx-000      thru prs-ucd-snx-999        .
       pre-exe-pgm-018.
      *              *-------------------------------------------------*
      *              * Determinazione codici dipendenze per l'azienda  *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      "DA"                 to   w-dpz-tip-ope          .
           move      s-ter                to   w-dpz-ide-ter          .
           move      s-ute                to   w-dpz-ide-ute          .
           move      s-azi                to   w-dpz-ide-azi          .
           move      s-sap                to   w-dpz-ide-sap          .
           move      s-arg                to   w-dpz-ide-arg          .
           move      s-set                to   w-dpz-ide-set          .
           move      s-fas                to   w-dpz-ide-fas          .
           move      i-ide-des            to   w-dpz-ide-des          .
           move      s-pro                to   w-dpz-ide-pro          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
      *              *-------------------------------------------------*
      *              * Se zero dipendenze : errore ed uscita           *
      *              *-------------------------------------------------*
           if        w-dpz-ctr-dpz        >    zero
                     go to pre-exe-pgm-020.
           move      "EN"                 to   w-dpz-tip-ope          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
           move      "#"                  to   w-cnt-pre-exe-pgm      .
           go to     pre-exe-pgm-999.
       pre-exe-pgm-020.
      *              *-------------------------------------------------*
      *              * Lettura numerazione relativa agli inventari     *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
           move      "RD"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *              *-------------------------------------------------*
      *              * Se fase di inventario gia' in corso             *
      *              *-------------------------------------------------*
           if        rn-dat-inv-tip-iic   =    spaces
                     go to pre-exe-pgm-100.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Salvataggio immagine video              *
      *                      *-----------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Video in Off                            *
      *                      *-----------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Box                                     *
      *                      *-----------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      17                   to   v-lto                  .
           move      78                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Messaggi nel box                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Titolo                              *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "                           A T T E N Z I O N E    
      -              "                      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Prima riga                          *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "Programma non eseguibile !                        
      -              "                      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Seconda riga                        *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing data inizio inventario  *
      *                              *---------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      rn-dat-inv-dat-ini   to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Stampa                          *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "E' ancora in corso l'inventario del "
                                delimited by   size
                     v-edt
                                delimited by   spaces
                     "."
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Parentesi quadre di delimitazione       *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      74                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Video in On                             *
      *                      *-----------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Accettazione carattere di presa visione *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      75                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Ripristino immagine video               *
      *                      *-----------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita con errore                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-exe-pgm      .
           go to     pre-exe-pgm-999.
       pre-exe-pgm-100.
      *              *-------------------------------------------------*
      *              * Determinazione data fine esercizio              *
      *              *-------------------------------------------------*
           perform   det-dat-ife-000      thru det-dat-ife-999        .
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-det-dat-ife-dfe    not  = zero
                     go to pre-exe-pgm-200.
      *                  *---------------------------------------------*
      *                  * Determinazione data attuale                 *
      *                  *---------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-det-dat-ife-dfe      .
      *                  *---------------------------------------------*
      *                  * Se data no determinata : fine esercizio     *
      *                  * precedente                                  *
      *                  *---------------------------------------------*
           move      w-det-dat-ife-dfe    to   s-dat                  .
           subtract  1                    from s-saa                  .
           move      12                   to   s-mes                  .
           move      31                   to   s-gio                  .
           move      s-dat                to   w-det-dat-ife-dfe      .
       pre-exe-pgm-200.
      *                  *---------------------------------------------*
      *                  * Test su flag di uscita                      *
      *                  *---------------------------------------------*
           if        w-det-dat-ife-flg    =    spaces or
                     w-det-dat-ife-flg    =    "F"    or
                     w-det-dat-ife-flg    =    "I"
                     go to pre-exe-pgm-999.
           move      "#"                  to   w-cnt-pre-exe-pgm      .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Mese chiusura esercizio       *
      *    *-----------------------------------------------------------*
       prs-mes-chi-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/cge[mes-chi]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-num          to   w-prs-mes-chi
           else      move  12             to   w-prs-mes-chi          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-mes-chi        >    zero and
                     w-prs-mes-chi        not  > 12
                     go to prs-mes-chi-999.
           move      12                   to   w-prs-mes-chi          .
       prs-mes-chi-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Si/No gestione semilavorati   *
      *    *                             attiva                        *
      *    *-----------------------------------------------------------*
       prs-dps-snx-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/dps[snx]"       to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-dps-snx
           else      move  spaces         to   w-prs-dps-snx          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-dps-snx        =    "S" or
                     w-prs-dps-snx        =    "N"
                     go to prs-dps-snx-999.
           move      "N"                  to   w-prs-dps-snx          .
       prs-dps-snx-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Si/No gestione materie prime  *
      *    *                             attiva                        *
      *    *-----------------------------------------------------------*
       prs-dpm-snx-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/dpm[snx]"       to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-dpm-snx
           else      move  spaces         to   w-prs-dpm-snx          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-dpm-snx        =    "S" or
                     w-prs-dpm-snx        =    "N"
                     go to prs-dpm-snx-999.
           move      "N"                  to   w-prs-dpm-snx          .
       prs-dpm-snx-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Si/No gestione materiali vari *
      *    *                             attiva                        *
      *    *-----------------------------------------------------------*
       prs-mtv-snx-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/mtv[snx]"       to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-mtv-snx
           else      move  spaces         to   w-prs-mtv-snx          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-mtv-snx        =    "S" or
                     w-prs-mtv-snx        =    "N"
                     go to prs-mtv-snx-999.
           move      "N"                  to   w-prs-mtv-snx          .
       prs-mtv-snx-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Si/No controllo preliminare   *
      *    *                             carichi valorizzati           *
      *    *-----------------------------------------------------------*
       prs-snx-ccv-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/mag/inv/mag600[snx-ccv]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-snx-ccv
           else      move  spaces         to   w-prs-snx-ccv          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-snx-ccv        =    "S" or
                     w-prs-snx-ccv        =    "N"
                     go to prs-snx-ccv-999.
           move      "S"                  to   w-prs-snx-ccv          .
       prs-snx-ccv-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Si/No gestione ubicazioni     *
      *    *                             come dislocazioni             *
      *    *-----------------------------------------------------------*
       prs-ucd-snx-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/mag/dsl[snx-ubi]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-ucd-snx
           else      move  spaces         to   w-prs-ucd-snx          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-ucd-snx        not  = "S"
                     move  "N"            to   w-prs-ucd-snx          .
       prs-ucd-snx-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si richieste ad utente                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * No funzionamento ciclico                        *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-cic      .
      *              *-------------------------------------------------*
      *              * No funzionamento automatico                     *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-aut      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione saldo di magazz.  *
      *              *-------------------------------------------------*
           perform   det-sld-mag-opn-000  thru det-sld-mag-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione saldo di magaz-   *
      *              * zino per ubicazione                             *
      *              *-------------------------------------------------*
           perform   det-sld-ubi-opn-000  thru det-sld-ubi-opn-999    .
      *              *-------------------------------------------------*
      *              * [mmz]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
      *              *-------------------------------------------------*
      *              * [mmv]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmv                 .
      *              *-------------------------------------------------*
      *              * [mau]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
       rou-opn-fls-100.
      *              *-------------------------------------------------*
      *              * [dps]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione semilavorati attiva        *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        not  = "S"
                     go to rou-opn-fls-120.
      *                  *---------------------------------------------*
      *                  * Apertura file                               *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
       rou-opn-fls-120.
      *              *-------------------------------------------------*
      *              * [dpm]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione materie prime attiva       *
      *                  *---------------------------------------------*
           if        w-prs-dpm-snx        not  = "S"
                     go to rou-opn-fls-140.
      *                  *---------------------------------------------*
      *                  * Apertura file                               *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
       rou-opn-fls-140.
      *              *-------------------------------------------------*
      *              * [mtv]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione materiali vari attiva      *
      *                  *---------------------------------------------*
           if        w-prs-mtv-snx        not  = "S"
                     go to rou-opn-fls-200.
      *                  *---------------------------------------------*
      *                  * Apertura file                               *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mtv/fls/ioc/obj/iofmtv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mtv                 .
       rou-opn-fls-200.
      *              *-------------------------------------------------*
      *              * [datinv]                                        *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *              *-------------------------------------------------*
      *              * [datife]                                        *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione saldo di magazz. *
      *              *-------------------------------------------------*
           perform   det-sld-mag-cls-000  thru det-sld-mag-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione saldo di magaz-  *
      *              * zino per ubicazione                             *
      *              *-------------------------------------------------*
           perform   det-sld-ubi-cls-000  thru det-sld-ubi-cls-999    .
       rou-cls-fls-050.
      *              *-------------------------------------------------*
      *              * [mmz]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
      *              *-------------------------------------------------*
      *              * [mmv]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmv                 .
      *              *-------------------------------------------------*
      *              * [mau]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
       rou-cls-fls-100.
      *              *-------------------------------------------------*
      *              * [dps]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione semilavorati attiva        *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        not  = "S"
                     go to rou-cls-fls-120.
      *                  *---------------------------------------------*
      *                  * Chiusura file                               *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
       rou-cls-fls-120.
      *              *-------------------------------------------------*
      *              * [dpm]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione materie prime attiva       *
      *                  *---------------------------------------------*
           if        w-prs-dpm-snx        not  = "S"
                     go to rou-cls-fls-140.
      *                  *---------------------------------------------*
      *                  * Chiusura file                               *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
       rou-cls-fls-140.
      *              *-------------------------------------------------*
      *              * [mtv]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione materiali vari attiva      *
      *                  *---------------------------------------------*
           if        w-prs-mtv-snx        not  = "S"
                     go to rou-cls-fls-200.
      *                  *---------------------------------------------*
      *                  * Chiusura file                               *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mtv/fls/ioc/obj/iofmtv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mtv                 .
       rou-cls-fls-200.
      *              *-------------------------------------------------*
      *              * [datinv]                                        *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *              *-------------------------------------------------*
      *              * [datife]                                        *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Tipo inventario                             *
      *                  *---------------------------------------------*
           perform   acc-tip-inv-000      thru acc-tip-inv-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-200.
      *                  *---------------------------------------------*
      *                  * Data inventario                             *
      *                  *---------------------------------------------*
           perform   acc-dat-inv-000      thru acc-dat-inv-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-100.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#CNF"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
           move      spaces               to   rr-tip-inv             .
           move      zero                 to   rr-dat-inv             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Tipo di inventario                              *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo di inventario         :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Data inventario                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data inventario            :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Tipo di inventario         *
      *    *-----------------------------------------------------------*
       acc-tip-inv-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su flag di uscita da routine di    *
      *                      * determinazione data di fine esercizio   *
      *                      *-----------------------------------------*
           if        w-det-dat-ife-flg    not  = "F" and
                     w-det-dat-ife-flg    not  = "I"
                     go to acc-tip-inv-050.
      *                      *-----------------------------------------*
      *                      * Forzatura tipo inventario               *
      *                      *-----------------------------------------*
           move      w-det-dat-ife-flg    to   rr-tip-inv             .
           perform   vis-tip-inv-000      thru vis-tip-inv-999        .
      *                      *-----------------------------------------*
      *                      * Eventuale forzatura data inventario     *
      *                      *-----------------------------------------*
           if        w-det-dat-ife-flg    =    "F"
                     move  w-det-dat-ife-dfe
                                          to   rr-dat-inv
                     perform vis-dat-inv-000
                                          thru vis-dat-inv-999        .
      *                      *-----------------------------------------*
      *                      * Box di avviso                           *
      *                      *-----------------------------------------*
           if        w-det-dat-ife-flg    =    "F"
                     perform   acc-tip-inv-avv-000
                                          thru acc-tip-inv-avv-999    .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     acc-tip-inv-999.
       acc-tip-inv-050.
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      rr-tip-inv           to   w-sav-tip-inv          .
       acc-tip-inv-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-inv-lun    to   v-car                  .
           move      w-exp-tip-inv-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      05                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-tip-inv-tbl    to   v-txt                  .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           if        rr-tip-inv           =    "I"
                     move  01             to   v-num
           else if   rr-tip-inv           =    "F"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-tip-inv-999.
       acc-tip-inv-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  "I"            to   rr-tip-inv
           else if   v-num                =    02
                     move  "F"            to   rr-tip-inv
           else      move  spaces         to   rr-tip-inv             .
       acc-tip-inv-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        rr-tip-inv           =    spaces
                     go to acc-tip-inv-100.
       acc-tip-inv-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore attuale come precedente : oltre   *
      *                  *---------------------------------------------*
           if        rr-tip-inv           =    w-sav-tip-inv
                     go to acc-tip-inv-800.
      *                  *---------------------------------------------*
      *                  * Se inventario infra-annuale                 *
      *                  *---------------------------------------------*
           if        rr-tip-inv           not  = "I"
                     go to acc-tip-inv-700.
      *                      *-----------------------------------------*
      *                      * Trattamento data inventario             *
      *                      *-----------------------------------------*
           if        rr-dat-inv           not  = zero
                     move  zero           to   rr-dat-inv
                     perform vis-dat-inv-000
                                          thru vis-dat-inv-999        .
           go to     acc-tip-inv-800.
       acc-tip-inv-700.
      *                  *---------------------------------------------*
      *                  * Se inventario di fine esercizio             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        rr-tip-inv           not  = "F"
                     go to acc-tip-inv-800.
      *                      *-----------------------------------------*
      *                      * Trattamento data inventario             *
      *                      *-----------------------------------------*
           if        rr-dat-inv           not  = w-det-dat-ife-dfe
                     move  w-det-dat-ife-dfe
                                          to   rr-dat-inv
                     perform vis-dat-inv-000
                                          thru vis-dat-inv-999        .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     acc-tip-inv-800.
       acc-tip-inv-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-tip-inv-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-tip-inv-100.
       acc-tip-inv-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo selezione : Tipo di inventario      *
      *    *-----------------------------------------------------------*
       vis-tip-inv-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-inv-lun    to   v-car                  .
           move      w-exp-tip-inv-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      05                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-tip-inv-tbl    to   v-txt                  .
           if        rr-tip-inv           =    "I"
                     move  01             to   v-num
           else if   rr-tip-inv           =    "F"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-inv-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Tipo di inventario                   *
      *    *                                                           *
      *    * Subroutine di avvertimento                                *
      *    *-----------------------------------------------------------*
       acc-tip-inv-avv-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      07                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      18                   to   v-lto                  .
           move      78                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggi nel box                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "                           A T T E N Z I O N E    
      -              "                      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Prima riga                                  *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "L'inventario di fine esercizio, una volta chiuso, 
      -              "non consente modifiche"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Seconda riga                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing esercizio                       *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      "B"                  to   v-edm                  .
           move      rr-dat-inv           to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "ai movimenti di magazzino fino al "
                                delimited by   size
                     v-edt
                                delimited by   spaces
                     ", in quanto vengono generati i"
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Terza riga                                  *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "saldi per l'esercizio successivo. La chiusura e' p
      -              "ertanto irreversibile."
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Parentesi quadre di delimitazione           *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      74                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere                          *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      17                   to   v-lin                  .
           move      75                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-tip-inv-avv-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Data inventario            *
      *    *-----------------------------------------------------------*
       acc-dat-inv-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        rr-tip-inv           =    "F"
                     go to acc-dat-inv-999.
       acc-dat-inv-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      spaces               to   v-edm                  .
           move      08                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      rr-dat-inv           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dat-inv-999.
       acc-dat-inv-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dat-inv             .
       acc-dat-inv-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Controllo che non sia superiore alla data   *
      *                  * di fine esercizio                           *
      *                  *---------------------------------------------*
           if        w-det-dat-ife-dfe    =    zero
                     go to acc-dat-inv-500.
           if        rr-dat-inv           not  > w-det-dat-ife-dfe
                     go to acc-dat-inv-500.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Editing data di fine esercizio      *
      *                          *-------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      w-det-dat-ife-dfe    to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Composizione messaggio              *
      *                          *-------------------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "La data non puo' essere superiore al "
                                delimited by   size
                     v-edt
                                delimited by   spaces
                     " !"
                                delimited by   size
                                          into w-err-box-err-msg      .
      *                          *-------------------------------------*
      *                          * Emissione messaggio                 *
      *                          *-------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                          *-------------------------------------*
      *                          * Reimpostazione                      *
      *                          *-------------------------------------*
           go to     acc-dat-inv-100.
       acc-dat-inv-500.
      *                  *---------------------------------------------*
      *                  * Valore zero non ammesso, a meno che non si  *
      *                  * sia in Up                                   *
      *                  *---------------------------------------------*
           if        rr-dat-inv           not  = zero
                     go to acc-dat-inv-600.
           if        v-key                =    "UP  "
                     go to acc-dat-inv-600
           else      go to acc-dat-inv-100.
       acc-dat-inv-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-inv-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dat-inv-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dat-inv-100.
       acc-dat-inv-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo selezione : Data inventario         *
      *    *-----------------------------------------------------------*
       vis-dat-inv-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      ">"                  to   v-edm                  .
           move      08                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-dat-inv           to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dat-inv-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Controllo su data inventario                    *
      *              *-------------------------------------------------*
           if        rr-dat-inv           not  = zero
                     go to tdo-ric-sel-800.
           move      "Manca la data inventario !                        
      -              "      "             to   w-err-box-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-800.
      *              *-------------------------------------------------*
      *              * Uscita con successo                             *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Uscita con errori                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Emissione messaggio di errore               *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      74                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      70                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      71                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio inventario                        *
      *    *-----------------------------------------------------------*
       exe-ini-inv-000.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
           perform   vis-vdd-mnt-000      thru vis-vdd-mnt-999        .
      *              *-------------------------------------------------*
      *              * Controllo preliminare file [mmv]                *
      *              *-------------------------------------------------*
           perform   cnt-pre-mmv-000      thru cnt-pre-mmv-999        .
           if        w-cnt-pre-mmv-flg    not  = spaces
                     go to exe-ini-inv-999.
      *              *-------------------------------------------------*
      *              * Caricamento dati inventario                     *
      *              *-------------------------------------------------*
           perform   car-dti-inv-000      thru car-dti-inv-999        .
      *              *-------------------------------------------------*
      *              * Caricamento dati inventario per ubicazione      *
      *              *-------------------------------------------------*
           perform   car-dti-inv-ubi-000  thru car-dti-inv-ubi-999    .
      *              *-------------------------------------------------*
      *              * Aggiornamento numerazione [datinv]              *
      *              *-------------------------------------------------*
           perform   agg-dat-inv-000      thru agg-dat-inv-999        .
      *              *-------------------------------------------------*
      *              * Aggiornamento numerazione [datife]              *
      *              *-------------------------------------------------*
           perform   agg-dat-ife-000      thru agg-dat-ife-999        .
       exe-ini-inv-999.
           exit.

      *    *===========================================================*
      *    * Video di monitoraggio                                     *
      *    *-----------------------------------------------------------*
       vis-vdd-mnt-000.
      *              *-------------------------------------------------*
      *              * Trattini                                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "OPERAZIONI IN CORSO "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-vdd-mnt-999.
           exit.

      *    *===========================================================*
      *    * Controllo preliminare file [mmv]                          *
      *    *                                                           *
      *    * La seguente routine serve per determinare se esistono     *
      *    * delle quantita' ancora in attesa di valorizzazione nel    *
      *    * corso dell'esercizio                                      *
      *    *-----------------------------------------------------------*
       cnt-pre-mmv-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-mmv-flg      .
      *              *-------------------------------------------------*
      *              * Test se controllo da eseguire                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se inventario non di fine esercizio : no    *
      *                  *---------------------------------------------*
           if        rr-tip-inv           not  = "F"
                     go to cnt-pre-mmv-999.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione lo consente : no       *
      *                  *---------------------------------------------*
           if        w-prs-snx-ccv        not  = "S"
                     go to cnt-pre-mmv-999.
       cnt-pre-mmv-020.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Controllo preliminare .....:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-cnt-pre-mmv-cte      .
       cnt-pre-mmv-030.
      *              *-------------------------------------------------*
      *              * Determinazione esercizio richiesto              *
      *              *-------------------------------------------------*
           move      w-det-dat-ife-dfe    to   s-dat                  .
           move      s-saa                to   w-cnt-pre-mmv-ese      .
       cnt-pre-mmv-050.
      *              *-------------------------------------------------*
      *              * Start su file [mmv]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "ESECOD    "         to   f-key                  .
           move      w-cnt-pre-mmv-ese    to   rf-mmv-ann-ese         .
           move      zero                 to   rf-mmv-tip-mag         .
           move      zero                 to   rf-mmv-num-mag         .
           move      "pgm/mag/fls/ioc/obj/iofmmv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmv                 .
      *                      *-----------------------------------------*
      *                      * Test su esito operazione                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to cnt-pre-mmv-900.
       cnt-pre-mmv-100.
      *                  *---------------------------------------------*
      *                  * Lettura sequenziale record [mmv]            *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmv                 .
      *                      *-----------------------------------------*
      *                      * Test se 'At end'                        *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to cnt-pre-mmv-900.
      *                      *-----------------------------------------*
      *                      * Test sul massimo                        *
      *                      *-----------------------------------------*
           if        rf-mmv-ann-ese       not  = w-cnt-pre-mmv-ese
                     go to cnt-pre-mmv-900.
       cnt-pre-mmv-110.
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-cnt-pre-mmv-cte      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      15                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-cnt-pre-mmv-cte    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione progressivi mensili      *
      *                  *---------------------------------------------*
           move      zero                 to   w-cnt-pre-mmv-ctr      .
       cnt-pre-mmv-120.
           add       1                    to   w-cnt-pre-mmv-ctr      .
           if        w-cnt-pre-mmv-ctr    >    12
                     go to cnt-pre-mmv-100.
      *                      *-----------------------------------------*
      *                      * Se quantita' in attesa di valorizzazio- *
      *                      * ne a zero : riciclo                     *
      *                      *-----------------------------------------*
           if        rf-mmv-qav-mns
                    (w-cnt-pre-mmv-ctr)   =    zero
                     go to cnt-pre-mmv-120.
       cnt-pre-mmv-200.
      *                  *---------------------------------------------*
      *                  * Lettura anagrafica magazzino                *
      *                  *---------------------------------------------*
           if        rf-mmv-tip-mag       =    01
                     go to cnt-pre-mmv-210
           else if   rf-mmv-tip-mag       =    02
                     go to cnt-pre-mmv-220
           else if   rf-mmv-tip-mag       =    03
                     go to cnt-pre-mmv-230
           else if   rf-mmv-tip-mag       =    04
                     go to cnt-pre-mmv-240
           else      go to cnt-pre-mmv-210                            .
       cnt-pre-mmv-210.
      *                  *---------------------------------------------*
      *                  * Se Prodotto di vendita                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione [dcp]                   *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Lettura [dcp]                           *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      rf-mmv-num-mag       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * A messaggio di errore                   *
      *                      *-----------------------------------------*
           go to     cnt-pre-mmv-300.
       cnt-pre-mmv-220.
      *                  *---------------------------------------------*
      *                  * Se Semilavorato                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione [dps]                   *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
      *                      *-----------------------------------------*
      *                      * Lettura [dps]                           *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMSEM    "         to   f-key                  .
           move      rf-mmv-num-mag       to   rf-dps-num-sem         .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
      *                      *-----------------------------------------*
      *                      * A messaggio di errore                   *
      *                      *-----------------------------------------*
           go to     cnt-pre-mmv-300.
       cnt-pre-mmv-230.
      *                  *---------------------------------------------*
      *                  * Se Materia prima                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione [dpm]                   *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *                      *-----------------------------------------*
      *                      * Lettura [dps]                           *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMMAP    "         to   f-key                  .
           move      rf-mmv-num-mag       to   rf-dpm-num-map         .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *                      *-----------------------------------------*
      *                      * A messaggio di errore                   *
      *                      *-----------------------------------------*
           go to     cnt-pre-mmv-300.
       cnt-pre-mmv-240.
      *                  *---------------------------------------------*
      *                  * Se Materiale vario                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione [mtv]                   *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mtv/fls/ioc/obj/iofmtv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mtv                 .
      *                      *-----------------------------------------*
      *                      * Lettura [dps]                           *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMMTV    "         to   f-key                  .
           move      rf-mmv-num-mag       to   rf-mtv-num-mtv         .
           move      "pgm/mtv/fls/ioc/obj/iofmtv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mtv                 .
      *                      *-----------------------------------------*
      *                      * A messaggio di errore                   *
      *                      *-----------------------------------------*
           go to     cnt-pre-mmv-300.
       cnt-pre-mmv-300.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      "Durante la fase di controllo preliminare saldi di 
      -              "magazzino sono state riscon-  "
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *
           move      "WR"                 to   m-ope                  .
           move      "trate delle quantita' in attesa di valorizzazione.
      -              "                             "
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                      *-----------------------------------------*
      *                      * Editing progressivo numerico prodotto   *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      rf-mmv-num-mag       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Concatenamento prima riga messaggio     *
      *                      *-----------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
      *
           if        rf-mmv-tip-mag       =    01
                     move  "*** Prodotto di vendita      "
                                          to   w-all-str-cat (1)
           else if   rf-mmv-tip-mag       =    02
                     move  "*** Semilavorato             "
                                          to   w-all-str-cat (1)
           else if   rf-mmv-tip-mag       =    03
                     move  "*** Materia prima            "
                                          to   w-all-str-cat (1)
           else if   rf-mmv-tip-mag       =    04
                     move  "*** Materiale vario          "
                                          to   w-all-str-cat (1)
           else      move  "*** Elemento non identificato"
                                          to   w-all-str-cat (1)      .
           move      ", progressivo numerico ("
                                          to   w-all-str-cat (2)      .
      *
           move      v-edt                to   w-all-str-cat (3)      .
           move      ") -"                to   w-all-str-cat (4)      .
      *
           if        rf-mmv-tip-mag       =    01
                     move  rf-dcp-alf-pro to   w-all-str-cat (5)
           else if   rf-mmv-tip-mag       =    02
                     move  rf-dps-alf-sem to   w-all-str-cat (5)
           else if   rf-mmv-tip-mag       =    03
                     move  rf-dpm-alf-map to   w-all-str-cat (5)
           else if   rf-mmv-tip-mag       =    04
                     move  rf-mtv-alf-mtv to   w-all-str-cat (5)
           else      move  "?"            to   w-all-str-cat (5)      .
      *
           perform   all-str-cat-000      thru all-str-cat-999        .
      *
           move      "WR"                 to   m-ope                  .
           move      w-all-str-alf        to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *
           move      "WR"                 to   m-ope                  .
           move      "Il programma pertanto non e' ancora eseguibile !  
      -              "                              "
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-mmv-flg      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * con errori                                  *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      24                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "Eseguito (Vedi messaggi)"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita ad errore                         *
      *                  *---------------------------------------------*
           go to     cnt-pre-mmv-999.
       cnt-pre-mmv-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "Eseguito"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     cnt-pre-mmv-999.
       cnt-pre-mmv-999.
           exit.

      *    *===========================================================*
      *    * Routine di caricamento dati inventario                    *
      *    *-----------------------------------------------------------*
       car-dti-inv-000.
      *              *-------------------------------------------------*
      *              * Cancellazione preventiva file [mim]             *
      *              *-------------------------------------------------*
           move      "DF"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *              *-------------------------------------------------*
      *              * Open file [mim]                                 *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *              *-------------------------------------------------*
      *              * Preparazioni iniziali                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione anno di esercizio relativo   *
      *                  * alla data in cui e' stato richiesto l'in-   *
      *                  * ventario                                    *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-ese-cge-dtr          .
           move      w-prs-mes-chi        to   w-ese-cge-mce          .
           perform   det-ese-cge-000      thru det-ese-cge-999        .
           move      w-ese-cge-esa        to   w-car-dti-inv-esa      .
           move      w-ese-cge-esm        to   w-car-dti-inv-esm      .
      *              *-------------------------------------------------*
      *              * Prodotti di vendita                             *
      *              *-------------------------------------------------*
           perform   car-dti-dcp-000      thru car-dti-dcp-999        .
      *              *-------------------------------------------------*
      *              * Semilavorati                                    *
      *              *-------------------------------------------------*
           perform   car-dti-dps-000      thru car-dti-dps-999        .
      *              *-------------------------------------------------*
      *              * Materie prime                                   *
      *              *-------------------------------------------------*
           perform   car-dti-dpm-000      thru car-dti-dpm-999        .
      *              *-------------------------------------------------*
      *              * Materiali vari                                  *
      *              *-------------------------------------------------*
           perform   car-dti-mtv-000      thru car-dti-mtv-999        .
      *              *-------------------------------------------------*
      *              * Close file [mim]                                *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
       car-dti-inv-999.
           exit.

      *    *===========================================================*
      *    * Routine di caricamento dati inventario per file [dcp]     *
      *    *-----------------------------------------------------------*
       car-dti-dcp-000.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Caricamento Prodotti ......:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-car-dti-dcp-c01      .
      *              *-------------------------------------------------*
      *              * Start su file [dcp]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NUMPRO    "         to   f-key                  .
           move      zero                 to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-dti-dcp-900.
       car-dti-dcp-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [dcp]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se fine file : uscita                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-dti-dcp-900.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se il tipo prodotto non indica una merce :  *
      *                  * si ignora il record                         *
      *                  *---------------------------------------------*
           if        rf-dcp-tip-pro       not  = 01
                     go to car-dti-dcp-100.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-car-dti-dcp-c01      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      17                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-car-dti-dcp-c01    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Determinazione giacenza di magazzino per le di- *
      *              * pendenze                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione tabella dipendenze       *
      *                  *---------------------------------------------*
           move      zero                 to   w-car-dti-dcp-dpz      .
       car-dti-dcp-200.
           add       1                    to   w-car-dti-dcp-dpz      .
           if        w-car-dti-dcp-dpz    >    99
                     go to car-dti-dcp-100.
           if        w-dpz-ele-flg
                    (w-car-dti-dcp-dpz)   =    spaces
                     go to car-dti-dcp-200.
       car-dti-dcp-300.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo giacenza fisica alla   *
      *                  * data inventario                             *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-det-sld-gcf-ddr      .
           move      w-car-dti-dcp-dpz    to   w-det-sld-gcf-dpz      .
           move      01                   to   w-det-sld-gcf-tpm      .
           move      rf-dcp-num-pro       to   w-det-sld-gcf-nrm      .
           perform   det-sld-gcf-000      thru det-sld-gcf-999        .
           move      w-det-sld-gcf-sld    to   w-car-dti-dcp-gcf      .
       car-dti-dcp-400.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo merci di terzi presso  *
      *                  * di noi ma non nostre                        *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-det-sld-mdt-ddr      .
           move      w-car-dti-inv-esa    to   w-det-sld-mdt-esa      .
           move      w-car-dti-dcp-dpz    to   w-det-sld-mdt-dpz      .
           move      01                   to   w-det-sld-mdt-tpm      .
           move      rf-dcp-num-pro       to   w-det-sld-mdt-nrm      .
           move      rf-dcp-alf-pro       to   w-det-sld-mdt-afm      .
           move      rf-dcp-des-pro       to   w-det-sld-mdt-des      .
           move      rf-dcp-umi-ven       to   w-det-sld-mdt-umi      .
           move      rf-dcp-dec-qta       to   w-det-sld-mdt-deq      .
           perform   det-sld-mdt-000      thru det-sld-mdt-999        .
           move      w-det-sld-mdt-sld    to   w-car-dti-dcp-mdt      .
      *                  *---------------------------------------------*
      *                  * Aggiornamento giacenza fisica di proprieta' *
      *                  *---------------------------------------------*
           subtract  w-car-dti-dcp-mdt    from w-car-dti-dcp-gcf      .
       car-dti-dcp-500.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo merci presso terzi     *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-det-sld-mpt-ddr      .
           move      w-car-dti-inv-esa    to   w-det-sld-mpt-esa      .
           move      w-car-dti-dcp-dpz    to   w-det-sld-mpt-dpz      .
           move      01                   to   w-det-sld-mpt-tpm      .
           move      rf-dcp-num-pro       to   w-det-sld-mpt-nrm      .
           move      rf-dcp-alf-pro       to   w-det-sld-mpt-afm      .
           move      rf-dcp-des-pro       to   w-det-sld-mpt-des      .
           move      rf-dcp-umi-ven       to   w-det-sld-mpt-umi      .
           move      rf-dcp-dec-qta       to   w-det-sld-mpt-deq      .
           perform   det-sld-mpt-000      thru det-sld-mpt-999        .
           move      w-det-sld-mpt-sld    to   w-car-dti-dcp-mpt      .
       car-dti-dcp-600.
      *                  *---------------------------------------------*
      *                  * Determinazione parametri ubicazione relati- *
      *                  * vi al prodotto                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [mau]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [mau]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "MAGUBI    "         to   f-key                  .
           move      w-car-dti-dcp-dpz    to   rf-mau-cod-dpz         .
           move      01                   to   rf-mau-tip-mag         .
           move      rf-dcp-num-pro       to   rf-mau-num-mag         .
           move      spaces               to   rf-mau-var-mag         .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
      *                  *---------------------------------------------*
      *                  * Scrittura record [mim] per quanto riguarda  *
      *                  * la giacenza fisica                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [mim]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                      *-----------------------------------------*
      *                      * Composizione record [mim]               *
      *                      *-----------------------------------------*
           move      w-car-dti-dcp-dpz    to   rf-mim-cod-dpz         .
           move      01                   to   rf-mim-tip-mag         .
           move      rf-dcp-num-pro       to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      rf-dcp-alf-pro       to   rf-mim-alf-mag         .
           move      rf-dcp-des-pro       to   rf-mim-des-mag         .
           move      rf-dcp-umi-ven       to   rf-mim-umi-mag         .
           move      rf-dcp-dec-qta       to   rf-mim-dec-qta         .
           move      rf-mau-tip-ubi       to   rf-mim-tip-ubi         .
           move      rf-mau-prm-ubi (1)   to   rf-mim-prm-ubi (1)     .
           move      rf-mau-prm-ubi (2)   to   rf-mim-prm-ubi (2)     .
           move      rf-mau-prm-ubi (3)   to   rf-mim-prm-ubi (3)     .
           move      rf-mau-prm-ubi (4)   to   rf-mim-prm-ubi (4)     .
           move      01                   to   rf-mim-tip-gia         .
           move      spaces               to   rf-mim-cod-mic         .
           move      spaces               to   rf-mim-tip-arc         .
           move      zero                 to   rf-mim-cod-arc         .
           move      spaces               to   rf-mim-dpz-arc         .
           move      w-car-dti-dcp-gcf    to   rf-mim-qta-prs         .
           move      spaces               to   rf-mim-flg-ril         .
           move      zero                 to   rf-mim-qta-rlv         .
      *                  *---------------------------------------------*
      *                  * Scrittura record [mim]                      *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                  *---------------------------------------------*
      *                  * Riciclo su scansione tabella dipendenze     *
      *                  *---------------------------------------------*
           go to     car-dti-dcp-200.
       car-dti-dcp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "Eseguito"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     car-dti-dcp-999.
       car-dti-dcp-999.
           exit.

      *    *===========================================================*
      *    * Routine di caricamento dati inventario                    *
      *    *                                                           *
      *    * Subroutine per Ubicazione                                 *
      *    *-----------------------------------------------------------*
       car-dti-inv-ubi-000.
      *              *-------------------------------------------------*
      *              * Test su personalizzazione                       *
      *              *-------------------------------------------------*
           if        w-prs-ucd-snx        not  = "S"
                     go to car-dti-inv-ubi-999.
       car-dti-inv-ubi-100.
      *              *-------------------------------------------------*
      *              * Cancellazione preventiva file [miu]             *
      *              *-------------------------------------------------*
           move      "DF"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmiu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-miu                 .
      *              *-------------------------------------------------*
      *              * Open file [miu]                                 *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmiu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-miu                 .
      *              *-------------------------------------------------*
      *              * Prodotti di vendita                             *
      *              *-------------------------------------------------*
           perform   car-dti-dcp-ubi-000  thru car-dti-dcp-ubi-999    .
      *              *-------------------------------------------------*
      *              * Close file [miu]                                *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmiu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-miu                 .
       car-dti-inv-ubi-999.
           exit.

      *    *===========================================================*
      *    * Routine di caricamento dati inventario per file [dcp]     *
      *    *                                                           *
      *    * Subroutine per Ubicazione                                 *
      *    *-----------------------------------------------------------*
       car-dti-dcp-ubi-000.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Caricamento Ubicazioni ....:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-car-dti-dcp-cu1      .
       car-dti-dcp-ubi-100.
      *              *-------------------------------------------------*
      *              * Start su file [dcp]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NUMPRO    "         to   f-key                  .
           move      zero                 to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-dti-dcp-ubi-900.
       car-dti-dcp-ubi-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [dcp]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se fine file : uscita                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-dti-dcp-ubi-900.
       car-dti-dcp-ubi-400.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se il tipo prodotto non indica una merce :  *
      *                  * si ignora il record                         *
      *                  *---------------------------------------------*
           if        rf-dcp-tip-pro       not  = 01
                     go to car-dti-dcp-ubi-200.
       car-dti-dcp-ubi-600.
      *                  *---------------------------------------------*
      *                  * Determinazione buffer giacenze per ubica-   *
      *                  * zione                                       *
      *                  *---------------------------------------------*
           move      "PU"                 to   d-sld-ubi-tip-ope      .
           move      rr-dat-inv           to   d-sld-ubi-dat-ela      .
           move      01                   to   d-sld-ubi-cod-dpz      .
           move      01                   to   d-sld-ubi-tip-mag      .
           move      rf-dcp-num-pro       to   d-sld-ubi-num-mag      .
           move      spaces               to   d-sld-ubi-cod-ubi      .
           move      spaces               to   d-sld-ubi-lit-ubi      .
           perform   det-sld-ubi-cll-000  thru det-sld-ubi-cll-999    .
      *                  *---------------------------------------------*
      *                  * Ciclo di scrittura per ubicazione           *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-gia-ubi-ctr      .
       car-dti-dcp-ubi-620.
           add       1                    to   w-det-gia-ubi-ctr      .
      *                  *---------------------------------------------*
      *                  * Test su contatore elementi                  *
      *                  *---------------------------------------------*
           if        w-det-gia-ubi-ctr    >    d-sld-ubi-num-ele
                     go to car-dti-dcp-ubi-800.
      *                  *---------------------------------------------*
      *                  * Se ubicazione a spazi, ma con giacenza, il  *
      *                  * test viene superato se non e' una ubicazio- *
      *                  * ne di transito                              *
      *                  *---------------------------------------------*
           if        d-sld-ubi-ubi-gia
                    (w-det-gia-ubi-ctr)   not  = spaces
                     go to car-dti-dcp-ubi-630.
      *                  *---------------------------------------------*
      *                  * Test se giacenza a zero                     *
      *                  *---------------------------------------------*
           if        d-sld-ubi-qta-gia
                    (w-det-gia-ubi-ctr)   =    zero
                     go to car-dti-dcp-ubi-620.
      *                  *---------------------------------------------*
      *                  * Attenzione: l'ubicazione a spazi viene      *
      *                  * trasformata in ubicazione 'ZZZ' per         *
      *                  * verificare le giacenze                      *
      *                  *---------------------------------------------*
           move      "ZZZ    "            to   d-sld-ubi-ubi-gia
                                              (w-det-gia-ubi-ctr)     .
       car-dti-dcp-ubi-630.
      *                  *---------------------------------------------*
      *                  * Determinazione tipo ubicazione              *
      *                  *---------------------------------------------*
           move      "TU"                 to   d-sld-ubi-tip-ope      .
           move      01                   to   d-sld-ubi-cod-dpz      .
           move      d-sld-ubi-ubi-gia
                    (w-det-gia-ubi-ctr)   to   d-sld-ubi-cod-ubi      .
      *                  *---------------------------------------------*
      *                  * Se ubicazione di transito, senza giacenza,  *
      *                  * il test non viene superato                  *
      *                  *---------------------------------------------*
           perform   det-sld-ubi-cll-000  thru det-sld-ubi-cll-999    .
           if        d-sld-ubi-exi-sts    not  = "T"
                     go to car-dti-dcp-ubi-650.
           if        d-sld-ubi-qta-gia
                    (w-det-gia-ubi-ctr)   =    zero
                     go to car-dti-dcp-ubi-620.
       car-dti-dcp-ubi-650.
      *                  *---------------------------------------------*
      *                  * Video di monitoraggio                       *
      *                  *---------------------------------------------*
           add       1                    to   w-car-dti-dcp-cu1      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      21                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-car-dti-dcp-cu1    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [miu]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmiu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-miu                 .
      *                  *---------------------------------------------*
      *                  * Composizione record [miu]                   *
      *                  *---------------------------------------------*
           move      01                   to   rf-miu-cod-dpz         .
           move      01                   to   rf-miu-tip-mag         .
           move      rf-dcp-num-pro       to   rf-miu-num-mag         .
           move      d-sld-ubi-ubi-gia
                    (w-det-gia-ubi-ctr)   to   rf-miu-cod-ubi         .
           move      d-sld-ubi-qta-gia
                    (w-det-gia-ubi-ctr)   to   rf-miu-qta-prs         .
           move      spaces               to   rf-miu-flg-rlv         .
           move      spaces               to   rf-miu-flg-spv         .
           move      zero                 to   rf-miu-qta-rlv         .
           move      spaces               to   rf-miu-ubi-rlv         .
           move      zero                 to   rf-miu-cod-rsm         .
           move      zero                 to   rf-miu-ide-dat         .
           move      spaces               to   rf-miu-ide-ute         .
           move      spaces               to   rf-miu-ide-fas         .
           move      spaces               to   rf-miu-ann-rlv         .
           move      spaces               to   rf-miu-alx-exp         .
      *                  *---------------------------------------------*
      *                  * Scrittura record [miu]                      *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmiu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-miu                 .
       car-dti-dcp-ubi-700.
      *                  *---------------------------------------------*
      *                  * Riciclo su scansione ubicazioni             *
      *                  *---------------------------------------------*
           go to     car-dti-dcp-ubi-620.
       car-dti-dcp-ubi-800.
      *                  *---------------------------------------------*
      *                  * Riciclo su scansione prodotti               *
      *                  *---------------------------------------------*
           go to     car-dti-dcp-ubi-200.
       car-dti-dcp-ubi-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "Eseguito"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     car-dti-dcp-ubi-999.
       car-dti-dcp-ubi-999.
           exit.

      *    *===========================================================*
      *    * Routine di caricamento dati inventario per file [dps]     *
      *    *-----------------------------------------------------------*
       car-dti-dps-000.
      *              *-------------------------------------------------*
      *              * Test se gestione semilavorati attiva            *
      *              *-------------------------------------------------*
           if        w-prs-dps-snx        not  = "S"
                     go to car-dti-dps-999.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Caricamento Semilavorati ..:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-car-dti-dps-c01      .
      *              *-------------------------------------------------*
      *              * Start su file [dps]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NUMSEM    "         to   f-key                  .
           move      zero                 to   rf-dps-num-sem         .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
      *              *-------------------------------------------------*
      *              * Se Start errata : uscita                        *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-dti-dps-900.
       car-dti-dps-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [dps]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
      *              *-------------------------------------------------*
      *              * Se fine file : uscita                           *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-dti-dps-900.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-car-dti-dps-c01      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      18                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-car-dti-dps-c01    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Determinazione giacenza di magazzino per le di- *
      *              * pendenze                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione tabella dipendenze       *
      *                  *---------------------------------------------*
           move      zero                 to   w-car-dti-dps-dpz      .
       car-dti-dps-200.
           add       1                    to   w-car-dti-dps-dpz      .
           if        w-car-dti-dps-dpz    >    99
                     go to car-dti-dps-100.
           if        w-dpz-ele-flg
                    (w-car-dti-dps-dpz)   =    spaces
                     go to car-dti-dps-200.
       car-dti-dps-300.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo giacenza fisica alla   *
      *                  * data inventario                             *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-det-sld-gcf-ddr      .
           move      w-car-dti-dps-dpz    to   w-det-sld-gcf-dpz      .
           move      02                   to   w-det-sld-gcf-tpm      .
           move      rf-dps-num-sem       to   w-det-sld-gcf-nrm      .
           perform   det-sld-gcf-000      thru det-sld-gcf-999        .
           move      w-det-sld-gcf-sld    to   w-car-dti-dps-gcf      .
       car-dti-dps-400.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo merci di terzi presso  *
      *                  * di noi ma non nostre                        *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-det-sld-mdt-ddr      .
           move      w-car-dti-inv-esa    to   w-det-sld-mdt-esa      .
           move      w-car-dti-dps-dpz    to   w-det-sld-mdt-dpz      .
           move      02                   to   w-det-sld-mdt-tpm      .
           move      rf-dps-num-sem       to   w-det-sld-mdt-nrm      .
           move      rf-dps-alf-sem       to   w-det-sld-mdt-afm      .
           move      rf-dps-des-sem       to   w-det-sld-mdt-des      .
           move      rf-dps-umi-prd       to   w-det-sld-mdt-umi      .
           move      rf-dps-dec-qta       to   w-det-sld-mdt-deq      .
           perform   det-sld-mdt-000      thru det-sld-mdt-999        .
           move      w-det-sld-mdt-sld    to   w-car-dti-dps-mdt      .
      *                  *---------------------------------------------*
      *                  * Aggiornamento giacenza fisica di proprieta' *
      *                  *---------------------------------------------*
           subtract  w-car-dti-dps-mdt    from w-car-dti-dps-gcf      .
       car-dti-dps-500.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo merci presso terzi     *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-det-sld-mpt-ddr      .
           move      w-car-dti-inv-esa    to   w-det-sld-mpt-esa      .
           move      w-car-dti-dps-dpz    to   w-det-sld-mpt-dpz      .
           move      02                   to   w-det-sld-mpt-tpm      .
           move      rf-dps-num-sem       to   w-det-sld-mpt-nrm      .
           move      rf-dps-alf-sem       to   w-det-sld-mpt-afm      .
           move      rf-dps-des-sem       to   w-det-sld-mpt-des      .
           move      rf-dps-umi-prd       to   w-det-sld-mpt-umi      .
           move      rf-dps-dec-qta       to   w-det-sld-mpt-deq      .
           perform   det-sld-mpt-000      thru det-sld-mpt-999        .
           move      w-det-sld-mpt-sld    to   w-car-dti-dps-mpt      .
       car-dti-dps-600.
      *                  *---------------------------------------------*
      *                  * Determinazione parametri ubicazione relati- *
      *                  * vi al semilavorato                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [mau]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [mau]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "MAGUBI    "         to   f-key                  .
           move      w-car-dti-dps-dpz    to   rf-mau-cod-dpz         .
           move      02                   to   rf-mau-tip-mag         .
           move      rf-dps-num-sem       to   rf-mau-num-mag         .
           move      spaces               to   rf-mau-var-mag         .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
      *                  *---------------------------------------------*
      *                  * Scrittura record [mim] per quanto riguarda  *
      *                  * la giacenza fisica                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [mim]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                      *-----------------------------------------*
      *                      * Composizione record [mim]               *
      *                      *-----------------------------------------*
           move      w-car-dti-dps-dpz    to   rf-mim-cod-dpz         .
           move      02                   to   rf-mim-tip-mag         .
           move      rf-dps-num-sem       to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      rf-dps-alf-sem       to   rf-mim-alf-mag         .
           move      rf-dps-des-sem       to   rf-mim-des-mag         .
           move      rf-dps-umi-prd       to   rf-mim-umi-mag         .
           move      rf-dps-dec-qta       to   rf-mim-dec-qta         .
           move      rf-mau-tip-ubi       to   rf-mim-tip-ubi         .
           move      rf-mau-prm-ubi (1)   to   rf-mim-prm-ubi (1)     .
           move      rf-mau-prm-ubi (2)   to   rf-mim-prm-ubi (2)     .
           move      rf-mau-prm-ubi (3)   to   rf-mim-prm-ubi (3)     .
           move      rf-mau-prm-ubi (4)   to   rf-mim-prm-ubi (4)     .
           move      01                   to   rf-mim-tip-gia         .
           move      spaces               to   rf-mim-cod-mic         .
           move      spaces               to   rf-mim-tip-arc         .
           move      zero                 to   rf-mim-cod-arc         .
           move      spaces               to   rf-mim-dpz-arc         .
           move      w-car-dti-dps-gcf    to   rf-mim-qta-prs         .
           move      spaces               to   rf-mim-flg-ril         .
           move      zero                 to   rf-mim-qta-rlv         .
      *                  *---------------------------------------------*
      *                  * Scrittura record [mim]                      *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                  *---------------------------------------------*
      *                  * Riciclo su scansione tabella dipendenze     *
      *                  *---------------------------------------------*
           go to     car-dti-dps-200.
       car-dti-dps-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "Eseguito"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     car-dti-dps-999.
       car-dti-dps-999.
           exit.

      *    *===========================================================*
      *    * Routine di caricamento dati inventario per file [dpm]     *
      *    *-----------------------------------------------------------*
       car-dti-dpm-000.
      *              *-------------------------------------------------*
      *              * Test se gestione materie prime attiva           *
      *              *-------------------------------------------------*
           if        w-prs-dpm-snx        not  = "S"
                     go to car-dti-dpm-999.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Caricamento Materie prime .:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-car-dti-dpm-c01      .
      *              *-------------------------------------------------*
      *              * Start su file [dpm]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NUMMAP    "         to   f-key                  .
           move      zero                 to   rf-dpm-num-map         .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * Se Start errata : uscita                        *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-dti-dpm-900.
       car-dti-dpm-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [dpm]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * Se fine file : uscita                           *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-dti-dpm-900.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-car-dti-dpm-c01      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      19                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-car-dti-dpm-c01    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Determinazione giacenza di magazzino per le di- *
      *              * pendenze                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione tabella dipendenze       *
      *                  *---------------------------------------------*
           move      zero                 to   w-car-dti-dpm-dpz      .
       car-dti-dpm-200.
           add       1                    to   w-car-dti-dpm-dpz      .
           if        w-car-dti-dpm-dpz    >    99
                     go to car-dti-dpm-100.
           if        w-dpz-ele-flg
                    (w-car-dti-dpm-dpz)   =    spaces
                     go to car-dti-dpm-200.
       car-dti-dpm-300.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo giacenza fisica alla   *
      *                  * data inventario                             *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-det-sld-gcf-ddr      .
           move      w-car-dti-dpm-dpz    to   w-det-sld-gcf-dpz      .
           move      03                   to   w-det-sld-gcf-tpm      .
           move      rf-dpm-num-map       to   w-det-sld-gcf-nrm      .
           perform   det-sld-gcf-000      thru det-sld-gcf-999        .
           move      w-det-sld-gcf-sld    to   w-car-dti-dpm-gcf      .
       car-dti-dpm-400.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo merci di terzi presso  *
      *                  * di noi ma non nostre                        *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-det-sld-mdt-ddr      .
           move      w-car-dti-inv-esa    to   w-det-sld-mdt-esa      .
           move      w-car-dti-dpm-dpz    to   w-det-sld-mdt-dpz      .
           move      03                   to   w-det-sld-mdt-tpm      .
           move      rf-dpm-num-map       to   w-det-sld-mdt-nrm      .
           move      rf-dpm-alf-map       to   w-det-sld-mdt-afm      .
           move      rf-dpm-des-map       to   w-det-sld-mdt-des      .
           move      rf-dpm-umi-prd       to   w-det-sld-mdt-umi      .
           move      rf-dpm-dec-qta       to   w-det-sld-mdt-deq      .
           perform   det-sld-mdt-000      thru det-sld-mdt-999        .
           move      w-det-sld-mdt-sld    to   w-car-dti-dpm-mdt      .
      *                  *---------------------------------------------*
      *                  * Aggiornamento giacenza fisica di proprieta' *
      *                  *---------------------------------------------*
           subtract  w-car-dti-dpm-mdt    from w-car-dti-dpm-gcf      .
       car-dti-dpm-500.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo merci presso terzi     *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-det-sld-mpt-ddr      .
           move      w-car-dti-inv-esa    to   w-det-sld-mpt-esa      .
           move      w-car-dti-dpm-dpz    to   w-det-sld-mpt-dpz      .
           move      03                   to   w-det-sld-mpt-tpm      .
           move      rf-dpm-num-map       to   w-det-sld-mpt-nrm      .
           move      rf-dpm-alf-map       to   w-det-sld-mpt-afm      .
           move      rf-dpm-des-map       to   w-det-sld-mpt-des      .
           move      rf-dpm-umi-prd       to   w-det-sld-mpt-umi      .
           move      rf-dpm-dec-qta       to   w-det-sld-mpt-deq      .
           perform   det-sld-mpt-000      thru det-sld-mpt-999        .
           move      w-det-sld-mpt-sld    to   w-car-dti-dpm-mpt      .
       car-dti-dpm-600.
      *                  *---------------------------------------------*
      *                  * Determinazione parametri ubicazione relati- *
      *                  * vi alla materia prima                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [mau]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [mau]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "MAGUBI    "         to   f-key                  .
           move      w-car-dti-dpm-dpz    to   rf-mau-cod-dpz         .
           move      03                   to   rf-mau-tip-mag         .
           move      rf-dpm-num-map       to   rf-mau-num-mag         .
           move      spaces               to   rf-mau-var-mag         .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
      *                  *---------------------------------------------*
      *                  * Scrittura record [mim] per quanto riguarda  *
      *                  * la giacenza fisica                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [mim]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                      *-----------------------------------------*
      *                      * Composizione record [mim]               *
      *                      *-----------------------------------------*
           move      w-car-dti-dpm-dpz    to   rf-mim-cod-dpz         .
           move      03                   to   rf-mim-tip-mag         .
           move      rf-dpm-num-map       to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      rf-dpm-alf-map       to   rf-mim-alf-mag         .
           move      rf-dpm-des-map       to   rf-mim-des-mag         .
           move      rf-dpm-umi-prd       to   rf-mim-umi-mag         .
           move      rf-dpm-dec-qta       to   rf-mim-dec-qta         .
           move      rf-mau-tip-ubi       to   rf-mim-tip-ubi         .
           move      rf-mau-prm-ubi (1)   to   rf-mim-prm-ubi (1)     .
           move      rf-mau-prm-ubi (2)   to   rf-mim-prm-ubi (2)     .
           move      rf-mau-prm-ubi (3)   to   rf-mim-prm-ubi (3)     .
           move      rf-mau-prm-ubi (4)   to   rf-mim-prm-ubi (4)     .
           move      01                   to   rf-mim-tip-gia         .
           move      spaces               to   rf-mim-cod-mic         .
           move      spaces               to   rf-mim-tip-arc         .
           move      zero                 to   rf-mim-cod-arc         .
           move      spaces               to   rf-mim-dpz-arc         .
           move      w-car-dti-dpm-gcf    to   rf-mim-qta-prs         .
           move      spaces               to   rf-mim-flg-ril         .
           move      zero                 to   rf-mim-qta-rlv         .
      *                  *---------------------------------------------*
      *                  * Scrittura record [mim]                      *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                  *---------------------------------------------*
      *                  * Riciclo su scansione tabella dipendenze     *
      *                  *---------------------------------------------*
           go to     car-dti-dpm-200.
       car-dti-dpm-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "Eseguito"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     car-dti-dpm-999.
       car-dti-dpm-999.
           exit.

      *    *===========================================================*
      *    * Routine di caricamento dati inventario per file [mtv]     *
      *    *-----------------------------------------------------------*
       car-dti-mtv-000.
      *              *-------------------------------------------------*
      *              * Test se gestione materiali vari attiva          *
      *              *-------------------------------------------------*
           if        w-prs-mtv-snx        not  = "S"
                     go to car-dti-mtv-999.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Caricamento Materiali vari :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-car-dti-mtv-c01      .
      *              *-------------------------------------------------*
      *              * Start su file [mtv]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NUMMTV    "         to   f-key                  .
           move      zero                 to   rf-mtv-num-mtv         .
           move      "pgm/mtv/fls/ioc/obj/iofmtv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mtv                 .
      *              *-------------------------------------------------*
      *              * Se Start errata : uscita                        *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-dti-mtv-900.
       car-dti-mtv-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [mtv]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mtv/fls/ioc/obj/iofmtv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mtv                 .
      *              *-------------------------------------------------*
      *              * Se fine file : uscita                           *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-dti-mtv-900.
      *              *-------------------------------------------------*
      *              * Video di monitoraggio                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-car-dti-mtv-c01      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione contatore                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      20                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-car-dti-mtv-c01    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Determinazione giacenza di magazzino per le di- *
      *              * pendenze                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione tabella dipendenze       *
      *                  *---------------------------------------------*
           move      zero                 to   w-car-dti-mtv-dpz      .
       car-dti-mtv-200.
           add       1                    to   w-car-dti-mtv-dpz      .
           if        w-car-dti-mtv-dpz    >    99
                     go to car-dti-mtv-100.
           if        w-dpz-ele-flg
                    (w-car-dti-mtv-dpz)   =    spaces
                     go to car-dti-mtv-200.
       car-dti-mtv-300.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo giacenza fisica alla   *
      *                  * data inventario                             *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-det-sld-gcf-ddr      .
           move      w-car-dti-mtv-dpz    to   w-det-sld-gcf-dpz      .
           move      04                   to   w-det-sld-gcf-tpm      .
           move      rf-mtv-num-mtv       to   w-det-sld-gcf-nrm      .
           perform   det-sld-gcf-000      thru det-sld-gcf-999        .
           move      w-det-sld-gcf-sld    to   w-car-dti-mtv-gcf      .
       car-dti-mtv-400.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo merci di terzi presso  *
      *                  * di noi ma non nostre                        *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-det-sld-mdt-ddr      .
           move      w-car-dti-inv-esa    to   w-det-sld-mdt-esa      .
           move      w-car-dti-mtv-dpz    to   w-det-sld-mdt-dpz      .
           move      04                   to   w-det-sld-mdt-tpm      .
           move      rf-mtv-num-mtv       to   w-det-sld-mdt-nrm      .
           move      rf-mtv-alf-mtv       to   w-det-sld-mdt-afm      .
           move      rf-mtv-des-mtv       to   w-det-sld-mdt-des      .
           move      rf-mtv-umi-gst       to   w-det-sld-mdt-umi      .
           move      rf-mtv-dec-qta       to   w-det-sld-mdt-deq      .
           perform   det-sld-mdt-000      thru det-sld-mdt-999        .
           move      w-det-sld-mdt-sld    to   w-car-dti-mtv-mdt      .
      *                  *---------------------------------------------*
      *                  * Aggiornamento giacenza fisica di proprieta' *
      *                  *---------------------------------------------*
           subtract  w-car-dti-mtv-mdt    from w-car-dti-mtv-gcf      .
       car-dti-mtv-500.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo merci presso terzi     *
      *                  *---------------------------------------------*
           move      rr-dat-inv           to   w-det-sld-mpt-ddr      .
           move      w-car-dti-inv-esa    to   w-det-sld-mpt-esa      .
           move      w-car-dti-mtv-dpz    to   w-det-sld-mpt-dpz      .
           move      04                   to   w-det-sld-mpt-tpm      .
           move      rf-mtv-num-mtv       to   w-det-sld-mpt-nrm      .
           move      rf-mtv-alf-mtv       to   w-det-sld-mpt-afm      .
           move      rf-mtv-des-mtv       to   w-det-sld-mpt-des      .
           move      rf-mtv-umi-gst       to   w-det-sld-mpt-umi      .
           move      rf-mtv-dec-qta       to   w-det-sld-mpt-deq      .
           perform   det-sld-mpt-000      thru det-sld-mpt-999        .
           move      w-det-sld-mpt-sld    to   w-car-dti-mtv-mpt      .
       car-dti-mtv-600.
      *                  *---------------------------------------------*
      *                  * Determinazione parametri ubicazione relati- *
      *                  * vi al materiale vario                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [mau]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [mau]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "MAGUBI    "         to   f-key                  .
           move      w-car-dti-mtv-dpz    to   rf-mau-cod-dpz         .
           move      04                   to   rf-mau-tip-mag         .
           move      rf-mtv-num-mtv       to   rf-mau-num-mag         .
           move      spaces               to   rf-mau-var-mag         .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
      *                  *---------------------------------------------*
      *                  * Scrittura record [mim] per quanto riguarda  *
      *                  * la giacenza fisica                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [mim]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                      *-----------------------------------------*
      *                      * Composizione record [mim]               *
      *                      *-----------------------------------------*
           move      w-car-dti-mtv-dpz    to   rf-mim-cod-dpz         .
           move      04                   to   rf-mim-tip-mag         .
           move      rf-mtv-num-mtv       to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      rf-mtv-alf-mtv       to   rf-mim-alf-mag         .
           move      rf-mtv-des-mtv       to   rf-mim-des-mag         .
           move      rf-mtv-umi-gst       to   rf-mim-umi-mag         .
           move      rf-mtv-dec-qta       to   rf-mim-dec-qta         .
           move      rf-mau-tip-ubi       to   rf-mim-tip-ubi         .
           move      rf-mau-prm-ubi (1)   to   rf-mim-prm-ubi (1)     .
           move      rf-mau-prm-ubi (2)   to   rf-mim-prm-ubi (2)     .
           move      rf-mau-prm-ubi (3)   to   rf-mim-prm-ubi (3)     .
           move      rf-mau-prm-ubi (4)   to   rf-mim-prm-ubi (4)     .
           move      01                   to   rf-mim-tip-gia         .
           move      spaces               to   rf-mim-cod-mic         .
           move      spaces               to   rf-mim-tip-arc         .
           move      zero                 to   rf-mim-cod-arc         .
           move      spaces               to   rf-mim-dpz-arc         .
           move      w-car-dti-mtv-gcf    to   rf-mim-qta-prs         .
           move      spaces               to   rf-mim-flg-ril         .
           move      zero                 to   rf-mim-qta-rlv         .
      *                  *---------------------------------------------*
      *                  * Scrittura record [mim]                      *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                  *---------------------------------------------*
      *                  * Riciclo su scansione tabella dipendenze     *
      *                  *---------------------------------------------*
           go to     car-dti-mtv-200.
       car-dti-mtv-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione indicatore di operazione    *
      *                  * eseguita                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "Eseguito"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     car-dti-mtv-999.
       car-dti-mtv-999.
           exit.

      *    *===========================================================*
      *    * Routine di aggiornamento numerazione [datinv]             *
      *    *-----------------------------------------------------------*
       agg-dat-inv-000.
      *              *-------------------------------------------------*
      *              * Ottenimento record [datinv]                     *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *              *-------------------------------------------------*
      *              * Se record non esistente                         *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to agg-dat-inv-100.
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [datinv]             *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *                  *---------------------------------------------*
      *                  * Scrittura record [datinv]                   *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *                  *---------------------------------------------*
      *                  * Riciclo a inizio operazione                 *
      *                  *---------------------------------------------*
           go to     agg-dat-inv-000.
       agg-dat-inv-100.
      *              *-------------------------------------------------*
      *              * Composizione record [datinv]                    *
      *              *-------------------------------------------------*
           move      rr-tip-inv           to   rn-dat-inv-tip-iic     .
           move      rr-dat-inv           to   rn-dat-inv-dat-ini     .
           move      spaces               to   rn-dat-inv-flg-gdi     .
           move      zero                 to   rn-dat-inv-dat-fii     .
      *              *-------------------------------------------------*
      *              * Update record [datinv]                          *
      *              *-------------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
      *              *-------------------------------------------------*
      *              * Release record [datinv]                         *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatinv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-inv             .
       agg-dat-inv-999.
           exit.

      *    *===========================================================*
      *    * Routine di aggiornamento numerazione [datife]             *
      *    *-----------------------------------------------------------*
       agg-dat-ife-000.
      *              *-------------------------------------------------*
      *              * Test se record da aggiornare                    *
      *              *-------------------------------------------------*
           if        rr-tip-inv           not  = "F"
                     go to agg-dat-ife-999.
      *              *-------------------------------------------------*
      *              * Ottenimento record [datife]                     *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
      *              *-------------------------------------------------*
      *              * Se record non esistente                         *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to agg-dat-ife-100.
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [datife]             *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
      *                  *---------------------------------------------*
      *                  * Scrittura record [datife]                   *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
      *                  *---------------------------------------------*
      *                  * Riciclo a inizio operazione                 *
      *                  *---------------------------------------------*
           go to     agg-dat-ife-000.
       agg-dat-ife-100.
      *              *-------------------------------------------------*
      *              * Composizione record [datife]                    *
      *              *-------------------------------------------------*
           move      "#"                  to   rn-dat-ife-flg-ife     .
           move      rr-dat-inv           to   rn-dat-ife-ini-ife     .
           move      zero                 to   rn-dat-ife-fin-ife     .
           move      w-det-dat-ife-dfe    to   s-dat                  .
           move      s-saa                to   rn-dat-ife-ese-ife     .
      *              *-------------------------------------------------*
      *              * Update record [datife]                          *
      *              *-------------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
      *              *-------------------------------------------------*
      *              * Release record [datife]                         *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
       agg-dat-ife-999.
           exit.

      *    *===========================================================*
      *    * Determinazione data per inventario di fine esercizio      *
      *    *-----------------------------------------------------------*
       det-dat-ife-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-dat-ife-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione valore di uscita                *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-dat-ife-dfe      .
      *              *-------------------------------------------------*
      *              * Open file [mmt]                                 *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmt                 .
      *              *-------------------------------------------------*
      *              * Open numerazione [datife]                       *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
      *              *-------------------------------------------------*
      *              * Determinazione data attuale                     *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-det-dat-ife-att      .
      *              *-------------------------------------------------*
      *              * Determinazione anno e mese di esercizio relati- *
      *              * vi alla data attuale                            *
      *              *-------------------------------------------------*
           move      w-det-dat-ife-att    to   w-ese-cge-dtr          .
           move      w-prs-mes-chi        to   w-ese-cge-mce          .
           perform   det-ese-cge-000      thru det-ese-cge-999        .
           move      w-ese-cge-esa        to   w-det-dat-ife-eda      .
      *              *-------------------------------------------------*
      *              * Determinazione dati relativi all'ultimo inven-  *
      *              * tario di fine esercizio                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [datife]             *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
      *                  *---------------------------------------------*
      *                  * Lettura record [datife]                     *
      *                  *---------------------------------------------*
           move      "RD"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
      *                  *---------------------------------------------*
      *                  * Determinazione flag di record esistente o   *
      *                  * no                                          *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     move  "S"            to   w-det-dat-ife-fre
           else      move  "N"            to   w-det-dat-ife-fre      .
      *              *-------------------------------------------------*
      *              * Se record non esistente si salta il successivo  *
      *              * controllo                                       *
      *              *-------------------------------------------------*
           if        w-det-dat-ife-fre    =    "N"
                     go to det-dat-ife-100.
      *              *-------------------------------------------------*
      *              * Controllo che l'ultimo inventario di fine eser- *
      *              * cizio sia concluso                              *
      *              *-------------------------------------------------*
           if        rn-dat-ife-flg-ife   =    spaces
                     go to det-dat-ife-100.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Salvataggio immagine video              *
      *                      *-----------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Video in Off                            *
      *                      *-----------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Box                                     *
      *                      *-----------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      07                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      18                   to   v-lto                  .
           move      78                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Messaggi nel box                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Titolo                              *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "                           A T T E N Z I O N E    
      -              "                      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Prima riga                          *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "Programma non eseguibile !                        
      -              "                      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Seconda riga                        *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing esercizio               *
      *                              *---------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9"                  to   v-edm                  .
           move      rn-dat-ife-ese-ife   to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Stampa                          *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "E' ancora in corso l'inventario di fine esercizio 
      -              "'"
                                delimited by   size
                     v-edt
                                delimited by   spaces
                     "."
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Terza riga                          *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      72                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      "Si prega comunque di interpellare l'Assistenza Sof
      -              "tware.                "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Parentesi quadre di delimitazione       *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      74                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Video in On                             *
      *                      *-----------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Accettazione carattere                  *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      17                   to   v-lin                  .
           move      75                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Ripristino immagine video               *
      *                      *-----------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-det-dat-ife-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-dat-ife-900.
       det-dat-ife-100.
      *              *-------------------------------------------------*
      *              * Se record [datife] non esistente                *
      *              *-------------------------------------------------*
           if        w-det-dat-ife-fre    =    "S"
                     go to det-dat-ife-200.
      *                  *---------------------------------------------*
      *                  * Ricerca dell'esercizio relativo al primo    *
      *                  * movimento di magazzino                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Start su file [mmt]                     *
      *                      *-----------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "DATREG    "         to   f-key                  .
           move      zero                 to   rf-mmt-dat-reg         .
           move      zero                 to   rf-mmt-num-prt         .
           move      "pgm/mag/fls/ioc/obj/iofmmt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmt                 .
      *                      *-----------------------------------------*
      *                      * Test su esito operazione                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-dat-ife-140.
      *                      *-----------------------------------------*
      *                      * Lettura primo record [mmt]              *
      *                      *-----------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmt                 .
      *                      *-----------------------------------------*
      *                      * Test se 'At end'                        *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-dat-ife-140.
      *                      *-----------------------------------------*
      *                      * Determinazione anno e mese di esercizio *
      *                      * relativi alla data primo movimento di   *
      *                      * magazzino                               *
      *                      *-----------------------------------------*
           move      rf-mmt-dat-reg       to   w-ese-cge-dtr          .
           move      w-prs-mes-chi        to   w-ese-cge-mce          .
           perform   det-ese-cge-000      thru det-ese-cge-999        .
           move      w-ese-cge-esa        to   w-det-dat-ife-epm      .
      *                  *---------------------------------------------*
      *                  * Determinazione data di fine esercizio re-   *
      *                  * lativa al primo movimento di magazzino      *
      *                  *---------------------------------------------*
           move      w-det-dat-ife-epm    to   s-saa                  .
           move      w-prs-mes-chi        to   s-mes                  .
           move      31                   to   s-gio                  .
       det-dat-ife-120.
           move      "CD"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-sts                not  = spaces
                     subtract 1           from s-gio
                     go to det-dat-ife-120.
      *                  *---------------------------------------------*
      *                  * Data di fine esercizio in uscita            *
      *                  *---------------------------------------------*
           move      s-dat                to   w-det-dat-ife-dfe      .
      *                  *---------------------------------------------*
      *                  * Se l'esercizio relativo alla data attuale   *
      *                  * e' superiore a quello del primo movimento   *
      *                  * di magazzino : si forza a 'F' il flag di    *
      *                  * uscita                                      *
      *                  *---------------------------------------------*
           if        w-det-dat-ife-eda    >     w-det-dat-ife-epm
                     move  "F"            to    w-det-dat-ife-flg     .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-dat-ife-900.
       det-dat-ife-140.
      *                  *---------------------------------------------*
      *                  * Se nessun movimento di magazzino trovato    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     det-dat-ife-900.
       det-dat-ife-200.
      *              *-------------------------------------------------*
      *              * Determinazione esercizio precedente relativo    *
      *              * alla data attuale                               *
      *              *-------------------------------------------------*
           subtract  1                    from w-det-dat-ife-eda
                                        giving s-saa                  .
      *              *-------------------------------------------------*
      *              * Se diverso da quello dell'ultimo inventario di  *
      *              * fine esercizio eseguito                         *
      *              *-------------------------------------------------*
           if        s-saa                =    rn-dat-ife-ese-ife
                     go to det-dat-ife-300.
      *                  *---------------------------------------------*
      *                  * Determinazione data di fine esercizio per   *
      *                  * l'esercizio successivo a quello dell'ultimo *
      *                  * inventario di fine esercizio eseguito       *
      *                  *---------------------------------------------*
           move      rn-dat-ife-ese-ife   to   s-saa                  .
           add       1                    to   s-saa                  .
           move      w-prs-mes-chi        to   s-mes                  .
           move      31                   to   s-gio                  .
       det-dat-ife-220.
           move      "CD"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-sts                not  = spaces
                     subtract 1           from s-gio
                     go to det-dat-ife-220.
      *                  *---------------------------------------------*
      *                  * Data di fine esercizio in uscita            *
      *                  *---------------------------------------------*
           move      s-dat                to   w-det-dat-ife-dfe      .
      *                  *---------------------------------------------*
      *                  * Flag di uscita a 'F'                        *
      *                  *---------------------------------------------*
           move      "F"                  to   w-det-dat-ife-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-dat-ife-900.
       det-dat-ife-300.
      *              *-------------------------------------------------*
      *              * Determinazione data data di fine esercizio re-  *
      *              * lativa alla data attuale                        *
      *              *-------------------------------------------------*
           move      w-det-dat-ife-eda    to   s-saa                  .
           move      w-prs-mes-chi        to   s-mes                  .
           move      31                   to   s-gio                  .
       det-dat-ife-320.
           move      "CD"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-sts                not  = spaces
                     subtract 1           from s-gio
                     go to det-dat-ife-320.
           move      s-dat                to   w-det-dat-ife-dfe      .
      *              *-------------------------------------------------*
      *              * Determinazione data attuale + 4 mesi            *
      *              *-------------------------------------------------*
           move      w-det-dat-ife-att    to   s-dat                  .
           add       04                   to   s-mes                  .
           if        s-mes                >    12
                     subtract 12          from s-mes
                     add      1           to   s-saa                  .
      *              *-------------------------------------------------*
      *              * Se la data risultante e' inferiore alla data di *
      *              * fine esercizio relativa alla data attuale       *
      *              *-------------------------------------------------*
           if        s-dat                >    w-det-dat-ife-dfe
                     move  "I"            to   w-det-dat-ife-flg
                     go to det-dat-ife-900.
      *                  *---------------------------------------------*
      *                  * La data di fine esercizio fin qui determi-  *
      *                  * nata va' diminuita di un anno, purche' non  *
      *                  * sia gia' stato eseguito l'inventario di     *
      *                  * quell'anno                                  *
      *                  *---------------------------------------------*
           move      w-det-dat-ife-dfe    to   s-dat                  .
           subtract  1                    from s-saa                  .
           if        s-saa                not  = rn-dat-ife-ese-ife
                     move  s-dat          to   w-det-dat-ife-dfe
                     go to det-dat-ife-900.
      *                  *---------------------------------------------*
      *                  * Altrimenti si esce con forzatura ad inven-  *
      *                  * tario infrannuale                           *
      *                  *---------------------------------------------*
           move      "I"                  to   w-det-dat-ife-flg      .
       det-dat-ife-900.
      *              *-------------------------------------------------*
      *              * Close file [mmt]                                *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmt                 .
      *              *-------------------------------------------------*
      *              * Close numerazione [datife]                      *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/num/ioc/obj/indatife"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-dat-ife             .
       det-dat-ife-999.
           exit.

      *    *===========================================================*
      *    * Determinazione anno di esercizio per contabilita'         *
      *    *-----------------------------------------------------------*
       det-ese-cge-000.
      *              *-------------------------------------------------*
      *              * Determinazione anno di esercizio                *
      *              *-------------------------------------------------*
           move      w-ese-cge-dtr        to   s-dat                  .
           if        w-ese-cge-mce        =    12         or
                     s-mes                >    w-ese-cge-mce
                     move  s-saa          to   w-ese-cge-esa
                     go to det-ese-cge-500.
           subtract  1                    from s-saa                  .
           move      "NS"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-saa                to   w-ese-cge-esa          .
       det-ese-cge-500.
      *              *-------------------------------------------------*
      *              * Determinazione mese di esercizio                *
      *              *-------------------------------------------------*
           move      s-mes                to   w-ese-cge-esm          .
           if        w-ese-cge-mce        =    12
                     go to det-ese-cge-999.
           if        s-mes                >    w-ese-cge-mce
                     subtract w-ese-cge-mce
                                          from w-ese-cge-esm
                     go to det-ese-cge-999.
           if        s-mes                <    w-ese-cge-mce
                     add   12             to   w-ese-cge-esm
                     subtract w-ese-cge-mce
                                          from w-ese-cge-esm
                     go to det-ese-cge-999.
           move      12                   to   w-ese-cge-esm          .
       det-ese-cge-999.
           exit.

      *    *===========================================================*
      *    * Routine di determinazione saldo giacenza fisica           *
      *    *-----------------------------------------------------------*
       det-sld-gcf-000.
      *              *-------------------------------------------------*
      *              * Preparazione link-area                          *
      *              *-------------------------------------------------*
           move      "SL"                 to   d-sld-mag-tip-ope      .
           move      0000                 to   d-sld-mag-tip-sld      .
           move      w-det-sld-gcf-ddr    to   d-sld-mag-dat-sld      .
           move      "U"                  to   d-sld-mag-uot-dpz      .
           move      w-det-sld-gcf-dpz    to   d-sld-mag-cod-dpz      .
           move      w-det-sld-gcf-tpm    to   d-sld-mag-tip-mag      .
           move      w-det-sld-gcf-nrm    to   d-sld-mag-num-mag      .
           move      "T"                  to   d-sld-mag-uot-var      .
           move      spaces               to   d-sld-mag-var-mag      .
           move      "T"                  to   d-sld-mag-uot-dsl      .
           move      spaces               to   d-sld-mag-cod-dsl      .
      *              *-------------------------------------------------*
      *              * Richiamo del sottoprogramma                     *
      *              *-------------------------------------------------*
           perform   det-sld-mag-cll-000  thru det-sld-mag-cll-999    .
      *              *-------------------------------------------------*
      *              * Bufferizzazione valore in output                *
      *              *-------------------------------------------------*
           move      d-sld-mag-sld-mag    to   w-det-sld-gcf-sld      .
       det-sld-gcf-999.
           exit.

      *    *===========================================================*
      *    * Routine di determinazione saldo merci di terzi presso di  *
      *    * noi                                                       *
      *    *-----------------------------------------------------------*
       det-sld-mdt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valore in output                *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-sld-mdt-sld      .
       det-sld-mdt-100.
      *              *-------------------------------------------------*
      *              * Ciclo di scansione file [mmz] per individuare   *
      *              * tutti i records utili e scrittura del relativo  *
      *              * record [mim] con quantita' presunta a zero      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Start su file [mmz]                         *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "MAGARC    "         to   f-key                  .
           move      w-det-sld-mdt-esa    to   rf-mmz-ann-ese         .
           move      w-det-sld-mdt-dpz    to   rf-mmz-cod-dpz         .
           move      w-det-sld-mdt-tpm    to   rf-mmz-tip-mag         .
           move      w-det-sld-mdt-nrm    to   rf-mmz-num-mag         .
           move      spaces               to   rf-mmz-var-mag         .
           move      "T"                  to   rf-mmz-tip-ctm         .
           move      spaces               to   rf-mmz-cod-ctm         .
           move      spaces               to   rf-mmz-tip-arc         .
           move      zero                 to   rf-mmz-cod-arc         .
           move      spaces               to   rf-mmz-dpz-arc         .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
      *                      *-----------------------------------------*
      *                      * Test su esito operazione                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-sld-mdt-500.
       det-sld-mdt-120.
      *                  *---------------------------------------------*
      *                  * Lettura sequenziale record [mmz]            *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
      *                      *-----------------------------------------*
      *                      * Test se 'At end'                        *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-sld-mdt-500.
      *                  *---------------------------------------------*
      *                  * Test sul massimo                            *
      *                  *---------------------------------------------*
           if        rf-mmz-ann-ese       not  = w-det-sld-mdt-esa or
                     rf-mmz-cod-dpz       not  = w-det-sld-mdt-dpz or
                     rf-mmz-tip-mag       not  = w-det-sld-mdt-tpm or
                     rf-mmz-num-mag       not  = w-det-sld-mdt-nrm or
                     rf-mmz-var-mag       not  = spaces            or
                     rf-mmz-tip-ctm       not  = "T"
                     go to det-sld-mdt-500.
      *                  *---------------------------------------------*
      *                  * Scrittura record [mim]                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [mim]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                      *-----------------------------------------*
      *                      * Composizione record [mim]               *
      *                      *-----------------------------------------*
           move      w-det-sld-mdt-dpz    to   rf-mim-cod-dpz         .
           move      w-det-sld-mdt-tpm    to   rf-mim-tip-mag         .
           move      w-det-sld-mdt-nrm    to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      w-det-sld-mdt-afm    to   rf-mim-alf-mag         .
           move      w-det-sld-mdt-des    to   rf-mim-des-mag         .
           move      w-det-sld-mdt-umi    to   rf-mim-umi-mag         .
           move      w-det-sld-mdt-deq    to   rf-mim-dec-qta         .
           move      spaces               to   rf-mim-tip-ubi         .
           move      spaces               to   rf-mim-prm-ubi (1)     .
           move      spaces               to   rf-mim-prm-ubi (2)     .
           move      spaces               to   rf-mim-prm-ubi (3)     .
           move      spaces               to   rf-mim-prm-ubi (4)     .
           move      02                   to   rf-mim-tip-gia         .
           move      rf-mmz-cod-ctm       to   rf-mim-cod-mic         .
           move      rf-mmz-tip-arc       to   rf-mim-tip-arc         .
           move      rf-mmz-cod-arc       to   rf-mim-cod-arc         .
           move      rf-mmz-dpz-arc       to   rf-mim-dpz-arc         .
           move      zero                 to   rf-mim-qta-prs         .
           move      spaces               to   rf-mim-flg-ril         .
           move      zero                 to   rf-mim-qta-rlv         .
      *                      *-----------------------------------------*
      *                      * Scrittura record [mim]                  *
      *                      *-----------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                      *-----------------------------------------*
      *                      * Riciclo su lettura sequenziale record   *
      *                      * [mmz]                                   *
      *                      *-----------------------------------------*
           go to     det-sld-mdt-120.
       det-sld-mdt-500.
      *              *-------------------------------------------------*
      *              * Ciclo di scansione file [mim] sui records appe- *
      *              * na scritti per determinarne la giacenza ed ag-  *
      *              * giornare il record stesso                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Start su file [mim]                         *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "MAGTGC    "         to   f-key                  .
           move      w-det-sld-mdt-dpz    to   rf-mim-cod-dpz         .
           move      w-det-sld-mdt-tpm    to   rf-mim-tip-mag         .
           move      w-det-sld-mdt-nrm    to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      02                   to   rf-mim-tip-gia         .
           move      spaces               to   rf-mim-tip-arc         .
           move      zero                 to   rf-mim-cod-arc         .
           move      spaces               to   rf-mim-dpz-arc         .
           move      spaces               to   rf-mim-cod-mic         .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                      *-----------------------------------------*
      *                      * Test su esito operazione                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-sld-mdt-999.
       det-sld-mdt-520.
      *                  *---------------------------------------------*
      *                  * Lettura sequenziale record [mim]            *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                      *-----------------------------------------*
      *                      * Test se 'At end'                        *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-sld-mdt-999.
      *                  *---------------------------------------------*
      *                  * Test sul massimo                            *
      *                  *---------------------------------------------*
           if        rf-mim-cod-dpz       not  = w-det-sld-mdt-dpz or
                     rf-mim-tip-mag       not  = w-det-sld-mdt-tpm or
                     rf-mim-num-mag       not  = w-det-sld-mdt-nrm or
                     rf-mim-var-mag       not  = spaces            or
                     rf-mim-tip-gia       not  = 02
                     go to det-sld-mdt-999.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo di magazzino           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione link-area                  *
      *                      *-----------------------------------------*
           move      "SL"                 to   d-sld-mag-tip-ope      .
           move      0300                 to   d-sld-mag-tip-sld      .
           move      w-det-sld-mdt-ddr    to   d-sld-mag-dat-sld      .
           move      "U"                  to   d-sld-mag-uot-dpz      .
           move      w-det-sld-mdt-dpz    to   d-sld-mag-cod-dpz      .
           move      w-det-sld-mdt-tpm    to   d-sld-mag-tip-mag      .
           move      w-det-sld-mdt-nrm    to   d-sld-mag-num-mag      .
           move      "T"                  to   d-sld-mag-uot-var      .
           move      spaces               to   d-sld-mag-var-mag      .
           move      "U"                  to   d-sld-mag-uot-ctm      .
           move      rf-mim-cod-mic       to   d-sld-mag-cod-ctm      .
           move      rf-mim-tip-arc       to   d-sld-mag-tip-arc      .
           move      "U"                  to   d-sld-mag-uot-arc      .
           move      rf-mim-cod-arc       to   d-sld-mag-cod-arc      .
           move      "U"                  to   d-sld-mag-uot-dpa      .
           move      rf-mim-dpz-arc       to   d-sld-mag-dpz-arc      .
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           perform   det-sld-mag-cll-000  thru det-sld-mag-cll-999    .
      *                  *---------------------------------------------*
      *                  * Aggiornamento record [mim]                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se da eseguire                     *
      *                      *-----------------------------------------*
           if        d-sld-mag-sld-mag    =    zero
                     go to det-sld-mdt-580.
      *                      *-----------------------------------------*
      *                      * Aggiornamento quantita' presunta        *
      *                      *-----------------------------------------*
           move      d-sld-mag-sld-mag    to   rf-mim-qta-prs         .
      *                      *-----------------------------------------*
      *                      * Riscrittura record [mim]                *
      *                      *-----------------------------------------*
           move      "FP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
       det-sld-mdt-580.
      *                  *---------------------------------------------*
      *                  * Aggiornamento merce di terzi totale         *
      *                  *---------------------------------------------*
           add       d-sld-mag-sld-mag    to   w-det-sld-mdt-sld      .
      *                  *---------------------------------------------*
      *                  * Riciclo su lettura sequenziale record [mim] *
      *                  *---------------------------------------------*
           go to     det-sld-mdt-520.
       det-sld-mdt-999.
           exit.

      *    *===========================================================*
      *    * Routine di determinazione saldo merci presso terzi        *
      *    *-----------------------------------------------------------*
       det-sld-mpt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valore in output                *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-sld-mpt-sld      .
       det-sld-mpt-100.
      *              *-------------------------------------------------*
      *              * Ciclo di scansione file [mmz] per individuare   *
      *              * tutti i records utili e scrittura del relativo  *
      *              * record [mim] con quantita' presunta a zero      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Start su file [mmz]                         *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "MAGARC    "         to   f-key                  .
           move      w-det-sld-mpt-esa    to   rf-mmz-ann-ese         .
           move      w-det-sld-mpt-dpz    to   rf-mmz-cod-dpz         .
           move      w-det-sld-mpt-tpm    to   rf-mmz-tip-mag         .
           move      w-det-sld-mpt-nrm    to   rf-mmz-num-mag         .
           move      spaces               to   rf-mmz-var-mag         .
           move      "N"                  to   rf-mmz-tip-ctm         .
           move      spaces               to   rf-mmz-cod-ctm         .
           move      spaces               to   rf-mmz-tip-arc         .
           move      zero                 to   rf-mmz-cod-arc         .
           move      spaces               to   rf-mmz-dpz-arc         .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
      *                      *-----------------------------------------*
      *                      * Test su esito operazione                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-sld-mpt-500.
       det-sld-mpt-120.
      *                  *---------------------------------------------*
      *                  * Lettura sequenziale record [mmz]            *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmmz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mmz                 .
      *                      *-----------------------------------------*
      *                      * Test se 'At end'                        *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-sld-mpt-500.
      *                  *---------------------------------------------*
      *                  * Test sul massimo                            *
      *                  *---------------------------------------------*
           if        rf-mmz-ann-ese       not  = w-det-sld-mpt-esa or
                     rf-mmz-cod-dpz       not  = w-det-sld-mpt-dpz or
                     rf-mmz-tip-mag       not  = w-det-sld-mpt-tpm or
                     rf-mmz-num-mag       not  = w-det-sld-mpt-nrm or
                     rf-mmz-var-mag       not  = spaces            or
                     rf-mmz-tip-ctm       not  = "N"
                     go to det-sld-mpt-500.
      *                  *---------------------------------------------*
      *                  * Scrittura record [mim]                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [mim]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                      *-----------------------------------------*
      *                      * Composizione record [mim]               *
      *                      *-----------------------------------------*
           move      w-det-sld-mpt-dpz    to   rf-mim-cod-dpz         .
           move      w-det-sld-mpt-tpm    to   rf-mim-tip-mag         .
           move      w-det-sld-mpt-nrm    to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      w-det-sld-mpt-afm    to   rf-mim-alf-mag         .
           move      w-det-sld-mpt-des    to   rf-mim-des-mag         .
           move      w-det-sld-mpt-umi    to   rf-mim-umi-mag         .
           move      w-det-sld-mpt-deq    to   rf-mim-dec-qta         .
           move      spaces               to   rf-mim-tip-ubi         .
           move      spaces               to   rf-mim-prm-ubi (1)     .
           move      spaces               to   rf-mim-prm-ubi (2)     .
           move      spaces               to   rf-mim-prm-ubi (3)     .
           move      spaces               to   rf-mim-prm-ubi (4)     .
           move      03                   to   rf-mim-tip-gia         .
           move      rf-mmz-cod-ctm       to   rf-mim-cod-mic         .
           move      rf-mmz-tip-arc       to   rf-mim-tip-arc         .
           move      rf-mmz-cod-arc       to   rf-mim-cod-arc         .
           move      rf-mmz-dpz-arc       to   rf-mim-dpz-arc         .
           move      zero                 to   rf-mim-qta-prs         .
           move      spaces               to   rf-mim-flg-ril         .
           move      zero                 to   rf-mim-qta-rlv         .
      *                      *-----------------------------------------*
      *                      * Scrittura record [mim]                  *
      *                      *-----------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                      *-----------------------------------------*
      *                      * Riciclo su lettura sequenziale record   *
      *                      * [mmz]                                   *
      *                      *-----------------------------------------*
           go to     det-sld-mpt-120.
       det-sld-mpt-500.
      *              *-------------------------------------------------*
      *              * Ciclo di scansione file [mim] sui records appe- *
      *              * na scritti per determinarne la giacenza ed ag-  *
      *              * giornare il record stesso                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Start su file [mim]                         *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "MAGTGC    "         to   f-key                  .
           move      w-det-sld-mpt-dpz    to   rf-mim-cod-dpz         .
           move      w-det-sld-mpt-tpm    to   rf-mim-tip-mag         .
           move      w-det-sld-mpt-nrm    to   rf-mim-num-mag         .
           move      spaces               to   rf-mim-var-mag         .
           move      03                   to   rf-mim-tip-gia         .
           move      spaces               to   rf-mim-tip-arc         .
           move      zero                 to   rf-mim-cod-arc         .
           move      spaces               to   rf-mim-dpz-arc         .
           move      spaces               to   rf-mim-cod-mic         .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                      *-----------------------------------------*
      *                      * Test su esito operazione                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-sld-mpt-999.
       det-sld-mpt-520.
      *                  *---------------------------------------------*
      *                  * Lettura sequenziale record [mim]            *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
      *                      *-----------------------------------------*
      *                      * Test se 'At end'                        *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-sld-mpt-999.
      *                  *---------------------------------------------*
      *                  * Test sul massimo                            *
      *                  *---------------------------------------------*
           if        rf-mim-cod-dpz       not  = w-det-sld-mpt-dpz or
                     rf-mim-tip-mag       not  = w-det-sld-mpt-tpm or
                     rf-mim-num-mag       not  = w-det-sld-mpt-nrm or
                     rf-mim-var-mag       not  = spaces            or
                     rf-mim-tip-gia       not  = 03
                     go to det-sld-mpt-999.
      *                  *---------------------------------------------*
      *                  * Determinazione saldo di magazzino           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione link-area                  *
      *                      *-----------------------------------------*
           move      "SL"                 to   d-sld-mag-tip-ope      .
           move      0200                 to   d-sld-mag-tip-sld      .
           move      w-det-sld-mpt-ddr    to   d-sld-mag-dat-sld      .
           move      "U"                  to   d-sld-mag-uot-dpz      .
           move      w-det-sld-mpt-dpz    to   d-sld-mag-cod-dpz      .
           move      w-det-sld-mpt-tpm    to   d-sld-mag-tip-mag      .
           move      w-det-sld-mpt-nrm    to   d-sld-mag-num-mag      .
           move      "T"                  to   d-sld-mag-uot-var      .
           move      spaces               to   d-sld-mag-var-mag      .
           move      "U"                  to   d-sld-mag-uot-ctm      .
           move      rf-mim-cod-mic       to   d-sld-mag-cod-ctm      .
           move      rf-mim-tip-arc       to   d-sld-mag-tip-arc      .
           move      "U"                  to   d-sld-mag-uot-arc      .
           move      rf-mim-cod-arc       to   d-sld-mag-cod-arc      .
           move      "U"                  to   d-sld-mag-uot-dpa      .
           move      rf-mim-dpz-arc       to   d-sld-mag-dpz-arc      .
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           perform   det-sld-mag-cll-000  thru det-sld-mag-cll-999    .
      *                  *---------------------------------------------*
      *                  * Aggiornamento record [mim]                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se da eseguire                     *
      *                      *-----------------------------------------*
           if        d-sld-mag-sld-mag    =    zero
                     go to det-sld-mpt-580.
      *                      *-----------------------------------------*
      *                      * Aggiornamento quantita' presunta        *
      *                      *-----------------------------------------*
           move      d-sld-mag-sld-mag    to   rf-mim-qta-prs         .
      *                      *-----------------------------------------*
      *                      * Riscrittura record [mim]                *
      *                      *-----------------------------------------*
           move      "FP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmim"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mim                 .
       det-sld-mpt-580.
      *                  *---------------------------------------------*
      *                  * Aggiornamento merce presso terzi totale     *
      *                  *---------------------------------------------*
           add       d-sld-mag-sld-mag    to   w-det-sld-mpt-sld      .
      *                  *---------------------------------------------*
      *                  * Riciclo su lettura sequenziale record [mim] *
      *                  *---------------------------------------------*
           go to     det-sld-mpt-520.
       det-sld-mpt-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per determinazione saldo di magazzino         *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldmag0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per determinazione saldo di magazzino per     *
      *    * ubicazione                                                *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldubi0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

