       Identification Division.
       Program-Id.                                 pdcc450f           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    dcc                 *
      *                                Settore:    com                 *
      *                                   Fase:    dcc450              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 24/06/93    *
      *                       Ultima revisione:    NdK del 07/06/22    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Manutenzioni anagrafiche clienti            *
      *                                                                *
      *                    Sottoprogramma per esecuzione funzione di : *
      *                                                                *
      *                    Manutenzione condizioni di pagamento        *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
               10  filler                 pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Descrizione tipo interrogazione per l'overlay             *
      *    *-----------------------------------------------------------*
       01  w-des-tit-pgm-ovy              pic  x(40)       value
                     "        CONDIZIONI DI PAGAMENTO         "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-let-reg-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-let-reg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-ins-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-ins      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-mod-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-mod      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-vis-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-vis      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-snx-del      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-snx-del      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-tus.
      *            *---------------------------------------------------*
      *            * Da accettazione campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-nok      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione testata                           *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione corpo                             *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione riga corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione piede                             *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-key-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per controllo se chiave vuota                     *
      *            *---------------------------------------------------*
               10  w-cnt-key-vuo-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-nok-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per tasto Do su riga corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-rig-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su modalita' di funzionamento      *
      *        *-------------------------------------------------------*
           05  w-cnt-mfu.
      *            *---------------------------------------------------*
      *            * Tipo impostazione                                 *
      *            * - K : Impostazione campi chiave                   *
      *            * - T : Impostazione campi testata                  *
      *            * - C : Impostazione primo campo riga corpo         *
      *            * - R : Impostazione altri campi riga corpo         *
      *            * - P : Impostazione campi piede                    *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-imp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo funzione                                     *
      *            * - I : Inserimento                                 *
      *            * - M : Modifica                                    *
      *            * - V : Visualizzazione                             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-fun      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flag di controllo su status visualizzazione titolo    *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis-tit          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione chiave                               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina testata in corso di trattamento     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-npt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Salvataggio per il campo precedente               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-svp      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Si/No pagina testata in corso di trattamento      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-snp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagine componenti la testata               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-mpt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Impostazione testata                              *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione pagine di testata                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-pte.
                   15  w-cnt-sts-imp-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Ingresso in pagine di testata                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-ing-pte.
                   15  w-cnt-sts-ing-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione corpo                                *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione riga corpo                           *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione piede                                *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-pie      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di inibizione manuale tasto Delt             *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-itd      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts chiave                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts testata                   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts pagine di testata         *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-pte.
                   15  w-cnt-sts-pmt-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts corpo                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts riga accettazione corpo   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts piede                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati chiave                       *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati testata                      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati pagine di testata            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-pte.
                   15  w-cnt-sts-vis-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati riga di accettazione corpo   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati piede                        *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per trattamento corpo               *
      *        *-------------------------------------------------------*
           05  w-cnt-cor.
      *            *---------------------------------------------------*
      *            * Numero riga da accettare                          *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrg-dac      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero riga da visualizzare                       *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrg-dav      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo visualizzazione riga                         *
      *            *---------------------------------------------------*
               10  w-cnt-cor-tvi-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina corpo da visualizzare               *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrp-dav      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina corpo visualizzata                  *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrp-vis      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo aggiornamento post-riga (+ o -)              *
      *            *---------------------------------------------------*
               10  w-cnt-cor-tip-agg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Work per numero pagina riga corpo                 *
      *            *---------------------------------------------------*
               10  w-cnt-cor-pag-max      pic  9(03)                  .
               10  w-cnt-cor-pag-att      pic  9(03)                  .
               10  w-cnt-cor-pag-rem      pic  9(02)                  .
               10  w-cnt-cor-pag-ep1      pic  x(03)                  .
               10  w-cnt-cor-pag-ep2      pic  x(03)                  .
               10  w-cnt-cor-pag-npa      pic  x(09)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per variazioni                      *
      *        *-------------------------------------------------------*
           05  w-cnt-var.
      *            *---------------------------------------------------*
      *            * Flag di variazioni in testata che si ripercuotono *
      *            * su tutte le righe corpo                           *
      *            *---------------------------------------------------*
               10  w-cnt-var-tes-cor      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per Slct da primo campo riga corpo  *
      *        *-------------------------------------------------------*
           05  w-cnt-slc.
      *            *---------------------------------------------------*
      *            * Numero riga di destinazione per Slct              *
      *            *---------------------------------------------------*
               10  w-cnt-slc-num-rig      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Rappresentazione alfa del numero riga             *
      *            *---------------------------------------------------*
               10  w-cnt-slc-rap-alf.
                   15  w-cnt-slc-rap-chr
                               occurs 05  pic  x(01)                  .
               10  w-cnt-slc-rap-a01 redefines
                   w-cnt-slc-rap-alf.
                   15  w-cnt-slc-rap-chn
                               occurs 05  pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Rappresentazione numerica del numero riga         *
      *            *---------------------------------------------------*
               10  w-cnt-slc-rap-num      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per accettazioni singoli campi      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
               10  w-cnt-acc-flg-aum      pic  x(01)                  .
               10  w-cnt-acc-sav-tip      pic  x(01)                  .
               10  w-cnt-acc-sav-car      pic  9(02)                  .
               10  w-cnt-acc-sav-ldt      pic  9(02)                  .
               10  w-cnt-acc-sav-dec      pic  9(01)                  .
               10  w-cnt-acc-sav-sgn      pic  x(01)                  .
               10  w-cnt-acc-sav-edm      pic  x(10)                  .
               10  w-cnt-acc-sav-msk      pic  x(24)                  .
               10  w-cnt-acc-sav-lin      pic  9(02)                  .
               10  w-cnt-acc-sav-pos      pic  9(02)                  .
               10  w-cnt-acc-sav-alf      pic  x(80)                  .
               10  w-cnt-acc-sav-txt.
                   15  filler occurs 400  pic  x(01)                  .
               10  w-cnt-acc-sav-num      pic s9(13)v9(05)  trailing
                                                            separate
                                                            character .
               10  w-cnt-acc-sav-dat      pic  9(07)                  .
               10  w-cnt-acc-sav-ufk      pic  x(80)                  .
               10  w-cnt-acc-sav-mod      pic  x(01)                  .
               10  w-cnt-acc-sav-l23      pic  x(80)                  .
               10  w-cnt-acc-sav-l24      pic  x(80)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita per il tasto 'Exit'                *
      *            *---------------------------------------------------*
               10  w-cnt-acc-flg-exi      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work area                                             *
      *        *-------------------------------------------------------*
           05  w-cnt-wrk.
               10  w-cnt-wrk-ctr-001      pic  9(05)                  .
               10  w-cnt-wrk-ctr-002      pic  9(05)                  .
               10  w-cnt-wrk-ctr-003      pic  9(05)                  .
               10  w-cnt-wrk-ctr-008      pic  9(05)                  .
               10  w-cnt-wrk-ctr-009      pic  9(05)                  .

      *    *===========================================================*
      *    * Link-area per accettazione codice cliente commerciale     *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmndcc0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione forma di pagamento             *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmnzfp0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione del codice ABI                 *
      *    *-----------------------------------------------------------*
           copy      "pgm/abi/prg/cpy/acmnabi0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione del codice CAB                 *
      *    *-----------------------------------------------------------*
           copy      "pgm/abi/prg/cpy/acmncab0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice nostra cassa, banca, o  *
      *    * c/c postale                                               *
      *    *-----------------------------------------------------------*
           copy      "pgm/gep/prg/cpy/acdecbp0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione categoria spesa incasso        *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acodzin0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione categoria spesa bollo          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acodzbo0.acl"                   .

      *    *===========================================================*
      *    * Link-area per modulo dell'area 'svf'           'msetsvf0' *
      *    *-----------------------------------------------------------*
           copy      "pgm/svf/prg/cpy/msetsvf0.mdl"                   .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [zfp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfzfp"                          .
      *        *-------------------------------------------------------*
      *        * [zin]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfzin"                          .
      *        *-------------------------------------------------------*
      *        * [zbo]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfzbo"                          .
      *        *-------------------------------------------------------*
      *        * [axi]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxi"                          .
      *        *-------------------------------------------------------*
      *        * [axs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxs"                          .
      *        *-------------------------------------------------------*
      *        * [cbp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfcbp"                          .
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .

      *    *===========================================================*
      *    * Work-area per bufferizzazione testata                     *
      *    *-----------------------------------------------------------*
       01  w-tes.
      *        *-------------------------------------------------------*
      *        * Valori chiave                                         *
      *        *-------------------------------------------------------*
           05  w-tes-val-key.
      *            *---------------------------------------------------*
      *            * Chiavi di selezione                               *
      *            *---------------------------------------------------*
               10  w-tes-rag-min          pic  x(20)                  .
               10  w-tes-rag-max          pic  x(20)                  .
               10  w-tes-cod-min          pic  9(07)                  .
               10  w-tes-cod-max          pic  9(07)                  .
               10  w-tes-mne-min          pic  x(10)                  .
               10  w-tes-mne-max          pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Altri valori per la selezione                     *
      *            *---------------------------------------------------*
               10  w-tes-cod-fop          pic  9(07)                  .
               10  w-tes-cod-fop-sns      pic  9(01)                  .
               10  w-tes-cod-fop-des      pic  x(40)                  .
               10  w-tes-cod-abi          pic  9(05)                  .
               10  w-tes-cod-abi-den      pic  x(40)                  .
               10  w-tes-cod-abi-sns      pic  9(01)                  .
               10  w-tes-cod-cab          pic  9(05)                  .
               10  w-tes-cod-cab-den      pic  x(40)                  .
               10  w-tes-cod-cab-sns      pic  9(01)                  .
               10  w-tes-ccc-app          pic  x(12)                  .
               10  w-tes-nos-ban          pic  x(10)                  .
               10  w-tes-nos-ban-des      pic  x(40)                  .
               10  w-tes-nos-ban-sns      pic  9(01)                  .
               10  w-tes-nos-bpe          pic  x(10)                  .
               10  w-tes-nos-bpe-des      pic  x(40)                  .
               10  w-tes-nos-ccp          pic  x(10)                  .
               10  w-tes-nos-ccp-des      pic  x(40)                  .
               10  w-tes-add-spi          pic  x(03)                  .
               10  w-tes-add-spi-des      pic  x(40)                  .
               10  w-tes-add-spb          pic  x(03)                  .
               10  w-tes-add-spb-des      pic  x(40)                  .
               10  w-tes-tip-esm          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Valori sostitutivi                                *
      *            *---------------------------------------------------*
               10  w-tes-fop-sos          pic  9(07)                  .
               10  w-tes-abi-sos          pic  9(05)                  .
               10  w-tes-cab-sos          pic  9(05)                  .
               10  w-tes-nos-sos          pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Conferma impostazioni                             *
      *            *---------------------------------------------------*
               10  w-tes-cnf-imp          pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per bufferizzazione riga corpo                  *
      *    *-----------------------------------------------------------*
       01  w-rig.
           05  w-rig-001.
               10  w-rig-num-prg          pic  9(05)                  .
               10  w-rig-cod-cli          pic  9(07)                  .
               10  w-rig-dpz-cli          pic  x(04)                  .
               10  w-rig-cod-cli-rag      pic  x(40)                  .
               10  w-rig-cod-cli-mne      pic  x(10)                  .
               10  w-rig-cod-fop          pic  9(07)                  .
               10  w-rig-cod-fop-des      pic  x(40)                  .
               10  w-rig-cod-fop-mne      pic  x(10)                  .
               10  w-rig-cod-abi          pic  9(05)                  .
               10  w-rig-cod-abi-den      pic  x(40)                  .
               10  w-rig-cod-cab          pic  9(05)                  .
               10  w-rig-cod-cab-den      pic  x(40)                  .
               10  w-rig-ccc-app          pic  x(12)                  .
               10  w-rig-nos-ban          pic  x(10)                  .
               10  w-rig-nos-ban-des      pic  x(40)                  .
               10  w-rig-nos-bpe          pic  x(10)                  .
               10  w-rig-nos-bpe-des      pic  x(40)                  .
               10  w-rig-nos-ccp          pic  x(10)                  .
               10  w-rig-nos-ccp-des      pic  x(40)                  .
               10  w-rig-add-spi          pic  x(03)                  .
               10  w-rig-add-spb          pic  x(03)                  .
               10  w-rig-tip-esm          pic  9(02)                  .
               10  w-rig-ggg-alt          pic  9(02)                  .
               10  w-rig-mmm-e01          pic  9(02)                  .
               10  w-rig-mmm-e02          pic  9(02)                  .
           05  w-rig-002.
               10  filler occurs 512      pic  x(01)                  .

      *    *===========================================================*
      *    * Area di comunicazione per gestione file relative di sup-  *
      *    * porto, con buffer in grado di ospitare l'area w-rig.      *
      *    *-----------------------------------------------------------*
       01  w-rlt-sup.
           05  w-rlt-sup-ope              pic  x(02)                  .
           05  w-rlt-sup-exs              pic  x(01)                  .
           05  w-rlt-sup-prg              pic  9(05)                  .
           05  w-rlt-sup-max              pic  9(05)                  .
           05  w-rlt-sup-ctr              pic  9(05)                  .
           05  w-rlt-sup-buf.
               10  filler occurs 1024     pic  x(01)                  .

      *    *===========================================================*
      *    * Work per linea corpo a video                              *
      *    *-----------------------------------------------------------*
       01  w-lin.
      *        *-------------------------------------------------------*
      *        * Numero righe di corpo effettive visibili contempora-  *
      *        * neamente in una pagina di corpo nell'area di scroll   *
      *        *-------------------------------------------------------*
           05  w-lin-num-lin-vis          pic  9(02)       value 05   .
      *        *-------------------------------------------------------*
      *        * Numero linee di display impegnate per ogni riga corpo *
      *        * nell'area di scroll                                   *
      *        *-------------------------------------------------------*
           05  w-lin-num-lin-prc          pic  9(02)       value 01   .
      *        *-------------------------------------------------------*
      *        * Prima linea di display utilizzata per le righe corpo  *
      *        * nell'area di scroll                                   *
      *        *-------------------------------------------------------*
           05  w-lin-pri-lin-vid          pic  9(02)       value 06   .
      *        *-------------------------------------------------------*
      *        * Immagine di una riga di corpo su video                *
      *        *-------------------------------------------------------*
           05  w-lin-imm.
      *            *---------------------------------------------------*
      *            * Linee di display per ogni riga corpo in scroll    *
      *            *---------------------------------------------------*
               10  w-lin-imm-dsp.
                   15  w-lin-imm-dsp-lin occurs 01
                                          pic  x(80)                  .
      *            *---------------------------------------------------*
      *            * Riga corpo in scroll rappresentata linearmente    *
      *            *---------------------------------------------------*
               10  w-lin-imm-scr redefines
                   w-lin-imm-dsp.
      *                *-----------------------------------------------*
      *                * Numero linea                                  *
      *                *-----------------------------------------------*
                   15  w-lin-imm-num-lin  pic  x(05)                  .
      *                *-----------------------------------------------*
      *                * Altri dati visualizzati                       *
      *                *-----------------------------------------------*
                   15  filler             pic  x(02)                  .
                   15  w-lin-imm-cod-cli  pic  x(07)                  .
                   15  filler             pic  x(02)                  .
                   15  w-lin-imm-rag-cli.
                       20  w-lin-imm-rag-rag
                                          pic  x(35)                  .
                       20  w-lin-imm-rag-fil
                                          pic  x(01)                  .
                       20  w-lin-imm-rag-dpz
                                          pic  x(04)                  .
                   15  filler             pic  x(02)                  .
                   15  w-lin-imm-mne-fop  pic  x(10)                  .
                   15  filler             pic  x(01)                  .
                   15  w-lin-imm-cod-abi  pic  x(05)                  .
                   15  filler             pic  x(01)                  .
                   15  w-lin-imm-cod-cab  pic  x(05)                  .

      *    *===========================================================*
      *    * Work-area per salvataggi                                  *
      *    *-----------------------------------------------------------*
       01  w-sav.
      *        *-------------------------------------------------------*
      *        * Salvataggio per codice cliente                        *
      *        *-------------------------------------------------------*
           05  w-sav-cod-cli              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per salvataggio codice A.B.I.                    *
      *        *-------------------------------------------------------*
           05  w-sav-cod-abi              pic  9(05)                  .

      *    *===========================================================*
      *    * Work-area per coordinate di posizionamento campi          *
      *    *-----------------------------------------------------------*
       01  w-lpt.
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Forma di pagamento              *
      *        *-------------------------------------------------------*
           05  w-lpt-cod-fop-lin          pic  9(03)    value 009     .
           05  w-lpt-cod-fop-pos          pic  9(03)    value 030     .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Codice ABI                      *
      *        *-------------------------------------------------------*
           05  w-lpt-cod-abi-lin          pic  9(03)    value 011     .
           05  w-lpt-cod-abi-pos          pic  9(03)    value 030     .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Codice CAB                      *
      *        *-------------------------------------------------------*
           05  w-lpt-cod-cab-lin          pic  9(03)    value 012     .
           05  w-lpt-cod-cab-pos          pic  9(03)    value 030     .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Codice nostra banca             *
      *        *-------------------------------------------------------*
           05  w-lpt-nos-ban-lin          pic  9(03)    value 015     .
           05  w-lpt-nos-ban-pos          pic  9(03)    value 030     .

      *    *===========================================================*
      *    * Work-area per selezioni sul record [dcc]                  *
      *    *-----------------------------------------------------------*
       01  w-sel-rec-dcc.
      *        *-------------------------------------------------------*
      *        * Flag di selezione superata                            *
      *        * - spaces : selezione superata                         *
      *        * - "#"    : selezione non superata                     *
      *        *-------------------------------------------------------*
           05  w-sel-rec-dcc-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di editing                           *
      *    *-----------------------------------------------------------*
       01  w-edt.
      *        *-------------------------------------------------------*
      *        * Area editata per 5 percentuali di sconto              *
      *        *-------------------------------------------------------*
           05  w-edt-per-sco.
               10  w-edt-cst-psr occurs 5.
                   15  w-edt-psr-ele      pic  x(04)                  .
                   15  filler             pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area editata per 3 percentuali di provvigioni         *
      *        *-------------------------------------------------------*
           05  w-edt-per-pvg.
               10  w-edt-cst-ppv occurs 3.
                   15  w-edt-ppv-ele      pic  x(04)                  .
                   15  filler             pic  x(01)                  .

      *    *===========================================================*
      *    * Work per routine di Expand anagrafica cliente             *
      *    *-----------------------------------------------------------*
       01  w-rou-exp-ana.
      *        *-------------------------------------------------------*
      *        * Codice cliente                                        *
      *        *-------------------------------------------------------*
           05  w-rou-exp-ana-cod          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza cliente                             *
      *        *-------------------------------------------------------*
           05  w-rou-exp-ana-dpz          pic  x(04)                  .

      *    *===========================================================*
      *    * Work per routine di caricamento righe                     *
      *    *-----------------------------------------------------------*
       01  w-car-eff-rig.
      *        *-------------------------------------------------------*
      *        * Contatore elementi caricati                           *
      *        *-------------------------------------------------------*
           05  w-car-eff-rig-ctr          pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Numero massimo elementi da caricare                   *
      *        *-------------------------------------------------------*
           05  w-car-eff-rig-max          pic  9(06)   value 099999   .
      *        *-------------------------------------------------------*
      *        * Flag di superamento numero massimo elementi           *
      *        *-------------------------------------------------------*
           05  w-car-eff-rig-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo esclusione mesi                       *
      *        *-------------------------------------------------------*
           05  w-exp-tip-esm.
               10  w-exp-tip-esm-num      pic  9(02)       value 4    .
               10  w-exp-tip-esm-lun      pic  9(02)       value 40   .
               10  w-exp-tip-esm-tbl.
                   15  filler             pic  x(40) value
                            "Tutti                                   ".
                   15  filler             pic  x(40) value
                            "Nessun mese di esclusione scadenze      ".
                   15  filler             pic  x(40) value
                            "Stesso giorno del mese successivo       ".
                   15  filler             pic  x(40) value
                            "Un giorno fisso del mese successivo     ".
      *        *-------------------------------------------------------*
      *        * Work per : Tipo esclusione mesi per le righe          *
      *        *-------------------------------------------------------*
           05  w-exp-rig-esm.
               10  w-exp-rig-esm-num      pic  9(02)       value 3    .
               10  w-exp-rig-esm-lun      pic  9(02)       value 40   .
               10  w-exp-rig-esm-tbl.
                   15  filler             pic  x(40) value
                            "Nessun mese di esclusione scadenze      ".
                   15  filler             pic  x(40) value
                            "Stesso giorno del mese successivo       ".
                   15  filler             pic  x(40) value
                            "Un giorno fisso del mese successivo     ".

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zfp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zfp.
               10  w-let-arc-zfp-flg      pic  x(01)                  .
               10  w-let-arc-zfp-cod      pic  9(07)                  .
               10  w-let-arc-zfp-des      pic  x(40)                  .
               10  w-let-arc-zfp-mne      pic  x(10)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zin]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zin.
               10  w-let-arc-zin-flg      pic  x(01)                  .
               10  w-let-arc-zin-cod      pic  x(03)                  .
               10  w-let-arc-zin-des      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zbo]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zbo.
               10  w-let-arc-zbo-flg      pic  x(01)                  .
               10  w-let-arc-zbo-cod      pic  x(03)                  .
               10  w-let-arc-zbo-des      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [axi]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-axi.
               10  w-let-arc-axi-flg      pic  x(01)                  .
               10  w-let-arc-axi-cod      pic  9(05)                  .
               10  w-let-arc-axi-den      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [axs]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-axs.
               10  w-let-arc-axs-flg      pic  x(01)                  .
               10  w-let-arc-axs-abi      pic  9(05)                  .
               10  w-let-arc-axs-cab      pic  9(05)                  .
               10  w-let-arc-axs-den      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [cbp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-cbp.
               10  w-let-arc-cbp-flg      pic  x(01)                  .
               10  w-let-arc-cbp-tip      pic  9(02)                  .
               10  w-let-arc-cbp-cod      pic  x(10)                  .
               10  w-let-arc-cbp-des      pic  x(40)                  .
               10  w-let-arc-cbp-csc      pic  9(07)                  .
               10  w-let-arc-cbp-csa      pic  9(07)                  .
               10  w-let-arc-cbp-abi      pic  9(05)                  .
               10  w-let-arc-cbp-cab      pic  9(05)                  .
               10  w-let-arc-cbp-ccb      pic  x(12)                  .
               10  w-let-arc-cbp-cco      pic  9(07)                  .
               10  w-let-arc-cbp-bba      pic  9(07)                  .
               10  w-let-arc-cbp-bbp      pic  9(07)                  .
               10  w-let-arc-cbp-psm      pic  9(07)                  .
               10  w-let-arc-cbp-psi      pic  9(07)                  .
               10  w-let-arc-cbp-pdi      pic  9(07)                  .
               10  w-let-arc-cbp-psc      pic  9(07)                  .
               10  w-let-arc-cbp-anv      pic  9(07)                  .
               10  w-let-arc-cbp-dfp      pic  9(07)                  .
               10  w-let-arc-cbp-dfa      pic  9(07)                  .
               10  w-let-arc-cbp-onb      pic  9(07)                  .
               10  w-let-arc-cbp-inb      pic  9(07)                  .
               10  w-let-arc-cbp-ccp      pic  x(12)                  .
               10  w-let-arc-cbp-bpa      pic  9(07)                  .
               10  w-let-arc-cbp-bpp      pic  9(07)                  .

      *    *===========================================================*
      *    * Work-area per visualizzazioni                             *
      *    *-----------------------------------------------------------*
       01  w-vis.
      *        *-------------------------------------------------------*
      *        * Comodo per visualizzazione literal di sostituzione    *
      *        *-------------------------------------------------------*
           05  w-vis-lit-sos              pic  x(50)                  .

      *    *===========================================================*
      *    * Work-area per variabili di i.p.c. eventualmente passate   *
      *    * dal chiamante                                             *
      *    *-----------------------------------------------------------*
       01  w-ipc.
      *        *-------------------------------------------------------*
      *        * Per tipo di chiamante del sottoprogramma              *
      *        *-------------------------------------------------------*
           05  w-ipc-tdc-mos.
      *            *---------------------------------------------------*
      *            * Si/No variabile di i.p.c. relativa al tipo di     *
      *            * chiamante del sottoprogramma                      *
      *            *---------------------------------------------------*
               10  w-ipc-tdc-mos-snx      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Valore della variabile di i.p.c. relativa al tipo *
      *            * di chiamante del sottoprogramma                   *
      *            * - M : Il main                                     *
      *            * - S : Un altro sottoprogramma                     *
      *            *---------------------------------------------------*
               10  w-ipc-tdc-mos-val      pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale                         *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Link-area comune per programmi della serie pdcc4500       *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/pdcc4500.pgl"                   .

      ******************************************************************
       Procedure Division                using i-ide
                                               w-ovy-exe
                                               w-tmn
                                               w-spg
                                               w-prs                  .
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
       main-050.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-800.
       main-100.
      *              *-------------------------------------------------*
      *              * Accettazione campi chiave                       *
      *              *-------------------------------------------------*
           perform   acc-key-reg-000      thru acc-key-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita "E" : fine programma         *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-key    =    "E"
                     go to main-800.
      *              *-------------------------------------------------*
      *              * Lettura registrazione pre-esistente             *
      *              *-------------------------------------------------*
           perform   rou-let-reg-000      thru rou-let-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se esito negativo : riciclo su chiave       *
      *                  *---------------------------------------------*
           if        w-cnt-rou-let-reg    not  = spaces
                     go to main-100.
      *              *-------------------------------------------------*
      *              * Routine pre-accettazione campi non chiave       *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     go to main-130
           else if   w-cnt-mfu-tip-fun    =    "M"
                     go to main-140
           else if   w-cnt-mfu-tip-fun    =    "V"
                     go to main-150
           else      go to main-100.
       main-130.
           move      spaces               to   w-cnt-pre-acc-ins      .
           perform   pre-acc-ins-000      thru pre-acc-ins-999        .
           if        w-cnt-pre-acc-ins    =    spaces
                     go to main-180
           else      go to main-100.
       main-140.
           move      spaces               to   w-cnt-pre-acc-mod      .
           perform   pre-acc-mod-000      thru pre-acc-mod-999        .
           if        w-cnt-pre-acc-mod    =    spaces
                     go to main-180
           else      go to main-100.
       main-150.
           move      spaces               to   w-cnt-pre-acc-vis      .
           perform   pre-acc-vis-000      thru pre-acc-vis-999        .
           if        w-cnt-pre-acc-vis    =    spaces
                     go to main-180
           else      go to main-100.
       main-180.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di modifica di almeno un   *
      *              * campo non chiave                                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-flg-aum      .
      *              *-------------------------------------------------*
      *              * Accettazione campi non chiave                   *
      *              *-------------------------------------------------*
           perform   acc-nok-reg-000      thru acc-nok-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "E"
                     go to main-200.
      *                      *-----------------------------------------*
      *                      * Routine post-exit su campi non chiave   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se Inserimento                      *
      *                          *-------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-exi-ins-000
                                          thru pos-exi-ins-999
      *                          *-------------------------------------*
      *                          * Se Modifica                         *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-exi-mod-000
                                          thru pos-exi-mod-999
      *                          *-------------------------------------*
      *                          * Se Visualizzazione                  *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "V"
                     perform   pos-exi-vis-000
                                          thru pos-exi-vis-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-200.
      *                  *---------------------------------------------*
      *                  * Se uscita per annullamento                  *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "X"
                     go to main-300.
      *                      *-----------------------------------------*
      *                      * Routine post-conferma di annullamento   *
      *                      *-----------------------------------------*
           perform   pos-cnf-ann-000      thru pos-cnf-ann-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-300.
      *                  *---------------------------------------------*
      *                  * Se uscita per conferma                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Routine post-conferma                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se post-conferma di Inserimento     *
      *                          *-------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-cnf-ins-000
                                          thru pos-cnf-ins-999
      *                          *-------------------------------------*
      *                          * Se post-conferma di Modifica        *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-cnf-mod-000
                                          thru pos-cnf-mod-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione routine post-esecuzione programma    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-exe-pgm      .
           perform   pos-exe-pgm-000      thru pos-exe-pgm-999        .
           if        w-cnt-pos-exe-pgm    not  = spaces
                     go to main-050.
       main-900.
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Prsc :                        *
      *              * - se in tipo impostazione testata e su pagina   *
      *              *   maggiore di 1 : abilitato                     *
      *              * - altrimenti    : invariato                     *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "T" and
                     w-cnt-sts-imp-npt    >    1
                     move  "PRSC"         to   v-pfk (07)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Nxsc :                        *
      *              * - se in tipo impostazione testata e se pagina   *
      *              *   gia' completamente impostata o testata gia'   *
      *              *   completamente impostata : abilitato           *
      *              *  - altrimenti             : invariato           *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    not  = "T"
                     go to exe-acc-cmp-050.
           if        w-cnt-sts-imp-tes    not  = spaces or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     move  "NXSC"         to   v-pfk (08)             .
       exe-acc-cmp-050.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Delt :                        *
      *              *  - se Impostazione chiave    : non abilitato    *
      *              *  - se Altri campi corpo      : non abilitato    *
      *              *  - se Inserimento            : non abilitato    *
      *              *  - se Visualizzazione        : non abilitato    *
      *              *  - se Disabilitato manualm.  : non abilitato    *
      *              *  - se Almeno una modifica    : non abilitato    *
      *              *  - altrimenti                : abilitato        *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "K"      or
                     w-cnt-mfu-tip-imp    =    "R"      or
                     w-cnt-mfu-tip-fun    =    "I"      or
                     w-cnt-mfu-tip-fun    =    "V"      or
                     w-cnt-sts-imp-itd    not  = spaces or
                     w-cnt-acc-flg-aum    not  = spaces
                     go to exe-acc-cmp-100.
           move      "DELT"               to   v-pfk (19)             .
       exe-acc-cmp-100.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Do :                          *
      *              *  - se Visualizzazione     : disabilitato        *
      *              *  - altrimenti             : inalterato          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     move  spaces         to   v-pfk (05)             .
      *              *-------------------------------------------------*
      *              * Tasti di funzione Insr e Remv :                 *
      *              *  - se Visualizzazione e in                      *
      *              *    primo campo riga corpo : disabilitati        *
      *              *  - altrimenti             : inalterati          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V" and
                     w-cnt-mfu-tip-imp    =    "C"
                     move  spaces         to   v-pfk (04)
                     move  spaces         to   v-pfk (06)             .
      *              *-------------------------------------------------*
      *              * Salvataggio parametri di accettazione           *
      *              *-------------------------------------------------*
           move      v-tip                to   w-cnt-acc-sav-tip      .
           move      v-car                to   w-cnt-acc-sav-car      .
           move      v-lin                to   w-cnt-acc-sav-lin      .
           move      v-pos                to   w-cnt-acc-sav-pos      .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  v-alf          to   w-cnt-acc-sav-alf      .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  v-dec          to   w-cnt-acc-sav-dec
                     move  v-sgn          to   w-cnt-acc-sav-sgn
                     move  v-edm          to   w-cnt-acc-sav-edm
                     move  v-msk          to   w-cnt-acc-sav-msk
                     move  v-num          to   w-cnt-acc-sav-num      .
           if        v-tip                =    "D"
                     move  v-dat          to   w-cnt-acc-sav-dat      .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  v-ldt          to   w-cnt-acc-sav-ldt
                     move  v-txt          to   w-cnt-acc-sav-txt      .
           move      v-ufk                to   w-cnt-acc-sav-ufk      .
       exe-acc-cmp-200.
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Memorizzazione segnale di campo modificato      *
      *              *-------------------------------------------------*
           move      v-mod                to   w-cnt-acc-sav-mod      .
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-600.
      *              *-------------------------------------------------*
      *              * Se il campo impostato ha modificato il valore   *
      *              * precedente : ripetizione impostazione           *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     go to exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Routine pre-richiesta di ratifica tasto Delete  *
      *              *-------------------------------------------------*
           perform   pre-snx-del-000      thru pre-snx-del-999        .
      *              *-------------------------------------------------*
      *              * Se errore : a ripristino                        *
      *              *-------------------------------------------------*
           if        w-cnt-pre-snx-del    not  = spaces
                     go to exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Salvataggio linee 23 e 24 di note operative     *
      *              *-------------------------------------------------*
           move      "GL"                 to   v-ope                  .
           move      23                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l23      .
           move      "GL"                 to   v-ope                  .
           move      24                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l24      .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative attuali            *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      spaces               to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Richiesta conferma annullamento                 *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#DEL"               to   v-not                  .
           move      "N"                  to   v-alf                  .
           move      "SN"                 to   v-msk                  .
           move      "DELT"               to   v-pfk (19)             .
           move      "UP  "               to   v-pfk (02)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                =    spaces
                     if      v-alf        =    "S"
                             move  "DELT" to   v-key
                     else    move  "UP  " to   v-key                  .
      *              *-------------------------------------------------*
      *              * Se non function key DELT si ripristina          *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Routine post-richiesta di ratifica tasto Delete *
      *              *-------------------------------------------------*
           perform   pos-snx-del-000      thru pos-snx-del-999        .
      *              *-------------------------------------------------*
      *              * Se errore : a ripristino                        *
      *              *-------------------------------------------------*
           if        w-cnt-pos-snx-del    not  = spaces
                     go to exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Altrimenti : uscita                             *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-999.
       exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Ripristino linee 23 e 24 di note operative      *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      w-cnt-acc-sav-l23    to   v-nt1                  .
           move      w-cnt-acc-sav-l24    to   v-nt2                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Ripristino parametri di impostazione            *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      w-cnt-acc-sav-tip    to   v-tip                  .
           move      w-cnt-acc-sav-car    to   v-car                  .
           move      w-cnt-acc-sav-lin    to   v-lin                  .
           move      w-cnt-acc-sav-pos    to   v-pos                  .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-alf
                                          to   v-alf                  .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-dec
                                          to   v-dec
                     move  w-cnt-acc-sav-sgn
                                          to   v-sgn
                     move  w-cnt-acc-sav-edm
                                          to   v-edm
                     move  w-cnt-acc-sav-msk
                                          to   v-msk
                     move  w-cnt-acc-sav-num
                                          to   v-num                  .
           if        v-tip                =    "D"
                     move  w-cnt-acc-sav-dat
                                          to   v-dat                  .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-ldt
                                          to   v-ldt
                     move  w-cnt-acc-sav-txt
                                          to   v-txt                  .
           move      w-cnt-acc-sav-ufk    to   v-ufk                  .
      *              *-------------------------------------------------*
      *              * Ritorno alla impostazione                       *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-200.
       exe-acc-cmp-600.
      *              *-------------------------------------------------*
      *              * Flag globale di avvenuta almeno una modifica    *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     move  "#"            to   w-cnt-acc-flg-aum      .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           perform   vis-tip-fun-000      thru vis-tip-fun-999        .
       exe-acc-cmp-800.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "EXIT"
                     go to exe-acc-cmp-999.
      *                  *---------------------------------------------*
      *                  * Subroutine di controllo per Exit            *
      *                  *---------------------------------------------*
           perform   exe-acc-cmp-exi-000  thru exe-acc-cmp-exi-999    .
      *                  *---------------------------------------------*
      *                  * Se Exit non attivato : a ripristino para-   *
      *                  * metri di impostazione                       *
      *                  *---------------------------------------------*
           if        w-cnt-acc-flg-exi    not  = spaces
                     go to exe-acc-cmp-400.
      *                  *---------------------------------------------*
      *                  * Altrimenti : uscita                         *
      *                  *---------------------------------------------*
           go to     exe-acc-cmp-999.
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *                                                           *
      *    * Subroutine di controllo tasto 'Exit'                      *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-exi-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-flg-exi      .
       exe-acc-cmp-exi-050.
      *              *-------------------------------------------------*
      *              * Se impostazione campi chiave : si ignora        *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "K"
                     go to exe-acc-cmp-exi-920.
      *              *-------------------------------------------------*
      *              * Se in visualizzazione : si ignora               *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to exe-acc-cmp-exi-920.
      *              *-------------------------------------------------*
      *              * Se in impostazione altri campi riga corpo : si  *
      *              * ignora                                          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "R"
                     go to exe-acc-cmp-exi-920.
      *              *-------------------------------------------------*
      *              * Se non avvenuta alcuna modifica : si ignora     *
      *              *-------------------------------------------------*
           if        w-cnt-acc-flg-aum    =    spaces
                     go to exe-acc-cmp-exi-920.
       exe-acc-cmp-exi-100.
      *              *-------------------------------------------------*
      *              * Salvataggio linee 23 e 24 di note operative     *
      *              *-------------------------------------------------*
           move      "GL"                 to   v-ope                  .
           move      23                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l23      .
           move      "GL"                 to   v-ope                  .
           move      24                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l24      .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative attuali            *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      spaces               to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Richiesta conferma di uscita                    *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#EXI"               to   v-not                  .
           move      "N"                  to   v-alf                  .
           move      "SN"                 to   v-msk                  .
           move      "EXIT"               to   v-pfk (20)             .
           move      "UP  "               to   v-pfk (02)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                =    spaces
                     if      v-alf        =    "S"
                             move  "EXIT" to   v-key
                     else    move  "UP  " to   v-key                  .
      *              *-------------------------------------------------*
      *              * Se non function key EXIT si ripristina          *
      *              *-------------------------------------------------*
           if        v-key                not  = "EXIT"
                     go to exe-acc-cmp-exi-600.
      *              *-------------------------------------------------*
      *              * Altrimenti : ad Exit attivato                   *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-exi-800.
       exe-acc-cmp-exi-600.
      *              *-------------------------------------------------*
      *              * Se uscita senza Exit                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di Exit non attivato                   *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-acc-flg-exi      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     exe-acc-cmp-exi-900.
       exe-acc-cmp-exi-800.
      *              *-------------------------------------------------*
      *              * Se uscita con Exit                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     exe-acc-cmp-exi-900.
       exe-acc-cmp-exi-900.
      *              *-------------------------------------------------*
      *              * Ripristino linee 23 e 24 di note operative      *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      w-cnt-acc-sav-l23    to   v-nt1                  .
           move      w-cnt-acc-sav-l24    to   v-nt2                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-exi-920.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-exi-999.
       exe-acc-cmp-exi-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Test su flag di visualizzazione titolo          *
      *              *-------------------------------------------------*
           if        w-cnt-sts-vis-tit    not  = spaces
                     move  spaces         to   w-cnt-sts-vis-tit
                     go to vis-tit-pgm-999.
       vis-tit-pgm-100.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se impostazione chiave effettuata      *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-key    not  = spaces
                     go to vis-tit-pgm-200.
      *                  *---------------------------------------------*
      *                  * Erase video                                 *
      *                  *---------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-200.
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           perform   vis-tit-pgm-des-000  thru vis-tit-pgm-des-999    .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *                                                           *
      *    * Trattamento descrizione del programma                     *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-des-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione della fase di accetta-   *
      *              * zione                                           *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "C" or
                     w-cnt-mfu-tip-imp    =    "R" or
                     w-cnt-mfu-tip-imp    =    "T"
                     go to vis-tit-pgm-des-500.
       vis-tit-pgm-des-200.
      *              *-------------------------------------------------*
      *              * Prima pagina                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se programma richiamato                *
      *                  *---------------------------------------------*
           if        w-ipc-tdc-mos-val    not  = "S"
                     move  w-des-tit-pgm-ovy
                                          to   w-all-str-alf
                     go to vis-tit-pgm-des-250.
      *                  *---------------------------------------------*
      *                  * Concatenamento                              *
      *                  *---------------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      w-des-tit-pgm-ovy    to   w-all-str-cat (1)      .
           move      "[SET]"              to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                  *---------------------------------------------*
      *                  * Allineamento al centro descrizione          *
      *                  *---------------------------------------------*
           move      40                   to   w-all-str-lun          .
           perform   all-str-cen-000      thru all-str-cen-999        .
       vis-tit-pgm-des-250.
      *                  *---------------------------------------------*
      *                  * Descrizione del programma                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-tit-pgm-des-900.
       vis-tit-pgm-des-500.
      *              *-------------------------------------------------*
      *              * Pagine successive                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Concatenamento con numero di record         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing numero record                   *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-car-eff-rig-ctr    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Concatenamento                          *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      w-des-tit-pgm-ovy    to   w-all-str-cat (1)      .
           move      "{"                  to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *
           move      03                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      "}"                  to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                      *-----------------------------------------*
      *                      * Allineamento al centro descrizione      *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                      *-----------------------------------------*
      *                      * Visualizzazione dati documento          *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-tit-pgm-des-900.
       vis-tit-pgm-des-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-tit-pgm-des-999.
       vis-tit-pgm-des-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione tipo funzionamento                        *
      *    *-----------------------------------------------------------*
       vis-tip-fun-000.
           move      "TF"                 to   v-ope                  .
           move      w-cnt-mfu-tip-fun    to   v-tfu                  .
           move      w-cnt-acc-flg-aum    to   v-tfm                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Lettura della variabile eventuale di i.p.c. per *
      *              * il tipo di chiamante del sottoprogramma, se il  *
      *              * main oppure se un altro sottoprogramma          *
      *              *-------------------------------------------------*
           perform   ipc-tdc-mos-000      thru ipc-tdc-mos-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione titolo programma                *
      *              *-------------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
           move      "#"                  to   w-cnt-sts-vis-tit      .
      *              *-------------------------------------------------*
      *              * Open dei moduli di accettazione                 *
      *              *-------------------------------------------------*
           perform   opn-mdl-acc-000      thru opn-mdl-acc-999        .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Personalizzazione relativa al tipo di ordi- *
      *                  * namento anagrafiche clienti                 *
      *                  *---------------------------------------------*
           perform   prs-tip-ord-000      thru prs-tip-ord-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura della variabile eventuale di i.p.c. per il tipo   *
      *    * di chiamante del sottoprogramma, se il main o un altro    *
      *    * sottoprogramma                                            *
      *    *-----------------------------------------------------------*
       ipc-tdc-mos-000.
      *              *-------------------------------------------------*
      *              * Estrazione della variabile 'tdc-mos' dallo      *
      *              * stesso livello di profondita'                   *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "tdc-mos"            to   s-var                  .
           move      "="                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito dell'operazione *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     go to ipc-tdc-mos-200
           else      go to ipc-tdc-mos-400.
       ipc-tdc-mos-200.
      *              *-------------------------------------------------*
      *              * Se variabile esistente                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile esistente              *
      *                  *---------------------------------------------*
           move      "S"                  to   w-ipc-tdc-mos-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile                      *
      *                  *---------------------------------------------*
           move      s-alf                to   w-ipc-tdc-mos-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-tdc-mos-999.
       ipc-tdc-mos-400.
      *              *-------------------------------------------------*
      *              * Se variabile non esistente                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile non esistente          *
      *                  *---------------------------------------------*
           move      "N"                  to   w-ipc-tdc-mos-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile a spaces             *
      *                  *---------------------------------------------*
           move      spaces               to   w-ipc-tdc-mos-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-tdc-mos-999.
       ipc-tdc-mos-999.
           exit.

      *    *===========================================================*
      *    * Lettura della personalizzazione per il tipo ordinamento   *
      *    *-----------------------------------------------------------*
       prs-tip-ord-000.
      *              *-------------------------------------------------*
      *              * Lettura della personalizzazione                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione work-area                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-prs-tip-ord-tip      .
      *                  *---------------------------------------------*
      *                  * Lettura personalizzazione                   *
      *                  *---------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/dcc/com/dcc450[tip-ord]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        s-ves                not  = spaces
                     go to prs-tip-ord-500.
      *                  *---------------------------------------------*
      *                  * Valore personalizzazione in work-area       *
      *                  *---------------------------------------------*
           move      s-alf                to   w-prs-tip-ord-tip      .
      *                  *---------------------------------------------*
      *                  * Controllo personalizzazione                 *
      *                  *---------------------------------------------*
           if        w-prs-tip-ord-tip    not  = "R" and
                     w-prs-tip-ord-tip    not  = "C" and
                     w-prs-tip-ord-tip    not  = "M"
                     move  spaces         to   w-prs-tip-ord-tip      .
       prs-tip-ord-500.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del valore della per-  *
      *                  * sonalizzazione letta                        *
      *                  *---------------------------------------------*
           if        w-prs-tip-ord-tip    =    spaces
                     go to prs-tip-ord-600
           else      go to prs-tip-ord-999.
       prs-tip-ord-600.
      *                  *---------------------------------------------*
      *                  * Se la personalizzazione non esprime nessuna *
      *                  * preferenza , l'ordinamento sara' per ragio- *
      *                  * ne sociale                                  *
      *                  *---------------------------------------------*
           move      "R"                  to   w-prs-tip-ord-tip      .
           go to     prs-tip-ord-999.
       prs-tip-ord-999.
           exit.

      *    *===========================================================*
      *    * Routine post-esecuzione programma                         *
      *    *-----------------------------------------------------------*
       pos-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Close dei moduli di accettazione                *
      *              *-------------------------------------------------*
           perform   cls-mdl-acc-000      thru cls-mdl-acc-999        .
       pos-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Open dei moduli di accettazione                           *
      *    *-----------------------------------------------------------*
       opn-mdl-acc-000.
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice cliente commer- *
      *              * ciale                                           *
      *              *-------------------------------------------------*
           perform   cod-mne-dcc-opn-000  thru cod-mne-dcc-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione forma di pagamento     *
      *              *-------------------------------------------------*
           perform   cod-mne-zfp-opn-000  thru cod-mne-zfp-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice ABI             *
      *              *-------------------------------------------------*
           perform   cod-mne-abi-opn-000  thru cod-mne-abi-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice CAB             *
      *              *-------------------------------------------------*
           perform   cod-mne-cab-opn-000  thru cod-mne-cab-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice nostra cassa,   *
      *              * banca, o c/c postale                            *
      *              *-------------------------------------------------*
           perform   cod-des-cbp-opn-000  thru cod-des-cbp-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice categoria spese *
      *              * incasso                                         *
      *              *-------------------------------------------------*
           perform   cod-cod-spi-opn-000  thru cod-cod-spi-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice categoria spese *
      *              * bollo                                           *
      *              *-------------------------------------------------*
           perform   cod-cod-spb-opn-000  thru cod-cod-spb-opn-999    .
       opn-mdl-acc-999.
           exit.

      *    *===========================================================*
      *    * Close dei moduli di accettazione                          *
      *    *-----------------------------------------------------------*
       cls-mdl-acc-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice cliente com-   *
      *              * merciale                                        *
      *              *-------------------------------------------------*
           perform   cod-mne-dcc-cls-000  thru cod-mne-dcc-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione forma di pagamento    *
      *              *-------------------------------------------------*
           perform   cod-mne-zfp-cls-000  thru cod-mne-zfp-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice ABI            *
      *              *-------------------------------------------------*
           perform   cod-mne-abi-cls-000  thru cod-mne-abi-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice CAB            *
      *              *-------------------------------------------------*
           perform   cod-mne-cab-cls-000  thru cod-mne-cab-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice nostra cassa,  *
      *              * banca, o c/c postale                            *
      *              *-------------------------------------------------*
           perform   cod-des-cbp-cls-000  thru cod-des-cbp-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice categoria spe- *
      *              * se incasso                                      *
      *              *-------------------------------------------------*
           perform   cod-cod-spi-cls-000  thru cod-cod-spi-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice categoria spe- *
      *              * se bollo                                        *
      *              *-------------------------------------------------*
           perform   cod-cod-spb-cls-000  thru cod-cod-spb-cls-999    .
       cls-mdl-acc-999.
           exit.

      *    *===========================================================*
      *    * Open files                                                *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [zfp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zfp                 .
      *              *-------------------------------------------------*
      *              * [zin]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzin"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zin                 .
      *              *-------------------------------------------------*
      *              * [zbo]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzbo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zbo                 .
      *              *-------------------------------------------------*
      *              * [axi]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
      *              *-------------------------------------------------*
      *              * [axs]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
      *              *-------------------------------------------------*
      *              * [cbp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * Open modulo per la generazione set              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da eseguire                         *
      *                  *---------------------------------------------*
           if        w-ipc-tdc-mos-val    not  = "S"
                     go to rou-opn-fls-800.
      *                  *---------------------------------------------*
      *                  * Open                                        *
      *                  *---------------------------------------------*
           perform   mdl-gen-set-opn-000  thru mdl-gen-set-opn-999    .
       rou-opn-fls-800.
      *              *-------------------------------------------------*
      *              * File relative di supporto                       *
      *              *-------------------------------------------------*
           move      "OP"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files                                               *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [zfp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zfp                 .
      *              *-------------------------------------------------*
      *              * [zin]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzin"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zin                 .
      *              *-------------------------------------------------*
      *              * [zbo]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzbo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zbo                 .
      *              *-------------------------------------------------*
      *              * [axi]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
      *              *-------------------------------------------------*
      *              * [axs]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
      *              *-------------------------------------------------*
      *              * [cbp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * Close modulo per la generazione set             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da eseguire                         *
      *                  *---------------------------------------------*
           if        w-ipc-tdc-mos-val    not  = "S"
                     go to rou-cls-fls-800.
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           perform   mdl-gen-set-cls-000  thru mdl-gen-set-cls-999    .
       rou-cls-fls-800.
      *              *-------------------------------------------------*
      *              * File relative di supporto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
      *                  *---------------------------------------------*
      *                  * Cancel                                      *
      *                  *---------------------------------------------*
           perform   cnc-rlt-sup-000      thru cnc-rlt-sup-999        .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi chiave della registrazione             *
      *    *-----------------------------------------------------------*
       acc-key-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-fun      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo impostazione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-sts-imp-npt      .
           move      spaces               to   w-cnt-sts-imp-key
                                               w-cnt-sts-imp-tes
                                               w-cnt-sts-imp-pte
                                               w-cnt-sts-ing-pte
                                               w-cnt-sts-imp-cor
                                               w-cnt-sts-imp-rig
                                               w-cnt-sts-imp-pie
                                               w-cnt-sts-imp-itd      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key
                                               w-cnt-sts-pmt-tes
                                               w-cnt-sts-pmt-pte
                                               w-cnt-sts-pmt-cor
                                               w-cnt-sts-pmt-rig
                                               w-cnt-sts-pmt-pie      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-key
                                               w-cnt-sts-vis-tes
                                               w-cnt-sts-vis-pte
                                               w-cnt-sts-vis-cor
                                               w-cnt-sts-vis-rig
                                               w-cnt-sts-vis-pie      .
      *              *-------------------------------------------------*
      *              * Normalizzazione area di controllo variazioni    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-var-tes-cor      .
      *              *-------------------------------------------------*
      *              * Normalizzazione registrazione                   *
      *              *-------------------------------------------------*
           perform   nor-key-nok-000      thru nor-key-nok-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           perform   pmt-key-reg-000      thru pmt-key-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per prima pagina testata            *
      *                  *---------------------------------------------*
           perform   pmt-tes-reg-000      thru pmt-tes-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : chiave                      *
      *              *-------------------------------------------------*
           move      "K"                  to   w-cnt-mfu-tip-imp      .
       acc-key-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Ordinatore minimo e massimo                 *
      *                  *---------------------------------------------*
           perform   acc-ord-mem-000      thru acc-ord-mem-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
       acc-key-reg-200.
      *                  *---------------------------------------------*
      *                  * Codice forma di pagamento                   *
      *                  *---------------------------------------------*
           perform   acc-cod-fop-000      thru acc-cod-fop-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-100.
       acc-key-reg-250.
      *                  *---------------------------------------------*
      *                  * Codice  A.B.I.                              *
      *                  *---------------------------------------------*
           perform   acc-cod-abi-000      thru acc-cod-abi-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-200.
       acc-key-reg-300.
      *                  *---------------------------------------------*
      *                  * Codice  C.A.B.                              *
      *                  *---------------------------------------------*
           perform   acc-cod-cab-000      thru acc-cod-cab-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-250.
       acc-key-reg-350.
      *                  *---------------------------------------------*
      *                  * Conto corrente del cliente                  *
      *                  *---------------------------------------------*
           perform   acc-ccc-app-000      thru acc-ccc-app-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-300.
       acc-key-reg-400.
      *                  *---------------------------------------------*
      *                  * Codice nostra banca                         *
      *                  *---------------------------------------------*
           perform   acc-nos-ban-000      thru acc-nos-ban-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-350.
       acc-key-reg-420.
      *                  *---------------------------------------------*
      *                  * Codice nostra banca presentazione effetti   *
      *                  *---------------------------------------------*
           perform   acc-nos-bpe-000      thru acc-nos-bpe-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-400.
       acc-key-reg-450.
      *                  *---------------------------------------------*
      *                  * Codice nostro c/c postale                   *
      *                  *---------------------------------------------*
           perform   acc-nos-ccp-000      thru acc-nos-ccp-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-420.
       acc-key-reg-500.
      *                  *---------------------------------------------*
      *                  * Addebito spese incasso                      *
      *                  *---------------------------------------------*
           perform   acc-add-spi-000      thru acc-add-spi-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-450.
       acc-key-reg-550.
      *                  *---------------------------------------------*
      *                  * Addebito spese bollo                        *
      *                  *---------------------------------------------*
           perform   acc-add-spb-000      thru acc-add-spb-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-500.
       acc-key-reg-600.
      *                  *---------------------------------------------*
      *                  * Tipo esclusione mesi                        *
      *                  *---------------------------------------------*
           perform   acc-tip-esm-000      thru acc-tip-esm-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-550.
       acc-key-reg-800.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma impostazioni          *
      *                  *---------------------------------------------*
           perform   acc-cnf-imp-000      thru acc-cnf-imp-999        .
           if        w-cnt-tus-acc-key    =    "E"
                     move  spaces         to   w-cnt-tus-acc-key
                     go to acc-key-reg-100.
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-500.
       acc-key-reg-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-key      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visual. dati chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-key      .
      *              *-------------------------------------------------*
      *              * Test se chiave vuota                            *
      *              *-------------------------------------------------*
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-key-reg-999.
      *              *-------------------------------------------------*
      *              * Controllo globale su tasto Do su chiave         *
      *              *-------------------------------------------------*
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-key-reg-100.
           move      "S"                  to   w-cnt-tus-acc-key      .
       acc-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campi chiave della registrazione          *
      *    *-----------------------------------------------------------*
       vis-key-reg-000.
      *              *-------------------------------------------------*
      *              * Ordinatore minimo e massimo                     *
      *              *-------------------------------------------------*
           perform   vis-ord-mem-000      thru vis-ord-mem-999        .
      *              *-------------------------------------------------*
      *              * Codice forma di pagamento                       *
      *              *-------------------------------------------------*
           perform   vis-cod-fop-000      thru vis-cod-fop-999        .
           perform   vis-cod-fop-des-000  thru vis-cod-fop-des-999    .
      *              *-------------------------------------------------*
      *              * Codice A.B.I.                                   *
      *              *-------------------------------------------------*
           perform   vis-cod-abi-000      thru vis-cod-abi-999        .
           perform   vis-cod-abi-den-000  thru vis-cod-abi-den-999    .
      *              *-------------------------------------------------*
      *              * Codice C.A.B.                                   *
      *              *-------------------------------------------------*
           perform   vis-cod-cab-000      thru vis-cod-cab-999        .
           perform   vis-cod-cab-den-000  thru vis-cod-cab-den-999    .
      *              *-------------------------------------------------*
      *              * Conto corrente del cliente                      *
      *              *-------------------------------------------------*
           perform   vis-ccc-app-000      thru vis-ccc-app-999        .
      *              *-------------------------------------------------*
      *              * Codice nostra banca                             *
      *              *-------------------------------------------------*
           perform   vis-nos-ban-000      thru vis-nos-ban-999        .
           perform   vis-nos-ban-des-000  thru vis-nos-ban-des-999    .
      *              *-------------------------------------------------*
      *              * Codice nostra banca presentazione effetti       *
      *              *-------------------------------------------------*
           perform   vis-nos-bpe-000      thru vis-nos-bpe-999        .
           perform   vis-nos-bpe-des-000  thru vis-nos-bpe-des-999    .
      *              *-------------------------------------------------*
      *              * Codice nostro c/c postale                       *
      *              *-------------------------------------------------*
           perform   vis-nos-ccp-000      thru vis-nos-ccp-999        .
           perform   vis-nos-ccp-des-000  thru vis-nos-ccp-des-999    .
      *              *-------------------------------------------------*
      *              * Codice addebito spese incasso                   *
      *              *-------------------------------------------------*
           perform   vis-add-spi-000      thru vis-add-spi-999        .
           perform   vis-add-spi-des-000  thru vis-add-spi-des-999    .
      *              *-------------------------------------------------*
      *              * Codice addebito spese bollo                     *
      *              *-------------------------------------------------*
           perform   vis-add-spb-000      thru vis-add-spb-999        .
           perform   vis-add-spb-des-000  thru vis-add-spb-des-999    .
      *              *-------------------------------------------------*
      *              * Tipo esclusione mesi                            *
      *              *-------------------------------------------------*
           perform   vis-tip-esm-000      thru vis-tip-esm-999        .
       vis-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per campi chiave                  *
      *    *-----------------------------------------------------------*
       pmt-key-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate dalla chiave              *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-key-reg-100.
      *              *-------------------------------------------------*
      *              * Visualizzazioni prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ordinatore minimo e massimo                 *
      *                  *---------------------------------------------*
           perform   pmt-ord-mem-000      thru pmt-ord-mem-999        .
      *                  *---------------------------------------------*
      *                  * Linea di trattini di separazione            *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "------------------------------- Altre selezioni --
      -              "------------------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Codice forma di pagamento                   *
      *                  *---------------------------------------------*
           perform   pmt-cod-fop-000      thru pmt-cod-fop-999        .
      *                  *---------------------------------------------*
      *                  * Codice A.B.I.                               *
      *                  *---------------------------------------------*
           perform   pmt-cod-abi-000      thru pmt-cod-abi-999        .
      *                  *---------------------------------------------*
      *                  * Codice C.A.B.                               *
      *                  *---------------------------------------------*
           perform   pmt-cod-cab-000      thru pmt-cod-cab-999        .
      *                  *---------------------------------------------*
      *                  * Conto corrente del cliente                  *
      *                  *---------------------------------------------*
           perform   pmt-ccc-app-000      thru pmt-ccc-app-999        .
      *                  *---------------------------------------------*
      *                  * Codice nostra banca                         *
      *                  *---------------------------------------------*
           perform   pmt-nos-ban-000      thru pmt-nos-ban-999        .
      *                  *---------------------------------------------*
      *                  * Codice nostra banca presentazione effetti   *
      *                  *---------------------------------------------*
           perform   pmt-nos-bpe-000      thru pmt-nos-bpe-999        .
      *                  *---------------------------------------------*
      *                  * Codice nostro c/c postale                   *
      *                  *---------------------------------------------*
           perform   pmt-nos-ccp-000      thru pmt-nos-ccp-999        .
      *                  *---------------------------------------------*
      *                  * Addebito spese incasso                      *
      *                  *---------------------------------------------*
           perform   pmt-add-spi-000      thru pmt-add-spi-999        .
      *                  *---------------------------------------------*
      *                  * Addebito spese bollo                        *
      *                  *---------------------------------------------*
           perform   pmt-add-spb-000      thru pmt-add-spb-999        .
      *                  *---------------------------------------------*
      *                  * Tipo esclusione mesi                        *
      *                  *---------------------------------------------*
           perform   pmt-tip-esm-000      thru pmt-tip-esm-999        .
       pmt-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Ordinatore minimo e massimo                      *
      *    *-----------------------------------------------------------*
       pmt-ord-mem-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento da  *
      *              * personalizzazione                               *
      *              *-------------------------------------------------*
           if        w-prs-tip-ord-tip    =    "R"
                     go to pmt-ord-mem-200
           else if   w-prs-tip-ord-tip    =    "C"
                     go to pmt-ord-mem-400
           else if   w-prs-tip-ord-tip    =    "M"
                     go to pmt-ord-mem-600.
       pmt-ord-mem-200.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Ragione sociale             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ragione sociale minima                  *
      *                      *-----------------------------------------*
           perform   pmt-rag-min-000      thru pmt-rag-min-999        .
      *                      *-----------------------------------------*
      *                      * Ragione sociale massima                 *
      *                      *-----------------------------------------*
           perform   pmt-rag-max-000      thru pmt-rag-max-999        .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     pmt-ord-mem-999.
       pmt-ord-mem-400.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Codice                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice minimo                           *
      *                      *-----------------------------------------*
           perform   pmt-cod-min-000      thru pmt-cod-min-999        .
      *                      *-----------------------------------------*
      *                      * Codice massimo                          *
      *                      *-----------------------------------------*
           perform   pmt-cod-max-000      thru pmt-cod-max-999        .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     pmt-ord-mem-999.
       pmt-ord-mem-600.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Mnemonico                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Mnemonico minimo                        *
      *                      *-----------------------------------------*
           perform   pmt-mne-min-000      thru pmt-mne-min-999        .
      *                      *-----------------------------------------*
      *                      * Mnemonico massimo                       *
      *                      *-----------------------------------------*
           perform   pmt-mne-max-000      thru pmt-mne-max-999        .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     pmt-ord-mem-999.
       pmt-ord-mem-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Ragione sociale minima                           *
      *    *-----------------------------------------------------------*
       pmt-rag-min-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Ragione sociale minima  da selezionare :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-rag-min-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Ragione sociale massima                          *
      *    *-----------------------------------------------------------*
       pmt-rag-max-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Ragione sociale massima da selezionare :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-rag-max-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Codice minimo                                    *
      *    *-----------------------------------------------------------*
       pmt-cod-min-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      31                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice minimo  da selezionare :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-cod-min-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Codice massimo                                   *
      *    *-----------------------------------------------------------*
       pmt-cod-max-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      31                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice massimo da selezionare :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-cod-max-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Mnemonico minimo                                 *
      *    *-----------------------------------------------------------*
       pmt-mne-min-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      34                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Mnemonico minimo  da selezionare :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-mne-min-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Mnemonico massimo                                *
      *    *-----------------------------------------------------------*
       pmt-mne-max-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      34                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Mnemonico massimo da selezionare :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-mne-max-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice forma di pagamento        *
      *    *-----------------------------------------------------------*
       pmt-cod-fop-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice forma di pagamento  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cod-fop-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice A.B.I.                    *
      *    *-----------------------------------------------------------*
       pmt-cod-abi-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Cod. ABI banca d'appoggio  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cod-abi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice C.A.B.                    *
      *    *-----------------------------------------------------------*
       pmt-cod-cab-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Cod. CAB sportello         :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cod-cab-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Conto corrente del cliente       *
      *    *-----------------------------------------------------------*
       pmt-ccc-app-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Conto corrente del cliente :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-ccc-app-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice nostra banca              *
      *    *-----------------------------------------------------------*
       pmt-nos-ban-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Nostra banca per bonifici  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-nos-ban-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice nostra banca presentaz.   *
      *    *-----------------------------------------------------------*
       pmt-nos-bpe-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Nostra banca pres. effetti :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-nos-bpe-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice nostro c/c postale        *
      *    *-----------------------------------------------------------*
       pmt-nos-ccp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice nostro c/c postale  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-nos-ccp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Addebito spese incasso           *
      *    *-----------------------------------------------------------*
       pmt-add-spi-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Addebito spese incasso     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-add-spi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Addebito spese bollo             *
      *    *-----------------------------------------------------------*
       pmt-add-spb-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Addebito spese bollo       :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-add-spb-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Tipo esclusione mesi             *
      *    *-----------------------------------------------------------*
       pmt-tip-esm-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo esclusione mesi       :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-tip-esm-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Ordinatore minimo e massimo          *
      *    *-----------------------------------------------------------*
       acc-ord-mem-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento da  *
      *              * personalizzazione                               *
      *              *-------------------------------------------------*
           if        w-prs-tip-ord-tip    =    "R"
                     go to acc-ord-mem-200
           else if   w-prs-tip-ord-tip    =    "C"
                     go to acc-ord-mem-400
           else if   w-prs-tip-ord-tip    =    "M"
                     go to acc-ord-mem-600.
       acc-ord-mem-200.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Ragione sociale             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ragione sociale minima                  *
      *                      *-----------------------------------------*
           perform   acc-rag-min-000      thru acc-rag-min-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-ord-mem-999.
      *                      *-----------------------------------------*
      *                      * Ragione sociale massima                 *
      *                      *-----------------------------------------*
           perform   acc-rag-max-000      thru acc-rag-max-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-ord-mem-999.
           if        v-key                =    "UP  "
                     go to acc-ord-mem-200.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     acc-ord-mem-999.
       acc-ord-mem-400.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Codice                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice minimo                           *
      *                      *-----------------------------------------*
           perform   acc-cod-min-000      thru acc-cod-min-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-ord-mem-999.
      *                      *-----------------------------------------*
      *                      * Codice massimo                          *
      *                      *-----------------------------------------*
           perform   acc-cod-max-000      thru acc-cod-max-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-ord-mem-999.
           if        v-key                =    "UP  "
                     go to acc-ord-mem-400.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     acc-ord-mem-999.
       acc-ord-mem-600.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Mnemonico                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Mnemonico minimo                        *
      *                      *-----------------------------------------*
           perform   acc-mne-min-000      thru acc-mne-min-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-ord-mem-999.
      *                      *-----------------------------------------*
      *                      * Mnemonico massimo                       *
      *                      *-----------------------------------------*
           perform   acc-mne-max-000      thru acc-mne-max-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-ord-mem-999.
           if        v-key                =    "UP  "
                     go to acc-ord-mem-600.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     acc-ord-mem-999.
       acc-ord-mem-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Ordinatore minimo e massimo       *
      *    *-----------------------------------------------------------*
       vis-ord-mem-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento da  *
      *              * personalizzazione                               *
      *              *-------------------------------------------------*
           if        w-prs-tip-ord-tip    =    "R"
                     go to vis-ord-mem-200
           else if   w-prs-tip-ord-tip    =    "C"
                     go to vis-ord-mem-400
           else if   w-prs-tip-ord-tip    =    "M"
                     go to vis-ord-mem-600.
       vis-ord-mem-200.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Ragione sociale             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ragione sociale minima                  *
      *                      *-----------------------------------------*
           perform   vis-rag-min-000      thru vis-rag-min-999        .
      *                      *-----------------------------------------*
      *                      * Ragione sociale massima                 *
      *                      *-----------------------------------------*
           perform   vis-rag-max-000      thru vis-rag-max-999        .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     vis-ord-mem-999.
       vis-ord-mem-400.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Codice                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice minimo                           *
      *                      *-----------------------------------------*
           perform   vis-cod-min-000      thru vis-cod-min-999        .
      *                      *-----------------------------------------*
      *                      * Codice massimo                          *
      *                      *-----------------------------------------*
           perform   vis-cod-max-000      thru vis-cod-max-999        .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     vis-ord-mem-999.
       vis-ord-mem-600.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Mnemonico                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Mnemonico minimo                        *
      *                      *-----------------------------------------*
           perform   vis-mne-min-000      thru vis-mne-min-999        .
      *                      *-----------------------------------------*
      *                      * Mnemonico massimo                       *
      *                      *-----------------------------------------*
           perform   vis-mne-max-000      thru vis-mne-max-999        .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     vis-ord-mem-999.
       vis-ord-mem-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Ragione sociale minima     *
      *    *-----------------------------------------------------------*
       acc-rag-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-rag-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      42                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-rag-min        to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-rag-min-999.
       acc-rag-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-rag-min          .
       acc-rag-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-rag-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rag-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-rag-min-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-rag-min-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-rag-min-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-rag-min-999.
       acc-rag-min-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Ragione sociale minima            *
      *    *-----------------------------------------------------------*
       vis-rag-min-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-rag-min        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rag-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Ragione sociale massima    *
      *    *-----------------------------------------------------------*
       acc-rag-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-rag-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      42                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-rag-max        to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-rag-max-999.
       acc-rag-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-rag-max          .
       acc-rag-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-rag-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rag-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-rag-max-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-rag-max-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-rag-max-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-rag-max-999.
       acc-rag-max-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Ragione sociale massima           *
      *    *-----------------------------------------------------------*
       vis-rag-max-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-rag-max        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rag-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Codice cliente minimo      *
      *    *-----------------------------------------------------------*
       acc-cod-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-dcc-ope      .
           move      w-tes-cod-min        to   w-cod-mne-dcc-cod      .
           move      05                   to   w-cod-mne-dcc-lin      .
           move      33                   to   w-cod-mne-dcc-pos      .
           move      zero                 to   w-cod-mne-dcc-rln      .
           move      zero                 to   w-cod-mne-dcc-rps      .
           move      zero                 to   w-cod-mne-dcc-vln      .
           move      zero                 to   w-cod-mne-dcc-vps      .
           move      zero                 to   w-cod-mne-dcc-lln      .
           move      zero                 to   w-cod-mne-dcc-lps      .
           move      "<B"                 to   v-edm                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
       acc-cod-min-110.
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           if        w-cod-mne-dcc-ope    =    "F+"
                     go to acc-cod-min-115.
           if        w-cod-mne-dcc-ope    =    "AC"
                     go to acc-cod-min-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-min-115.
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
           go to     acc-cod-min-110.
       acc-cod-min-120.
           move      w-cod-mne-dcc-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-min-999.
       acc-cod-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cod-min          .
       acc-cod-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-min-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-min-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-min-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-min-999.
       acc-cod-min-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice cliente minimo             *
      *    *-----------------------------------------------------------*
       vis-cod-min-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      05                   to   v-lin                  .
           move      33                   to   v-pos                  .
           move      w-tes-cod-min        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Codice massimo             *
      *    *-----------------------------------------------------------*
       acc-cod-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-dcc-ope      .
           move      w-tes-cod-max        to   w-cod-mne-dcc-cod      .
           move      06                   to   w-cod-mne-dcc-lin      .
           move      33                   to   w-cod-mne-dcc-pos      .
           move      zero                 to   w-cod-mne-dcc-rln      .
           move      zero                 to   w-cod-mne-dcc-rps      .
           move      zero                 to   w-cod-mne-dcc-vln      .
           move      zero                 to   w-cod-mne-dcc-vps      .
           move      zero                 to   w-cod-mne-dcc-lln      .
           move      zero                 to   w-cod-mne-dcc-lps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
       acc-cod-max-110.
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           if        w-cod-mne-dcc-ope    =    "F+"
                     go to acc-cod-max-115.
           if        w-cod-mne-dcc-ope    =    "AC"
                     go to acc-cod-max-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-max-115.
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
           go to     acc-cod-max-110.
       acc-cod-max-120.
           move      w-cod-mne-dcc-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-max-999.
       acc-cod-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cod-max          .
       acc-cod-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-max-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-max-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-max-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-max-999.
       acc-cod-max-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice cliente massimo            *
      *    *-----------------------------------------------------------*
       vis-cod-max-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      06                   to   v-lin                  .
           move      33                   to   v-pos                  .
           move      w-tes-cod-max        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Mnemonico minimo           *
      *    *-----------------------------------------------------------*
       acc-mne-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-mne-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      36                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-mne-min        to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-mne-min-999.
       acc-mne-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-mne-min          .
       acc-mne-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-mne-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-mne-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-mne-min-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-mne-min-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-mne-min-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-mne-min-999.
       acc-mne-min-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Mnemonico minimo                  *
      *    *-----------------------------------------------------------*
       vis-mne-min-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      36                   to   v-pos                  .
           move      w-tes-mne-min        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-mne-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Mnemonico massimo          *
      *    *-----------------------------------------------------------*
       acc-mne-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-mne-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      36                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-mne-max        to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-mne-max-999.
       acc-mne-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-mne-max          .
       acc-mne-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-mne-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-mne-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-mne-max-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-mne-max-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-mne-max-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-mne-max-999.
       acc-mne-max-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Mnemonico massimo                 *
      *    *-----------------------------------------------------------*
       vis-mne-max-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      36                   to   v-pos                  .
           move      w-tes-mne-max        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-mne-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Forma di pagamento                   *
      *    *-----------------------------------------------------------*
       acc-cod-fop-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se richiesta sostituzione              *
      *                  *---------------------------------------------*
           if        w-tes-cod-fop-sns    =    zero
                     go to acc-cod-fop-100.
      *                  *---------------------------------------------*
      *                  * Forzatura del tasto Pf1                     *
      *                  *---------------------------------------------*
           move      "[1] "               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A test su Pf1                               *
      *                  *---------------------------------------------*
           go to     acc-cod-fop-300.
       acc-cod-fop-100.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      "[F1] per sostituzione"
                                          to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zfp-ope      .
           move      w-tes-cod-fop        to   w-cod-mne-zfp-cod      .
           move      w-lpt-cod-fop-lin    to   w-cod-mne-zfp-lin      .
           move      w-lpt-cod-fop-pos    to   w-cod-mne-zfp-pos      .
           move      w-lpt-cod-fop-lin    to   w-cod-mne-zfp-dln      .
           move      w-lpt-cod-fop-pos    to   w-cod-mne-zfp-dps      .
           add       11                   to   w-cod-mne-zfp-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "[1] "               to   v-pfk (14)             .
           perform   cod-mne-zfp-cll-000  thru cod-mne-zfp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zfp-foi-000  thru cod-mne-zfp-foi-999    .
       acc-cod-fop-110.
           perform   cod-mne-zfp-cll-000  thru cod-mne-zfp-cll-999    .
           if        w-cod-mne-zfp-ope    =    "F+"
                     go to acc-cod-fop-115.
           if        w-cod-mne-zfp-ope    =    "AC"
                     go to acc-cod-fop-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-fop-115.
           perform   cod-mne-zfp-foi-000  thru cod-mne-zfp-foi-999    .
           go to     acc-cod-fop-110.
       acc-cod-fop-120.
           move      w-cod-mne-zfp-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Cancellazione eventuali note operative          *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-fop-999.
       acc-cod-fop-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cod-fop          .
       acc-cod-fop-300.
      *              *-------------------------------------------------*
      *              * Se Pf1                                          *
      *              *-------------------------------------------------*
           if        v-key                not  = "[1] "
                     go to acc-cod-fop-400.
      *                  *---------------------------------------------*
      *                  * Subroutine di accettazione valore sostitu-  *
      *                  * tivo                                        *
      *                  *---------------------------------------------*
           perform   acc-cod-fop-sos-000  thru acc-cod-fop-sos-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-cod-fop-999.
      *                  *---------------------------------------------*
      *                  * Visualizzazione sostituzione effettuata     *
      *                  *---------------------------------------------*
           perform   vis-cod-fop-sos-000  thru vis-cod-fop-sos-999    .
      *                  *---------------------------------------------*
      *                  * Se sostituzione non effettuata ma impostati *
      *                  * valori : rivisualizzazione valori impostati *
      *                  *---------------------------------------------*
           if        w-tes-cod-fop-sns    not  = zero
                     go to acc-cod-fop-800.
      *                  *---------------------------------------------*
      *                  * Visualizzazione codice impostato            *
      *                  *---------------------------------------------*
           perform   vis-cod-fop-000      thru vis-cod-fop-999        .
       acc-cod-fop-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      w-tes-cod-fop        to   w-let-arc-zfp-cod      .
           perform   let-arc-zfp-000      thru let-arc-zfp-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-zfp-des    to   w-tes-cod-fop-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-cod-fop-des-000  thru vis-cod-fop-des-999    .
       acc-cod-fop-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-fop-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-fop-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-fop-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-fop-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-fop-999.
       acc-cod-fop-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Forma di pagamento                *
      *    *-----------------------------------------------------------*
       vis-cod-fop-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-lpt-cod-fop-lin    to   v-lin                  .
           move      w-lpt-cod-fop-pos    to   v-pos                  .
           move      w-tes-cod-fop        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-fop-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Descrizione pagamento     *
      *    *-----------------------------------------------------------*
       vis-cod-fop-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      w-lpt-cod-fop-lin    to   v-lin                  .
           move      w-lpt-cod-fop-pos    to   v-pos                  .
           add       11                   to   v-pos                  .
           move      w-tes-cod-fop-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-fop-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Forma di pagamento                   *
      *    *                                                           *
      *    * Subroutine di sostituzione                                *
      *    *-----------------------------------------------------------*
       acc-cod-fop-sos-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione segnale di sostituzione     *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-cod-fop-sns      .
      *                  *---------------------------------------------*
      *                  * Salvataggio immagine video                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      w-lpt-cod-fop-lin    to   v-lin                  .
           subtract  1                    from v-lin                  .
           move      w-lpt-cod-fop-pos    to   v-pos                  .
           subtract  1                    from v-pos                  .
           move      w-lpt-cod-fop-lin    to   v-lto                  .
           add       1                    to   v-lto                  .
           move      w-lpt-cod-fop-pos    to   v-pto                  .
           add       50                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cod-fop-sos-010.
      *                  *---------------------------------------------*
      *                  * Prompts per il box                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Valore da sostituire                    *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      w-lpt-cod-fop-lin    to   v-lin                  .
           move      w-lpt-cod-fop-pos    to   v-pos                  .
           move      "Da sostituire :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Con                                     *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      w-lpt-cod-fop-lin    to   v-lin                  .
           move      w-lpt-cod-fop-pos    to   v-pos                  .
           add       29                   to   v-pos                  .
           move      "Con :"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cod-fop-sos-100.
      *              *-------------------------------------------------*
      *              * Visualizzazioni                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore da sostituire        *
      *                  *---------------------------------------------*
           perform   vis-cod-fop-so1-000  thru vis-cod-fop-so1-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore sostitutivo          *
      *                  *---------------------------------------------*
           perform   vis-cod-fop-so2-000  thru vis-cod-fop-so2-999    .
       acc-cod-fop-sos-200.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore da sostituire                        *
      *                  *---------------------------------------------*
           perform   acc-cod-fop-so1-000  thru acc-cod-fop-so1-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-cod-fop-sos-600.
           if        v-key                =    "UP  "
                     go to acc-cod-fop-sos-600.
           if        v-key                =    "DOWN"
                     go to acc-cod-fop-sos-600.
       acc-cod-fop-sos-300.
      *                  *---------------------------------------------*
      *                  * Valore sostitutivo                          *
      *                  *---------------------------------------------*
           perform   acc-cod-fop-so2-000  thru acc-cod-fop-so2-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-cod-fop-sos-600.
           if        v-key                =    "UP  "
                     go to acc-cod-fop-sos-200.
       acc-cod-fop-sos-600.
      *              *-------------------------------------------------*
      *              * Controlli su valori accettati                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se i valori sono a zero : a dipendenze dal- *
      *                  * le impostazioni                             *
      *                  *---------------------------------------------*
           if        w-tes-cod-fop        =    zero  and
                     w-tes-fop-sos        =    zero
                     go to acc-cod-fop-sos-800.
      *                  *---------------------------------------------*
      *                  * Che i valori non siano uguali               *
      *                  *---------------------------------------------*
           if        w-tes-cod-fop        not  = w-tes-fop-sos
                     go to acc-cod-fop-sos-800.
      *                      *-----------------------------------------*
      *                      * Normalizzazione valore sostitutivo      *
      *                      *-----------------------------------------*
           move      zero                 to   w-tes-fop-sos          .
      *                      *-----------------------------------------*
      *                      * Segnale di sostituzione non effettuata  *
      *                      *-----------------------------------------*
           move      zero                 to   w-tes-cod-fop-sns      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     acc-cod-fop-sos-900.
       acc-cod-fop-sos-800.
      *              *-------------------------------------------------*
      *              * Dipendenza dalle impostazioni                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di sostituzione effettuata          *
      *                  *---------------------------------------------*
           if        w-tes-cod-fop        not  = zero or
                     w-tes-fop-sos        not  = zero
                     move  1              to   w-tes-cod-fop-sns      .
       acc-cod-fop-sos-900.
      *              *-------------------------------------------------*
      *              * Normalizzazione stato di uscita                 *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-cod-fop-sos-999.
       acc-cod-fop-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Forma di pagamento                   *
      *    *                                                           *
      *    * Subroutine di visualizzazione sostituzione                *
      *    *-----------------------------------------------------------*
       vis-cod-fop-sos-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del segnale di sostitu-  *
      *              * zione effettuata                                *
      *              *-------------------------------------------------*
           if        w-tes-cod-fop-sns    =    zero
                     go to vis-cod-fop-sos-100
           else      go to vis-cod-fop-sos-500.
       vis-cod-fop-sos-100.
      *              *-------------------------------------------------*
      *              * Se sostituzione non effettuata                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-cod-fop-lin    to   v-lin                  .
           move      w-lpt-cod-fop-pos    to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-cod-fop-sos-900.
       vis-cod-fop-sos-500.
      *              *-------------------------------------------------*
      *              * Se sostituzione effettuata                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing codice da sostituire                *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-tes-cod-fop        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Concatenamento prima parte                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-vis-lit-sos          .
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "( Sostituzione di :"
                                          to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      "- con :"            to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Editing codice sostitutivo                  *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-tes-fop-sos        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Concatenamento seconda parte                *
      *                  *---------------------------------------------*
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-vis-lit-sos        to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      ")"                  to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-cod-fop-lin    to   v-lin                  .
           move      w-lpt-cod-fop-pos    to   v-pos                  .
           move      w-vis-lit-sos        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-cod-fop-sos-900.
       vis-cod-fop-sos-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-cod-fop-sos-999.
       vis-cod-fop-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Forma di pagamento                   *
      *    *                                                           *
      *    * Subroutine di accettazione valore da sostituire           *
      *    *-----------------------------------------------------------*
       acc-cod-fop-so1-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-fop-so1-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zfp-ope      .
           move      w-tes-cod-fop        to   w-cod-mne-zfp-cod      .
           move      w-lpt-cod-fop-lin    to   w-cod-mne-zfp-lin      .
           move      w-lpt-cod-fop-pos    to   w-cod-mne-zfp-pos      .
           add       16                   to   w-cod-mne-zfp-pos      .
           move      zero                 to   w-cod-mne-zfp-dln      .
           move      zero                 to   w-cod-mne-zfp-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-zfp-cll-000  thru cod-mne-zfp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zfp-foi-000  thru cod-mne-zfp-foi-999    .
       acc-cod-fop-so1-110.
           perform   cod-mne-zfp-cll-000  thru cod-mne-zfp-cll-999    .
           if        w-cod-mne-zfp-ope    =    "F+"
                     go to acc-cod-fop-so1-115.
           if        w-cod-mne-zfp-ope    =    "AC"
                     go to acc-cod-fop-so1-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-fop-so1-115.
           perform   cod-mne-zfp-foi-000  thru cod-mne-zfp-foi-999    .
           go to     acc-cod-fop-so1-110.
       acc-cod-fop-so1-120.
           move      w-cod-mne-zfp-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-fop-so1-999.
       acc-cod-fop-so1-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cod-fop          .
       acc-cod-fop-so1-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-fop-so1-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-fop-so1-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-fop-so1-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-fop-so1-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-fop-so1-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-fop-so1-999.
       acc-cod-fop-so1-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Forma di pagamento                *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore da sostituire        *
      *    *-----------------------------------------------------------*
       vis-cod-fop-so1-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-lpt-cod-fop-lin    to   v-lin                  .
           move      w-lpt-cod-fop-pos    to   v-pos                  .
           add       16                   to   v-pos                  .
           move      w-tes-cod-fop        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-fop-so1-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Forma di pagamento                   *
      *    *                                                           *
      *    * Subroutine di accettazione valore sostitutivo             *
      *    *-----------------------------------------------------------*
       acc-cod-fop-so2-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-fop-so2-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zfp-ope      .
           move      w-tes-fop-sos        to   w-cod-mne-zfp-cod      .
           move      w-lpt-cod-fop-lin    to   w-cod-mne-zfp-lin      .
           move      w-lpt-cod-fop-pos    to   w-cod-mne-zfp-pos      .
           add       35                   to   w-cod-mne-zfp-pos      .
           move      zero                 to   w-cod-mne-zfp-dln      .
           move      zero                 to   w-cod-mne-zfp-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-zfp-cll-000  thru cod-mne-zfp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zfp-foi-000  thru cod-mne-zfp-foi-999    .
       acc-cod-fop-so2-110.
           perform   cod-mne-zfp-cll-000  thru cod-mne-zfp-cll-999    .
           if        w-cod-mne-zfp-ope    =    "F+"
                     go to acc-cod-fop-so2-115.
           if        w-cod-mne-zfp-ope    =    "AC"
                     go to acc-cod-fop-so2-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-fop-so2-115.
           perform   cod-mne-zfp-foi-000  thru cod-mne-zfp-foi-999    .
           go to     acc-cod-fop-so2-110.
       acc-cod-fop-so2-120.
           move      w-cod-mne-zfp-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-fop-so2-999.
       acc-cod-fop-so2-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-fop-sos          .
       acc-cod-fop-so2-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-fop-so2-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-fop-so2-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-fop-so2-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-fop-so2-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-fop-so2-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-fop-so2-999.
       acc-cod-fop-so2-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Forma di pagamento                *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore sostitutivo          *
      *    *-----------------------------------------------------------*
       vis-cod-fop-so2-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-lpt-cod-fop-lin    to   v-lin                  .
           move      w-lpt-cod-fop-pos    to   v-pos                  .
           add       35                   to   v-pos                  .
           move      w-tes-fop-sos        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-fop-so2-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice ABI banca d'appoggio          *
      *    *-----------------------------------------------------------*
       acc-cod-abi-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore iniziale                 *
      *                  *---------------------------------------------*
           move      w-tes-cod-abi        to   w-sav-cod-abi          .
      *                  *---------------------------------------------*
      *                  * Test se richiesta sostituzione              *
      *                  *---------------------------------------------*
           if        w-tes-cod-abi-sns    =    zero
                     go to acc-cod-abi-100.
      *                  *---------------------------------------------*
      *                  * Forzatura del tasto Pf1                     *
      *                  *---------------------------------------------*
           move      "[1] "               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A test su Pf1                               *
      *                  *---------------------------------------------*
           go to     acc-cod-abi-300.
       acc-cod-abi-100.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      "[F1] per sostituzione"
                                          to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-abi-ope      .
           move      w-tes-cod-abi        to   w-cod-mne-abi-cod      .
           move      w-lpt-cod-abi-lin    to   w-cod-mne-abi-lin      .
           move      w-lpt-cod-abi-pos    to   w-cod-mne-abi-pos      .
           move      w-lpt-cod-abi-lin    to   w-cod-mne-abi-dln      .
           move      w-lpt-cod-abi-pos    to   w-cod-mne-abi-dps      .
           add       11                   to   w-cod-mne-abi-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "[1] "               to   v-pfk (14)             .
           perform   cod-mne-abi-cll-000  thru cod-mne-abi-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-abi-foi-000  thru cod-mne-abi-foi-999    .
       acc-cod-abi-110.
           perform   cod-mne-abi-cll-000  thru cod-mne-abi-cll-999    .
           if        w-cod-mne-abi-ope    =    "F+"
                     go to acc-cod-abi-115.
           if        w-cod-mne-abi-ope    =    "AC"
                     go to acc-cod-abi-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-abi-115.
           perform   cod-mne-abi-foi-000  thru cod-mne-abi-foi-999    .
           go to     acc-cod-abi-110.
       acc-cod-abi-120.
           move      w-cod-mne-abi-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Cancellazione eventuali note operative          *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-abi-999.
       acc-cod-abi-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cod-abi          .
       acc-cod-abi-300.
      *              *-------------------------------------------------*
      *              * Se Pf1                                          *
      *              *-------------------------------------------------*
           if        v-key                not  = "[1] "
                     go to acc-cod-abi-400.
      *                  *---------------------------------------------*
      *                  * Subroutine di accettazione valore sostitu-  *
      *                  * tivo                                        *
      *                  *---------------------------------------------*
           perform   acc-cod-abi-sos-000  thru acc-cod-abi-sos-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-cod-abi-999.
      *                  *---------------------------------------------*
      *                  * Visualizzazione sostituzione effettuata     *
      *                  *---------------------------------------------*
           perform   vis-cod-abi-sos-000  thru vis-cod-abi-sos-999    .
      *                  *---------------------------------------------*
      *                  * Se sostituzione non effettuata ma impostati *
      *                  * valori : rivisualizzazione valori impostati *
      *                  *---------------------------------------------*
           if        w-tes-cod-abi-sns    not  = zero
                     go to acc-cod-abi-800.
      *                  *---------------------------------------------*
      *                  * Visualizzazione codice impostato            *
      *                  *---------------------------------------------*
           perform   vis-cod-abi-000      thru vis-cod-abi-999        .
       acc-cod-abi-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura anagrafica istituti                 *
      *                  *---------------------------------------------*
           move      w-tes-cod-abi        to   w-let-arc-axi-cod      .
           perform   let-arc-axi-000      thru let-arc-axi-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione denominazione                *
      *                  *---------------------------------------------*
           move      w-let-arc-axi-den    to   w-tes-cod-abi-den      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione denominazione               *
      *                  *---------------------------------------------*
           perform   vis-cod-abi-den-000  thru vis-cod-abi-den-999    .
       acc-cod-abi-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-abi-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-abi-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-abi-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-abi-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-abi-999.
       acc-cod-abi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Codice ABI banca          *
      *    *-----------------------------------------------------------*
       vis-cod-abi-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      w-lpt-cod-abi-lin    to   v-lin                  .
           move      w-lpt-cod-abi-pos    to   v-pos                  .
           move      w-tes-cod-abi        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-abi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Denominazione banca       *
      *    *-----------------------------------------------------------*
       vis-cod-abi-den-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      w-lpt-cod-abi-lin    to   v-lin                  .
           move      w-lpt-cod-abi-pos    to   v-pos                  .
           add       11                   to   v-pos                  .
           move      w-tes-cod-abi-den    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-abi-den-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice ABI banca d'appoggio          *
      *    *                                                           *
      *    * Subroutine di sostituzione                                *
      *    *-----------------------------------------------------------*
       acc-cod-abi-sos-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione segnale di sostituzione     *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-cod-abi-sns      .
      *                  *---------------------------------------------*
      *                  * Salvataggio immagine video                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      w-lpt-cod-abi-lin    to   v-lin                  .
           subtract  1                    from v-lin                  .
           move      w-lpt-cod-abi-pos    to   v-pos                  .
           subtract  1                    from v-pos                  .
           move      w-lpt-cod-abi-lin    to   v-lto                  .
           add       1                    to   v-lto                  .
           move      w-lpt-cod-abi-pos    to   v-pto                  .
           add       50                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cod-abi-sos-010.
      *                  *---------------------------------------------*
      *                  * Prompts per il box                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Valore da sostituire                    *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      w-lpt-cod-abi-lin    to   v-lin                  .
           move      w-lpt-cod-abi-pos    to   v-pos                  .
           move      "Da sostituire :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Con                                     *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      w-lpt-cod-abi-lin    to   v-lin                  .
           move      w-lpt-cod-abi-pos    to   v-pos                  .
           add       29                   to   v-pos                  .
           move      "Con :"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cod-abi-sos-100.
      *              *-------------------------------------------------*
      *              * Visualizzazioni                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore da sostituire        *
      *                  *---------------------------------------------*
           perform   vis-cod-abi-so1-000  thru vis-cod-abi-so1-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore sostitutivo          *
      *                  *---------------------------------------------*
           perform   vis-cod-abi-so2-000  thru vis-cod-abi-so2-999    .
       acc-cod-abi-sos-200.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore da sostituire                        *
      *                  *---------------------------------------------*
           perform   acc-cod-abi-so1-000  thru acc-cod-abi-so1-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-cod-abi-sos-600.
           if        v-key                =    "UP  "
                     go to acc-cod-abi-sos-600.
           if        v-key                =    "DOWN"
                     go to acc-cod-abi-sos-600.
       acc-cod-abi-sos-300.
      *                  *---------------------------------------------*
      *                  * Valore sostitutivo                          *
      *                  *---------------------------------------------*
           perform   acc-cod-abi-so2-000  thru acc-cod-abi-so2-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-cod-abi-sos-600.
           if        v-key                =    "UP  "
                     go to acc-cod-abi-sos-200.
       acc-cod-abi-sos-600.
      *              *-------------------------------------------------*
      *              * Controlli su valori accettati                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se i valori sono a zero : a dipendenze dal- *
      *                  * le impostazioni                             *
      *                  *---------------------------------------------*
           if        w-tes-cod-abi        =    zero  and
                     w-tes-abi-sos        =    zero
                     go to acc-cod-abi-sos-800.
      *                  *---------------------------------------------*
      *                  * Che i valori non siano uguali               *
      *                  *---------------------------------------------*
           if        w-tes-cod-abi        not  = w-tes-abi-sos
                     go to acc-cod-abi-sos-800.
      *                      *-----------------------------------------*
      *                      * Normalizzazione valore sostitutivo      *
      *                      *-----------------------------------------*
           move      zero                 to   w-tes-abi-sos          .
      *                      *-----------------------------------------*
      *                      * Segnale di sostituzione non effettuata  *
      *                      *-----------------------------------------*
           move      zero                 to   w-tes-cod-abi-sns      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     acc-cod-abi-sos-900.
       acc-cod-abi-sos-800.
      *              *-------------------------------------------------*
      *              * Dipendenza dalle impostazioni                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di sostituzione effettuata          *
      *                  *---------------------------------------------*
           if        w-tes-cod-abi        not  = zero or
                     w-tes-abi-sos        not  = zero
                     move  1              to   w-tes-cod-abi-sns      .
       acc-cod-abi-sos-900.
      *              *-------------------------------------------------*
      *              * Normalizzazione stato di uscita                 *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-cod-abi-sos-999.
       acc-cod-abi-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice ABI banca d'appoggio          *
      *    *                                                           *
      *    * Subroutine di visualizzazione sostituzione                *
      *    *-----------------------------------------------------------*
       vis-cod-abi-sos-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del segnale di sostitu-  *
      *              * zione effettuata                                *
      *              *-------------------------------------------------*
           if        w-tes-cod-abi-sns    =    zero
                     go to vis-cod-abi-sos-100
           else      go to vis-cod-abi-sos-500.
       vis-cod-abi-sos-100.
      *              *-------------------------------------------------*
      *              * Se sostituzione non effettuata                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-cod-abi-lin    to   v-lin                  .
           move      w-lpt-cod-abi-pos    to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-cod-abi-sos-900.
       vis-cod-abi-sos-500.
      *              *-------------------------------------------------*
      *              * Se sostituzione effettuata                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing codice da sostituire                *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-tes-cod-abi        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Concatenamento prima parte                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-vis-lit-sos          .
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "( Sostituzione di :"
                                          to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      "- con :"            to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Editing codice sostitutivo                  *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-tes-abi-sos        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Concatenamento seconda parte                *
      *                  *---------------------------------------------*
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-vis-lit-sos        to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      ")"                  to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-cod-abi-lin    to   v-lin                  .
           move      w-lpt-cod-abi-pos    to   v-pos                  .
           move      w-vis-lit-sos        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-cod-abi-sos-900.
       vis-cod-abi-sos-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-cod-abi-sos-999.
       vis-cod-abi-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice ABI banca d'appoggio          *
      *    *                                                           *
      *    * Subroutine di accettazione valore da sostituire           *
      *    *-----------------------------------------------------------*
       acc-cod-abi-so1-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-abi-so1-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-abi-ope      .
           move      w-tes-cod-abi        to   w-cod-mne-abi-cod      .
           move      w-lpt-cod-abi-lin    to   w-cod-mne-abi-lin      .
           move      w-lpt-cod-abi-pos    to   w-cod-mne-abi-pos      .
           add       16                   to   w-cod-mne-abi-pos      .
           move      zero                 to   w-cod-mne-abi-dln      .
           move      zero                 to   w-cod-mne-abi-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-abi-cll-000  thru cod-mne-abi-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-abi-foi-000  thru cod-mne-abi-foi-999    .
       acc-cod-abi-so1-110.
           perform   cod-mne-abi-cll-000  thru cod-mne-abi-cll-999    .
           if        w-cod-mne-abi-ope    =    "F+"
                     go to acc-cod-abi-so1-115.
           if        w-cod-mne-abi-ope    =    "AC"
                     go to acc-cod-abi-so1-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-abi-so1-115.
           perform   cod-mne-abi-foi-000  thru cod-mne-abi-foi-999    .
           go to     acc-cod-abi-so1-110.
       acc-cod-abi-so1-120.
           move      w-cod-mne-abi-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-abi-so1-999.
       acc-cod-abi-so1-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cod-abi          .
       acc-cod-abi-so1-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-abi-so1-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-abi-so1-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-abi-so1-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-abi-so1-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-abi-so1-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-abi-so1-999.
       acc-cod-abi-so1-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice ABI banca d'appoggio          *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore da sostituire        *
      *    *-----------------------------------------------------------*
       vis-cod-abi-so1-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      w-lpt-cod-abi-lin    to   v-lin                  .
           move      w-lpt-cod-abi-pos    to   v-pos                  .
           add       16                   to   v-pos                  .
           move      w-tes-cod-abi        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-abi-so1-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice ABI banca d'appoggio          *
      *    *                                                           *
      *    * Subroutine di accettazione valore sostitutivo             *
      *    *-----------------------------------------------------------*
       acc-cod-abi-so2-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-abi-so2-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-abi-ope      .
           move      w-tes-abi-sos        to   w-cod-mne-abi-cod      .
           move      w-lpt-cod-abi-lin    to   w-cod-mne-abi-lin      .
           move      w-lpt-cod-abi-pos    to   w-cod-mne-abi-pos      .
           add       35                   to   w-cod-mne-abi-pos      .
           move      zero                 to   w-cod-mne-abi-dln      .
           move      zero                 to   w-cod-mne-abi-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-abi-cll-000  thru cod-mne-abi-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-abi-foi-000  thru cod-mne-abi-foi-999    .
       acc-cod-abi-so2-110.
           perform   cod-mne-abi-cll-000  thru cod-mne-abi-cll-999    .
           if        w-cod-mne-abi-ope    =    "F+"
                     go to acc-cod-abi-so2-115.
           if        w-cod-mne-abi-ope    =    "AC"
                     go to acc-cod-abi-so2-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-abi-so2-115.
           perform   cod-mne-abi-foi-000  thru cod-mne-abi-foi-999    .
           go to     acc-cod-abi-so2-110.
       acc-cod-abi-so2-120.
           move      w-cod-mne-abi-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-abi-so2-999.
       acc-cod-abi-so2-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-abi-sos          .
       acc-cod-abi-so2-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-abi-so2-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-abi-so2-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-abi-so2-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-abi-so2-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-abi-so2-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-abi-so2-999.
       acc-cod-abi-so2-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice ABI banca d'appoggio          *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore sostitutivo          *
      *    *-----------------------------------------------------------*
       vis-cod-abi-so2-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      w-lpt-cod-abi-lin    to   v-lin                  .
           move      w-lpt-cod-abi-pos    to   v-pos                  .
           add       35                   to   v-pos                  .
           move      w-tes-abi-sos        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-abi-so2-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice CAB                   *
      *    *-----------------------------------------------------------*
       acc-cod-cab-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se codice A.B.I. a zero : uscita            *
      *                  *---------------------------------------------*
           if        w-tes-cod-abi        =    zero
                     go to acc-cod-cab-999.
      *                  *---------------------------------------------*
      *                  * Test se richiesta sostituzione              *
      *                  *---------------------------------------------*
           if        w-tes-cod-cab-sns    =    zero
                     go to acc-cod-cab-100.
      *                  *---------------------------------------------*
      *                  * Forzatura del tasto Pf1                     *
      *                  *---------------------------------------------*
           move      "[1] "               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A test su Pf1                               *
      *                  *---------------------------------------------*
           go to     acc-cod-cab-300.
       acc-cod-cab-100.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      "[F1] per sostituzione"
                                          to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-cab-ope      .
           move      w-tes-cod-abi        to   w-cod-mne-cab-abi      .
           move      w-tes-cod-cab        to   w-cod-mne-cab-cab      .
           move      w-lpt-cod-cab-lin    to   w-cod-mne-cab-lin      .
           move      w-lpt-cod-cab-pos    to   w-cod-mne-cab-pos      .
           move      w-lpt-cod-cab-lin    to   w-cod-mne-cab-dln      .
           move      w-lpt-cod-cab-pos    to   w-cod-mne-cab-dps      .
           add       11                   to   w-cod-mne-cab-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "[1] "               to   v-pfk (14)             .
           perform   cod-mne-cab-cll-000  thru cod-mne-cab-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-cab-foi-000  thru cod-mne-cab-foi-999    .
       acc-cod-cab-110.
           perform   cod-mne-cab-cll-000  thru cod-mne-cab-cll-999    .
           if        w-cod-mne-cab-ope    =    "F+"
                     go to acc-cod-cab-115.
           if        w-cod-mne-cab-ope    =    "AC"
                     go to acc-cod-cab-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-cab-115.
           perform   cod-mne-cab-foi-000  thru cod-mne-cab-foi-999    .
           go to     acc-cod-cab-110.
       acc-cod-cab-120.
           move      w-cod-mne-cab-cab    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Cancellazione eventuali note operative          *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-cab-999.
       acc-cod-cab-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cod-cab          .
       acc-cod-cab-300.
      *              *-------------------------------------------------*
      *              * Se Pf1                                          *
      *              *-------------------------------------------------*
           if        v-key                not  = "[1] "
                     go to acc-cod-cab-400.
      *                  *---------------------------------------------*
      *                  * Subroutine di accettazione valore sostitu-  *
      *                  * tivo                                        *
      *                  *---------------------------------------------*
           perform   acc-cod-cab-sos-000  thru acc-cod-cab-sos-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-cod-cab-999.
      *                  *---------------------------------------------*
      *                  * Visualizzazione sostituzione effettuata     *
      *                  *---------------------------------------------*
           perform   vis-cod-cab-sos-000  thru vis-cod-cab-sos-999    .
      *                  *---------------------------------------------*
      *                  * Se sostituzione non effettuata ma impostati *
      *                  * valori : rivisualizzazione valori impostati *
      *                  *---------------------------------------------*
           if        w-tes-cod-cab-sns    not  = zero
                     go to acc-cod-cab-800.
      *                  *---------------------------------------------*
      *                  * Visualizzazione codice impostato            *
      *                  *---------------------------------------------*
           perform   vis-cod-cab-000      thru vis-cod-cab-999        .
       acc-cod-cab-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      w-tes-cod-abi        to   w-let-arc-axs-abi      .
           move      w-tes-cod-cab        to   w-let-arc-axs-cab      .
           perform   let-arc-axs-000      thru let-arc-axs-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-axs-den    to   w-tes-cod-cab-den      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-cod-cab-den-000  thru vis-cod-cab-den-999    .
       acc-cod-cab-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-cab-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-cab-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-cab-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-cab-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-cab-999.
       acc-cod-cab-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice CAB                   *
      *    *-----------------------------------------------------------*
       vis-cod-cab-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      w-lpt-cod-cab-lin    to   v-lin                  .
           move      w-lpt-cod-cab-pos    to   v-pos                  .
           move      w-tes-cod-cab        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cab-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Denominazione sportello   *
      *    *-----------------------------------------------------------*
       vis-cod-cab-den-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      w-lpt-cod-cab-lin    to   v-lin                  .
           move      w-lpt-cod-cab-pos    to   v-pos                  .
           add       11                   to   v-pos                  .
           move      w-tes-cod-cab-den    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cab-den-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice CAB                   *
      *    *                                                           *
      *    * Subroutine di sostituzione                                *
      *    *-----------------------------------------------------------*
       acc-cod-cab-sos-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione segnale di sostituzione     *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-cod-cab-sns      .
      *                  *---------------------------------------------*
      *                  * Salvataggio immagine video                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      w-lpt-cod-cab-lin    to   v-lin                  .
           subtract  1                    from v-lin                  .
           move      w-lpt-cod-cab-pos    to   v-pos                  .
           subtract  1                    from v-pos                  .
           move      w-lpt-cod-cab-lin    to   v-lto                  .
           add       1                    to   v-lto                  .
           move      w-lpt-cod-cab-pos    to   v-pto                  .
           add       50                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cod-cab-sos-010.
      *                  *---------------------------------------------*
      *                  * Prompts per il box                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Valore da sostituire                    *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      w-lpt-cod-cab-lin    to   v-lin                  .
           move      w-lpt-cod-cab-pos    to   v-pos                  .
           move      "Da sostituire :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Con                                     *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      w-lpt-cod-cab-lin    to   v-lin                  .
           move      w-lpt-cod-cab-pos    to   v-pos                  .
           add       29                   to   v-pos                  .
           move      "Con :"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cod-cab-sos-100.
      *              *-------------------------------------------------*
      *              * Visualizzazioni                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore da sostituire        *
      *                  *---------------------------------------------*
           perform   vis-cod-cab-so1-000  thru vis-cod-cab-so1-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore sostitutivo          *
      *                  *---------------------------------------------*
           perform   vis-cod-cab-so2-000  thru vis-cod-cab-so2-999    .
       acc-cod-cab-sos-200.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore da sostituire                        *
      *                  *---------------------------------------------*
           perform   acc-cod-cab-so1-000  thru acc-cod-cab-so1-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-cod-cab-sos-600.
           if        v-key                =    "UP  "
                     go to acc-cod-cab-sos-600.
           if        v-key                =    "DOWN"
                     go to acc-cod-cab-sos-600.
       acc-cod-cab-sos-300.
      *                  *---------------------------------------------*
      *                  * Valore sostitutivo                          *
      *                  *---------------------------------------------*
           perform   acc-cod-cab-so2-000  thru acc-cod-cab-so2-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-cod-cab-sos-600.
           if        v-key                =    "UP  "
                     go to acc-cod-cab-sos-200.
       acc-cod-cab-sos-600.
      *              *-------------------------------------------------*
      *              * Controlli su valori accettati                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se i valori sono a zero : a dipendenze dal- *
      *                  * le impostazioni                             *
      *                  *---------------------------------------------*
           if        w-tes-cod-cab        =    zero  and
                     w-tes-cab-sos        =    zero
                     go to acc-cod-cab-sos-800.
      *                  *---------------------------------------------*
      *                  * Che i valori non siano uguali               *
      *                  *---------------------------------------------*
           if        w-tes-cod-cab        not  = w-tes-cab-sos
                     go to acc-cod-cab-sos-800.
      *                      *-----------------------------------------*
      *                      * Normalizzazione valore sostitutivo      *
      *                      *-----------------------------------------*
           move      zero                 to   w-tes-cab-sos          .
      *                      *-----------------------------------------*
      *                      * Segnale di sostituzione non effettuata  *
      *                      *-----------------------------------------*
           move      zero                 to   w-tes-cod-cab-sns      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     acc-cod-cab-sos-900.
       acc-cod-cab-sos-800.
      *              *-------------------------------------------------*
      *              * Dipendenza dalle impostazioni                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di sostituzione effettuata          *
      *                  *---------------------------------------------*
           if        w-tes-cod-cab        not  = zero or
                     w-tes-cab-sos        not  = zero
                     move  1              to   w-tes-cod-cab-sns      .
       acc-cod-cab-sos-900.
      *              *-------------------------------------------------*
      *              * Normalizzazione stato di uscita                 *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-cod-cab-sos-999.
       acc-cod-cab-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice CAB                   *
      *    *                                                           *
      *    * Subroutine di visualizzazione sostituzione                *
      *    *-----------------------------------------------------------*
       vis-cod-cab-sos-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del segnale di sostitu-  *
      *              * zione effettuata                                *
      *              *-------------------------------------------------*
           if        w-tes-cod-cab-sns    =    zero
                     go to vis-cod-cab-sos-100
           else      go to vis-cod-cab-sos-500.
       vis-cod-cab-sos-100.
      *              *-------------------------------------------------*
      *              * Se sostituzione non effettuata                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-cod-cab-lin    to   v-lin                  .
           move      w-lpt-cod-cab-pos    to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-cod-cab-sos-900.
       vis-cod-cab-sos-500.
      *              *-------------------------------------------------*
      *              * Se sostituzione effettuata                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing codice da sostituire                *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-tes-cod-cab        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Concatenamento prima parte                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-vis-lit-sos          .
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "( Sostituzione di :"
                                          to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      "- con :"            to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Editing codice sostitutivo                  *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-tes-cab-sos        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Concatenamento seconda parte                *
      *                  *---------------------------------------------*
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-vis-lit-sos        to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      ")"                  to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-cod-cab-lin    to   v-lin                  .
           move      w-lpt-cod-cab-pos    to   v-pos                  .
           move      w-vis-lit-sos        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-cod-cab-sos-900.
       vis-cod-cab-sos-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-cod-cab-sos-999.
       vis-cod-cab-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice CAB                   *
      *    *                                                           *
      *    * Subroutine di accettazione valore da sostituire           *
      *    *-----------------------------------------------------------*
       acc-cod-cab-so1-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-cab-so1-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-cab-ope      .
           move      w-tes-cod-abi        to   w-cod-mne-cab-abi      .
           move      w-tes-cod-cab        to   w-cod-mne-cab-cab      .
           move      w-lpt-cod-cab-lin    to   w-cod-mne-cab-lin      .
           move      w-lpt-cod-cab-pos    to   w-cod-mne-cab-pos      .
           add       16                   to   w-cod-mne-cab-pos      .
           move      zero                 to   w-cod-mne-cab-dln      .
           move      zero                 to   w-cod-mne-cab-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-cab-cll-000  thru cod-mne-cab-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-cab-foi-000  thru cod-mne-cab-foi-999    .
       acc-cod-cab-so1-110.
           perform   cod-mne-cab-cll-000  thru cod-mne-cab-cll-999    .
           if        w-cod-mne-cab-ope    =    "F+"
                     go to acc-cod-cab-so1-115.
           if        w-cod-mne-cab-ope    =    "AC"
                     go to acc-cod-cab-so1-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-cab-so1-115.
           perform   cod-mne-cab-foi-000  thru cod-mne-cab-foi-999    .
           go to     acc-cod-cab-so1-110.
       acc-cod-cab-so1-120.
           move      w-cod-mne-cab-cab    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-cab-so1-999.
       acc-cod-cab-so1-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cod-cab          .
       acc-cod-cab-so1-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-cab-so1-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-cab-so1-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-cab-so1-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-cab-so1-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-cab-so1-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-cab-so1-999.
       acc-cod-cab-so1-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice CAB                   *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore da sostituire        *
      *    *-----------------------------------------------------------*
       vis-cod-cab-so1-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      w-lpt-cod-cab-lin    to   v-lin                  .
           move      w-lpt-cod-cab-pos    to   v-pos                  .
           add       16                   to   v-pos                  .
           move      w-tes-cod-cab        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cab-so1-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice CAB                   *
      *    *                                                           *
      *    * Subroutine di accettazione valore sostitutivo             *
      *    *-----------------------------------------------------------*
       acc-cod-cab-so2-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-cab-so2-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-cab-ope      .
           move      w-tes-cod-abi        to   w-cod-mne-cab-abi      .
           move      w-tes-cab-sos        to   w-cod-mne-cab-cab      .
           move      w-lpt-cod-cab-lin    to   w-cod-mne-cab-lin      .
           move      w-lpt-cod-cab-pos    to   w-cod-mne-cab-pos      .
           add       35                   to   w-cod-mne-cab-pos      .
           move      zero                 to   w-cod-mne-cab-dln      .
           move      zero                 to   w-cod-mne-cab-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-cab-cll-000  thru cod-mne-cab-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-cab-foi-000  thru cod-mne-cab-foi-999    .
       acc-cod-cab-so2-110.
           perform   cod-mne-cab-cll-000  thru cod-mne-cab-cll-999    .
           if        w-cod-mne-cab-ope    =    "F+"
                     go to acc-cod-cab-so2-115.
           if        w-cod-mne-cab-ope    =    "AC"
                     go to acc-cod-cab-so2-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-cab-so2-115.
           perform   cod-mne-cab-foi-000  thru cod-mne-cab-foi-999    .
           go to     acc-cod-cab-so2-110.
       acc-cod-cab-so2-120.
           move      w-cod-mne-cab-cab    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-cab-so2-999.
       acc-cod-cab-so2-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cab-sos          .
       acc-cod-cab-so2-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-cab-so2-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-cab-so2-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-cab-so2-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-cab-so2-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-cab-so2-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-cab-so2-999.
       acc-cod-cab-so2-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice CAB                   *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore sostitutivo          *
      *    *-----------------------------------------------------------*
       vis-cod-cab-so2-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      w-lpt-cod-cab-lin    to   v-lin                  .
           move      w-lpt-cod-cab-pos    to   v-pos                  .
           add       35                   to   v-pos                  .
           move      w-tes-cab-sos        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cab-so2-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Conto corrente del cliente   *
      *    *-----------------------------------------------------------*
       acc-ccc-app-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-ccc-app-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      12                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-ccc-app        to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-ccc-app-999.
       acc-ccc-app-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-ccc-app          .
       acc-ccc-app-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-ccc-app-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-ccc-app-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-ccc-app-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-ccc-app-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-ccc-app-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-ccc-app-999.
       acc-ccc-app-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Conto corrente cliente            *
      *    *-----------------------------------------------------------*
       vis-ccc-app-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      12                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-ccc-app        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-ccc-app-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice nostra banca                  *
      *    *-----------------------------------------------------------*
       acc-nos-ban-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se richiesta sostituzione              *
      *                  *---------------------------------------------*
           if        w-tes-nos-ban-sns    =    zero
                     go to acc-nos-ban-100.
      *                  *---------------------------------------------*
      *                  * Forzatura del tasto Pf1                     *
      *                  *---------------------------------------------*
           move      "[1] "               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A test su Pf1                               *
      *                  *---------------------------------------------*
           go to     acc-nos-ban-300.
       acc-nos-ban-100.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      "[F1] per sostituzione"
                                          to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-cbp-ope      .
           move      02                   to   w-cod-des-cbp-tip      .
           move      w-tes-nos-ban        to   w-cod-des-cbp-cod      .
           move      w-lpt-nos-ban-lin    to   w-cod-des-cbp-lin      .
           move      w-lpt-nos-ban-pos    to   w-cod-des-cbp-pos      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "[1] "               to   v-pfk (14)             .
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
       acc-nos-ban-110.
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           if        w-cod-des-cbp-ope    =    "F+"
                     go to acc-nos-ban-115.
           if        w-cod-des-cbp-ope    =    "AC"
                     go to acc-nos-ban-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-nos-ban-115.
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
           go to     acc-nos-ban-110.
       acc-nos-ban-120.
           move      w-cod-des-cbp-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Cancellazione eventuali note operative          *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-nos-ban-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-nos-ban-999.
       acc-nos-ban-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-nos-ban          .
       acc-nos-ban-300.
      *              *-------------------------------------------------*
      *              * Se Pf1                                          *
      *              *-------------------------------------------------*
           if        v-key                not  = "[1] "
                     go to acc-nos-ban-400.
      *                  *---------------------------------------------*
      *                  * Subroutine di accettazione valore sostitu-  *
      *                  * tivo                                        *
      *                  *---------------------------------------------*
           perform   acc-nos-ban-sos-000  thru acc-nos-ban-sos-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-nos-ban-999.
      *                  *---------------------------------------------*
      *                  * Visualizzazione sostituzione effettuata     *
      *                  *---------------------------------------------*
           perform   vis-nos-ban-sos-000  thru vis-nos-ban-sos-999    .
      *                  *---------------------------------------------*
      *                  * Se sostituzione non effettuata ma impostati *
      *                  * valori : rivisualizzazione valori impostati *
      *                  *---------------------------------------------*
           if        w-tes-nos-ban-sns    not  = zero
                     go to acc-nos-ban-800.
      *                  *---------------------------------------------*
      *                  * Visualizzazione codice impostato            *
      *                  *---------------------------------------------*
           perform   vis-nos-ban-000      thru vis-nos-ban-999        .
       acc-nos-ban-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      02                   to   w-let-arc-cbp-tip      .
           move      w-tes-nos-ban        to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-cbp-des    to   w-tes-nos-ban-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-nos-ban-des-000  thru vis-nos-ban-des-999    .
       acc-nos-ban-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-nos-ban-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-nos-ban-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-nos-ban-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-nos-ban-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-nos-ban-999.
       acc-nos-ban-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostra banca               *
      *    *-----------------------------------------------------------*
       vis-nos-ban-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      w-lpt-nos-ban-lin    to   v-lin                  .
           move      w-lpt-nos-ban-pos    to   v-pos                  .
           move      w-tes-nos-ban        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-nos-ban-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Descrizione nostra banca          *
      *    *-----------------------------------------------------------*
       vis-nos-ban-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      w-lpt-nos-ban-lin    to   v-lin                  .
           move      w-lpt-nos-ban-pos    to   v-pos                  .
           add       11                   to   v-pos                  .
           move      w-tes-nos-ban-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-nos-ban-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice nostra banca                  *
      *    *                                                           *
      *    * Subroutine di sostituzione                                *
      *    *-----------------------------------------------------------*
       acc-nos-ban-sos-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione segnale di sostituzione     *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-nos-ban-sns      .
      *                  *---------------------------------------------*
      *                  * Salvataggio immagine video                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      w-lpt-nos-ban-lin    to   v-lin                  .
           subtract  1                    from v-lin                  .
           move      w-lpt-nos-ban-pos    to   v-pos                  .
           subtract  1                    from v-pos                  .
           move      w-lpt-nos-ban-lin    to   v-lto                  .
           add       1                    to   v-lto                  .
           move      w-lpt-nos-ban-pos    to   v-pto                  .
           add       50                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-nos-ban-sos-010.
      *                  *---------------------------------------------*
      *                  * Prompts per il box                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Valore da sostituire                    *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      w-lpt-nos-ban-lin    to   v-lin                  .
           move      w-lpt-nos-ban-pos    to   v-pos                  .
           move      "Da sostituire :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Con                                     *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      w-lpt-nos-ban-lin    to   v-lin                  .
           move      w-lpt-nos-ban-pos    to   v-pos                  .
           add       29                   to   v-pos                  .
           move      "Con :"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-nos-ban-sos-100.
      *              *-------------------------------------------------*
      *              * Visualizzazioni                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore da sostituire        *
      *                  *---------------------------------------------*
           perform   vis-nos-ban-so1-000  thru vis-nos-ban-so1-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore sostitutivo          *
      *                  *---------------------------------------------*
           perform   vis-nos-ban-so2-000  thru vis-nos-ban-so2-999    .
       acc-nos-ban-sos-200.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore da sostituire                        *
      *                  *---------------------------------------------*
           perform   acc-nos-ban-so1-000  thru acc-nos-ban-so1-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-nos-ban-sos-600.
           if        v-key                =    "UP  "
                     go to acc-nos-ban-sos-600.
           if        v-key                =    "DOWN"
                     go to acc-nos-ban-sos-600.
       acc-nos-ban-sos-300.
      *                  *---------------------------------------------*
      *                  * Valore sostitutivo                          *
      *                  *---------------------------------------------*
           perform   acc-nos-ban-so2-000  thru acc-nos-ban-so2-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-nos-ban-sos-600.
           if        v-key                =    "UP  "
                     go to acc-nos-ban-sos-200.
       acc-nos-ban-sos-600.
      *              *-------------------------------------------------*
      *              * Controlli su valori accettati                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se i valori sono a spaces : a dipendenze    *
      *                  * dalle impostazioni                          *
      *                  *---------------------------------------------*
           if        w-tes-nos-ban        =    spaces  and
                     w-tes-nos-sos        =    spaces
                     go to acc-nos-ban-sos-800.
      *                  *---------------------------------------------*
      *                  * Che i valori non siano uguali               *
      *                  *---------------------------------------------*
           if        w-tes-nos-ban        not  = w-tes-nos-sos
                     go to acc-nos-ban-sos-800.
      *                      *-----------------------------------------*
      *                      * Normalizzazione valore sostitutivo      *
      *                      *-----------------------------------------*
           move      spaces               to   w-tes-nos-sos          .
      *                      *-----------------------------------------*
      *                      * Segnale di sostituzione non effettuata  *
      *                      *-----------------------------------------*
           move      zero                 to   w-tes-nos-ban-sns      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     acc-nos-ban-sos-900.
       acc-nos-ban-sos-800.
      *              *-------------------------------------------------*
      *              * Dipendenza dalle impostazioni                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di sostituzione effettuata          *
      *                  *---------------------------------------------*
           if        w-tes-nos-ban        not  = spaces or
                     w-tes-nos-sos        not  = spaces
                     move  1              to   w-tes-nos-ban-sns      .
       acc-nos-ban-sos-900.
      *              *-------------------------------------------------*
      *              * Normalizzazione stato di uscita                 *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-nos-ban-sos-999.
       acc-nos-ban-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice nostra banca                  *
      *    *                                                           *
      *    * Subroutine di visualizzazione sostituzione                *
      *    *-----------------------------------------------------------*
       vis-nos-ban-sos-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del segnale di sostitu-  *
      *              * zione effettuata                                *
      *              *-------------------------------------------------*
           if        w-tes-nos-ban-sns    =    zero
                     go to vis-nos-ban-sos-100
           else      go to vis-nos-ban-sos-500.
       vis-nos-ban-sos-100.
      *              *-------------------------------------------------*
      *              * Se sostituzione non effettuata                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-nos-ban-lin    to   v-lin                  .
           move      w-lpt-nos-ban-pos    to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-nos-ban-sos-900.
       vis-nos-ban-sos-500.
      *              *-------------------------------------------------*
      *              * Se sostituzione effettuata                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Concatenamento prima parte                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-vis-lit-sos          .
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "( Sostituzione di :"
                                          to   w-all-str-cat (1)      .
      *
           if        w-tes-nos-ban        =    spaces
                     move  "[BASE]"       to   w-all-str-cat (2)
           else      move  w-tes-nos-ban  to   w-all-str-cat (2)      .
      *
           move      "- con :"            to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Concatenamento seconda parte                *
      *                  *---------------------------------------------*
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-vis-lit-sos        to   w-all-str-cat (1)      .
      *
           if        w-tes-nos-sos        =    spaces
                     move  "[BASE]"       to   w-all-str-cat (2)
           else      move  w-tes-nos-sos  to   w-all-str-cat (2)      .
      *
           move      ")"                  to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-nos-ban-lin    to   v-lin                  .
           move      w-lpt-nos-ban-pos    to   v-pos                  .
           move      w-vis-lit-sos        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-nos-ban-sos-900.
       vis-nos-ban-sos-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-nos-ban-sos-999.
       vis-nos-ban-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice nostra banca                  *
      *    *                                                           *
      *    * Subroutine di accettazione valore da sostituire           *
      *    *-----------------------------------------------------------*
       acc-nos-ban-so1-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-nos-ban-so1-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-cbp-ope      .
           move      02                   to   w-cod-des-cbp-tip      .
           move      w-tes-nos-ban        to   w-cod-des-cbp-cod      .
           move      w-lpt-nos-ban-lin    to   w-cod-des-cbp-lin      .
           move      w-lpt-nos-ban-pos    to   w-cod-des-cbp-pos      .
           add       16                   to   w-cod-des-cbp-pos      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
       acc-nos-ban-so1-110.
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           if        w-cod-des-cbp-ope    =    "F+"
                     go to acc-nos-ban-so1-115.
           if        w-cod-des-cbp-ope    =    "AC"
                     go to acc-nos-ban-so1-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-nos-ban-so1-115.
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
           go to     acc-nos-ban-so1-110.
       acc-nos-ban-so1-120.
           move      w-cod-des-cbp-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-nos-ban-so1-999.
       acc-nos-ban-so1-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-nos-ban          .
       acc-nos-ban-so1-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-nos-ban-so1-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-nos-ban-so1-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-nos-ban-so1-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-nos-ban-so1-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-nos-ban-so1-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-nos-ban-so1-999.
       acc-nos-ban-so1-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostra banca               *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore da sostituire        *
      *    *-----------------------------------------------------------*
       vis-nos-ban-so1-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      w-lpt-nos-ban-lin    to   v-lin                  .
           move      w-lpt-nos-ban-pos    to   v-pos                  .
           add       16                   to   v-pos                  .
           move      w-tes-nos-ban        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-nos-ban-so1-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice nostra banca                  *
      *    *                                                           *
      *    * Subroutine di accettazione valore sostitutivo             *
      *    *-----------------------------------------------------------*
       acc-nos-ban-so2-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-nos-ban-so2-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-cbp-ope      .
           move      02                   to   w-cod-des-cbp-tip      .
           move      w-tes-nos-sos        to   w-cod-des-cbp-cod      .
           move      w-lpt-nos-ban-lin    to   w-cod-des-cbp-lin      .
           move      w-lpt-nos-ban-pos    to   w-cod-des-cbp-pos      .
           add       35                   to   w-cod-des-cbp-pos      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
       acc-nos-ban-so2-110.
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           if        w-cod-des-cbp-ope    =    "F+"
                     go to acc-nos-ban-so2-115.
           if        w-cod-des-cbp-ope    =    "AC"
                     go to acc-nos-ban-so2-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-nos-ban-so2-115.
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
           go to     acc-nos-ban-so2-110.
       acc-nos-ban-so2-120.
           move      w-cod-des-cbp-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-nos-ban-so2-999.
       acc-nos-ban-so2-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-nos-sos          .
       acc-nos-ban-so2-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-nos-ban-so2-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-nos-ban-so2-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-nos-ban-so2-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-nos-ban-so2-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-nos-ban-so2-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-nos-ban-so2-999.
       acc-nos-ban-so2-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostra banca               *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore sostitutivo          *
      *    *-----------------------------------------------------------*
       vis-nos-ban-so2-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      w-lpt-nos-ban-lin    to   v-lin                  .
           move      w-lpt-nos-ban-pos    to   v-pos                  .
           add       35                   to   v-pos                  .
           move      w-tes-nos-sos        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-nos-ban-so2-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice nostra banca presentazione    *
      *    *-----------------------------------------------------------*
       acc-nos-bpe-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-nos-bpe-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-cbp-ope      .
           move      02                   to   w-cod-des-cbp-tip      .
           move      w-tes-nos-bpe        to   w-cod-des-cbp-cod      .
           move      16                   to   w-cod-des-cbp-lin      .
           move      30                   to   w-cod-des-cbp-pos      .
           move      16                   to   w-cod-des-cbp-dln      .
           move      41                   to   w-cod-des-cbp-dps      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
       acc-nos-bpe-110.
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           if        w-cod-des-cbp-ope    =    "F+"
                     go to acc-nos-bpe-115.
           if        w-cod-des-cbp-ope    =    "AC"
                     go to acc-nos-bpe-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-nos-bpe-115.
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
           go to     acc-nos-bpe-110.
       acc-nos-bpe-120.
           move      w-cod-des-cbp-cod    to   v-alf                  .
       acc-nos-bpe-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-nos-bpe-999.
       acc-nos-bpe-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-nos-bpe          .
       acc-nos-bpe-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      02                   to   w-let-arc-cbp-tip      .
           move      w-tes-nos-bpe        to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-cbp-des    to   w-tes-nos-bpe-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-nos-bpe-des-000  thru vis-nos-bpe-des-999    .
       acc-nos-bpe-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-nos-bpe-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-nos-bpe-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-nos-bpe-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-nos-bpe-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-nos-bpe-999.
       acc-nos-bpe-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostra banca               *
      *    *-----------------------------------------------------------*
       vis-nos-bpe-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      16                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-nos-bpe        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-nos-bpe-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostra banca , descrizione *
      *    *-----------------------------------------------------------*
       vis-nos-bpe-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      16                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-nos-bpe-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-nos-bpe-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice nostro c/c postale            *
      *    *-----------------------------------------------------------*
       acc-nos-ccp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-nos-ccp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-cbp-ope      .
           move      03                   to   w-cod-des-cbp-tip      .
           move      w-tes-nos-ccp        to   w-cod-des-cbp-cod      .
           move      17                   to   w-cod-des-cbp-lin      .
           move      30                   to   w-cod-des-cbp-pos      .
           move      17                   to   w-cod-des-cbp-dln      .
           move      41                   to   w-cod-des-cbp-dps      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
       acc-nos-ccp-110.
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           if        w-cod-des-cbp-ope    =    "F+"
                     go to acc-nos-ccp-115.
           if        w-cod-des-cbp-ope    =    "AC"
                     go to acc-nos-ccp-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-nos-ccp-115.
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
           go to     acc-nos-ccp-110.
       acc-nos-ccp-120.
           move      w-cod-des-cbp-cod    to   v-alf                  .
       acc-nos-ccp-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-nos-ccp-999.
       acc-nos-ccp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-nos-ccp          .
       acc-nos-ccp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      03                   to   w-let-arc-cbp-tip      .
           move      w-tes-nos-ccp        to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-cbp-des    to   w-tes-nos-ccp-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-nos-ccp-des-000  thru vis-nos-ccp-des-999    .
       acc-nos-ccp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-nos-ccp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-nos-ccp-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-nos-ccp-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-nos-ccp-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-nos-ccp-999.
       acc-nos-ccp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostro c/c postale         *
      *    *-----------------------------------------------------------*
       vis-nos-ccp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      17                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-nos-ccp        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-nos-ccp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostro c/c postale, des-   *
      *    * crizione                                                  *
      *    *-----------------------------------------------------------*
       vis-nos-ccp-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      17                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-nos-ccp-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-nos-ccp-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Addebito spese incasso               *
      *    *-----------------------------------------------------------*
       acc-add-spi-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-add-spi-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-zin-ope      .
           move      w-tes-add-spi        to   w-cod-cod-zin-cod      .
           move      18                   to   w-cod-cod-zin-lin      .
           move      30                   to   w-cod-cod-zin-pos      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-spi-cll-000  thru cod-cod-spi-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-spi-foi-000  thru cod-cod-spi-foi-999    .
       acc-add-spi-110.
           perform   cod-cod-spi-cll-000  thru cod-cod-spi-cll-999    .
           if        w-cod-cod-zin-ope    =    "F+"
                     go to acc-add-spi-115.
           if        w-cod-cod-zin-ope    =    "AC"
                     go to acc-add-spi-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-add-spi-115.
           perform   cod-cod-spi-foi-000  thru cod-cod-spi-foi-999    .
           go to     acc-add-spi-110.
       acc-add-spi-120.
           move      w-cod-cod-zin-cod    to   v-alf                  .
       acc-add-spi-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-add-spi-999.
       acc-add-spi-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-add-spi          .
       acc-add-spi-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      w-tes-add-spi        to   w-let-arc-zin-cod      .
           perform   let-arc-zin-000      thru let-arc-zin-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-zin-des    to   w-tes-add-spi-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-add-spi-des-000  thru vis-add-spi-des-999    .
       acc-add-spi-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-add-spi-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-add-spi-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-add-spi-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-add-spi-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-add-spi-999.
       acc-add-spi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Addebito spese incasso            *
      *    *-----------------------------------------------------------*
       vis-add-spi-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      18                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-add-spi        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-add-spi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Descrizione addebito spe- *
      *    * se incasso                                                *
      *    *-----------------------------------------------------------*
       vis-add-spi-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      18                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-add-spi-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-add-spi-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Addebito spese bollo         *
      *    *-----------------------------------------------------------*
       acc-add-spb-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-add-spb-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-zbo-ope      .
           move      w-tes-add-spb        to   w-cod-cod-zbo-cod      .
           move      19                   to   w-cod-cod-zbo-lin      .
           move      30                   to   w-cod-cod-zbo-pos      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-spb-cll-000  thru cod-cod-spb-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-spb-foi-000  thru cod-cod-spb-foi-999    .
       acc-add-spb-110.
           perform   cod-cod-spb-cll-000  thru cod-cod-spb-cll-999    .
           if        w-cod-cod-zbo-ope    =    "F+"
                     go to acc-add-spb-115.
           if        w-cod-cod-zbo-ope    =    "AC"
                     go to acc-add-spb-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-add-spb-115.
           perform   cod-cod-spb-foi-000  thru cod-cod-spb-foi-999    .
           go to     acc-add-spb-110.
       acc-add-spb-120.
           move      w-cod-cod-zbo-cod    to   v-alf                  .
       acc-add-spb-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-add-spb-999.
       acc-add-spb-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-add-spb          .
       acc-add-spb-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      w-tes-add-spb        to   w-let-arc-zbo-cod      .
           perform   let-arc-zbo-000      thru let-arc-zbo-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-zbo-des    to   w-tes-add-spb-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-add-spb-des-000  thru vis-add-spb-des-999    .
       acc-add-spb-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-add-spb-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-add-spb-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-add-spb-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-add-spb-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-add-spb-999.
       acc-add-spb-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Addebito spese bollo              *
      *    *-----------------------------------------------------------*
       vis-add-spb-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      19                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-add-spb        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-add-spb-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Descrizione addebito spese bollo  *
      *    *-----------------------------------------------------------*
       vis-add-spb-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      19                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-add-spb-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-add-spb-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Tipo esclusione mese         *
      *    *-----------------------------------------------------------*
       acc-tip-esm-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-tip-esm-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-esm-lun    to   v-car                  .
           move      w-exp-tip-esm-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      21                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-tip-esm-tbl    to   v-txt                  .
           move      w-tes-tip-esm        to   v-num                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-tip-esm-999.
       acc-tip-esm-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-tip-esm          .
       acc-tip-esm-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-tip-esm-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-tip-esm-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-tip-esm-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-tip-esm-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-tip-esm-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-tip-esm-999.
       acc-tip-esm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Tipo esclusione mese      *
      *    *-----------------------------------------------------------*
       vis-tip-esm-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-esm-lun    to   v-car                  .
           move      w-exp-tip-esm-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      21                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-tip-esm-tbl    to   v-txt                  .
           move      w-tes-tip-esm        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-esm-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Conferma impostazioni                *
      *    *-----------------------------------------------------------*
       acc-cnf-imp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea 23                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Linea 24                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Conferma impostazioni (S/N/E) ? "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione valore da impostare         *
      *                  *---------------------------------------------*
           move      spaces               to   w-tes-cnf-imp          .
       acc-cnf-imp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      33                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-tes-cnf-imp        to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cnf-imp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-cnf-imp          .
       acc-cnf-imp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se impostata una function-key prevista : Ok *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  " or
                     v-key                =    "DO  " or
                     v-key                =    "EXIT"
                     go to acc-cnf-imp-450.
      *                  *---------------------------------------------*
      *                  * Se impostato un carattere previsto : Ok     *
      *                  *---------------------------------------------*
           if        w-tes-cnf-imp        =    "S" or
                     w-tes-cnf-imp        =    "N" or
                     w-tes-cnf-imp        =    "E"
                     go to acc-cnf-imp-450.
      *                  *---------------------------------------------*
      *                  * Altrimenti : reimpostazione                 *
      *                  *---------------------------------------------*
           go to     acc-cnf-imp-100.
       acc-cnf-imp-450.
      *                  *---------------------------------------------*
      *                  * Cancellazione prompts                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea 23                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Linea 24                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cnf-imp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda della function-key o   *
      *                  * del carattere impostato                     *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-cnf-imp-625
           else if   v-key                =    "DO  "
                     go to acc-cnf-imp-650
           else if   v-key                =    "EXIT"
                     go to acc-cnf-imp-675.
           if        w-tes-cnf-imp        =    "N"
                     go to acc-cnf-imp-625
           else if   w-tes-cnf-imp        =    "S"
                     go to acc-cnf-imp-650
           else if   w-tes-cnf-imp        =    "E"
                     go to acc-cnf-imp-675.
       acc-cnf-imp-625.
      *                  *---------------------------------------------*
      *                  * Se Up o 'N'                                 *
      *                  *---------------------------------------------*
           move      "UP  "               to   v-key                  .
           go to     acc-cnf-imp-999.
       acc-cnf-imp-650.
      *                  *---------------------------------------------*
      *                  * Se Do o 'S'                                 *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
           go to     acc-cnf-imp-999.
       acc-cnf-imp-675.
      *                  *---------------------------------------------*
      *                  * Se Exit o 'E'                               *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-key      .
           go to     acc-cnf-imp-999.
       acc-cnf-imp-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi non chiave della registrazione         *
      *    *-----------------------------------------------------------*
       acc-nok-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-nok      .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           perform   vis-tip-fun-000      thru vis-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione se in modi- *
      *              * fica o visualizzazione, per testata e corpo     *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M" or
                     w-cnt-mfu-tip-fun    =    "V"
                     move  "#"            to   w-cnt-sts-imp-tes
                     move  all "#"        to   w-cnt-sts-imp-pte
                     move  all "#"        to   w-cnt-sts-ing-pte
                     move  "#"            to   w-cnt-sts-imp-cor      .
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione per piede   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-pie      .
       acc-nok-reg-200.
      *              *-------------------------------------------------*
      *              * Trattamento testata                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione del numero di pagine che     *
      *                  * compongono la testata                       *
      *                  *---------------------------------------------*
           perform   dmp-tes-reg-000      thru dmp-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati corpo                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-cor      
                                               w-cnt-sts-vis-cor      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati riga corpo             *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-rig      
                                               w-cnt-sts-vis-rig      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati piede                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-pie      
                                               w-cnt-sts-vis-pie      .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-key    =    spaces
                     perform pmt-key-reg-000
                                          thru pmt-key-reg-999
                     move    "#"          to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati campi chiave           *
      *                  *---------------------------------------------*
           if        w-cnt-sts-vis-key    =    spaces
                     perform vis-key-reg-000
                                          thru vis-key-reg-999
                     move    "#"          to   w-cnt-sts-vis-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per pagina di testata               *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-ptx
                    (w-cnt-sts-imp-npt)   =    spaces
                     perform pmt-tes-reg-000
                                          thru pmt-tes-reg-999
                     move    "#"          to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati pagina testata         *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M"      or
                     w-cnt-mfu-tip-fun    =    "V"      or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces or
                     w-cnt-sts-ing-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     if    w-cnt-sts-vis-ptx
                          (w-cnt-sts-imp-npt)
                                          =    spaces
                           perform vis-tes-reg-000
                                          thru vis-tes-reg-999
                           move    "#"    to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Flag di ingresso in pagina di testata       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-ing-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione dati testata                   *
      *                  *---------------------------------------------*
           perform   acc-tes-reg-000      thru acc-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita definitivo                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "S" or
                     w-cnt-tus-acc-tes    =    "X" or
                     w-cnt-tus-acc-tes    =    "E"
                     move  w-cnt-tus-acc-tes
                                          to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999.
      *                  *---------------------------------------------*
      *                  * Se spostamento di pagina                    *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "-"
                     go to acc-nok-reg-225
           else      go to acc-nok-reg-250.
       acc-nok-reg-225.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina precedente      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' 1 si ignora *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  > 1
                     go to acc-nok-reg-200.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina attuale a : no    *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
       acc-nok-reg-230.
      *                          *-------------------------------------*
      *                          * Decremento numero pagina attuale    *
      *                          *-------------------------------------*
           subtract  1                    from w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : decremento ulteriore        *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces and
                     w-cnt-sts-imp-npt    >    1
                     go to acc-nok-reg-230.
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-250.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina successiva      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Salvataggio numero pagina attuale   *
      *                          *-------------------------------------*
           move      w-cnt-sts-imp-npt    to   w-cnt-sts-imp-svp      .
       acc-nok-reg-260.
      *                          *-------------------------------------*
      *                          * Status di impostazione dati della   *
      *                          * della pagina attuale a : si'        *
      *                          *-------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si pone lo status di impostazione   *
      *                          * dati generale testata a si'         *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  "#"            to   w-cnt-sts-imp-tes      .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si va' ad accettazione corpo        *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  w-cnt-sts-imp-svp
                                          to   w-cnt-sts-imp-npt
                     go to acc-nok-reg-300.
      *                          *-------------------------------------*
      *                          * Incremento numero pagina attuale    *
      *                          *-------------------------------------*
           add       1                    to   w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : a re-incremento             *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces
                     go to acc-nok-reg-260.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina impostata a : no  *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-svp)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-svp)     .
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-300.
      *                  *---------------------------------------------*
      *                  * Numero riga corpo da accettare : 1          *
      *                  *---------------------------------------------*
           move       1                   to   w-cnt-cor-nrg-dac      .
       acc-nok-reg-400.
      *              *-------------------------------------------------*
      *              * Trattamento corpo                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati chiave                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      
                                               w-cnt-sts-vis-key      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati testata                *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-tes
                                               w-cnt-sts-pmt-pte
                                               w-cnt-sts-vis-tes
                                               w-cnt-sts-vis-pte      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati piede                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-pie      
                                               w-cnt-sts-vis-pie      .
      *                  *---------------------------------------------*
      *                  * Accettazione dati corpo                     *
      *                  *---------------------------------------------*
           perform   acc-cor-reg-000      thru acc-cor-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita definitivo                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-cor    =    "S" or
                     w-cnt-tus-acc-cor    =    "X" or
                     w-cnt-tus-acc-cor    =    "E"
                     move  w-cnt-tus-acc-cor
                                          to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999.
      *                  *---------------------------------------------*
      *                  * Se tipo uscita "-"                          *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-cor    =    "-"
                     go to acc-nok-reg-200.
       acc-nok-reg-800.
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Se attualmente visualizzato il corpo si e-  *
      *                  * segue la visualizzazione dei prompts della  *
      *                  * riga corpo espansa                          *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-cor    =    spaces
                     go to acc-nok-reg-805.
           perform   pmt-rig-cor-000      thru pmt-rig-cor-999        .
       acc-nok-reg-805.
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-nok-reg-810.
      *                  *---------------------------------------------*
      *                  * Test se sola visualizzazione                *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to acc-nok-reg-820
           else      go to acc-nok-reg-830.
       acc-nok-reg-820.
      *                      *-----------------------------------------*
      *                      * Accettazione se sola visualizzazione    *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#VIS"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "E"                  to   v-msk                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "E"
                     move  "EXIT"         to   v-key                  .
           go to     acc-nok-reg-840.
       acc-nok-reg-830.
      *                      *-----------------------------------------*
      *                      * Accettazione se inserimento o modifica  *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#SAV"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "E"           to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-nok-reg-840.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-nok-reg-850
           else if   v-key                =    "EXIT"
                     go to acc-nok-reg-860
           else if   v-key                =    "UP  "
                     go to acc-nok-reg-870
           else      go to acc-nok-reg-810.
       acc-nok-reg-850.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-tus-acc-nok      .
           perform   cnt-tdo-nok-000      thru cnt-tdo-nok-999        .
           if        w-cnt-tdo-nok-flg    not  = spaces
                     go to acc-nok-reg-870.
           go to     acc-nok-reg-999.
       acc-nok-reg-860.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine di controllo per Exit        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se Exit non attivato : come 'Up'    *
      *                          *-------------------------------------*
           perform   exe-acc-cmp-exi-000  thru exe-acc-cmp-exi-999    .
           if        w-cnt-acc-flg-exi    not  = spaces
                     go to acc-nok-reg-870.
      *                          *-------------------------------------*
      *                          * Se Exit attivato                    *
      *                          *-------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-nok      .
           go to     acc-nok-reg-999.
       acc-nok-reg-870.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nr riga corpo da accettare : max        *
      *                      *-----------------------------------------*
           move      w-rlt-sup-max        to   w-cnt-cor-nrg-dac      .
      *                      *-----------------------------------------*
      *                      * Ad accettazione corpo                   *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
           go to     acc-nok-reg-400.
       acc-nok-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione numero pagine che compongono la testata    *
      *    *-----------------------------------------------------------*
       dmp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * La testata e' composta di nr. 1 pagine          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-sts-imp-mpt      .
       dmp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione si/no pagina w-cnt-sts-imp-npt da trattare *
      *    *-----------------------------------------------------------*
       snp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Flag di uscita a Si                             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-snp      .
       snp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione testata registrazione                        *
      *    *-----------------------------------------------------------*
       acc-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-tes      .
      *              *-------------------------------------------------*
      *              * Normalizzazione function-key                    *
      *              *-------------------------------------------------*
           move      spaces               to   v-key                  .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : testata                     *
      *              *-------------------------------------------------*
           move      "T"                  to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Disabilitazione forzata del tasto Delt      *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-itd      .
      *                  *---------------------------------------------*
      *                  * Fine Pagina                                 *
      *                  *---------------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-tes      .
           go to     acc-tes-reg-999.
       acc-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione testata registrazione                     *
      *    *-----------------------------------------------------------*
       vis-tes-reg-000.
       vis-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts testata                           *
      *    *-----------------------------------------------------------*
       pmt-tes-reg-000.
       pmt-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Presa visione per pagina     *
      *    *-----------------------------------------------------------*
       acc-pre-vpg-000.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      spaces               to   v-msk                  .
           move      spaces               to   v-alf                  .
           move      spaces               to   v-not                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-pre-vpg-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-pre-vpg-000.
       acc-pre-vpg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione corpo a partire dalla riga con numero d'or-  *
      *    * dine : w-cnt-cor-nrg-dac                                  *
      *    *-----------------------------------------------------------*
       acc-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita da corpo            *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-cor      .
      *              *-------------------------------------------------*
      *              * Confronto tra numero d'ordine riga da accettare *
      *              * e numero d'ordine dell'ultima riga              *
      *              *-------------------------------------------------*
           if        w-cnt-cor-nrg-dac    not  > w-rlt-sup-max
                     go to acc-cor-reg-025.
      *              *-------------------------------------------------*
      *              * Se oltre numero riga massimo si esce con status *
      *              * di uscita "+"                                   *
      *              *-------------------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-025.
      *              *-------------------------------------------------*
      *              * Video in 'OFF'                                  *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Prompts per corpo                               *
      *              *-------------------------------------------------*
           if        w-cnt-sts-pmt-cor    =    spaces
                     perform pmt-cor-reg-000
                                          thru pmt-cor-reg-999
                     move    "#"          to   w-cnt-sts-pmt-cor      .
      *              *-------------------------------------------------*
      *              * Visualizzazione dati corpo                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione nr pagina da visualizzare    *
      *                  *---------------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrp-dav      .
           add       w-lin-num-lin-vis    to   w-cnt-cor-nrp-dav      .
           subtract  1                    from w-cnt-cor-nrp-dav      .
           divide    w-lin-num-lin-vis    into w-cnt-cor-nrp-dav      .
      *                  *---------------------------------------------*
      *                  * Se non e' visualizzata nessuna pagina corpo *
      *                  * o una pagina corpo diversa da quella da vi- *
      *                  * sualizzare si procede alla visualizzazione  *
      *                  *---------------------------------------------*
           if        w-cnt-sts-vis-cor    =    spaces           or
                     w-cnt-cor-nrp-vis    not  = w-cnt-cor-nrp-dav
                     perform vis-cor-reg-000
                                          thru vis-cor-reg-999
                     move    "#"          to   w-cnt-sts-vis-cor
                     move    w-cnt-cor-nrp-dav
                                          to   w-cnt-cor-nrp-vis      .
      *              *-------------------------------------------------*
      *              * Lettura riga da file relative di supporto       *
      *              *-------------------------------------------------*
           move      "RD"                 to   w-rlt-sup-ope          .
           move      w-cnt-cor-nrg-dac    to   w-rlt-sup-prg          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
           move      w-rlt-sup-buf        to   w-rig                  .
       acc-cor-reg-050.
      *              *-------------------------------------------------*
      *              * Routine pre-accettazione riga corpo             *
      *              *-------------------------------------------------*
           perform   pre-rig-cor-000      thru pre-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts per riga d'accettazione *
      *              *-------------------------------------------------*
           perform   pmt-rig-cor-000      thru pmt-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione dati per riga di accettazione   *
      *              *-------------------------------------------------*
           perform   vis-rig-cor-000      thru vis-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Video in 'ON'                                   *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Flag di status impostazione corpo               *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-cor      .
      *              *-------------------------------------------------*
      *              * Flag di status impostione riga attuale          *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-rig      .
      *              *-------------------------------------------------*
      *              * Indicatore linea in corso di trattamento        *
      *              *-------------------------------------------------*
           move      "I"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita da riga corpo       *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-rig      .
       acc-cor-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo impostazione : primo campo riga corpo  *
      *                  *---------------------------------------------*
           move      "C"                  to   w-cnt-mfu-tip-imp      .
      *                  *---------------------------------------------*
      *                  * Accettazione Codice cliente                 *
      *                  *---------------------------------------------*
           perform   acc-cod-cli-000      thru acc-cod-cli-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-925.
      *                  *---------------------------------------------*
      *                  * Tipo impostazione : altri campi riga corpo  *
      *                  *---------------------------------------------*
           move      "R"                  to   w-cnt-mfu-tip-imp      .
       acc-cor-reg-200.
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Codice forma di pagamento                   *
      *                  *---------------------------------------------*
           perform   acc-rig-fop-000      thru acc-rig-fop-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
       acc-cor-reg-250.
      *                  *---------------------------------------------*
      *                  * Codice  A.B.I.                              *
      *                  *---------------------------------------------*
           perform   acc-rig-abi-000      thru acc-rig-abi-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-200.
       acc-cor-reg-300.
      *                  *---------------------------------------------*
      *                  * Codice  C.A.B.                              *
      *                  *---------------------------------------------*
           perform   acc-rig-cab-000      thru acc-rig-cab-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-250.
       acc-cor-reg-350.
      *                  *---------------------------------------------*
      *                  * Conto corrente del cliente                  *
      *                  *---------------------------------------------*
           perform   acc-rig-app-000      thru acc-rig-app-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-300.
       acc-cor-reg-400.
      *                  *---------------------------------------------*
      *                  * Codice nostra banca                         *
      *                  *---------------------------------------------*
           perform   acc-rig-ban-000      thru acc-rig-ban-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-350.
       acc-cor-reg-420.
      *                  *---------------------------------------------*
      *                  * Codice nostra banca presentazione effetti   *
      *                  *---------------------------------------------*
           perform   acc-rig-bpe-000      thru acc-rig-bpe-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-400.
       acc-cor-reg-450.
      *                  *---------------------------------------------*
      *                  * Codice nostro c/c postale                   *
      *                  *---------------------------------------------*
           perform   acc-rig-ccp-000      thru acc-rig-ccp-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-420.
       acc-cor-reg-500.
      *                  *---------------------------------------------*
      *                  * Addebito spese incasso                      *
      *                  *---------------------------------------------*
           perform   acc-rig-spi-000      thru acc-rig-spi-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-450.
       acc-cor-reg-550.
      *                  *---------------------------------------------*
      *                  * Addebito spese bollo                        *
      *                  *---------------------------------------------*
           perform   acc-rig-spb-000      thru acc-rig-spb-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-500.
       acc-cor-reg-600.
      *                  *---------------------------------------------*
      *                  * Tipo esclusione mesi                        *
      *                  *---------------------------------------------*
           perform   acc-rig-esm-000      thru acc-rig-esm-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-550.
       acc-cor-reg-650.
      *                  *---------------------------------------------*
      *                  * Giorno fisso scadenza                       *
      *                  *---------------------------------------------*
           perform   acc-ggg-alt-000      thru acc-ggg-alt-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-600.
       acc-cor-reg-700.
      *                  *---------------------------------------------*
      *                  * I mese di esclusione                        *
      *                  *---------------------------------------------*
           perform   acc-mmm-e01-000      thru acc-mmm-e01-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-650.
       acc-cor-reg-750.
      *                  *---------------------------------------------*
      *                  * II mese di esclusione                       *
      *                  *---------------------------------------------*
           perform   acc-mmm-e02-000      thru acc-mmm-e02-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-700.
       acc-cor-reg-800.
      *              *-------------------------------------------------*
      *              * Controllo finale su riga impostata              *
      *              *-------------------------------------------------*
           perform   cnt-tdo-rig-000      thru cnt-tdo-rig-999        .
           if        w-cnt-tdo-rig-flg    not  = spaces
                     move  spaces         to   w-cnt-tdo-rig-flg
                     move  "UP  "         to   v-key
                     go to acc-cor-reg-200.
       acc-cor-reg-900.
      *              *-------------------------------------------------*
      *              * Tests per uscita significativa da interno riga  *
      *              *-------------------------------------------------*
           if        w-cnt-tus-acc-rig    =    spaces or
                     w-cnt-tus-acc-rig    =    "S"
                     go to acc-cor-reg-905.
      *                  *---------------------------------------------*
      *                  * Se Exit da interno riga                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione numero riga             *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
           go to     acc-cor-reg-000.
       acc-cor-reg-905.
      *                  *---------------------------------------------*
      *                  * Se Do da interno riga                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Routine post-accettazione riga          *
      *                      *-----------------------------------------*
           move      "+"                  to   w-cnt-cor-tip-agg      .
           perform   pos-rig-cor-000      thru pos-rig-cor-999        .
      *                      *-----------------------------------------*
      *                      * Update riga su file relative di suppor- *
      *                      * to                                      *
      *                      *-----------------------------------------*
           move      "UP"                 to   w-rlt-sup-ope          .
           move      w-cnt-cor-nrg-dac    to   w-rlt-sup-prg          .
           move      w-rig                to   w-rlt-sup-buf          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
      *                      *-----------------------------------------*
      *                      * Visualizzazione linea corpo             *
      *                      *-----------------------------------------*
           move      "R"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Incremento del numero d'ordine della    *
      *                      * riga da accettare                       *
      *                      *-----------------------------------------*
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-925.
      *              *-------------------------------------------------*
      *              * Tests per uscita significativa dal primo campo  *
      *              * di impostazione della riga                      *
      *              *-------------------------------------------------*
           if        w-cnt-tus-acc-rig    =    "U"
                     go to acc-cor-reg-935
           else if   w-cnt-tus-acc-rig    =    "D"
                     go to acc-cor-reg-940
           else if   w-cnt-tus-acc-rig    =    "S"
                     go to acc-cor-reg-945
           else if   w-cnt-tus-acc-rig    =    "T"
                     go to acc-cor-reg-965
           else if   w-cnt-tus-acc-rig    =    "B"
                     go to acc-cor-reg-970
           else if   w-cnt-tus-acc-rig    =    "N"
                     go to acc-cor-reg-975
           else if   w-cnt-tus-acc-rig    =    "P"
                     go to acc-cor-reg-980
           else if   w-cnt-tus-acc-rig    =    "."
                     go to acc-cor-reg-985.
       acc-cor-reg-930.
      *                  *---------------------------------------------*
      *                  * Se Exit da primo campo di impostazione riga *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-935.
      *                  *---------------------------------------------*
      *                  * Se Up da primo campo di impostazione riga   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Decremento numero riga da accettare     *
      *                      *-----------------------------------------*
           subtract  1                    from w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-940.
      *                  *---------------------------------------------*
      *                  * Se Down da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Incremento del numero riga              *
      *                      *-----------------------------------------*
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-945.
      *                  *---------------------------------------------*
      *                  * Se Do da primo campo di impostazione riga   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di uscita a 'S'                  *
      *                      *-----------------------------------------*
           move      "S"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-965.
      *                  *---------------------------------------------*
      *                  * Se Tab da primo campo di impostazione riga  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Ad accettazione ultimo record           *
      *                      *-----------------------------------------*
           move      w-rlt-sup-max        to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-970.
      *                  *---------------------------------------------*
      *                  * Se Back da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
           move      1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-975.
      *                  *---------------------------------------------*
      *                  * Se Nxsc da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Determinazione numero d'ordine della    *
      *                      * prima riga appartenente alla pagina     *
      *                      * successiva a quella attuale             *
      *                      *-----------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-cnt-wrk-ctr-001      .
           add       w-lin-num-lin-vis    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001      .
           multiply  w-lin-num-lin-vis    by   w-cnt-wrk-ctr-001      .
           add       1                    to   w-cnt-wrk-ctr-001      .
      *                      *-----------------------------------------*
      *                      * Se questa e' maggiore del numero riga   *
      *                      * massimo si esce con '+'                 *
      *                      *-----------------------------------------*
           if        w-cnt-wrk-ctr-001    >    w-rlt-sup-max
                     move  "+"            to   w-cnt-tus-acc-cor
                     go to acc-cor-reg-990.
      *                      *-----------------------------------------*
      *                      * Altrimenti : ad accettazione della pri- *
      *                      * ma riga della pagina successiva         *
      *                      *-----------------------------------------*
           move      w-cnt-wrk-ctr-001    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-980.
      *                  *---------------------------------------------*
      *                  * Se Prsc da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Se si e' sulla prima pagina : si ignora *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  > w-lin-num-lin-vis
                     go to acc-cor-reg-000.
      *                      *-----------------------------------------*
      *                      * Se non si e' sulla prima pagina : alla  *
      *                      * accettazione della prima riga della pa- *
      *                      * gina precedente                         *
      *                      *-----------------------------------------*
           subtract  w-lin-num-lin-vis    from w-cnt-cor-nrg-dac      .
           subtract  1                    from w-cnt-cor-nrg-dac      .
           divide    w-lin-num-lin-vis    into w-cnt-cor-nrg-dac      .
           multiply  w-lin-num-lin-vis    by   w-cnt-cor-nrg-dac      .
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-985.
      *                  *---------------------------------------------*
      *                  * Se Slct da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Ad accettazione nr riga selezionato     *
      *                      *-----------------------------------------*
           move      w-cnt-slc-num-rig    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-990.
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione corpo       *
      *              *-------------------------------------------------*
           if        w-rlt-sup-max        =    zero
                     move  spaces         to   w-cnt-sts-imp-cor
           else      move  "#"            to   w-cnt-sts-imp-cor      .
       acc-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina corpo numero : w-cnt-cor-nrp-dav   *
      *    *-----------------------------------------------------------*
       vis-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate, escluse fincature        *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           move      w-lin-pri-lin-vid    to   v-lto                  .
           add       w-lin-num-lin-vis    to   v-lto                  .
           subtract  1                    from v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-cor-reg-150.
      *              *-------------------------------------------------*
      *              * Determinazione numero d'ordine del primo numero *
      *              * riga da visualizzare                            *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrp-dav    to   w-cnt-wrk-ctr-008      .
           multiply  w-lin-num-lin-vis    by   w-cnt-wrk-ctr-008      .
           add       1                    to   w-cnt-wrk-ctr-008      .
           subtract  w-lin-num-lin-vis    from w-cnt-wrk-ctr-008      .
      *              *-------------------------------------------------*
      *              * Determinazione numero d'ordine dell'ultimo nu-  *
      *              * mero riga da visualizzare                       *
      *              *-------------------------------------------------*
           move      w-cnt-wrk-ctr-008    to   w-cnt-wrk-ctr-009      .
           add       w-lin-num-lin-vis    to   w-cnt-wrk-ctr-009      .
           subtract  1                    from w-cnt-wrk-ctr-009      .
      *              *-------------------------------------------------*
      *              * Visualizzazione numero pagina in corso di trat- *
      *              * tamento                                         *
      *              *-------------------------------------------------*
           perform   vis-cor-reg-npg-000  thru vis-cor-reg-npg-999    .
       vis-cor-reg-200.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se si e' entro il massimo  *
      *              * numero di records caricati oppure no            *
      *              *-------------------------------------------------*
           if        w-cnt-wrk-ctr-008    >    w-rlt-sup-max
                     go to vis-cor-reg-300
           else      go to vis-cor-reg-400.
       vis-cor-reg-300.
      *              *-------------------------------------------------*
      *              * Se si e' oltre il massimo numero di records ca- *
      *              * ricati                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione linea a Spaces              *
      *                  *---------------------------------------------*
           move      "B"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-wrk-ctr-008    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     vis-cor-reg-500.
       vis-cor-reg-400.
      *              *-------------------------------------------------*
      *              * Se non si e' oltre il massimo numero di records *
      *              * caricati                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura file relative di supporto           *
      *                  *---------------------------------------------*
           move      "RD"                 to   w-rlt-sup-ope          .
           move      w-cnt-wrk-ctr-008    to   w-rlt-sup-prg          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
           move      w-rlt-sup-buf        to   w-rig                  .
      *                  *---------------------------------------------*
      *                  * Visualizzazione riga                        *
      *                  *---------------------------------------------*
           move      "R"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-wrk-ctr-008    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
       vis-cor-reg-500.
      *              *-------------------------------------------------*
      *              * Incremento numero riga da visualizzare          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-wrk-ctr-008      .
      *              *-------------------------------------------------*
      *              * Test se oltre ultima riga da visualizzare       *
      *              *-------------------------------------------------*
           if        w-cnt-wrk-ctr-008    not  > w-cnt-wrk-ctr-009
                     go to vis-cor-reg-200.
       vis-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina corpo                              *
      *    *                                                           *
      *    * Numero pagina corpo                                       *
      *    *-----------------------------------------------------------*
       vis-cor-reg-npg-000.
      *              *-------------------------------------------------*
      *              * Numero di pagina                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione pagina attuale               *
      *                  *---------------------------------------------*
           divide    w-lin-num-lin-vis    into w-car-eff-rig-ctr
                                        giving w-cnt-cor-pag-max
                                     remainder w-cnt-cor-pag-rem      .
           if        w-cnt-cor-pag-rem    >    zero
                     add 1                to   w-cnt-cor-pag-max      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-009
                                        giving w-cnt-cor-pag-att      .
      *                  *---------------------------------------------*
      *                  * Editing pagina attuale                      *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-cnt-cor-pag-att    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-edt                to   w-cnt-cor-pag-ep1      .
      *                  *---------------------------------------------*
      *                  * Editing pagina finale                       *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-cnt-cor-pag-max    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-edt                to   w-cnt-cor-pag-ep2      .
      *                  *---------------------------------------------*
      *                  * Composizione                                *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-cor-pag-npa      .
           string    "["
                                delimited by   size
                     w-cnt-cor-pag-ep1
                                delimited by   spaces
                     "/"
                                delimited by   size
                     w-cnt-cor-pag-ep2
                                delimited by   spaces
                     "]"
                                delimited by   size
                                          into w-cnt-cor-pag-npa      .
      *                  *---------------------------------------------*
      *                  * Allineamento al centro                      *
      *                  *---------------------------------------------*
           move      09                   to   w-all-str-lun          .
           move      w-cnt-cor-pag-npa    to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
           move      w-all-str-alf        to   w-cnt-cor-pag-npa      .
      *                  *---------------------------------------------*
      *                  * Riempimento con '-'                         *
      *                  *---------------------------------------------*
           inspect   w-cnt-cor-pag-npa
                                     replacing all " " by   "-"       .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      09                   to   v-car                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
      *
           move      37                   to   v-pos                  .
           move      w-cnt-cor-pag-npa    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-cor-reg-npg-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-cor-reg-npg-999.
       vis-cor-reg-npg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione linea corpo numero : w-cnt-cor-nrg-dav    *
      *    *-----------------------------------------------------------*
       vis-lin-cor-000.
      *              *-------------------------------------------------*
      *              * Abblencamento immagine linea di corpo           *
      *              *-------------------------------------------------*
           move      spaces               to   w-lin-imm              .
      *              *-------------------------------------------------*
      *              * Determinazione numero linea assoluta a video    *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrg-dav    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001
                                        giving w-cnt-wrk-ctr-003
                                     remainder w-cnt-wrk-ctr-002      .
           multiply  w-lin-num-lin-prc    by   w-cnt-wrk-ctr-002      .
           add       w-lin-pri-lin-vid    to   w-cnt-wrk-ctr-002      .
      *              *-------------------------------------------------*
      *              * Test su tipo visualizzazione riga               *
      *              *-------------------------------------------------*
           if        w-cnt-cor-tvi-rig    =    "I"
                     go to vis-lin-cor-100
           else if   w-cnt-cor-tvi-rig    =    "B"
                     go to vis-lin-cor-150
           else if   w-cnt-cor-tvi-rig    =    "S"
                     go to vis-lin-cor-200
           else if   w-cnt-cor-tvi-rig    =    "N"
                     go to vis-lin-cor-300
           else      go to vis-lin-cor-400.
       vis-lin-cor-100.
      *              *-------------------------------------------------*
      *              * Se visualizzazione indicatore linea             *
      *              *-------------------------------------------------*
           move      "====>"              to   w-lin-imm-num-lin      .
           move      05                   to   v-car                  .
           go to     vis-lin-cor-900.
       vis-lin-cor-150.
      *              *-------------------------------------------------*
      *              * Se visualizzazione linea a blanks               *
      *              *-------------------------------------------------*
           move      80                   to   v-car                  .
           go to     vis-lin-cor-900.
       vis-lin-cor-200.
      *              *-------------------------------------------------*
      *              * Se visualizzazione numero linea a spaces        *
      *              *-------------------------------------------------*
           move      spaces               to   w-lin-imm-num-lin      .
           move      05                   to   v-car                  .
           go to     vis-lin-cor-900.
       vis-lin-cor-300.
      *              *-------------------------------------------------*
      *              * Se visualizzazione numero d'ordine riga         *
      *              *-------------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      spaces               to   v-edm                  .
           move      w-rlt-sup-prg        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-num-lin      .
           go to     vis-lin-cor-900.
       vis-lin-cor-400.
      *              *-------------------------------------------------*
      *              * Se visualizzazione riga intera                  *
      *              *-------------------------------------------------*
       vis-lin-cor-420.
      *                  *---------------------------------------------*
      *                  * Editing Numero d'ordine riga                *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      spaces               to   v-edm                  .
           move      w-rlt-sup-prg        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-num-lin      .
       vis-lin-cor-440.
      *                  *---------------------------------------------*
      *                  * Editing Codice cliente                      *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "B"                  to   v-edm                  .
           move      w-rig-cod-cli        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-cod-cli      .
       vis-lin-cor-460.
      *                  *---------------------------------------------*
      *                  * Editing Ragione sociale cliente             *
      *                  *---------------------------------------------*
           move      w-rig-cod-cli-rag    to   w-lin-imm-rag-cli      .
      *                      *-----------------------------------------*
      *                      * Se si tratta di una dipendenza si so-   *
      *                      * vrascrivono gli ultimi 5 caratteri con  *
      *                      * uno spazio e con il codice dipendenza   *
      *                      *-----------------------------------------*
           if        w-rig-dpz-cli        =    spaces
                     go to vis-lin-cor-480.
           move      spaces               to   w-lin-imm-rag-fil      .
           move      w-rig-dpz-cli        to   w-lin-imm-rag-dpz      .
       vis-lin-cor-480.
      *                  *---------------------------------------------*
      *                  * Editing Forma di pagamento                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su codice forma di pagamento       *
      *                      *-----------------------------------------*
           if        w-rig-cod-fop        =    zero
                     move  "-         "   to   w-lin-imm-mne-fop
                     go to vis-lin-cor-500.
      *                      *-----------------------------------------*
      *                      * Test su codice mnemonico                *
      *                      *-----------------------------------------*
           if        w-rig-cod-fop-mne    not  = spaces
                     move  w-rig-cod-fop-mne
                                          to   w-lin-imm-mne-fop
                     go to vis-lin-cor-500.
      *                      *-----------------------------------------*
      *                      * Editing codice forma di pagamento       *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-rig-cod-fop        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      10                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "("                  to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      ")"                  to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                      *-----------------------------------------*
      *                      * Allineamento a destra                   *
      *                      *-----------------------------------------*
           perform   all-str-adx-000      thru all-str-adx-999        .
           move      w-all-str-alf        to   w-lin-imm-mne-fop      .
       vis-lin-cor-500.
      *                  *---------------------------------------------*
      *                  * Editing codice ABI                          *
      *                  *---------------------------------------------*
           if        w-rig-cod-abi        =    zero
                     move   spaces        to   w-lin-imm-cod-abi
                     go to vis-lin-cor-520.
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9"                  to   v-edm                  .
           move      w-rig-cod-abi        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-cod-abi      .
       vis-lin-cor-520.
      *                  *---------------------------------------------*
      *                  * Editing codice CAB                          *
      *                  *---------------------------------------------*
           if        w-rig-cod-cab        =    zero
                     move   spaces        to   w-lin-imm-cod-cab
                     go to vis-lin-cor-800.
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9"                  to   v-edm                  .
           move      w-rig-cod-cab        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-cod-cab      .
       vis-lin-cor-800.
      *                  *---------------------------------------------*
      *                  * Parametri per visualizzazione               *
      *                  *---------------------------------------------*
           move      80                   to   v-car                  .
       vis-lin-cor-900.
      *              *-------------------------------------------------*
      *              * Esecuzione visualizzazione prima linea          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-lin-imm-dsp-lin (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se una sola linea : uscita                      *
      *              *-------------------------------------------------*
           if        w-lin-num-lin-prc    =    1
                     go to vis-lin-cor-999.
      *              *-------------------------------------------------*
      *              * Esecuzione visualizzazione altre linee          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-wrk-ctr-003      .
       vis-lin-cor-925.
           add       1                    to   w-cnt-wrk-ctr-003      .
           if        w-cnt-wrk-ctr-003    >    w-lin-num-lin-prc
                     go to vis-lin-cor-999.
           add       1                    to   w-cnt-wrk-ctr-002      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-lin-imm-dsp-lin
                    (w-cnt-wrk-ctr-003)   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     vis-lin-cor-925.
       vis-lin-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts area linee di corpo               *
      *    *-----------------------------------------------------------*
       pmt-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate sia dall'area per la fin- *
      *              * catura che dall'area delle righe effettive      *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      w-lin-pri-lin-vid    to   v-lto                  .
           add       w-lin-num-lin-vis    to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Fincatura : Linea 04                            *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      " N.R.          Codice e ragione sociale cliente   
      -              "        F. di pag.  Abi   Cab "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Fincatura : Linea 05                            *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "-----  -------------------------------------------
      -              "------  ---------- ----- -----"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Fincatura : Linea 11                            *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione riga corpo di accettazione in w-rig       *
      *    *-----------------------------------------------------------*
       vis-rig-cor-000.
      *              *-------------------------------------------------*
      *              * Codice cliente                                  *
      *              *-------------------------------------------------*
           perform   vis-cod-cli-000      thru vis-cod-cli-999        .
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-cod-cli-rag-000  thru vis-cod-cli-rag-999    .
      *              *-------------------------------------------------*
      *              * Codice forma di pagamento                       *
      *              *-------------------------------------------------*
           perform   vis-rig-fop-000      thru vis-rig-fop-999        .
           perform   vis-rig-fop-des-000  thru vis-rig-fop-des-999    .
      *              *-------------------------------------------------*
      *              * Codice A.B.I.                                   *
      *              *-------------------------------------------------*
           perform   vis-rig-abi-000      thru vis-rig-abi-999        .
           perform   vis-rig-abi-den-000  thru vis-rig-abi-den-999    .
      *              *-------------------------------------------------*
      *              * Codice C.A.B.                                   *
      *              *-------------------------------------------------*
           perform   vis-rig-cab-000      thru vis-rig-cab-999        .
           perform   vis-rig-cab-den-000  thru vis-rig-cab-den-999    .
      *              *-------------------------------------------------*
      *              * Conto corrente del cliente                      *
      *              *-------------------------------------------------*
           perform   vis-rig-app-000      thru vis-rig-app-999        .
      *              *-------------------------------------------------*
      *              * Codice nostra banca                             *
      *              *-------------------------------------------------*
           perform   vis-rig-ban-000      thru vis-rig-ban-999        .
           perform   vis-rig-ban-des-000  thru vis-rig-ban-des-999    .
      *              *-------------------------------------------------*
      *              * Codice nostra banca presentazione effetti       *
      *              *-------------------------------------------------*
           perform   vis-rig-bpe-000      thru vis-rig-bpe-999        .
           perform   vis-rig-bpe-des-000  thru vis-rig-bpe-des-999    .
      *              *-------------------------------------------------*
      *              * Codice nostro c/c postale                       *
      *              *-------------------------------------------------*
           perform   vis-rig-ccp-000      thru vis-rig-ccp-999        .
           perform   vis-rig-ccp-des-000  thru vis-rig-ccp-des-999    .
      *              *-------------------------------------------------*
      *              * Codice addebito spese incasso                   *
      *              *-------------------------------------------------*
           perform   vis-rig-spi-000      thru vis-rig-spi-999        .
      *              *-------------------------------------------------*
      *              * Codice addebito spese bollo                     *
      *              *-------------------------------------------------*
           perform   vis-rig-spb-000      thru vis-rig-spb-999        .
      *              *-------------------------------------------------*
      *              * Tipo esclusione mesi                            *
      *              *-------------------------------------------------*
           perform   vis-rig-esm-000      thru vis-rig-esm-999        .
      *              *-------------------------------------------------*
      *              * Giorno fisso scadenza                           *
      *              *-------------------------------------------------*
           perform   vis-ggg-alt-000      thru vis-ggg-alt-999        .
      *              *-------------------------------------------------*
      *              * I mese di esclusione                            *
      *              *-------------------------------------------------*
           perform   vis-mmm-e01-000      thru vis-mmm-e01-999        .
      *              *-------------------------------------------------*
      *              * II mese di esclusione                           *
      *              *-------------------------------------------------*
           perform   vis-mmm-e02-000      thru vis-mmm-e02-999        .
       vis-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per riga corpo di accettazione    *
      *    *-----------------------------------------------------------*
       pmt-rig-cor-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate dall'area di impostazione *
      *              * della singola riga corpo espansa a piede        *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-rig-cor-100.
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts per riga corpo espansa  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice cliente                              *
      *                  *---------------------------------------------*
           perform   pmt-cod-cli-000      thru pmt-cod-cli-999        .
      *                  *---------------------------------------------*
      *                  * Codice forma di pagamento                   *
      *                  *---------------------------------------------*
           perform   pmt-rig-fop-000      thru pmt-rig-fop-999        .
      *                  *---------------------------------------------*
      *                  * Codice A.B.I.                               *
      *                  *---------------------------------------------*
           perform   pmt-rig-abi-000      thru pmt-rig-abi-999        .
      *                  *---------------------------------------------*
      *                  * Codice C.A.B.                               *
      *                  *---------------------------------------------*
           perform   pmt-rig-cab-000      thru pmt-rig-cab-999        .
      *                  *---------------------------------------------*
      *                  * Conto corrente del cliente                  *
      *                  *---------------------------------------------*
           perform   pmt-rig-app-000      thru pmt-rig-app-999        .
      *                  *---------------------------------------------*
      *                  * Codice nostra banca                         *
      *                  *---------------------------------------------*
           perform   pmt-rig-ban-000      thru pmt-rig-ban-999        .
      *                  *---------------------------------------------*
      *                  * Codice nostra banca presentazione effetti   *
      *                  *---------------------------------------------*
           perform   pmt-rig-bpe-000      thru pmt-rig-bpe-999        .
      *                  *---------------------------------------------*
      *                  * Codice nostro c/c postale                   *
      *                  *---------------------------------------------*
           perform   pmt-rig-ccp-000      thru pmt-rig-ccp-999        .
      *                  *---------------------------------------------*
      *                  * Addebito spese incasso                      *
      *                  *---------------------------------------------*
           perform   pmt-rig-spi-000      thru pmt-rig-spi-999        .
      *                  *---------------------------------------------*
      *                  * Addebito spese bollo                        *
      *                  *---------------------------------------------*
           perform   pmt-rig-spb-000      thru pmt-rig-spb-999        .
      *                  *---------------------------------------------*
      *                  * Tipo esclusione mesi                        *
      *                  *---------------------------------------------*
           perform   pmt-rig-esm-000      thru pmt-rig-esm-999        .
      *                  *---------------------------------------------*
      *                  * Giorno fisso scadenza                       *
      *                  *---------------------------------------------*
           perform   pmt-ggg-alt-000      thru pmt-ggg-alt-999        .
      *                  *---------------------------------------------*
      *                  * Mesi di esclusione                          *
      *                  *---------------------------------------------*
           perform   pmt-mmm-e12-000      thru pmt-mmm-e12-999        .
       pmt-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice cliente                   *
      *    *-----------------------------------------------------------*
       pmt-cod-cli-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice cliente     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-cod-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice forma di pagamento        *
      *    *-----------------------------------------------------------*
       pmt-rig-fop-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Forma di pagamento :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-fop-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice A.B.I.                    *
      *    *-----------------------------------------------------------*
       pmt-rig-abi-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice ABI         :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-abi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice C.A.B.                    *
      *    *-----------------------------------------------------------*
       pmt-rig-cab-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice CAB         :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-cab-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Conto corrente del cliente       *
      *    *-----------------------------------------------------------*
       pmt-rig-app-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "C/C del cliente    :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-app-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice nostra banca              *
      *    *-----------------------------------------------------------*
       pmt-rig-ban-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Ns. banca per bonif:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-ban-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice nostra banca presentaz.   *
      *    *-----------------------------------------------------------*
       pmt-rig-bpe-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Ns. banca pres.eff.:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-bpe-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice nostro c/c postale        *
      *    *-----------------------------------------------------------*
       pmt-rig-ccp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Nostro c/c postale :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-ccp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Addebito spese incasso           *
      *    *-----------------------------------------------------------*
       pmt-rig-spi-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Spese incasso      :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-spi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Addebito spese bollo             *
      *    *-----------------------------------------------------------*
       pmt-rig-spb-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      13                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "Spese bollo :"      to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-spb-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Tipo esclusione mesi             *
      *    *-----------------------------------------------------------*
       pmt-rig-esm-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo esclus. mesi  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-esm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Giorno fisso scadenza            *
      *    *-----------------------------------------------------------*
       pmt-ggg-alt-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      63                   to   v-pos                  .
           move      "gg.:"               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-ggg-alt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Mesi di esclusione               *
      *    *-----------------------------------------------------------*
       pmt-mmm-e12-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      71                   to   v-pos                  .
           move      "mm.:"               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-mmm-e12-999.
           exit.

      *    *===========================================================*
      *    * Accettazione 1. campo riga corpo espansa : Codice cliente *
      *    *-----------------------------------------------------------*
       acc-cod-cli-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-rig-cod-cli        to   w-sav-cod-cli          .
       acc-cod-cli-100.
      *              *-------------------------------------------------*
      *              * Ripristino valore precedente                    *
      *              *-------------------------------------------------*
           move      w-sav-cod-cli        to   w-rig-cod-cli          .
       acc-cod-cli-125.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Parametri generali di accettazione          *
      *                  *---------------------------------------------*
           move      "AC"                 to   w-cod-mne-dcc-ope      .
           move      w-rig-cod-cli        to   w-cod-mne-dcc-cod      .
           move      12                   to   w-cod-mne-dcc-lin      .
           move      22                   to   w-cod-mne-dcc-pos      .
           move      zero                 to   w-cod-mne-dcc-rln      .
           move      zero                 to   w-cod-mne-dcc-rps      .
           move      zero                 to   w-cod-mne-dcc-vln      .
           move      zero                 to   w-cod-mne-dcc-vps      .
           move      zero                 to   w-cod-mne-dcc-lln      .
           move      zero                 to   w-cod-mne-dcc-lps      .
           move      "<B"                 to   v-edm                  .
      *                  *---------------------------------------------*
      *                  * Tasti funzione                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Up   : sempre ammesso, a meno che non   *
      *                      *        si sia alla riga numero 1        *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    >    1
                     move  "UP  "         to   v-pfk (01)
           else      move  spaces         to   v-pfk (01)             .
      *                      *-----------------------------------------*
      *                      * Down : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "DOWN"               to   v-pfk (02)             .
      *                      *-----------------------------------------*
      *                      * Find : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "FIND"               to   v-pfk (03)             .
      *                      *-----------------------------------------*
      *                      * Insr : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "INSR"               to   v-pfk (04)             .
      *                      *-----------------------------------------*
      *                      * Do   : sempre ammesso, purche' sia con- *
      *                      *        cesso dallo status delle impo-   *
      *                      *        stazioni; eventualmente disat-   *
      *                      *        tivato dal richiamo della sub-   *
      *                      *        routine di accettazione          *
      *                      *-----------------------------------------*
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)
           else      move  spaces         to   v-pfk (05)             .
      *                      *-----------------------------------------*
      *                      * Remv : mai ammesso                      *
      *                      *-----------------------------------------*
           move      spaces               to   v-pfk (06)             .
      *                      *-----------------------------------------*
      *                      * Prsc : sempre ammesso, a meno che non   *
      *                      *        si sia alla pagina numero 1      *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    >    w-lin-num-lin-vis
                     move  "PRSC"         to   v-pfk (07)
           else      move  spaces         to   v-pfk (07)             .
      *                      *-----------------------------------------*
      *                      * Nxsc : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "NXSC"               to   v-pfk (08)             .
      *                      *-----------------------------------------*
      *                      * Back : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sulla prima riga     *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  = 1
                     move  "BACK"         to   v-pfk (09)
           else      move  spaces         to   v-pfk (09)             .
      *                      *-----------------------------------------*
      *                      * Tab  : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sull'ultima riga     *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  = w-rlt-sup-max
                     move  "TAB "         to   v-pfk (10)
           else      move  spaces         to   v-pfk (10)             .
      *                      *-----------------------------------------*
      *                      * Slct : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sull'unica riga      *
      *                      *-----------------------------------------*
           if        w-rlt-sup-max        not  < 2
                     move  "SLCT"         to   v-pfk (11)
           else      move  spaces         to   v-pfk (11)             .
      *                      *-----------------------------------------*
      *                      * Expd : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "EXPD"               to   v-pfk (15)             .
       acc-cod-cli-150.
      *                  *---------------------------------------------*
      *                  * Esecuzione accettazione                     *
      *                  *---------------------------------------------*
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
       acc-cod-cli-152.
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           if        w-cod-mne-dcc-ope    =    "F+"
                     go to acc-cod-cli-154.
           if        w-cod-mne-dcc-ope    =    "AC"
                     go to acc-cod-cli-156.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-cli-154.
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
           go to     acc-cod-cli-152.
       acc-cod-cli-156.
           move      w-cod-mne-dcc-cod    to   v-num                  .
       acc-cod-cli-200.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-cod-cli-999.
       acc-cod-cli-225.
      *              *-------------------------------------------------*
      *              * Test se Return                                  *
      *              *-------------------------------------------------*
           if        v-key                =    spaces
                     go to acc-cod-cli-400.
       acc-cod-cli-250.
      *              *-------------------------------------------------*
      *              * Se Slct                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "SLCT"
                     go to acc-cod-cli-300.
       acc-cod-cli-255.
      *                      *-----------------------------------------*
      *                      * Comodo per selezione                    *
      *                      *-----------------------------------------*
           move      v-num                to   w-cnt-slc-rap-num      .
      *                      *-----------------------------------------*
      *                      * Se conversione senza errori             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se numero riga minore di 1 oppure   *
      *                          * maggiore del massimo : reimposta-   *
      *                          * zione                               *
      *                          *-------------------------------------*
           if        w-cnt-slc-rap-num    =    zero       or
                     w-cnt-slc-rap-num    >    w-rlt-sup-max
                     go to acc-cod-cli-100.
      *                          *-------------------------------------*
      *                          * Se numero riga impostato pari a nu- *
      *                          * numero riga attuale : reimpostazio- *
      *                          * ne                                  *
      *                          *-------------------------------------*
           if        w-cnt-slc-rap-num    =    w-cnt-cor-nrg-dac
                     go to acc-cod-cli-100.
      *                          *-------------------------------------*
      *                          * Preparazione parametri e uscita     *
      *                          *-------------------------------------*
           move      w-cnt-slc-rap-num    to   w-cnt-slc-num-rig      .
           move      "."                  to   w-cnt-tus-acc-rig      .
           go to     acc-cod-cli-999.
       acc-cod-cli-300.
      *              *-------------------------------------------------*
      *              * Se Expd                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "EXPD"
                     go to acc-cod-cli-320.
           if        w-rig-cod-cli        =    zero
                     go to acc-cod-cli-320.
      *                  *---------------------------------------------*
      *                  * Box di espansione                           *
      *                  *---------------------------------------------*
           move      w-rig-cod-cli        to   w-rou-exp-ana-cod      .
           move      w-rig-dpz-cli        to   w-rou-exp-ana-dpz      .
           perform   rou-exp-ana-000      thru rou-exp-ana-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-cod-cli-100.
       acc-cod-cli-320.
      *              *-------------------------------------------------*
      *              * Se premuto un altro tasto funzione non deve es- *
      *              * sere avvenuta variazione del campo di imposta-  *
      *              * zione                                           *
      *              *-------------------------------------------------*
           if        v-mod                not  = spaces
                     go to acc-cod-cli-100.
      *              *-------------------------------------------------*
      *              * Se Up                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "UP  "
                     move  "U"            to   w-cnt-tus-acc-rig
                     go to acc-cod-cli-999.
      *              *-------------------------------------------------*
      *              * Se Down                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DOWN"
                     move  "D"            to   w-cnt-tus-acc-rig
                     go to acc-cod-cli-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-cod-cli-999
                     else    go to acc-cod-cli-100.
      *              *-------------------------------------------------*
      *              * Se Tab                                          *
      *              *-------------------------------------------------*
           if        v-key                =    "TAB "
                     move  "T"            to   w-cnt-tus-acc-rig
                     go to acc-cod-cli-999.
      *              *-------------------------------------------------*
      *              * Se Back                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "BACK"
                     move  "B"            to   w-cnt-tus-acc-rig
                     go to acc-cod-cli-999.
      *              *-------------------------------------------------*
      *              * Se Nxsc                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "NXSC"
                     move  "N"            to   w-cnt-tus-acc-rig
                     go to acc-cod-cli-999.
      *              *-------------------------------------------------*
      *              * Se Prsc                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "PRSC"
                     move  "P"            to   w-cnt-tus-acc-rig
                     go to acc-cod-cli-999.
       acc-cod-cli-400.
      *              *-------------------------------------------------*
      *              * Se Return                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se variazione del valore di default : a re- *
      *                  * impostazione                                *
      *                  *---------------------------------------------*
           if        v-mod                not  = spaces
                     go to acc-cod-cli-100.
       acc-cod-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice cliente                          *
      *    *-----------------------------------------------------------*
       vis-cod-cli-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      12                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-cod-cli        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza del cliente           *
      *    *-----------------------------------------------------------*
       vis-dpz-cli-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      34                   to   v-pos                  .
           move      w-rig-dpz-cli        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice cliente, ragione sociale         *
      *    *-----------------------------------------------------------*
       vis-cod-cli-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-rig-cod-cli-rag    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cli-rag-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Forma di pagamento                   *
      *    *-----------------------------------------------------------*
       acc-rig-fop-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se dipendenza : uscita                      *
      *                  *---------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to acc-rig-fop-999.
       acc-rig-fop-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zfp-ope      .
           move      w-rig-cod-fop        to   w-cod-mne-zfp-cod      .
           move      13                   to   w-cod-mne-zfp-lin      .
           move      22                   to   w-cod-mne-zfp-pos      .
           move      13                   to   w-cod-mne-zfp-dln      .
           move      41                   to   w-cod-mne-zfp-dps      .
           move      "<B"                 to   v-edm                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-zfp-cll-000  thru cod-mne-zfp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zfp-foi-000  thru cod-mne-zfp-foi-999    .
       acc-rig-fop-110.
           perform   cod-mne-zfp-cll-000  thru cod-mne-zfp-cll-999    .
           if        w-cod-mne-zfp-ope    =    "F+"
                     go to acc-rig-fop-115.
           if        w-cod-mne-zfp-ope    =    "AC"
                     go to acc-rig-fop-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-fop-115.
           perform   cod-mne-zfp-foi-000  thru cod-mne-zfp-foi-999    .
           go to     acc-rig-fop-110.
       acc-rig-fop-120.
           move      w-cod-mne-zfp-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-fop-999.
       acc-rig-fop-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-cod-fop          .
       acc-rig-fop-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      w-rig-cod-fop        to   w-let-arc-zfp-cod      .
           perform   let-arc-zfp-000      thru let-arc-zfp-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-zfp-des    to   w-rig-cod-fop-des      .
           move      w-let-arc-zfp-mne    to   w-rig-cod-fop-mne      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-rig-fop-des-000  thru vis-rig-fop-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-zfp-flg    not  = spaces
                     go to acc-rig-fop-100.
       acc-rig-fop-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rig-fop-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-fop-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-fop-100.
       acc-rig-fop-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Forma di pagamento                *
      *    *-----------------------------------------------------------*
       vis-rig-fop-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      13                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-cod-fop        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-fop-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Descrizione pagamento     *
      *    *-----------------------------------------------------------*
       vis-rig-fop-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-rig-cod-fop-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-fop-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice ABI banca d'appoggio          *
      *    *-----------------------------------------------------------*
       acc-rig-abi-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore iniziale                 *
      *                  *---------------------------------------------*
           move      w-rig-cod-abi        to   w-sav-cod-abi          .
       acc-rig-abi-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-abi-ope      .
           move      w-rig-cod-abi        to   w-cod-mne-abi-cod      .
           move      14                   to   w-cod-mne-abi-lin      .
           move      22                   to   w-cod-mne-abi-pos      .
           move      14                   to   w-cod-mne-abi-dln      .
           move      41                   to   w-cod-mne-abi-dps      .
           move      "9B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-abi-cll-000  thru cod-mne-abi-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-abi-foi-000  thru cod-mne-abi-foi-999    .
       acc-rig-abi-110.
           perform   cod-mne-abi-cll-000  thru cod-mne-abi-cll-999    .
           if        w-cod-mne-abi-ope    =    "F+"
                     go to acc-rig-abi-115.
           if        w-cod-mne-abi-ope    =    "AC"
                     go to acc-rig-abi-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-abi-115.
           perform   cod-mne-abi-foi-000  thru cod-mne-abi-foi-999    .
           go to     acc-rig-abi-110.
       acc-rig-abi-120.
           move      w-cod-mne-abi-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-abi-999.
       acc-rig-abi-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-cod-abi          .
       acc-rig-abi-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura anagrafica istituti                 *
      *                  *---------------------------------------------*
           move      w-rig-cod-abi        to   w-let-arc-axi-cod      .
           perform   let-arc-axi-000      thru let-arc-axi-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione denominazione                *
      *                  *---------------------------------------------*
           move      w-let-arc-axi-den    to   w-rig-cod-abi-den      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione denominazione               *
      *                  *---------------------------------------------*
           perform   vis-rig-abi-den-000  thru vis-rig-abi-den-999    .
      *                  *---------------------------------------------*
      *                  * Test su flag di uscita da lettura           *
      *                  *---------------------------------------------*
           if        w-let-arc-axi-flg    not  = spaces
                     go to acc-rig-abi-100.
       acc-rig-abi-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se variato codice ABI                       *
      *                  *---------------------------------------------*
           if        w-rig-cod-abi        =    w-sav-cod-abi
                     go to acc-rig-abi-800.
           if        w-rig-cod-cab        =    zero
                     go to acc-rig-abi-800.
      *                      *-----------------------------------------*
      *                      * Normalizzazione dati sportello CAB      *
      *                      *-----------------------------------------*
           move      zero                 to   w-rig-cod-cab          .
           move      spaces               to   w-rig-cod-cab-den      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati sportello CAB          *
      *                  *---------------------------------------------*
           perform   vis-rig-cab-000      thru vis-rig-cab-999        .
           perform   vis-rig-cab-den-000  thru vis-rig-cab-den-999    .
       acc-rig-abi-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-abi-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-abi-100.
       acc-rig-abi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Codice ABI banca          *
      *    *-----------------------------------------------------------*
       vis-rig-abi-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      14                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-cod-abi        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-abi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Denominazione banca       *
      *    *-----------------------------------------------------------*
       vis-rig-abi-den-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-rig-cod-abi-den    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-abi-den-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice CAB                   *
      *    *-----------------------------------------------------------*
       acc-rig-cab-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se codice A.B.I. a zero : uscita            *
      *                  *---------------------------------------------*
           if        w-rig-cod-abi        =    zero
                     go to acc-rig-cab-999.
       acc-rig-cab-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-cab-ope      .
           move      w-rig-cod-abi        to   w-cod-mne-cab-abi      .
           move      w-rig-cod-cab        to   w-cod-mne-cab-cab      .
           move      15                   to   w-cod-mne-cab-lin      .
           move      22                   to   w-cod-mne-cab-pos      .
           move      15                   to   w-cod-mne-cab-dln      .
           move      41                   to   w-cod-mne-cab-dps      .
           move      "9B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-cab-cll-000  thru cod-mne-cab-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-cab-foi-000  thru cod-mne-cab-foi-999    .
       acc-rig-cab-110.
           perform   cod-mne-cab-cll-000  thru cod-mne-cab-cll-999    .
           if        w-cod-mne-cab-ope    =    "F+"
                     go to acc-rig-cab-115.
           if        w-cod-mne-cab-ope    =    "AC"
                     go to acc-rig-cab-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-cab-115.
           perform   cod-mne-cab-foi-000  thru cod-mne-cab-foi-999    .
           go to     acc-rig-cab-110.
       acc-rig-cab-120.
           move      w-cod-mne-cab-cab    to   v-num                  .
       acc-rig-cab-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-cab-999.
       acc-rig-cab-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-cod-cab          .
       acc-rig-cab-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      w-rig-cod-abi        to   w-let-arc-axs-abi      .
           move      w-rig-cod-cab        to   w-let-arc-axs-cab      .
           perform   let-arc-axs-000      thru let-arc-axs-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-axs-den    to   w-rig-cod-cab-den      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-rig-cab-den-000  thru vis-rig-cab-den-999    .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-axs-flg    not  = spaces
                     go to acc-rig-cab-100.
       acc-rig-cab-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rig-cab-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-cab-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-cab-100.
       acc-rig-cab-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice CAB                        *
      *    *-----------------------------------------------------------*
       vis-rig-cab-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      15                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-cod-cab        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-cab-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Denominazione sportello           *
      *    *-----------------------------------------------------------*
       vis-rig-cab-den-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      30                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-rig-cod-cab-den    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-cab-den-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Conto corrente del cliente   *
      *    *-----------------------------------------------------------*
       acc-rig-app-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-rig-app-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      12                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-rig-ccc-app        to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-app-999.
       acc-rig-app-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-rig-ccc-app          .
       acc-rig-app-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-rig-app-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rig-app-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-app-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-app-100.
       acc-rig-app-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Conto corrente cliente            *
      *    *-----------------------------------------------------------*
       vis-rig-app-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      12                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-ccc-app        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-app-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice nostra banca                  *
      *    *-----------------------------------------------------------*
       acc-rig-ban-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se dipendenza : uscita                      *
      *                  *---------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to acc-rig-ban-999.
       acc-rig-ban-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-cbp-ope      .
           move      02                   to   w-cod-des-cbp-tip      .
           move      w-rig-nos-ban        to   w-cod-des-cbp-cod      .
           move      17                   to   w-cod-des-cbp-lin      .
           move      22                   to   w-cod-des-cbp-pos      .
           move      17                   to   w-cod-des-cbp-dln      .
           move      41                   to   w-cod-des-cbp-dps      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
       acc-rig-ban-110.
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           if        w-cod-des-cbp-ope    =    "F+"
                     go to acc-rig-ban-115.
           if        w-cod-des-cbp-ope    =    "AC"
                     go to acc-rig-ban-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-ban-115.
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
           go to     acc-rig-ban-110.
       acc-rig-ban-120.
           move      w-cod-des-cbp-cod    to   v-alf                  .
       acc-rig-ban-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-ban-999.
       acc-rig-ban-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-rig-nos-ban          .
       acc-rig-ban-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      02                   to   w-let-arc-cbp-tip      .
           move      w-rig-nos-ban        to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-cbp-des    to   w-rig-nos-ban-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-rig-ban-des-000  thru vis-rig-ban-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-cbp-flg    not  = spaces
                     go to acc-rig-ban-100.
       acc-rig-ban-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rig-ban-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-ban-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-ban-100.
       acc-rig-ban-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostra banca               *
      *    *-----------------------------------------------------------*
       vis-rig-ban-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      17                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-nos-ban        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-ban-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostra banca , descrizione *
      *    *-----------------------------------------------------------*
       vis-rig-ban-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      17                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-rig-nos-ban-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-ban-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice nostra banca presentazione    *
      *    *-----------------------------------------------------------*
       acc-rig-bpe-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se dipendenza : uscita                      *
      *                  *---------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to acc-rig-bpe-999.
       acc-rig-bpe-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-cbp-ope      .
           move      02                   to   w-cod-des-cbp-tip      .
           move      w-rig-nos-bpe        to   w-cod-des-cbp-cod      .
           move      18                   to   w-cod-des-cbp-lin      .
           move      22                   to   w-cod-des-cbp-pos      .
           move      18                   to   w-cod-des-cbp-dln      .
           move      41                   to   w-cod-des-cbp-dps      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
       acc-rig-bpe-110.
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           if        w-cod-des-cbp-ope    =    "F+"
                     go to acc-rig-bpe-115.
           if        w-cod-des-cbp-ope    =    "AC"
                     go to acc-rig-bpe-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-bpe-115.
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
           go to     acc-rig-bpe-110.
       acc-rig-bpe-120.
           move      w-cod-des-cbp-cod    to   v-alf                  .
       acc-rig-bpe-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-bpe-999.
       acc-rig-bpe-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-rig-nos-bpe          .
       acc-rig-bpe-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      02                   to   w-let-arc-cbp-tip      .
           move      w-rig-nos-bpe        to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-cbp-des    to   w-rig-nos-bpe-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-rig-bpe-des-000  thru vis-rig-bpe-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-cbp-flg    not  = spaces
                     go to acc-rig-bpe-100.
       acc-rig-bpe-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rig-bpe-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-bpe-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-bpe-100.
       acc-rig-bpe-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostra banca presentazione *
      *    *-----------------------------------------------------------*
       vis-rig-bpe-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      18                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-nos-bpe        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-bpe-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostra banca presentazione *
      *    *                         descrizione                       *
      *    *-----------------------------------------------------------*
       vis-rig-bpe-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      18                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-rig-nos-bpe-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-bpe-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice nostro c/c postale            *
      *    *-----------------------------------------------------------*
       acc-rig-ccp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se dipendenza : uscita                      *
      *                  *---------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to acc-rig-ccp-999.
       acc-rig-ccp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-cbp-ope      .
           move      03                   to   w-cod-des-cbp-tip      .
           move      w-rig-nos-ccp        to   w-cod-des-cbp-cod      .
           move      19                   to   w-cod-des-cbp-lin      .
           move      22                   to   w-cod-des-cbp-pos      .
           move      19                   to   w-cod-des-cbp-dln      .
           move      41                   to   w-cod-des-cbp-dps      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
       acc-rig-ccp-110.
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           if        w-cod-des-cbp-ope    =    "F+"
                     go to acc-rig-ccp-115.
           if        w-cod-des-cbp-ope    =    "AC"
                     go to acc-rig-ccp-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-ccp-115.
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
           go to     acc-rig-ccp-110.
       acc-rig-ccp-120.
           move      w-cod-des-cbp-cod    to   v-alf                  .
       acc-rig-ccp-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-ccp-999.
       acc-rig-ccp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-rig-nos-ccp          .
       acc-rig-ccp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      03                   to   w-let-arc-cbp-tip      .
           move      w-rig-nos-ccp        to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-cbp-des    to   w-rig-nos-ccp-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-rig-ccp-des-000  thru vis-rig-ccp-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-cbp-flg    not  = spaces
                     go to acc-rig-ccp-100.
       acc-rig-ccp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rig-ccp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-ccp-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-ccp-100.
       acc-rig-ccp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostro c/c postale         *
      *    *-----------------------------------------------------------*
       vis-rig-ccp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      19                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-nos-ccp        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-ccp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice nostro c/c postale, des-   *
      *    * crizione                                                  *
      *    *-----------------------------------------------------------*
       vis-rig-ccp-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      19                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-rig-nos-ccp-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-ccp-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Addebito spese incasso               *
      *    *-----------------------------------------------------------*
       acc-rig-spi-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se dipendenza : uscita                      *
      *                  *---------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to acc-rig-spi-999.
       acc-rig-spi-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-zin-ope      .
           move      w-rig-add-spi        to   w-cod-cod-zin-cod      .
           move      20                   to   w-cod-cod-zin-lin      .
           move      22                   to   w-cod-cod-zin-pos      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-spi-cll-000  thru cod-cod-spi-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-spi-foi-000  thru cod-cod-spi-foi-999    .
       acc-rig-spi-110.
           perform   cod-cod-spi-cll-000  thru cod-cod-spi-cll-999    .
           if        w-cod-cod-zin-ope    =    "F+"
                     go to acc-rig-spi-115.
           if        w-cod-cod-zin-ope    =    "AC"
                     go to acc-rig-spi-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-spi-115.
           perform   cod-cod-spi-foi-000  thru cod-cod-spi-foi-999    .
           go to     acc-rig-spi-110.
       acc-rig-spi-120.
           move      w-cod-cod-zin-cod    to   v-alf                  .
       acc-rig-spi-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-spi-999.
       acc-rig-spi-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-rig-add-spi          .
       acc-rig-spi-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      w-rig-add-spi        to   w-let-arc-zin-cod      .
           perform   let-arc-zin-000      thru let-arc-zin-999        .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-zin-flg    not  = spaces
                     go to acc-rig-spi-100.
       acc-rig-spi-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rig-spi-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-spi-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-spi-100.
       acc-rig-spi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Addebito spese incasso            *
      *    *-----------------------------------------------------------*
       vis-rig-spi-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      20                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-add-spi        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-spi-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Addebito spese bollo         *
      *    *-----------------------------------------------------------*
       acc-rig-spb-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se dipendenza : uscita                      *
      *                  *---------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to acc-rig-spb-999.
       acc-rig-spb-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-zbo-ope      .
           move      w-rig-add-spb        to   w-cod-cod-zbo-cod      .
           move      20                   to   w-cod-cod-zbo-lin      .
           move      55                   to   w-cod-cod-zbo-pos      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-spb-cll-000  thru cod-cod-spb-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-spb-foi-000  thru cod-cod-spb-foi-999    .
       acc-rig-spb-110.
           perform   cod-cod-spb-cll-000  thru cod-cod-spb-cll-999    .
           if        w-cod-cod-zbo-ope    =    "F+"
                     go to acc-rig-spb-115.
           if        w-cod-cod-zbo-ope    =    "AC"
                     go to acc-rig-spb-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-spb-115.
           perform   cod-cod-spb-foi-000  thru cod-cod-spb-foi-999    .
           go to     acc-rig-spb-110.
       acc-rig-spb-120.
           move      w-cod-cod-zbo-cod    to   v-alf                  .
       acc-rig-spb-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-spb-999.
       acc-rig-spb-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-rig-add-spb          .
       acc-rig-spb-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      w-rig-add-spb        to   w-let-arc-zbo-cod      .
           perform   let-arc-zbo-000      thru let-arc-zbo-999        .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-zbo-flg    not  = spaces
                     go to acc-rig-spb-100.
       acc-rig-spb-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rig-spb-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-spb-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-spb-100.
       acc-rig-spb-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Addebito spese bollo              *
      *    *-----------------------------------------------------------*
       vis-rig-spb-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      20                   to   v-lin                  .
           move      55                   to   v-pos                  .
           move      w-rig-add-spb        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-spb-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Tipo esclusione mese         *
      *    *-----------------------------------------------------------*
       acc-rig-esm-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se dipendenza : uscita                      *
      *                  *---------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to acc-rig-esm-999.
       acc-rig-esm-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-rig-esm-lun    to   v-car                  .
           move      w-exp-rig-esm-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      21                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-exp-rig-esm-tbl    to   v-txt                  .
           move      w-rig-tip-esm        to   v-num                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-esm-999.
       acc-rig-esm-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-tip-esm          .
       acc-rig-esm-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-rig-esm-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se "Nessun mese di esclusione"              *
      *                  *---------------------------------------------*
           if        w-rig-tip-esm        not  = 01
                     go to acc-rig-esm-650.
      *                      *-----------------------------------------*
      *                      * Mese di esclusione 1 a zero             *
      *                      *-----------------------------------------*
           move      zero                 to   w-rig-mmm-e01          .
      *                      *-----------------------------------------*
      *                      * Mese di esclusione 2 a zero             *
      *                      *-----------------------------------------*
           move      zero                 to   w-rig-mmm-e02          .
      *                      *-----------------------------------------*
      *                      * Visualizzazioni                         *
      *                      *-----------------------------------------*
           perform   vis-mmm-e01-000      thru vis-mmm-e01-999        .
           perform   vis-mmm-e02-000      thru vis-mmm-e02-999        .
           go to     acc-rig-esm-660.
       acc-rig-esm-650.
      *                  *---------------------------------------------*
      *                  * Se "Lo stesso giorno del mese successivo"   *
      *                  *---------------------------------------------*
           if        w-rig-tip-esm        not  = 02
                     go to acc-rig-esm-800.
       acc-rig-esm-660.
      *                      *-----------------------------------------*
      *                      * Giorno fisso di scadenza a zero         *
      *                      *-----------------------------------------*
           move      zero                 to   w-rig-ggg-alt          .
      *                      *-----------------------------------------*
      *                      * Visualizzazione                         *
      *                      *-----------------------------------------*
           perform   vis-ggg-alt-000      thru vis-ggg-alt-999        .
       acc-rig-esm-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-esm-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-esm-100.
       acc-rig-esm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Tipo esclusione mese              *
      *    *-----------------------------------------------------------*
       vis-rig-esm-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-rig-esm-lun    to   v-car                  .
           move      w-exp-rig-esm-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      21                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-exp-rig-esm-tbl    to   v-txt                  .
           move      w-rig-tip-esm        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-esm-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Giorno fisso di scadenza             *
      *    *-----------------------------------------------------------*
       acc-ggg-alt-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-rig-tip-esm        not  = 03
                     go to acc-ggg-alt-999.
       acc-ggg-alt-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      21                   to   v-lin                  .
           move      68                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-rig-ggg-alt        to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-ggg-alt-999.
       acc-ggg-alt-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-ggg-alt          .
       acc-ggg-alt-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        w-rig-ggg-alt        >    28
                     go to acc-ggg-alt-100.
           if        w-rig-ggg-alt        >    zero
                     go to acc-ggg-alt-600.
           if        v-key                =    "UP  "
                     go to acc-ggg-alt-600
           else      go to acc-ggg-alt-100.
       acc-ggg-alt-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-ggg-alt-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-ggg-alt-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-ggg-alt-100.
       acc-ggg-alt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Giorno fisso di scadenza          *
      *    *-----------------------------------------------------------*
       vis-ggg-alt-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      21                   to   v-lin                  .
           move      68                   to   v-pos                  .
           move      w-rig-ggg-alt        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-ggg-alt-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Primo mese escluso                   *
      *    *-----------------------------------------------------------*
       acc-mmm-e01-000.
      *              *-------------------------------------------------*
      *              * Preparazioni pre-accettazione                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-rig-tip-esm        not  = 02 and
                     w-rig-tip-esm        not  = 03
                     go to acc-mmm-e01-999.
       acc-mmm-e01-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      21                   to   v-lin                  .
           move      76                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-rig-mmm-e01        to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-mmm-e01-999.
       acc-mmm-e01-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-mmm-e01          .
       acc-mmm-e01-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Che non sia maggiore di 12                  *
      *                  *---------------------------------------------*
           if        w-rig-mmm-e01        >    12
                     go to acc-mmm-e01-100.
      *                  *---------------------------------------------*
      *                  * Che non sia a zero, a meno che non si sia   *
      *                  * in tasti Up                                 *
      *                  *---------------------------------------------*
           if        w-rig-mmm-e01        not  = zero
                     go to acc-mmm-e01-600.
           if        v-key                not  = "UP  "
                     go to acc-mmm-e01-100.
       acc-mmm-e01-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del valore             *
      *                  *---------------------------------------------*
           if        w-rig-mmm-e01        =    zero
                     go to acc-mmm-e01-625
           else      go to acc-mmm-e01-700.
       acc-mmm-e01-625.
      *                  *---------------------------------------------*
      *                  * Se 1. mese escluso a zero                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del valore attuale *
      *                      * del 2. mese escluso                     *
      *                      *-----------------------------------------*
           if        w-rig-mmm-e02        =    zero
                     go to acc-mmm-e01-650
           else      go to acc-mmm-e01-675.
       acc-mmm-e01-650.
      *                      *-----------------------------------------*
      *                      * Se 2. mese escluso a zero               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Continuazione                       *
      *                          *-------------------------------------*
           go to     acc-mmm-e01-800.
       acc-mmm-e01-675.
      *                      *-----------------------------------------*
      *                      * Se 2. mese escluso a non-zero           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * 2. mese escluso su 1. mese escluso  *
      *                          *-------------------------------------*
           move      w-rig-mmm-e02        to   w-rig-mmm-e01          .
      *                          *-------------------------------------*
      *                          * 2. mese escluso a zero              *
      *                          *-------------------------------------*
           move      zero                 to   w-rig-mmm-e02          .
      *                          *-------------------------------------*
      *                          * Visualizzazione 1. mese escluso     *
      *                          *-------------------------------------*
           perform   vis-mmm-e01-000      thru vis-mmm-e01-999        .
      *                          *-------------------------------------*
      *                          * Visualizzazione 2. mese escluso     *
      *                          *-------------------------------------*
           perform   vis-mmm-e02-000      thru vis-mmm-e02-999        .
      *                          *-------------------------------------*
      *                          * A reimpostazione 1. mese escluso    *
      *                          *-------------------------------------*
           go to     acc-mmm-e01-100.
       acc-mmm-e01-700.
      *                  *---------------------------------------------*
      *                  * Se 1. mese escluso a non-zero               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     acc-mmm-e01-800.
       acc-mmm-e01-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-mmm-e01-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-mmm-e01-100.
       acc-mmm-e01-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Primo mese escluso                *
      *    *-----------------------------------------------------------*
       vis-mmm-e01-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      21                   to   v-lin                  .
           move      76                   to   v-pos                  .
           move      w-rig-mmm-e01        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-mmm-e01-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Secondo mese escluso                 *
      *    *-----------------------------------------------------------*
       acc-mmm-e02-000.
      *              *-------------------------------------------------*
      *              * Preparazioni pre-accettazione                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-rig-tip-esm        not  = 02 and
                     w-rig-tip-esm        not  = 03
                     go to acc-mmm-e02-999.
           if        w-rig-mmm-e01        =    zero
                     go to acc-mmm-e02-999.
       acc-mmm-e02-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      21                   to   v-lin                  .
           move      79                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-rig-mmm-e02        to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-mmm-e02-999.
       acc-mmm-e02-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-mmm-e02          .
       acc-mmm-e02-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Che non sia maggiore di 12                  *
      *                  *---------------------------------------------*
           if        w-rig-mmm-e02        >    12
                     go to acc-mmm-e02-100.
      *                  *---------------------------------------------*
      *                  * Che non sia uguale al primo mese escluso    *
      *                  *---------------------------------------------*
           if        w-rig-mmm-e02        =    w-rig-mmm-e01
                     go to acc-mmm-e02-100.
       acc-mmm-e02-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-mmm-e02-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-mmm-e02-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-mmm-e02-100.
       acc-mmm-e02-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo richieste : Secondo mese escluso    *
      *    *-----------------------------------------------------------*
       vis-mmm-e02-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9B"                 to   v-edm                  .
           move      21                   to   v-lin                  .
           move      79                   to   v-pos                  .
           move      w-rig-mmm-e02        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-mmm-e02-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi chiave           *
      *    *-----------------------------------------------------------*
       cnt-tdo-key-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-key-flg      .
       cnt-tdo-key-100.
      *              *-------------------------------------------------*
      *              * Controlli bloccanti                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo ordinamento *
      *                  *---------------------------------------------*
           if        w-prs-tip-ord-tip    =    "R"
                     go to cnt-tdo-key-120
           else if   w-prs-tip-ord-tip    =    "C"
                     go to cnt-tdo-key-140
           else if   w-prs-tip-ord-tip    =    "M"
                     go to cnt-tdo-key-160.
       cnt-tdo-key-120.
      *                      *-----------------------------------------*
      *                      * Ordinamento per Ragione sociale         *
      *                      *-----------------------------------------*
           if        w-tes-rag-max        =    spaces
                     go to cnt-tdo-key-124.
           if        w-tes-rag-max        not  < w-tes-rag-min
                     go to cnt-tdo-key-124.
           move      "La ragione sociale massima non puo' essere inferio
      -              "re alla minima "    to   w-err-box-err-msg      .
           go to     cnt-tdo-key-900.
       cnt-tdo-key-124.
      *                      *-----------------------------------------*
      *                      * A normalizzazioni                       *
      *                      *-----------------------------------------*
           go to     cnt-tdo-key-500.
       cnt-tdo-key-140.
      *                  *---------------------------------------------*
      *                  * Controllo su codice minimo e massimo        *
      *                  *---------------------------------------------*
           if        w-tes-cod-max        =    zero
                     go to cnt-tdo-key-144.
           if        w-tes-cod-max        not  < w-tes-cod-min
                     go to cnt-tdo-key-144.
           move      "Il codice massimo non puo' essere inferiore al cod
      -              "ice minimo !   "    to   w-err-box-err-msg      .
           go to     cnt-tdo-key-900.
       cnt-tdo-key-144.
      *                      *-----------------------------------------*
      *                      * A normalizzazioni                       *
      *                      *-----------------------------------------*
           go to     cnt-tdo-key-500.
       cnt-tdo-key-160.
      *                  *---------------------------------------------*
      *                  * Controllo su mnemonico minimo e massimo     *
      *                  *---------------------------------------------*
           if        w-tes-mne-max        =    spaces
                     go to cnt-tdo-key-164.
           if        w-tes-mne-max        not  < w-tes-mne-min
                     go to cnt-tdo-key-164.
           move      "Il mnemonico massimo non puo' essere inferiore a q
      -              "uello minimo ! "    to   w-err-box-err-msg      .
           go to     cnt-tdo-key-900.
       cnt-tdo-key-164.
      *                      *-----------------------------------------*
      *                      * A normalizzazioni                       *
      *                      *-----------------------------------------*
           go to     cnt-tdo-key-500.
       cnt-tdo-key-500.
      *              *-------------------------------------------------*
      *              * Normalizzazioni                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo esclusione mesi                        *
      *                  *---------------------------------------------*
           if        w-tes-tip-esm        =    zero
                     move  01             to   w-tes-tip-esm          .
           subtract  1                    from w-tes-tip-esm          .
       cnt-tdo-key-510.
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo ordinamento *
      *                  *---------------------------------------------*
           if        w-prs-tip-ord-tip    =    "R"
                     go to cnt-tdo-key-520
           else if   w-prs-tip-ord-tip    =    "C"
                     go to cnt-tdo-key-540
           else if   w-prs-tip-ord-tip    =    "M"
                     go to cnt-tdo-key-560.
       cnt-tdo-key-520.
      *                      *-----------------------------------------*
      *                      * Ordinamento per Ragione sociale         *
      *                      *-----------------------------------------*
           if        w-tes-rag-max        =    spaces
                     move   w-tes-rag-min to   w-tes-rag-max          .
           move      w-tes-rag-max        to   w-all-str-alf          .
           move      40                   to   w-all-str-lun          .
           perform   all-str-pad-000      thru all-str-pad-999        .
           move      w-all-str-alf        to   w-tes-rag-max          .
      *                          *-------------------------------------*
      *                          * Ad uscita post-normalizzazioni      *
      *                          *-------------------------------------*
           go to     cnt-tdo-key-800.
       cnt-tdo-key-540.
      *                      *-----------------------------------------*
      *                      * Ordinamento per Codice cliente          *
      *                      *-----------------------------------------*
           if        w-tes-cod-min        =    zero and
                     w-tes-cod-max        =    zero
                     move   9999999       to   w-tes-cod-max
           else if   w-tes-cod-min        not  = zero and
                     w-tes-cod-max        =    zero
                     move  w-tes-cod-min  to   w-tes-cod-max          .
      *                          *-------------------------------------*
      *                          * Ad uscita post-normalizzazioni      *
      *                          *-------------------------------------*
           go to     cnt-tdo-key-800.
       cnt-tdo-key-560.
      *                      *-----------------------------------------*
      *                      * Ordinamento per Mnemonico               *
      *                      *-----------------------------------------*
           if        w-tes-mne-max        =    spaces
                     move   w-tes-mne-min to   w-tes-mne-max          .
           move      w-tes-mne-max        to   w-all-str-alf          .
           move      10                   to   w-all-str-lun          .
           perform   all-str-pad-000      thru all-str-pad-999        .
           move      w-all-str-alf        to   w-tes-mne-max          .
      *                          *-------------------------------------*
      *                          * Ad uscita post-normalizzazioni      *
      *                          *-------------------------------------*
           go to     cnt-tdo-key-800.
       cnt-tdo-key-800.
      *              *-------------------------------------------------*
      *              * Uscita post-normalizzazioni                     *
      *              *-------------------------------------------------*
           go to     cnt-tdo-key-999.
       cnt-tdo-key-900.
      *              *-------------------------------------------------*
      *              * Emissione messaggio di errore e set del flag di *
      *              * uscita ad errore                                *
      *              *-------------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di errore in uscita                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-key-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     cnt-tdo-key-999.
       cnt-tdo-key-999.
           exit.
           
      *    *===========================================================*
      *    * Controllo se chiave vuota                                 *
      *    *-----------------------------------------------------------*
       cnt-key-vuo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-key-vuo-flg      .
       cnt-key-vuo-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi non chiave       *
      *    *-----------------------------------------------------------*
       cnt-tdo-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-nok-flg      .
       cnt-tdo-nok-999.
           exit.
           
      *    *===========================================================*
      *    * Controllo su impostazione tasto Do riga corpo             *
      *    *-----------------------------------------------------------*
       cnt-tdo-rig-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-rig-flg      .
       cnt-tdo-rig-300.
      *              *-------------------------------------------------*
      *              * Controllo su Forma di pagamento                 *
      *              *-------------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to cnt-tdo-rig-310.
           if        w-rig-cod-fop        =    zero
                     go to cnt-tdo-rig-310.
           move      w-rig-cod-fop        to   w-let-arc-zfp-cod      .
           perform   let-arc-zfp-000      thru let-arc-zfp-999        .
           if        w-let-arc-zfp-flg    =    spaces
                     go to cnt-tdo-rig-310.
           move      "Codice Forma di Pagamento non esistente           
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-310.
      *              *-------------------------------------------------*
      *              * Controllo su Tipo esclusione mesi               *
      *              *-------------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to cnt-tdo-rig-320.
           if        w-rig-tip-esm        =    zero
                     go to cnt-tdo-rig-320.
           if        w-rig-tip-esm        not  > 03
                     go to cnt-tdo-rig-320.
           move      "Tipo di Esclusione Mesi errato                    
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-320.
      *              *-------------------------------------------------*
      *              * Controllo su Giorno fisso di scadenza           *
      *              *-------------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to cnt-tdo-rig-330.
           if        w-rig-tip-esm        not  = 03
                     go to cnt-tdo-rig-330.
           if        w-rig-ggg-alt        not  = zero
                     go to cnt-tdo-rig-322.
           move      "Manca il Giorno Fisso di Scadenza                 
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-322.
           if        w-rig-ggg-alt        not  > 28
                     go to cnt-tdo-rig-330.
           move      "Giorno Fisso di Scadenza errato                   
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-330.
      *              *-------------------------------------------------*
      *              * Controllo su Mesi di esclusione 1 e 2           *
      *              *-------------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to cnt-tdo-rig-340.
           if        w-rig-tip-esm        not  = 02 and
                     w-rig-tip-esm        not  = 03
                     go to cnt-tdo-rig-340.
           if        w-rig-mmm-e01        not  = zero or
                     w-rig-mmm-e02        not  = zero
                     go to cnt-tdo-rig-332.
           move      "Mancano i Mesi di Esclusione                      
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-332.
           if        w-rig-mmm-e01        not  > 12 and
                     w-rig-mmm-e02        not  > 12
                     go to cnt-tdo-rig-334.
           move      "Mesi di Esclusione errati                         
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-334.
           if        w-rig-mmm-e01        =    zero or
                     w-rig-mmm-e02        =    zero
                     go to cnt-tdo-rig-340.
           if        w-rig-mmm-e01        not  = w-rig-mmm-e02
                     go to cnt-tdo-rig-340.
           move      "Mesi di Esclusione uguali                         
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-340.
      *              *-------------------------------------------------*
      *              * Controllo su Addebito spese incasso             *
      *              *-------------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to cnt-tdo-rig-350.
           if        w-rig-add-spi        =    spaces
                     go to cnt-tdo-rig-350.
           move      w-rig-add-spi        to   w-let-arc-zin-cod      .
           perform   let-arc-zin-000      thru let-arc-zin-999        .
           if        w-let-arc-zin-flg    =    spaces
                     go to cnt-tdo-rig-350.
           move      "Tipo Addebito Spese Incasso non esistente         
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-350.
      *              *-------------------------------------------------*
      *              * Controllo su Addebito spese bollo               *
      *              *-------------------------------------------------*
           if        w-rig-dpz-cli        not  = spaces
                     go to cnt-tdo-rig-360.
           if        w-rig-add-spb        =    spaces
                     go to cnt-tdo-rig-360.
           move      w-rig-add-spb        to   w-let-arc-zbo-cod      .
           perform   let-arc-zbo-000      thru let-arc-zbo-999        .
           if        w-let-arc-zbo-flg    =    spaces
                     go to cnt-tdo-rig-360.
           move      "Tipo Addebito Spese Bollo non esistente           
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-360.
      *              *-------------------------------------------------*
      *              * Controllo su Codice A.B.I.                      *
      *              *-------------------------------------------------*
           if        w-rig-cod-abi        =    zero
                     go to cnt-tdo-rig-370.
           move      w-rig-cod-abi        to   w-let-arc-axi-cod      .
           perform   let-arc-axi-000      thru let-arc-axi-999        .
           if        w-let-arc-axi-flg    =    spaces
                     go to cnt-tdo-rig-370.
           move      "Codice A.B.I. Banca d'Appoggio non esistente      
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-370.
      *              *-------------------------------------------------*
      *              * Controllo su Codice C.A.B.                      *
      *              *-------------------------------------------------*
           if        w-rig-cod-abi        =    zero
                     go to cnt-tdo-rig-600.
           if        w-rig-cod-cab        =    zero
                     go to cnt-tdo-rig-600.
           move      w-rig-cod-abi        to   w-let-arc-axs-abi      .
           move      w-rig-cod-cab        to   w-let-arc-axs-cab      .
           perform   let-arc-axs-000      thru let-arc-axs-999        .
           if        w-let-arc-axs-flg    =    spaces
                     go to cnt-tdo-rig-600.
           move      "Codice C.A.B. Sportello Bancario non esistente    
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-374.
      *              *-------------------------------------------------*
      *              * Controllo su Codice nostra banca                *
      *              *-------------------------------------------------*
           if        w-rig-nos-ban        =    spaces
                     go to cnt-tdo-rig-375.
           move      02                   to   w-let-arc-cbp-tip      .
           move      w-rig-nos-ban        to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
           if        w-let-arc-cbp-flg    =    spaces
                     go to cnt-tdo-rig-375.
           move      "Codice nostra banca non esistente                 
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-375.
      *              *-------------------------------------------------*
      *              * Controllo su Codice nostra banca presentazione  *
      *              *-------------------------------------------------*
           if        w-rig-nos-bpe        =    spaces
                     go to cnt-tdo-rig-376.
           move      02                   to   w-let-arc-cbp-tip      .
           move      w-rig-nos-bpe        to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
           if        w-let-arc-cbp-flg    =    spaces
                     go to cnt-tdo-rig-376.
           move      "Codice nostra banca presentazione effetti non esis
      -              "tente     "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-376.
      *              *-------------------------------------------------*
      *              * Controllo su Codice nostro c/c postale          *
      *              *-------------------------------------------------*
           if        w-rig-nos-ccp        =    spaces
                     go to cnt-tdo-rig-600.
           move      03                   to   w-let-arc-cbp-tip      .
           move      w-rig-nos-ccp        to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
           if        w-let-arc-cbp-flg    =    spaces
                     go to cnt-tdo-rig-600.
           move      "Codice nostro c/c postale non esistente           
      -              "          "         to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-600.
      *              *-------------------------------------------------*
      *              * Normalizzazioni post-controlli bloccanti        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se si tratta del cli-  *
      *                  * ente principale o di una sua dipendenza     *
      *                  *---------------------------------------------*
           if        w-rig-dpz-cli        =    spaces
                     go to cnt-tdo-rig-620
           else      go to cnt-tdo-rig-700.
       cnt-tdo-rig-620.
      *                  *---------------------------------------------*
      *                  * Se cliente principale                       *
      *                  *---------------------------------------------*
       cnt-tdo-rig-625.
      *                      *-----------------------------------------*
      *                      * Tipo esclusione mesi                    *
      *                      *-----------------------------------------*
           if        w-rig-tip-esm        =    zero
                     move  01             to   w-rig-tip-esm          .
      *                      *-----------------------------------------*
      *                      * Tipo esclusione mesi                    *
      *                      *-----------------------------------------*
           if        w-rig-tip-esm        =    zero
                     move  01             to   w-rig-tip-esm          .
      *                      *-----------------------------------------*
      *                      * Giorno fisso di scadenza                *
      *                      *-----------------------------------------*
           if        w-rig-tip-esm        not  = 03
                     move  zero           to   w-rig-ggg-alt          .
      *                      *-----------------------------------------*
      *                      * Mesi di esclusione                      *
      *                      *-----------------------------------------*
           if        w-rig-tip-esm        not  = 02 and
                     w-rig-tip-esm        not  = 03
                     move  zero           to   w-rig-mmm-e01    
                     move  zero           to   w-rig-mmm-e02          .
      *                      *-----------------------------------------*
      *                      * Codice C.A.B.                           *
      *                      *-----------------------------------------*
           if        w-rig-cod-abi        =    zero
                     move  zero           to   w-rig-cod-cab          .
      *                      *-----------------------------------------*
      *                      * Uscita post-normalizzazione             *
      *                      *-----------------------------------------*
           go to     cnt-tdo-rig-999.
       cnt-tdo-rig-700.
      *                  *---------------------------------------------*
      *                  * Se dipendenza                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Eliminazione valori non significativi   *
      *                      * per la dipendenza                       *
      *                      *-----------------------------------------*
           move      zero                 to   w-rig-cod-fop          .
           move      zero                 to   w-rig-tip-esm          .
           move      zero                 to   w-rig-ggg-alt          .
           move      zero                 to   w-rig-mmm-e01          .
           move      zero                 to   w-rig-mmm-e02          .
           move      spaces               to   w-rig-add-spi          .
           move      spaces               to   w-rig-add-spb          .
           move      spaces               to   w-rig-nos-ban          .
           move      spaces               to   w-rig-nos-bpe          .
           move      spaces               to   w-rig-nos-ccp          .
      *                      *-----------------------------------------*
      *                      * Normalizzazione valori significativi    *
      *                      * per la dipendenza                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Codice C.A.B.                       *
      *                          *-------------------------------------*
           if        w-rig-cod-abi        =    zero
                     move  zero           to   w-rig-cod-cab          .
      *                      *-----------------------------------------*
      *                      * Uscita post-normalizzazione             *
      *                      *-----------------------------------------*
           go to     cnt-tdo-rig-999.
       cnt-tdo-rig-900.
      *              *-------------------------------------------------*
      *              * Emissione messaggio di errore e set del flag di *
      *              * uscita ad errore                                *
      *              *-------------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di errore in uscita                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-rig-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     cnt-tdo-rig-999.
       cnt-tdo-rig-999.
           exit.

      *    *===========================================================*
      *    * Preparazioni pre-accettazione riga corpo                  *
      *    *-----------------------------------------------------------*
       pre-rig-cor-000.
       pre-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Azioni post-accettazione riga corpo                       *
      *    *-----------------------------------------------------------*
       pos-rig-cor-000.
       pos-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati chiave e non chiave                  *
      *    *-----------------------------------------------------------*
       nor-key-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione dati chiave                     *
      *              *-------------------------------------------------*
           perform   nor-key-reg-000      thru nor-key-reg-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave testata         *
      *              *-------------------------------------------------*
           perform   nor-nok-tes-000      thru nor-nok-tes-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave riga corpo      *
      *              *-------------------------------------------------*
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave piede           *
      *              *-------------------------------------------------*
           perform   nor-nok-pie-000      thru nor-nok-pie-999        .
      *              *-------------------------------------------------*
      *              * Inizializzazione file relative di supporto      *
      *              *-------------------------------------------------*
           move      "BE"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       nor-key-nok-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati chiave                               *
      *    *-----------------------------------------------------------*
       nor-key-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione selettori sulle chiavi          *
      *              *-------------------------------------------------*
           move      zero                 to   w-tes-cod-min          .
           move      zero                 to   w-tes-cod-max          .
           move      spaces               to   w-tes-rag-min          .
           move      spaces               to   w-tes-rag-max          .
           move      spaces               to   w-tes-mne-min          .
           move      spaces               to   w-tes-mne-max          .
      *              *-------------------------------------------------*
      *              * Normalizzazione selettori sui dati              *
      *              *-------------------------------------------------*
           move      zero                 to   w-tes-cod-fop          .
           move      zero                 to   w-tes-cod-fop-sns      .
           move      spaces               to   w-tes-cod-fop-des      .
           move      zero                 to   w-tes-cod-abi          .
           move      spaces               to   w-tes-cod-abi-den      .
           move      zero                 to   w-tes-cod-abi-sns      .
           move      zero                 to   w-tes-cod-cab          .
           move      spaces               to   w-tes-cod-cab-den      .
           move      zero                 to   w-tes-cod-cab-sns      .
           move      spaces               to   w-tes-add-spi          .
           move      spaces               to   w-tes-add-spi-des      .
           move      spaces               to   w-tes-add-spb          .
           move      spaces               to   w-tes-add-spb-des      .
           move      spaces               to   w-tes-ccc-app          .
           move      spaces               to   w-tes-nos-ban          .
           move      spaces               to   w-tes-nos-ban-des      .
           move      zero                 to   w-tes-nos-ban-sns      .
           move      spaces               to   w-tes-nos-bpe          .
           move      spaces               to   w-tes-nos-bpe-des      .
           move      spaces               to   w-tes-nos-ccp          .
           move      spaces               to   w-tes-nos-ccp-des      .
           move      zero                 to   w-tes-tip-esm          .
      *              *-------------------------------------------------*
      *              * Normalizzazione valori sostitutivi              *
      *              *-------------------------------------------------*
           move      zero                 to   w-tes-fop-sos          .
           move      zero                 to   w-tes-abi-sos          .
           move      zero                 to   w-tes-cab-sos          .
      *              *-------------------------------------------------*
      *              * Normalizzazione conferma ipostazioni            *
      *              *-------------------------------------------------*
           move      spaces               to   w-tes-cnf-imp          .
       nor-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave testata                   *
      *    *-----------------------------------------------------------*
       nor-nok-tes-000.
       nor-nok-tes-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave riga corpo                *
      *    *-----------------------------------------------------------*
       nor-nok-rig-000.
           move      zero                 to   w-rig-num-prg          .
           move      zero                 to   w-rig-cod-cli          .
           move      spaces               to   w-rig-dpz-cli          .
           move      spaces               to   w-rig-cod-cli-rag      .
           move      spaces               to   w-rig-cod-cli-mne      .
           move      zero                 to   w-rig-cod-fop          .
           move      spaces               to   w-rig-cod-fop-des      .
           move      spaces               to   w-rig-cod-fop-mne      .
           move      zero                 to   w-rig-cod-abi          .
           move      spaces               to   w-rig-cod-abi-den      .
           move      zero                 to   w-rig-cod-cab          .
           move      spaces               to   w-rig-cod-cab-den      .
           move      spaces               to   w-rig-ccc-app          .
           move      spaces               to   w-rig-nos-ban          .
           move      spaces               to   w-rig-nos-ban-des      .
           move      spaces               to   w-rig-nos-bpe          .
           move      spaces               to   w-rig-nos-bpe-des      .
           move      spaces               to   w-rig-nos-ccp          .
           move      spaces               to   w-rig-nos-ccp-des      .
           move      spaces               to   w-rig-add-spi          .
           move      spaces               to   w-rig-add-spb          .
           move      zero                 to   w-rig-tip-esm          .
           move      zero                 to   w-rig-ggg-alt          .
           move      zero                 to   w-rig-mmm-e01          .
           move      zero                 to   w-rig-mmm-e02          .
       nor-nok-rig-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave piede                     *
      *    *-----------------------------------------------------------*
       nor-nok-pie-000.
       nor-nok-pie-999.
           exit.

      *    *===========================================================*
      *    * Lettura registrazione pre-esistente                       *
      *    *-----------------------------------------------------------*
       rou-let-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-let-reg      .
       rou-let-reg-100.
      *              *-------------------------------------------------*
      *              * Messaggio di caricamento in esecuzione          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "                       --- Caricamento in esecuzio
      -              "ne ---                        "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Routine di caricamento                          *
      *              *-------------------------------------------------*
           perform   car-fil-rap-000      thru car-fil-rap-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del numero di records ca-  *
      *              * ricati nel file relative di appoggio            *
      *              *-------------------------------------------------*
           if        w-rlt-sup-max        =    zero
                     go to rou-let-reg-200
           else      go to rou-let-reg-300.
       rou-let-reg-200.
      *              *-------------------------------------------------*
      *              * Se numero di records caricati : zero            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Nessun cliente da trattare !                      
      -              "          "         to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Status di uscita ad errore                  *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-rou-let-reg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-300.
      *              *-------------------------------------------------*
      *              * Se numero di records caricati maggiore di zero  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Modifica                                    *
      *                  *---------------------------------------------*
           move      "M"                  to   w-cnt-mfu-tip-fun      .
      *                  *---------------------------------------------*
      *                  * Test per visualizzazione                    *
      *                  *---------------------------------------------*
           if        w-ovy-exe-vis        =    "V"
                     move  "V"            to   w-cnt-mfu-tip-fun      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per inserimento                  *
      *    *-----------------------------------------------------------*
       pre-acc-ins-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-ins      .
       pre-acc-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per modifica                     *
      *    *-----------------------------------------------------------*
       pre-acc-mod-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-mod      .
       pre-acc-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per visualizzazione              *
      *    *-----------------------------------------------------------*
       pre-acc-vis-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-vis      .
       pre-acc-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-richiesta di ratifica tasto Delete            *
      *    *-----------------------------------------------------------*
       pre-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-snx-del      .
      *              *-------------------------------------------------*
      *              * Si ignora comunque il tasto Delt                *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-pre-snx-del      .
       pre-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-richiesta di ratifica tasto Delete           *
      *    *-----------------------------------------------------------*
       pos-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-snx-del      .
      *              *-------------------------------------------------*
      *              * Si ignora comunque il tasto Delt                *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-pos-snx-del      .
       pos-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su inserimento                          *
      *    *-----------------------------------------------------------*
       pos-exi-ins-000.
       pos-exi-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su modifica                             *
      *    *-----------------------------------------------------------*
       pos-exi-mod-000.
       pos-exi-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su visualizzazione                      *
      *    *-----------------------------------------------------------*
       pos-exi-vis-000.
       pos-exi-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di inserimento                      *
      *    *-----------------------------------------------------------*
       pos-cnf-ins-000.
       pos-cnf-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di modifica                         *
      *    *-----------------------------------------------------------*
       pos-cnf-mod-000.
      *              *-------------------------------------------------*
      *              * Scaricamento file relative di appoggio          *
      *              *-------------------------------------------------*
           perform   sca-fil-rap-000      thru sca-fil-rap-999        .
       pos-cnf-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di annullamento                     *
      *    *-----------------------------------------------------------*
       pos-cnf-ann-000.
       pos-cnf-ann-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione caricamento file relative di appoggio          *
      *    *-----------------------------------------------------------*
       car-fil-rap-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore righe da caricare     *
      *              *-------------------------------------------------*
           move      zero                 to   w-car-eff-rig-ctr      .
      *              *-------------------------------------------------*
      *              * Normalizzazione segnale di superamento massimo  *
      *              * righe da caricare                               *
      *              *-------------------------------------------------*
           move      spaces               to   w-car-eff-rig-flg      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento da  *
      *              * personalizzazione                               *
      *              *-------------------------------------------------*
           if        w-prs-tip-ord-tip    =    "R"
                     go to car-fil-rap-020
           else if   w-prs-tip-ord-tip    =    "C"
                     go to car-fil-rap-040
           else if   w-prs-tip-ord-tip    =    "M"
                     go to car-fil-rap-060.
       car-fil-rap-020.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Ragione sociale             *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "RAGKEY    "         to   f-key                  .
           move      w-tes-rag-min        to   rf-dcc-rag-key         .
           move      zero                 to   rf-dcc-cod-cli         .
           move      spaces               to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-900.
      *                  *---------------------------------------------*
      *                  * A Read-next                                 *
      *                  *---------------------------------------------*
           go to     car-fil-rap-200.
       car-fil-rap-040.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Codice                      *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-tes-cod-min        to   rf-dcc-cod-cli         .
           move      spaces               to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-900.
      *                  *---------------------------------------------*
      *                  * A Read-next                                 *
      *                  *---------------------------------------------*
           go to     car-fil-rap-200.
       car-fil-rap-060.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Mnemonico                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Dal momento che il record [dcc] non ha  *
      *                      * una chiave sul codice mnemonico, si     *
      *                      * deve utilizzare quella del file [cli]   *
      *                      *-----------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "CODMNE    "         to   f-key                  .
           move      w-tes-mne-min        to   rf-cli-cod-mne         .
           move      zero                 to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-900.
      *                  *---------------------------------------------*
      *                  * A Read-next                                 *
      *                  *---------------------------------------------*
           go to     car-fil-rap-200.
       car-fil-rap-200.
      *              *-------------------------------------------------*
      *              * Read-next                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Indicatore di programma in esecuzione       *
      *                  *---------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo ordinamento *
      *                  *---------------------------------------------*
           if        w-prs-tip-ord-tip    =    "R"
                     go to car-fil-rap-220
           else if   w-prs-tip-ord-tip    =    "C"
                     go to car-fil-rap-240
           else if   w-prs-tip-ord-tip    =    "M"
                     go to car-fil-rap-260.
       car-fil-rap-220.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Ragione sociale             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Read-next su archivio [dcc]             *
      *                      *-----------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Se at end : uscita                      *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-900.
      *                      *-----------------------------------------*
      *                      * A test sul massimo                      *
      *                      *-----------------------------------------*
           go to     car-fil-rap-300.
       car-fil-rap-240.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Codice                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Read-next su archivio [dcc]             *
      *                      *-----------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Se at end : uscita                      *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-900.
      *                      *-----------------------------------------*
      *                      * A test sul massimo                      *
      *                      *-----------------------------------------*
           go to     car-fil-rap-300.
       car-fil-rap-260.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Mnemonico                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Read-next su archivio [cli]             *
      *                      *-----------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *                      *-----------------------------------------*
      *                      * Se at end : uscita                      *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-900.
      *                  *---------------------------------------------*
      *                  * Test sul massimo                            *
      *                  *---------------------------------------------*
           if        rf-cli-cod-mne       >    w-tes-mne-max
                     go to car-fil-rap-900.
       car-fil-rap-262.
      *                      *-----------------------------------------*
      *                      * Start sul file [dcc] per codice         *
      *                      *-----------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-cli-cod-cli       to   rf-dcc-cod-cli         .
           move      spaces               to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                          *-------------------------------------*
      *                          * Se Start errata : a riciclo         *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-600.
       car-fil-rap-264.
      *                      *-----------------------------------------*
      *                      * Read-next su archivio [dcc]             *
      *                      *-----------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Se at end : a riciclo                   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-600.
       car-fil-rap-266.
      *                      *-----------------------------------------*
      *                      * Test sul massimo file [dcc]             *
      *                      *-----------------------------------------*
           if        rf-dcc-cod-cli       not  = rf-cli-cod-cli
                     go to car-fil-rap-600.
       car-fil-rap-268.
      *                      *-----------------------------------------*
      *                      * Selezioni sul record                    *
      *                      *-----------------------------------------*
           perform   sel-rec-dcc-000      thru sel-rec-dcc-999        .
      *                          *-------------------------------------*
      *                          * Test su flag di selezione           *
      *                          *-------------------------------------*
           if        w-sel-rec-dcc-flg    not  = spaces
                     go to car-fil-rap-264.
       car-fil-rap-270.
      *                      *-----------------------------------------*
      *                      * Bufferizzazione codice mnemonico        *
      *                      *-----------------------------------------*
           move      rf-cli-cod-mne       to   w-rig-cod-cli-mne      .
      *                      *-----------------------------------------*
      *                      * Caricamento effettivo del record nella  *
      *                      * catena movimenti per la registrazione   *
      *                      *-----------------------------------------*
           perform   car-eff-rig-000      thru car-eff-rig-999        .
      *                          *-------------------------------------*
      *                          * Test su flag di uscita              *
      *                          *-------------------------------------*
           if        w-car-eff-rig-flg    =    spaces
                     go to car-fil-rap-272.
      *                          *-------------------------------------*
      *                          * Box di superamento numero elementi  *
      *                          * massimo da caricare                 *
      *                          *-------------------------------------*
           perform   box-err-rig-000      thru box-err-rig-999        .
      *                          *-------------------------------------*
      *                          * Fine lettura                        *
      *                          *-------------------------------------*
           go to     car-fil-rap-900.
       car-fil-rap-272.
      *                      *-----------------------------------------*
      *                      * Riciclo a Read Next su file [cli]       *
      *                      *-----------------------------------------*
           go to     car-fil-rap-264.
       car-fil-rap-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo ordinamento *
      *                  *---------------------------------------------*
           if        w-prs-tip-ord-tip    =    "R"
                     go to car-fil-rap-320
           else if   w-prs-tip-ord-tip    =    "C"
                     go to car-fil-rap-340
           else if   w-prs-tip-ord-tip    =    "M"
                     go to car-fil-rap-360.
       car-fil-rap-320.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Ragione sociale             *
      *                  *---------------------------------------------*
           if        rf-dcc-rag-key       >    w-tes-rag-max
                     go to car-fil-rap-900.
      *                      *-----------------------------------------*
      *                      * A selezioni sul record                  *
      *                      *-----------------------------------------*
           go to     car-fil-rap-400.
       car-fil-rap-340.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Codice                      *
      *                  *---------------------------------------------*
           if        rf-dcc-cod-cli       >    w-tes-cod-max
                     go to car-fil-rap-900.
      *                      *-----------------------------------------*
      *                      * A selezioni sul record                  *
      *                      *-----------------------------------------*
           go to     car-fil-rap-400.
       car-fil-rap-360.
      *                  *---------------------------------------------*
      *                  * Ordinamento per Mnemonico                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nessuna azione                          *
      *                      *-----------------------------------------*
           go to     car-fil-rap-400.
       car-fil-rap-400.
      *              *-------------------------------------------------*
      *              * Selezioni sul record                            *
      *              *-------------------------------------------------*
           perform   sel-rec-dcc-000      thru sel-rec-dcc-999        .
      *                  *---------------------------------------------*
      *                  * Test su flag di selezione                   *
      *                  *---------------------------------------------*
           if        w-sel-rec-dcc-flg    not  = spaces
                     go to car-fil-rap-200.
       car-fil-rap-500.
      *              *-------------------------------------------------*
      *              * Caricamento effettivo del record nella catena   *
      *              * movimenti per la registrazione                  *
      *              *-------------------------------------------------*
           perform   car-eff-rig-000      thru car-eff-rig-999        .
      *                  *---------------------------------------------*
      *                  * Test su flag di uscita                      *
      *                  *---------------------------------------------*
           if        w-car-eff-rig-flg    =    spaces
                     go to car-fil-rap-600.
      *                  *---------------------------------------------*
      *                  * Box di superamento numero elementi massimo  *
      *                  * da caricare                                 *
      *                  *---------------------------------------------*
           perform   box-err-rig-000      thru box-err-rig-999        .
      *                  *---------------------------------------------*
      *                  * Fine lettura                                *
      *                  *---------------------------------------------*
           go to     car-fil-rap-900.
       car-fil-rap-600.
      *              *-------------------------------------------------*
      *              * Riciclo a Read Next su file [dcc]               *
      *              *-------------------------------------------------*
           go to     car-fil-rap-200.
       car-fil-rap-900.
      *              *-------------------------------------------------*
      *              * Eliminazione messaggio di caricamento in esecu- *
      *              * zione                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       car-fil-rap-950.
      *              *-------------------------------------------------*
      *              * Forzatura flag di visualizzazione prompt e dati *
      *              * campi chiave                                    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-pmt-key      .
           move      "#"                  to   w-cnt-sts-vis-key      .
       car-fil-rap-999.
           exit.

      *    *===========================================================*
      *    * Selezioni sul record [dcc]                                *
      *    *-----------------------------------------------------------*
       sel-rec-dcc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di selezione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-sel-rec-dcc-flg      .
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
       sel-rec-dcc-100.
      *                  *---------------------------------------------*
      *                  * Forma di pagamento                          *
      *                  *---------------------------------------------*
           if        w-tes-cod-fop-sns    =    zero and
                     w-tes-cod-fop        =    zero
                     go to sel-rec-dcc-150.
           if        rf-dcc-cod-fop       not  = w-tes-cod-fop
                     go to sel-rec-dcc-900.
       sel-rec-dcc-150.
      *                  *---------------------------------------------*
      *                  * Codice ABI                                  *
      *                  *---------------------------------------------*
           if        w-tes-cod-abi-sns    =    zero and
                     w-tes-cod-abi        =    zero
                     go to sel-rec-dcc-250.
           if        rf-dcc-cod-abi       not  = w-tes-cod-abi
                     go to sel-rec-dcc-900.
       sel-rec-dcc-200.
      *                  *---------------------------------------------*
      *                  * Codice CAB                                  *
      *                  *---------------------------------------------*
           if        w-tes-cod-cab-sns    =    zero and
                     w-tes-cod-cab        =    zero
                     go to sel-rec-dcc-250.
           if        rf-dcc-cod-cab       not  = w-tes-cod-cab
                     go to sel-rec-dcc-900.
       sel-rec-dcc-250.
      *                  *---------------------------------------------*
      *                  * Conto corrente del cliente                  *
      *                  *---------------------------------------------*
           if        w-tes-ccc-app        =    spaces
                     go to sel-rec-dcc-300.
           if        rf-dcc-ccc-app       not  = w-tes-ccc-app
                     go to sel-rec-dcc-900.
       sel-rec-dcc-300.
      *                  *---------------------------------------------*
      *                  * Codice nostra banca                         *
      *                  *---------------------------------------------*
           if        w-tes-nos-ban        =    spaces
                     go to sel-rec-dcc-320.
           if        rf-dcc-nos-ban       not  = w-tes-nos-ban
                     go to sel-rec-dcc-900.
       sel-rec-dcc-320.
      *                  *---------------------------------------------*
      *                  * Codice nostra banca presentazione effetti   *
      *                  *---------------------------------------------*
           if        w-tes-nos-bpe        =    spaces
                     go to sel-rec-dcc-350.
           if        rf-dcc-nos-bpe       not  = w-tes-nos-bpe
                     go to sel-rec-dcc-900.
       sel-rec-dcc-350.
      *                  *---------------------------------------------*
      *                  * Codice nostro c/c postale                   *
      *                  *---------------------------------------------*
           if        w-tes-nos-ccp        =    spaces
                     go to sel-rec-dcc-400.
           if        rf-dcc-nos-ccp       not  = w-tes-nos-ccp
                     go to sel-rec-dcc-900.
       sel-rec-dcc-400.
      *                  *---------------------------------------------*
      *                  * Addebito spese incasso                      *
      *                  *---------------------------------------------*
           if        w-tes-add-spi        =    spaces
                     go to sel-rec-dcc-450.
           if        rf-dcc-add-spi       not  = w-tes-add-spi
                     go to sel-rec-dcc-900.
       sel-rec-dcc-450.
      *                  *---------------------------------------------*
      *                  * Addebito spese bollo                        *
      *                  *---------------------------------------------*
           if        w-tes-add-spb        =    spaces
                     go to sel-rec-dcc-500.
           if        rf-dcc-add-spb       not  = w-tes-add-spb
                     go to sel-rec-dcc-900.
       sel-rec-dcc-500.
      *                  *---------------------------------------------*
      *                  * Tipo esclusione mesi                        *
      *                  *---------------------------------------------*
           if        w-tes-tip-esm        =    zero
                     go to sel-rec-dcc-550.
           if        rf-dcc-tip-esm       not  = w-tes-tip-esm
                     go to sel-rec-dcc-900.
       sel-rec-dcc-550.
      *                  *---------------------------------------------*
      *                  * Uscita per selezione superata               *
      *                  *---------------------------------------------*
           go to     sel-rec-dcc-999.
       sel-rec-dcc-900.
      *              *-------------------------------------------------*
      *              * Se selezione non superata                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di selezione non superata              *
      *                  *---------------------------------------------*
           move      "#"                  to   w-sel-rec-dcc-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita per selezione non superata           *
      *                  *---------------------------------------------*
           go to     sel-rec-dcc-999.
       sel-rec-dcc-999.
           exit.

      *    *===========================================================*
      *    * Caricamento effettivo delle righe                         *
      *    *-----------------------------------------------------------*
       car-eff-rig-000.
      *              *-------------------------------------------------*
      *              * Composizione area 'w-rig'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore righe da caricare      *
      *                  *---------------------------------------------*
           add       1                    to   w-car-eff-rig-ctr      .
      *                  *---------------------------------------------*
      *                  * Test sul massimo righe caricabili           *
      *                  *---------------------------------------------*
           if        w-car-eff-rig-ctr    >    w-car-eff-rig-max
                     move  "#"            to   w-car-eff-rig-flg
                     go to car-eff-rig-999.
      *                  *---------------------------------------------*
      *                  * Numero progressivo record caricato          *
      *                  *---------------------------------------------*
           move      w-rlt-sup-max        to   w-rig-num-prg          .
           add       1                    to   w-rig-num-prg          .
      *                      *-----------------------------------------*
      *                      * Valori determinati direttamente da      *
      *                      * record [dcc]                            *
      *                      *-----------------------------------------*
           move      rf-dcc-cod-cli       to   w-rig-cod-cli          .
           move      rf-dcc-dpz-cli       to   w-rig-dpz-cli          .
           move      rf-dcc-rag-soc       to   w-rig-cod-cli-rag      .
           move      rf-dcc-cod-fop       to   w-rig-cod-fop          .
           move      rf-dcc-cod-abi       to   w-rig-cod-abi          .
           move      rf-dcc-cod-cab       to   w-rig-cod-cab          .
           move      rf-dcc-ccc-app       to   w-rig-ccc-app          .
           move      rf-dcc-add-spi       to   w-rig-add-spi          .
           move      rf-dcc-add-spb       to   w-rig-add-spb          .
           move      rf-dcc-tip-esm       to   w-rig-tip-esm          .
           move      rf-dcc-ggg-alt       to   w-rig-ggg-alt          .
           move      rf-dcc-mmm-e01       to   w-rig-mmm-e01          .
           move      rf-dcc-mmm-e02       to   w-rig-mmm-e02          .
           move      rf-dcc-nos-ban       to   w-rig-nos-ban          .
           move      rf-dcc-nos-bpe       to   w-rig-nos-bpe          .
           move      rf-dcc-nos-ccp       to   w-rig-nos-ccp          .
      *                      *-----------------------------------------*
      *                      * Eventuali sostituzioni                  *
      *                      *-----------------------------------------*
           perform   car-eff-rig-sos-000  thru car-eff-rig-sos-999    .
      *                      *-----------------------------------------*
      *                      * Valori determinati indirettamente da    *
      *                      * record [dcc]                            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Descrizione per codice forma di pa- *
      *                          * gamento                             *
      *                          *-------------------------------------*
           move      w-rig-cod-fop        to   w-let-arc-zfp-cod      .
           perform   let-arc-zfp-000      thru let-arc-zfp-999        .
           move      w-let-arc-zfp-des    to   w-rig-cod-fop-des      .
           move      w-let-arc-zfp-mne    to   w-rig-cod-fop-mne      .
      *                          *-------------------------------------*
      *                          * Descrizione per codice A.B.I.       *
      *                          *-------------------------------------*
           move      w-rig-cod-abi        to   w-let-arc-axi-cod      .
           perform   let-arc-axi-000      thru let-arc-axi-999        .
           move      w-let-arc-axi-den    to   w-rig-cod-abi-den      .
      *                          *-------------------------------------*
      *                          * Descrizione per codice C.A.B.       *
      *                          *-------------------------------------*
           move      w-rig-cod-abi        to   w-let-arc-axs-abi      .
           move      w-rig-cod-cab        to   w-let-arc-axs-cab      .
           perform   let-arc-axs-000      thru let-arc-axs-999        .
           move      w-let-arc-axs-den    to   w-rig-cod-cab-den      .
      *                          *-------------------------------------*
      *                          * Descrizione per codice nostra banca *
      *                          *-------------------------------------*
           move      02                   to   w-let-arc-cbp-tip      .
           move      w-rig-nos-ban        to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
           move      w-let-arc-cbp-des    to   w-rig-nos-ban-des      .
      *                          *-------------------------------------*
      *                          * Descrizione per codice nostra banca *
      *                          * per la presentazione degli effetti  *
      *                          *-------------------------------------*
           move      02                   to   w-let-arc-cbp-tip      .
           move      w-rig-nos-bpe        to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
           move      w-let-arc-cbp-des    to   w-rig-nos-bpe-des      .
      *                          *-------------------------------------*
      *                          * Descrizione per codice nostro c/c   *
      *                          * postale                             *
      *                          *-------------------------------------*
           move      03                   to   w-let-arc-cbp-tip      .
           move      w-rig-nos-ccp        to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
           move      w-let-arc-cbp-des    to   w-rig-nos-ccp-des      .
       car-eff-rig-800.
      *              *-------------------------------------------------*
      *              * Bufferizzazione riga pre-modifica               *
      *              *-------------------------------------------------*
           move      w-rig-001            to   w-rig-002              .
      *              *-------------------------------------------------*
      *              * Put su file relative di appoggio                *
      *              *-------------------------------------------------*
           move      "PT"                 to   w-rlt-sup-ope          .
           move      w-rig                to   w-rlt-sup-buf          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       car-eff-rig-999.
           exit.

      *    *===========================================================*
      *    * Caricamento effettivo delle righe                         *
      *    *                                                           *
      *    * Eventuali sostituzioni                                    *
      *    *-----------------------------------------------------------*
       car-eff-rig-sos-000.
      *              *-------------------------------------------------*
      *              * Forma di pagamento                              *
      *              *-------------------------------------------------*
           if        w-tes-cod-fop-sns    =    zero
                     go to car-eff-rig-sos-100.
           move      w-tes-fop-sos        to   w-rig-cod-fop          .
       car-eff-rig-sos-100.
      *              *-------------------------------------------------*
      *              * Codice ABI                                      *
      *              *-------------------------------------------------*
           if        w-tes-cod-abi-sns    =    zero
                     go to car-eff-rig-sos-200.
           move      w-tes-abi-sos        to   w-rig-cod-abi          .
       car-eff-rig-sos-200.
      *              *-------------------------------------------------*
      *              * Codice CAB                                      *
      *              *-------------------------------------------------*
           if        w-tes-cod-cab-sns    =    zero
                     go to car-eff-rig-sos-300.
           move      w-tes-cab-sos        to   w-rig-cod-cab          .
       car-eff-rig-sos-300.
      *              *-------------------------------------------------*
      *              * Codice nostra banca                             *
      *              *-------------------------------------------------*
           if        w-tes-nos-ban-sns    =    zero
                     go to car-eff-rig-sos-900.
           move      w-tes-nos-sos        to   w-rig-nos-ban          .
       car-eff-rig-sos-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     car-eff-rig-sos-999.
       car-eff-rig-sos-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione scaricamento da file relative di appoggio      *
      *    *-----------------------------------------------------------*
       sca-fil-rap-000.
      *              *-------------------------------------------------*
      *              * Messaggio di aggiornamento in esecuzione        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "            --- Aggiornamento anagrafiche clienti 
      -              "in esecuzione ---             "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       sca-fil-rap-050.
      *              *-------------------------------------------------*
      *              * Contatore records scaricati a zero              *
      *              *-------------------------------------------------*
           move      zero                 to   w-rlt-sup-ctr          .
       sca-fil-rap-070.
      *              *-------------------------------------------------*
      *              * Normalizzazione set                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da eseguire                         *
      *                  *---------------------------------------------*
           if        w-ipc-tdc-mos-val    not  = "S"
                     go to sca-fil-rap-100.
      *                  *---------------------------------------------*
      *                  * Utente di sistema da segreteria             *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione                             *
      *                  *---------------------------------------------*
           move      "NO"                 to   w-mod-set-tip-ope      .
           move      s-ute                to   w-mod-set-ide-ute      .
           move      i-ide-fas            to   w-mod-set-ide-fas      .
           perform   mdl-gen-set-cll-000  thru mdl-gen-set-cll-999    .
       sca-fil-rap-100.
      *              *-------------------------------------------------*
      *              * Incremento contatore records scaricati          *
      *              *-------------------------------------------------*
           add       1                    to   w-rlt-sup-ctr          .
      *              *-------------------------------------------------*
      *              * Se maggiore del numero di records caricati  :   *
      *              * uscita                                          *
      *              *-------------------------------------------------*
           if        w-rlt-sup-ctr        >    w-rlt-sup-max
                     go to sca-fil-rap-900.
       sca-fil-rap-150.
      *              *-------------------------------------------------*
      *              * Lettura riga da file relative di supporto       *
      *              *-------------------------------------------------*
           move      "RD"                 to   w-rlt-sup-ope          .
           move      w-rlt-sup-ctr        to   w-rlt-sup-prg          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
           move      w-rlt-sup-buf        to   w-rig                  .
       sca-fil-rap-160.
      *              *-------------------------------------------------*
      *              * Test preliminare se in fase di generazione set  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su variabile letta                     *
      *                  *---------------------------------------------*
           if        w-ipc-tdc-mos-val    not  = "S"
                     go to sca-fil-rap-180.
      *                  *---------------------------------------------*
      *                  * Subroutine di update set                    *
      *                  *---------------------------------------------*
           perform   sca-fil-rap-set-000  thru   sca-fil-rap-set-999  .
      *                  *---------------------------------------------*
      *                  * A riga successiva                           *
      *                  *---------------------------------------------*
           go to     sca-fil-rap-400.
       sca-fil-rap-180.
      *              *-------------------------------------------------*
      *              * Test se riga modificata                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se e' stata richiesta almeno una sostitu-   *
      *                  * zione il test che segue viene ignorato      *
      *                  *---------------------------------------------*
           if        w-tes-cod-fop-sns    not  = zero or
                     w-tes-cod-abi-sns    not  = zero or
                     w-tes-cod-cab-sns    not  = zero or
                     w-tes-nos-ban-sns    not  = zero
                     go to sca-fil-rap-190.
      *                  *---------------------------------------------*
      *                  * Se non e' avvenuta alcuna modifica si rici- *
      *                  * cla alla riga successiva                    *
      *                  *---------------------------------------------*
           if        w-rig-001            =    w-rig-002
                     go to sca-fil-rap-400.
       sca-fil-rap-190.
      *              *-------------------------------------------------*
      *              * Lettura, con lock, del record [dcc]             *
      *              *-------------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-rig-cod-cli        to   rf-dcc-cod-cli         .
           move      w-rig-dpz-cli        to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to sca-fil-rap-250.
       sca-fil-rap-200.
      *              *-------------------------------------------------*
      *              * Se record cliente non esistente                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Riciclo a rilettura riga da file relative   *
      *                  * di supporto                                 *
      *                  *---------------------------------------------*
           go to     sca-fil-rap-100.
       sca-fil-rap-250.
      *              *-------------------------------------------------*
      *              * Se record cliente esistente                     *
      *              *-------------------------------------------------*
       sca-fil-rap-300.
      *                      *-----------------------------------------*
      *                      * Data, utente, fase, di ultimo inseri-   *
      *                      * mento o modifica                        *
      *                      *-----------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   rf-dcc-ide-dat         .
           move      s-ute                to   rf-dcc-ide-ute         .
           move      s-fas                to   rf-dcc-ide-fas         .
      *                      *-----------------------------------------*
      *                      * Dati gestiti dal programma              *
      *                      *-----------------------------------------*
           move      w-rig-cod-fop        to   rf-dcc-cod-fop         .
           move      w-rig-cod-abi        to   rf-dcc-cod-abi         .
           move      w-rig-cod-cab        to   rf-dcc-cod-cab         .
           move      w-rig-ccc-app        to   rf-dcc-ccc-app         .
           move      w-rig-add-spi        to   rf-dcc-add-spi         .
           move      w-rig-add-spb        to   rf-dcc-add-spb         .
           move      w-rig-tip-esm        to   rf-dcc-tip-esm         .
           move      w-rig-ggg-alt        to   rf-dcc-ggg-alt         .
           move      w-rig-mmm-e01        to   rf-dcc-mmm-e01         .
           move      w-rig-mmm-e02        to   rf-dcc-mmm-e02         .
           move      w-rig-nos-ban        to   rf-dcc-nos-ban         .
           move      w-rig-nos-bpe        to   rf-dcc-nos-bpe         .
           move      w-rig-nos-ccp        to   rf-dcc-nos-ccp         .
       sca-fil-rap-350.
      *                  *---------------------------------------------*
      *                  * Update record                               *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * Unlock record                               *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
       sca-fil-rap-400.
      *                  *---------------------------------------------*
      *                  * Riciclo a rilettura riga da file relative   *
      *                  * di supporto                                 *
      *                  *---------------------------------------------*
           go to     sca-fil-rap-100.
       sca-fil-rap-900.
      *              *-------------------------------------------------*
      *              * Eliminazione messaggio di aggiornamento in ese- *
      *              * cuzione                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       sca-fil-rap-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione scaricamento da file relative di appoggio      *
      *    *                                                           *
      *    * Subroutine di generazione set                             *
      *    *-----------------------------------------------------------*
       sca-fil-rap-set-000.
      *              *-------------------------------------------------*
      *              * Utente di sistema da segreteria                 *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Update                                          *
      *              *-------------------------------------------------*
           move      "UP"                 to   w-mod-set-tip-ope      .
           move      s-ute                to   w-mod-set-ide-ute      .
           move      i-ide-fas            to   w-mod-set-ide-fas      .
           move      i-ide-des            to   w-mod-set-ide-des      .
           move      01                   to   w-mod-set-tip-arc      .
           move      w-rig-cod-cli        to   w-mod-set-cod-arc      .
           move      w-rig-dpz-cli        to   w-mod-set-alf-arc      .
           move      spaces               to   w-mod-set-dat-ac1      .
           move      spaces               to   w-mod-set-dat-ac2      .
           move      spaces               to   w-mod-set-dat-ac3      .
           perform   mdl-gen-set-cll-000  thru mdl-gen-set-cll-999    .
       sca-fil-rap-set-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     sca-fil-rap-set-999.
       sca-fil-rap-set-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [zfp]                            *
      *    *-----------------------------------------------------------*
       let-arc-zfp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zfp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-zfp-cod    =    zero
                     go to let-arc-zfp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFOP    "         to   f-key                  .
           move      w-let-arc-zfp-cod    to   rf-zfp-cod-fop         .
           move      "pgm/dcc/fls/ioc/obj/iofzfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zfp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zfp-400.
       let-arc-zfp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zfp-des-fop       to   w-let-arc-zfp-des      .
           move      rf-zfp-cod-mne       to   w-let-arc-zfp-mne      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zfp-999.
       let-arc-zfp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zfp-flg      .
           move      all   "."            to   w-let-arc-zfp-des      .
           go to     let-arc-zfp-600.
       let-arc-zfp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zfp-des      .
       let-arc-zfp-600.
           move      spaces               to   w-let-arc-zfp-mne      .
       let-arc-zfp-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [zin]                            *
      *    *-----------------------------------------------------------*
       let-arc-zin-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zin-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spaces                         *
      *              *-------------------------------------------------*
           if        w-let-arc-zin-cod    =    spaces
                     go to let-arc-zin-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODSPI    "         to   f-key                  .
           move      w-let-arc-zin-cod    to   rf-zin-cod-spi         .
           move      zero                 to   rf-zin-tip-pag         .
           move      "pgm/dcc/fls/ioc/obj/iofzin"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zin                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zin-400.
       let-arc-zin-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zin-des-spi       to   w-let-arc-zin-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zin-999.
       let-arc-zin-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zin-flg      .
           move      all   "."            to   w-let-arc-zin-des      .
           go to     let-arc-zin-999.
       let-arc-zin-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zin-des      .
       let-arc-zin-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [zbo]                            *
      *    *-----------------------------------------------------------*
       let-arc-zbo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zbo-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spaces                         *
      *              *-------------------------------------------------*
           if        w-let-arc-zbo-cod    =    spaces
                     go to let-arc-zbo-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODSPB    "         to   f-key                  .
           move      w-let-arc-zbo-cod    to   rf-zbo-cod-spb         .
           move      zero                 to   rf-zbo-tip-pag         .
           move      "pgm/dcc/fls/ioc/obj/iofzbo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zbo                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zbo-400.
       let-arc-zbo-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zbo-des-spb       to   w-let-arc-zbo-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zbo-999.
       let-arc-zbo-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zbo-flg      .
           move      all   "."            to   w-let-arc-zbo-des      .
           go to     let-arc-zbo-999.
       let-arc-zbo-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zbo-des      .
       let-arc-zbo-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [axi]                         *
      *    *-----------------------------------------------------------*
       let-arc-axi-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axi-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice istituto a zero                  *
      *              *-------------------------------------------------*
           if        w-let-arc-axi-cod    =    zero
                     go to let-arc-axi-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODABI"             to   f-key                  .
           move      w-let-arc-axi-cod    to   rf-axi-cod-abi         .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-axi-400.
       let-arc-axi-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-axi-den-abi       to   w-let-arc-axi-den      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-axi-999.
       let-arc-axi-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-axi-flg      .
           move      all   "."            to   w-let-arc-axi-den      .
           go to     let-arc-axi-999.
       let-arc-axi-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axi-den      .
       let-arc-axi-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [axs]                         *
      *    *-----------------------------------------------------------*
       let-arc-axs-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axs-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice banca a zero                     *
      *              *-------------------------------------------------*
           if        w-let-arc-axs-abi    =    zero
                     go to let-arc-axs-500.
      *              *-------------------------------------------------*
      *              * Test se codice agenzia a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-axs-cab    =    zero
                     go to let-arc-axs-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "ABICAB    "         to   f-key                  .
           move      w-let-arc-axs-abi    to   rf-axs-cod-abi         .
           move      w-let-arc-axs-cab    to   rf-axs-cod-cab         .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-axs-400.
       let-arc-axs-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-axs-den-spt       to   w-let-arc-axs-den      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-axs-999.
       let-arc-axs-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-axs-flg      .
           move      all   "."            to   w-let-arc-axs-den      .
           go to     let-arc-axs-999.
       let-arc-axs-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axs-den      .
       let-arc-axs-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [cbp]                         *
      *    *-----------------------------------------------------------*
       let-arc-cbp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cbp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spaces                         *
      *              *-------------------------------------------------*
           if        w-let-arc-cbp-cod    =    spaces
                     go to let-arc-cbp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCBP    "         to   f-key                  .
           move      w-let-arc-cbp-tip    to   rf-cbp-tip-cbp         .
           move      w-let-arc-cbp-cod    to   rf-cbp-cod-cbp         .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-cbp-400.
       let-arc-cbp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-cbp-des-cbp       to   w-let-arc-cbp-des      .
           move      rf-cbp-stc-csc       to   w-let-arc-cbp-csc      .
           move      rf-cbp-stc-csa       to   w-let-arc-cbp-csa      .
           move      rf-cbp-abi-ban       to   w-let-arc-cbp-abi      .
           move      rf-cbp-cab-ban       to   w-let-arc-cbp-cab      .
           move      rf-cbp-sgl-ccb       to   w-let-arc-cbp-ccb      .
           move      rf-cbp-stc-cco       to   w-let-arc-cbp-cco      .
           move      rf-cbp-stc-bba       to   w-let-arc-cbp-bba      .
           move      rf-cbp-stc-bbp       to   w-let-arc-cbp-bbp      .
           move      rf-cbp-stc-psm       to   w-let-arc-cbp-psm      .
           move      rf-cbp-stc-psi       to   w-let-arc-cbp-psi      .
           move      rf-cbp-stc-pdi       to   w-let-arc-cbp-pdi      .
           move      rf-cbp-stc-psc       to   w-let-arc-cbp-psc      .
           move      rf-cbp-stc-anv       to   w-let-arc-cbp-anv      .
           move      rf-cbp-stc-dfp       to   w-let-arc-cbp-dfp      .
           move      rf-cbp-stc-dfa       to   w-let-arc-cbp-dfa      .
           move      rf-cbp-stc-onb       to   w-let-arc-cbp-onb      .
           move      rf-cbp-stc-inb       to   w-let-arc-cbp-inb      .
           move      rf-cbp-sgl-ccp       to   w-let-arc-cbp-ccp      .
           move      rf-cbp-stc-bpa       to   w-let-arc-cbp-bpa      .
           move      rf-cbp-stc-bpp       to   w-let-arc-cbp-bpp      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-cbp-999.
       let-arc-cbp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-cbp-flg      .
           move      all   "."            to   w-let-arc-cbp-des      .
           go to     let-arc-cbp-600.
       let-arc-cbp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cbp-des      .
       let-arc-cbp-600.
           move      zero                 to   w-let-arc-cbp-csc      .
           move      zero                 to   w-let-arc-cbp-csa      .
           move      zero                 to   w-let-arc-cbp-abi      .
           move      zero                 to   w-let-arc-cbp-cab      .
           move      spaces               to   w-let-arc-cbp-ccb      .
           move      zero                 to   w-let-arc-cbp-cco      .
           move      zero                 to   w-let-arc-cbp-bba      .
           move      zero                 to   w-let-arc-cbp-bbp      .
           move      zero                 to   w-let-arc-cbp-psm      .
           move      zero                 to   w-let-arc-cbp-psi      .
           move      zero                 to   w-let-arc-cbp-pdi      .
           move      zero                 to   w-let-arc-cbp-psc      .
           move      zero                 to   w-let-arc-cbp-anv      .
           move      zero                 to   w-let-arc-cbp-dfp      .
           move      zero                 to   w-let-arc-cbp-dfa      .
           move      zero                 to   w-let-arc-cbp-onb      .
           move      zero                 to   w-let-arc-cbp-inb      .
           move      spaces               to   w-let-arc-cbp-ccp      .
           move      zero                 to   w-let-arc-cbp-bpa      .
           move      zero                 to   w-let-arc-cbp-bpp      .
       let-arc-cbp-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand anagrafica commerciale cliente in riga *
      *    *-----------------------------------------------------------*
       rou-exp-ana-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Video in 'OFF'                                  *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Determinazione numero linea assoluta a video    *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrg-dav    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001
                                        giving w-cnt-wrk-ctr-003
                                     remainder w-cnt-wrk-ctr-002      .
           multiply  w-lin-num-lin-prc    by   w-cnt-wrk-ctr-002      .
           add       w-lin-pri-lin-vid    to   w-cnt-wrk-ctr-002      .
       rou-exp-ana-100.
      *              *-------------------------------------------------*
      *              * Costruzione box di Expand                       *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           subtract  1                    from v-lin                  .
           move      15                   to   v-pos                  .
           move      w-cnt-wrk-ctr-002    to   v-lto                  .
           add       04                   to   v-lto                  .
           move      58                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       rou-exp-ana-200.
      *              *-------------------------------------------------*
      *              * Lettura dati per Expand                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Anagrafica commerciale cliente              *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI"             to   f-key                  .
           move      w-rou-exp-ana-cod    to   rf-dcc-cod-cli         .
           move      w-rou-exp-ana-dpz    to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
           if        f-sts                not  = e-not-err
                     move  all "."        to   rf-dcc-rag-soc
                     move  all "."        to   rf-dcc-via-dcc
                     move  all "."        to   rf-dcc-loc-dcc         .
      *                  *---------------------------------------------*
      *                  * Anagrafica contabile cliente                *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI"             to   f-key                  .
           move      w-rou-exp-ana-cod    to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
           if        f-sts                not  = e-not-err
                     move  all "."        to   rf-cli-cod-mne         .
       rou-exp-ana-300.
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts per Expand              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Prompt per Partita Iva                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           add       03                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      "P.I.:"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Prompt per Mnemonico                        *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           add       03                   to   v-lin                  .
           move      37                   to   v-pos                  .
           move      "Mnem.:"             to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       rou-exp-ana-400.
      *              *-------------------------------------------------*
      *              * Visualizzazione dati per Expand                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione Ragione sociale             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      17                   to   v-pos                  .
           move      rf-dcc-rag-soc       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione Indirizzo                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           add       01                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      rf-dcc-via-dcc       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione localita'                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           add       02                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      rf-dcc-loc-dcc       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione Partita Iva                 *
      *                  *---------------------------------------------*
           if        rf-cli-prt-iva       =    zero
                     go to rou-exp-ana-420.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9"                  to   v-edm                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           add       03                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      rf-cli-prt-iva       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       rou-exp-ana-420.
      *                  *---------------------------------------------*
      *                  * Visualizzazione codice mnemonico            *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           add       03                   to   v-lin                  .
           move      44                   to   v-pos                  .
           move      rf-cli-cod-mne       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       rou-exp-ana-900.
      *              *-------------------------------------------------*
      *              * Video in 'ON'                                   *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione di un carattere per presa visione  *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           add       03                   to   v-lin                  .
           move      56                   to   v-pos                  .
           move      "EXIT"               to   v-pfk (1)              .
           move      "DO  "               to   v-pfk (2)              .
           move      "DOWN"               to   v-pfk (3)              .
           move      "UP  "               to   v-pfk (4)              .
           move      "EXPD"               to   v-pfk (5)              .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      spaces               to   v-key                  .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       rou-exp-ana-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Box per superamento massimo righe caricabili              *
      *    *-----------------------------------------------------------*
       box-err-rig-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Costruzione box di dialogo                      *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      15                   to   v-pos                  .
           move      17                   to   v-lto                  .
           move      66                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal nel box di dialogo - 1                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      "Il numero di clienti selezionati e' maggiore di"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal nel box di dialogo - 2                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      "quello gestibile dal programma (99999).        "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal nel box di dialogo - 3                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      "Si consiglia di operare una serie di selezioni "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal nel box di dialogo - 4                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      "sul minimo e massimo per poter agire su tutti  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal nel box di dialogo - 5                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      "gli elementi desiderati.                       "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal nel box di dialogo - 6                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal di presa visione                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      32                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "Premere 'OK' per presa visione :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       box-err-rig-800.
      *              *-------------------------------------------------*
      *              * Accettazione campo di conferma                  *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      63                   to   v-pos                  .
           move      spaces               to   v-edm                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           if        v-alf                not  = "OK"
                     go to box-err-rig-800.
       box-err-rig-900.
      *              *-------------------------------------------------*
      *              * Restore video                                   *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       box-err-rig-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per l'accettazione della forma di pagamento   *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmnzfp0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice ABI             *
      *    *-----------------------------------------------------------*
           copy      "pgm/abi/prg/cpy/acmnabi0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice CAB             *
      *    *-----------------------------------------------------------*
           copy      "pgm/abi/prg/cpy/acmncab0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice nostra cassa, o *
      *    * nostra banca, o nostro c/c postale                        *
      *    *-----------------------------------------------------------*
           copy      "pgm/gep/prg/cpy/acdecbp0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione categoria spesa incasso    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acodzin0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione categoria spesa bollo      *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acodzbo0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione codice cliente commerciale *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmndcc0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per modulo modulo generazione set             *
      *    *-----------------------------------------------------------*
           copy      "pgm/svf/prg/cpy/msetsvf0.mds"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

      *    *===========================================================*
      *    * Richiamo sottoprogramma per gestione catena righe         *
      *    *-----------------------------------------------------------*
       cll-rlt-sup-000.
           call      "pgm/dcc/prg/obj/pdcc4502"
                                         using w-rlt-sup              .
       cll-rlt-sup-999.
           exit.

      *    *===========================================================*
      *    * Cancellazione sottoprogramma per gestione catena righe    *
      *    *-----------------------------------------------------------*
       cnc-rlt-sup-000.
           cancel    "pgm/dcc/prg/obj/pdcc4502"                       .
       cnc-rlt-sup-999.
           exit.

