       Identification Division.
       Program-Id.                                 pdcc340d           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    dcp                 *
      *                                Settore:    lst                 *
      *                                   Fase:    dcc340              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 17/02/05    *
      *                       Ultima revisione:    NdK del 07/06/22    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Stampe prezzi netti concordati              *
      *                                                                *
      *                    Sottoprogramma per la stampa di controllo   *
      *                    netti concordati rispetto a listino         *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "dcp"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "lst"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "dcc340"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pdcc340d"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "STAMPA CONTROLLO PREZZI NETTI CONCORDATI"       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "msegrt" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mpslct" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/r"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine sel-prm-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-sel-prm-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste per programma di esecuzione       *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico                       *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No richiesta di selezione stampa               *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area per preparazione parametri selezione stampa      *
      *        *-------------------------------------------------------*
           05  w-cnt-stp.
               10  w-cnt-stp-tip-sel      pic  x(10)                  .
               10  w-cnt-stp-cod-stp      pic  x(08)                  .
               10  w-cnt-stp-tip-sta      pic  x(01)                  .
               10  w-cnt-stp-cod-mod      pic  x(08)                  .
               10  w-cnt-stp-tip-mod      pic  x(01)                  .
               10  w-cnt-stp-amp-lin      pic  9(03)                  .
               10  w-cnt-stp-top-lin      pic  9(04)                  .
               10  w-cnt-stp-lin-min      pic  9(02)                  .
               10  w-cnt-stp-bot-lin      pic  9(04)                  .
               10  w-cnt-stp-amp-car      pic  9(02)v9(02)            .
               10  w-cnt-stp-alt-int      pic  9(02)v9(02)            .
               10  w-cnt-stp-esp-fut      pic  x(99)                  .
               10  w-cnt-stp-fnz-spc      pic  x(99)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring record richieste             *
      *        *-------------------------------------------------------*
           05  w-stu-rrr.
               10  w-stu-rrr-pnt-stu      pic  9(05)                  .
               10  w-stu-rrr-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-stu-rrr-sav-pnt      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records files                                             *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [zvl]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfzvl"                          .
      *        *-------------------------------------------------------*
      *        * [zos]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/azi/fls/rec/rfzos"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [zp1]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp1"                          .
      *        *-------------------------------------------------------*
      *        * [zp2]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp2"                          .
      *        *-------------------------------------------------------*
      *        * [zp3]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp3"                          .
      *        *-------------------------------------------------------*
      *        * [zls]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzls"                          .
      *        *-------------------------------------------------------*
      *        * [lst]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rflst"                          .

      *    *===========================================================*
      *    * Work-area richieste                                       *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Filtro di selezione                                   *
      *        *-------------------------------------------------------*
           05  rr-fso-dcp                 pic  9(08)                  .
           05  rr-fso-dcp-alf redefines
               rr-fso-dcp                 pic  x(08)                  .
           05  rr-fso-dcp-des             pic  x(40)                  .
           05  rr-fso-dcp-ord             pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Si/no salto pagina                                    *
      *        *-------------------------------------------------------*
           05  rr-tip-slp                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Listino di riferimento                                *
      *        *-------------------------------------------------------*
           05  rr-cod-lst                 pic  x(03)                  .
           05  rr-cod-lst-des             pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Date per la selezione                                 *
      *        *-------------------------------------------------------*
           05  rr-dat-min                 pic  9(07)                  .
           05  rr-dat-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente                                        *
      *        *-------------------------------------------------------*
           05  rr-cod-cli                 pic  9(07)                  .
           05  rr-cod-cli-rag             pic  x(40)                  .
           05  rr-cod-cli-vlt             pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Selezioni su prezzi                                   *
      *        *-------------------------------------------------------*
           05  rr-snx-pze                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Selezioni su validita' prezzi                         *
      *        *-------------------------------------------------------*
           05  rr-sel-vld                 pic  9(02)                  .

      *    *===========================================================*
      *    * Link-area per accettazione codice listino                 *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acodzls0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice cliente commerciale     *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmndcc0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice valuta                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acodzvl0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice filtro selezione e or-  *
      *    * dinamento per file [dcp]                                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/azosdcp0.acl"                   .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [cli]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-cli.
               10  w-let-arc-cli-flg      pic  x(01)                  .
               10  w-let-arc-cli-cod      pic  9(07)                  .
               10  w-let-arc-cli-rag      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcc.
               10  w-let-arc-dcc-flg      pic  x(01)                  .
               10  w-let-arc-dcc-cli      pic  9(07)                  .
               10  w-let-arc-dcc-dpz      pic  x(04)                  .
               10  w-let-arc-dcc-rag      pic  x(40)                  .
               10  w-let-arc-dcc-vlt      pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zvl]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zvl.
               10  w-let-arc-zvl-flg      pic  x(01)                  .
               10  w-let-arc-zvl-cod      pic  x(03)                  .
               10  w-let-arc-zvl-des      pic  x(20)                  .
               10  w-let-arc-zvl-din      pic  x(20)                  .
               10  w-let-arc-zvl-dec      pic  9(01)                  .
               10  w-let-arc-zvl-tdc      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zp1]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zp1.
               10  w-let-arc-zp1-flg      pic  x(01)                  .
               10  w-let-arc-zp1-cla      pic  9(05)                  .
               10  w-let-arc-zp1-des      pic  x(40)                  .
               10  w-let-arc-zp1-mne      pic  x(05)                  .
               10  w-let-arc-zp1-sud      pic  9(02)                  .
               10  w-let-arc-zp1-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zp2]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zp2.
               10  w-let-arc-zp2-flg      pic  x(01)                  .
               10  w-let-arc-zp2-cla      pic  9(05)                  .
               10  w-let-arc-zp2-gru      pic  9(05)                  .
               10  w-let-arc-zp2-des      pic  x(40)                  .
               10  w-let-arc-zp2-mne      pic  x(05)                  .
               10  w-let-arc-zp2-sud      pic  9(02)                  .
               10  w-let-arc-zp2-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zp3]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zp3.
               10  w-let-arc-zp3-flg      pic  x(01)                  .
               10  w-let-arc-zp3-cla      pic  9(05)                  .
               10  w-let-arc-zp3-gru      pic  9(05)                  .
               10  w-let-arc-zp3-sgr      pic  9(05)                  .
               10  w-let-arc-zp3-des      pic  x(40)                  .
               10  w-let-arc-zp3-mne      pic  x(05)                  .
               10  w-let-arc-zp3-sud      pic  9(02)                  .
               10  w-let-arc-zp3-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [lst]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-lst.
               10  w-let-arc-lst-flg      pic  x(01)                  .
               10  w-let-arc-lst-tip      pic  9(02)                  .
               10  w-let-arc-lst-cod      pic  x(03)                  .
               10  w-let-arc-lst-cli      pic  9(07)                  .
               10  w-let-arc-lst-vlt      pic  x(03)                  .
               10  w-let-arc-lst-pro      pic  9(07)                  .
               10  w-let-arc-lst-prz      pic  9(09)v9(02)            .
               10  w-let-arc-lst-sco occurs 05 
                                          pic  9(02)v9(01)            .
               10  w-let-arc-lst-pvg occurs 03 
                                          pic  9(02)v9(01)            .
               10  w-let-arc-lst-ini      pic  9(07)                  .
               10  w-let-arc-lst-fin      pic  9(07)                  .
               10  w-let-arc-lst-tfu      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zls]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zls.
               10  w-let-arc-zls-flg      pic  x(01)                  .
               10  w-let-arc-zls-cod      pic  x(03)                  .
               10  w-let-arc-zls-des      pic  x(20)                  .
               10  w-let-arc-zls-vlt      pic  x(03)                  .
              
      *    *===========================================================*
      *    * Work per Let su archivio [zos] per [dcp]                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/lzosdcp0.ltw"                   .
              
      *    *===========================================================*
      *    * Area di comunicazione per determinazione prezzo di vendi- *
      *    * ta                                                        *
      *    *-----------------------------------------------------------*
           copy      "pgm/fat/prg/cpy/dprzven0.dtl"                   .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo salto pagina                          *
      *        *-------------------------------------------------------*
           05  w-exp-tip-slp.
               10  w-exp-tip-slp-num      pic  9(02)       value 4    .
               10  w-exp-tip-slp-lun      pic  9(02)       value 20   .
               10  w-exp-tip-slp-tbl.
                   15  filler             pic  x(20) value
                            "No                  "                    .
                   15  filler             pic  x(20) value
                            "ad ogni Classe      "                    .
                   15  filler             pic  x(20) value
                            "ad ogni Gruppo      "                    .
                   15  filler             pic  x(20) value
                            "ad ogni Sottogruppo "                    .
      *        *-------------------------------------------------------*
      *        * Work per : Si/no stampa prezzi a zero                 *
      *        *-------------------------------------------------------*
           05  w-exp-snx-pze.
               10  w-exp-snx-pze-num      pic  9(02)       value 2    .
               10  w-exp-snx-pze-lun      pic  9(02)       value 30   .
               10  w-exp-snx-pze-tbl.
                   15  filler             pic  x(30) value
                            "Nessuna                       "          .
                   15  filler             pic  x(30) value
                            "solo prezzi Variati           "          .
      *        *-------------------------------------------------------*
      *        * Work per : Selezione su validita'                     *
      *        *-------------------------------------------------------*
           05  w-exp-sel-vld.
               10  w-exp-sel-vld-num      pic  9(02)       value 3    .
               10  w-exp-sel-vld-lun      pic  9(02)       value 30   .
               10  w-exp-sel-vld-tbl.
                   15  filler             pic  x(30) value
                            "Tutti i prezzi                "          .
                   15  filler             pic  x(30) value
                            "solo quelli in Vigore         "          .
                   15  filler             pic  x(30) value
                            "solo quelli Scaduti           "          .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per determinazione prezzi di listino             *
      *        *-------------------------------------------------------*
           05  w-det-prz-lst.
      *            *---------------------------------------------------*
      *            * Prezzo netto concordato                           *
      *            *---------------------------------------------------*
               10  w-det-prz-lst-prn      pic  9(09)                  .
      *            *---------------------------------------------------*
      *            * Prezzo 1                                          *
      *            *---------------------------------------------------*
               10  w-det-prz-lst-pr1      pic  9(09)                  .
      *            *---------------------------------------------------*
      *            * Prezzo 2                                          *
      *            *---------------------------------------------------*
               10  w-det-prz-lst-pr2      pic  9(09)                  .

      *    *===========================================================*
      *    * Work area per gestione classe, gruppo e sottogruppo       *
      *    *-----------------------------------------------------------*
       01  w-cgs.
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori generici                   *
      *        *-------------------------------------------------------*
           05  w-cgs-gen.
      *            *---------------------------------------------------*
      *            * Flag di prima intestazione pagina da eseguire     *
      *            *---------------------------------------------------*
               10  w-cgs-gen-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori classe                     *
      *        *-------------------------------------------------------*
           05  w-cgs-cla.
      *            *---------------------------------------------------*
      *            * Si/No intestazione ad inizio classe               *
      *            *---------------------------------------------------*
               10  w-cgs-cla-int          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice classe                                     *
      *            *---------------------------------------------------*
               10  w-cgs-cla-cod          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Mnemonico classe                                  *
      *            *---------------------------------------------------*
               10  w-cgs-cla-mne          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di sequenza classe                         *
      *            *---------------------------------------------------*
               10  w-cgs-cla-sqz          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione classe                                *
      *            *---------------------------------------------------*
               10  w-cgs-cla-des          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Segnale di classe ulteriormente suddivisa         *
      *            *---------------------------------------------------*
               10  w-cgs-cla-sud          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Flag di intestazione gia' eseguita                *
      *            *---------------------------------------------------*
               10  w-cgs-cla-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori gruppo                     *
      *        *-------------------------------------------------------*
           05  w-cgs-gru.
      *            *---------------------------------------------------*
      *            * Si/No intestazione ad inizio gruppo               *
      *            *---------------------------------------------------*
               10  w-cgs-gru-int          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice gruppo                                     *
      *            *---------------------------------------------------*
               10  w-cgs-gru-cod          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Mnemonico gruppo                                  *
      *            *---------------------------------------------------*
               10  w-cgs-gru-mne          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di sequenza gruppo                         *
      *            *---------------------------------------------------*
               10  w-cgs-gru-sqz          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione gruppo                                *
      *            *---------------------------------------------------*
               10  w-cgs-gru-des          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Segnale di gruppo ulteriormente suddiviso         *
      *            *---------------------------------------------------*
               10  w-cgs-gru-sud          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Flag di intestazione gia' eseguita                *
      *            *---------------------------------------------------*
               10  w-cgs-gru-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori sottogruppo                *
      *        *-------------------------------------------------------*
           05  w-cgs-sgr.
      *            *---------------------------------------------------*
      *            * Si/No intestazione ad inizio sottogruppo          *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-int          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice sottogruppo                                *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-cod          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Mnemonico sottogruppo                             *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-mne          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di sequenza sottogruppo                    *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-sqz          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione sottogruppo                           *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-des          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Flag di intestazione gia' eseguita                *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori dettaglio                  *
      *        *-------------------------------------------------------*
           05  w-cgs-det.
      *            *---------------------------------------------------*
      *            * Numero di linee effettive impegnate dalla finca-  *
      *            * tura per il dettaglio e la sottolineatura         *
      *            *---------------------------------------------------*
               10  w-cgs-det-idf          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Per work                                              *
      *        *-------------------------------------------------------*
           05  w-cgs-wrk.
               10  w-cgs-wrk-nln          pic  9(02)                  .
               10  w-cgs-wrk-inx          pic  9(03)                  .
               10  w-cgs-wrk-pnt          pic  9(03)                  .
               10  w-cgs-wrk-car          pic  9(03)                  .
               10  w-cgs-wrk-pos          pic  9(03)                  .
               10  w-cgs-wrk-pfn          pic  9(03)                  .
               10  w-cgs-wrk-des          pic  x(40)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/werrbox0.cpw"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  w-rot-l03-cod-cla      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  w-rot-l02-cod-gru      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  w-rot-l01-cod-sgr      pic  9(05)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-800.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-800.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento programma       *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Se no richieste : a selezione stampante         *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-350.
       main-250.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-800.
      *                  *---------------------------------------------*
      *                  * Se uscita per 'N'                           *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "N"
                     go to main-250.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-350.
      *              *-------------------------------------------------*
      *              * Se no stampa : ad esecuzione                    *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to main-450.
      *              *-------------------------------------------------*
      *              * Preparazione defaults per parametri di selezio- *
      *              * ne stampa                                       *
      *              *-------------------------------------------------*
           perform   pre-prm-stp-000      thru pre-prm-stp-999        .
      *              *-------------------------------------------------*
      *              * Selezione parametri stampa                      *
      *              *-------------------------------------------------*
           perform   sel-prm-stp-000      thru sel-prm-stp-999        .
      *                  *---------------------------------------------*
      *                  * Test se uscita                              *
      *                  *---------------------------------------------*
           if        w-cnt-sel-prm-stp    not  = spaces
                     go to main-800.
       main-450.
      *              *-------------------------------------------------*
      *              * Esecuzione in foreground                        *
      *              *-------------------------------------------------*
           perform   exe-pgm-frg-000      thru exe-pgm-frg-999        .
      *              *-------------------------------------------------*
      *              * Test se tipo esecuzione ciclico                 *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S" or
                     w-cnt-fun-snx-cic    not  = "S"
                     go to main-800
           else      go to main-250.
       main-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Programma di esecuzione in foreground                     *
      *    *-----------------------------------------------------------*
       exe-pgm-frg-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione rullino messaggi di foreground *
      *              *-------------------------------------------------*
           move      "OF"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Se errore : uscita                          *
      *                  *---------------------------------------------*
            if       m-rsc                not  = spaces
                     go to exe-pgm-frg-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-pgm-frg-300.
      *              *-------------------------------------------------*
      *              * Esecuzione del programma                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura parametri di selezione stampa       *
      *                  *---------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to exe-pgm-frg-999.
      *                  *---------------------------------------------*
      *                  * Esecuzione eventuale sort preliminare       *
      *                  *---------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se sort eseguito       *
      *                  *---------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to exe-pgm-frg-400
           else      go to exe-pgm-frg-500.
       exe-pgm-frg-400.
      *                  *---------------------------------------------*
      *                  * Se sort non eseguito                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ciclo di report-program                 *
      *                      *-----------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     exe-pgm-frg-600.
       exe-pgm-frg-500.
      *                  *---------------------------------------------*
      *                  * Se sort eseguito                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     exe-pgm-frg-600.
       exe-pgm-frg-600.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo stampa                 *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       exe-pgm-frg-900.
      *                  *---------------------------------------------*
      *                  * Visual. eventuali errori di esecuzione      *
      *                  *---------------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "F"                  to   b-tfe                  .
           move      i-ide-des            to   b-chr                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
           cancel    "swd/mod/prg/obj/mbckgv"                         .
       exe-pgm-frg-999.
           exit.

      *    *===========================================================*
      *    *  Selezione parametri stampa                               *
      *    *-----------------------------------------------------------*
       sel-prm-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sel-prm-stp      .
      *              *-------------------------------------------------*
      *              * Test se selezione stampa da eseguire            *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to sel-prm-stp-999.
      *              *-------------------------------------------------*
      *              * Preparazione parametri per richiamo selezione   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Informazioni generali da segreteria         *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Codice azienda                          *
      *                      *-----------------------------------------*
           move      s-azi                to   r-env-cod-azi          .
      *                      *-----------------------------------------*
      *                      * Codice terminale                        *
      *                      *-----------------------------------------*
           move      s-ter                to   r-env-cod-ter          .
      *                      *-----------------------------------------*
      *                      * Codice utente                           *
      *                      *-----------------------------------------*
           move      s-ute                to   r-env-cod-ute          .
      *                      *-----------------------------------------*
      *                      * Date and time da segreteria             *
      *                      *-----------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Date and time                           *
      *                      *-----------------------------------------*
           move      s-sdt                to   r-env-dat-tim          .
      *                  *---------------------------------------------*
      *                  * Informazioni da identificazione programma   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Sistema applicativo                     *
      *                      *-----------------------------------------*
           move      i-ide-sap            to   r-ide-sis-app          .
      *                      *-----------------------------------------*
      *                      * Area gestionale                         *
      *                      *-----------------------------------------*
           move      i-ide-arg            to   r-ide-are-ges          .
      *                      *-----------------------------------------*
      *                      * Settore gestionale                      *
      *                      *-----------------------------------------*
           move      i-ide-set            to   r-ide-set-ges          .
      *                      *-----------------------------------------*
      *                      * Fase gestionale                         *
      *                      *-----------------------------------------*
           move      i-ide-fas            to   r-ide-fas-ges          .
      *                  *---------------------------------------------*
      *                  * Informazioni da preparazione param. stampa  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flags di tipo selezione                 *
      *                      *-----------------------------------------*
           move      w-cnt-stp-tip-sel    to   r-fix-tip-sel          .
      *                      *-----------------------------------------*
      *                      * Codice stampante                        *
      *                      *-----------------------------------------*
           move      w-cnt-stp-cod-stp    to   r-fix-cod-stp          .
      *                      *-----------------------------------------*
      *                      * Tipo di stampa                          *
      *                      *-----------------------------------------*
           move      w-cnt-stp-tip-sta    to   r-fix-tip-sta          .
      *                      *-----------------------------------------*
      *                      * Codice modulo                           *
      *                      *-----------------------------------------*
           move      w-cnt-stp-cod-mod    to   r-fix-cod-mod          .
      *                      *-----------------------------------------*
      *                      * Tipo modulo                             *
      *                      *-----------------------------------------*
           move      w-cnt-stp-tip-mod    to   r-fix-tip-mod          .
      *                      *-----------------------------------------*
      *                      * Ampiezza linea di stampa in caratteri   *
      *                      *-----------------------------------------*
           move      w-cnt-stp-amp-lin    to   r-fix-amp-lin          .
      *                      *-----------------------------------------*
      *                      * Top margin in linee                     *
      *                      *-----------------------------------------*
           move      w-cnt-stp-top-lin    to   r-fix-top-lin          .
      *                      *-----------------------------------------*
      *                      * Numero linee di stampa minimo           *
      *                      *-----------------------------------------*
           move      w-cnt-stp-lin-min    to   r-fix-lin-min          .
      *                      *-----------------------------------------*
      *                      * Bottom margin in linee                  *
      *                      *-----------------------------------------*
           move      w-cnt-stp-bot-lin    to   r-fix-bot-lin          .
      *                      *-----------------------------------------*
      *                      * Ampiezza caratteri                      *
      *                      *-----------------------------------------*
           move      w-cnt-stp-amp-car    to   r-fix-amp-car          .
      *                      *-----------------------------------------*
      *                      * Altezza interlinea                      *
      *                      *-----------------------------------------*
           move      w-cnt-stp-alt-int    to   r-fix-alt-int          .
      *                      *-----------------------------------------*
      *                      * Area riservata per espansioni future    *
      *                      *-----------------------------------------*
           move      w-cnt-stp-esp-fut    to   r-fix-esp-fut          .
      *                      *-----------------------------------------*
      *                      * Area riservata per funzioni speciali    *
      *                      *-----------------------------------------*
           move      w-cnt-stp-fnz-spc    to   r-fix-fnz-spc          .
      *              *-------------------------------------------------*
      *              * Richiamo modulo di selezione stampa             *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mpslct"
                                         using r                      .
           cancel    "swd/mod/prg/obj/mpslct"                         .
      *              *-------------------------------------------------*
      *              * Status di uscita                                *
      *              *-------------------------------------------------*
           if        r-rsc                not  = spaces
                     move  "#"            to   w-cnt-sel-prm-stp      .
       sel-prm-stp-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-cnt-tit-des-azi      .
           move      40                   to   w-cnt-tit-ctr-azi      .
       int-pag-std-100.
           if        w-cnt-tit-chr-azi
                    (w-cnt-tit-ctr-azi)   =    spaces
                     if     w-cnt-tit-ctr-azi
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-cnt-tit-ctr-tit      .
       int-pag-std-200.
           if        w-cnt-tit-chr-tit
                    (w-cnt-tit-ctr-tit)   =    spaces
                     if     w-cnt-tit-ctr-tit
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-tit      .
           subtract  w-cnt-tit-ctr-tit    from w-cnt-tit-pos-tit      .
           divide    2                    into w-cnt-tit-pos-tit      .
           add       1                    to   w-cnt-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    =    zero
                     move  4              to   w-cnt-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-cnt-tit-ctr-wrk      .
           inspect   w-cnt-tit-num-pag
                                      tallying w-cnt-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-cnt-tit-ctr-wrk    from 27
                                        giving w-cnt-tit-ctr-dep      .
           subtract  w-cnt-tit-ctr-wrk    from 5
                                        giving w-cnt-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-dep      .
           subtract  w-cnt-tit-ctr-dep    from w-cnt-tit-pos-dep      .
           add       1                    to   w-cnt-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-cnt-tit-ctr-azi    to   w-cnt-tit-ctr-wrk      .
           add       2                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-tit
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      w-cnt-tit-pos-tit    to   w-cnt-tit-ctr-wrk      .
           add       w-cnt-tit-ctr-tit    to   w-cnt-tit-ctr-wrk      .
           add       1                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-dep
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-cnt-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-cnt-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-cnt-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-cnt-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No richieste ad utente                       *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No funzionamento ciclico stampa              *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-cic      .
      *              *-------------------------------------------------*
      *              * Si/No richiesta di selezione stampa             *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [zvl]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzvl"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zvl                 .
      *              *-------------------------------------------------*
      *              * [zos]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofzos"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zos                 .
      *              *-------------------------------------------------*
      *              * [zp1]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
      *              *-------------------------------------------------*
      *              * [zp2]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
      *              *-------------------------------------------------*
      *              * [zp3]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [lst]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice listino         *
      *              *-------------------------------------------------*
           perform   cod-cod-zls-opn-000  thru cod-cod-zls-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice cliente commer- *
      *              * ciale                                           *
      *              *-------------------------------------------------*
           perform   cod-mne-dcc-opn-000  thru cod-mne-dcc-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice valuta          *
      *              *-------------------------------------------------*
           perform   cod-cod-zvl-opn-000  thru cod-cod-zvl-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice filtro ordina-  *
      *              * mento e selezione per file [dcp]                *
      *              *-------------------------------------------------*
           perform   cod-zos-dcp-opn-000  thru cod-zos-dcp-opn-999    .
      *              *-------------------------------------------------*
      *              * Apertura filtro per selezione ed ordinamento    *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione prezzo di vendita *
      *              *-------------------------------------------------*
           perform   det-prz-ven-opn-000  thru det-prz-ven-opn-999    .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [zvl]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzvl"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zvl                 .
      *              *-------------------------------------------------*
      *              * [zos]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofzos"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zos                 .
      *              *-------------------------------------------------*
      *              * [zp1]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
      *              *-------------------------------------------------*
      *              * [zp2]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
      *              *-------------------------------------------------*
      *              * [zp3]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [lst]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice listino        *
      *              *-------------------------------------------------*
           perform   cod-cod-zls-cls-000  thru cod-cod-zls-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice cliente com-   *
      *              * merciale                                        *
      *              *-------------------------------------------------*
           perform   cod-mne-dcc-cls-000  thru cod-mne-dcc-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice valuta         *
      *              *-------------------------------------------------*
           perform   cod-cod-zvl-cls-000  thru cod-cod-zvl-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice filtro ordina- *
      *              * mento e selezione per file [dcp]                *
      *              *-------------------------------------------------*
           perform   cod-zos-dcp-cls-000  thru cod-zos-dcp-cls-999    .
      *              *-------------------------------------------------*
      *              * Filtro per selezione ed ordinamento [dcp]       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Cancel                                      *
      *                  *---------------------------------------------*
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       rou-cls-fls-800.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione prezzo di vendi- *
      *              * ta                                              *
      *              *-------------------------------------------------*
           perform   det-prz-ven-cls-000  thru det-prz-ven-cls-999    .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Abilitazione tasto Do                       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *                  *---------------------------------------------*
      *                  * Filtro di ordinamento e selezione per file  *
      *                  * [dcp]                                       *
      *                  *---------------------------------------------*
           perform   acc-fso-dcp-000      thru acc-fso-dcp-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-200.
      *                  *---------------------------------------------*
      *                  * Tipo salto pagina                           *
      *                  *---------------------------------------------*
           perform   acc-tip-slp-000      thru acc-tip-slp-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-100.
       acc-ric-sel-250.
      *                  *---------------------------------------------*
      *                  * Codice listino                              *
      *                  *---------------------------------------------*
           perform   acc-cod-lst-000      thru acc-cod-lst-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-200.
       acc-ric-sel-300.
      *                  *---------------------------------------------*
      *                  * Data selezione min                          *
      *                  *---------------------------------------------*
           perform   acc-dat-min-000      thru acc-dat-min-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-250.
       acc-ric-sel-350.
      *                  *---------------------------------------------*
      *                  * Data selezione max                          *
      *                  *---------------------------------------------*
           perform   acc-dat-max-000      thru acc-dat-max-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-300.
       acc-ric-sel-400.
      *                  *---------------------------------------------*
      *                  * Codice cliente                              *
      *                  *---------------------------------------------*
           perform   acc-cod-cli-000      thru acc-cod-cli-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-350.
       acc-ric-sel-450.
      *                  *---------------------------------------------*
      *                  * Si/no stampa prezzi a zero                  *
      *                  *---------------------------------------------*
           perform   acc-snx-pze-000      thru acc-snx-pze-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-400.
       acc-ric-sel-500.
      *                  *---------------------------------------------*
      *                  * Selezione su validita'                      *
      *                  *---------------------------------------------*
           perform   acc-sel-vld-000      thru acc-sel-vld-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-450.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#CNF"               to   v-not                  .
           move      "S"                  to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Codice filtro ordinamento e selezione per file  *
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           perform   pmt-fso-dcp-000      thru pmt-fso-dcp-999        .
      *              *-------------------------------------------------*
      *              * Tipo salto pagina                               *
      *              *-------------------------------------------------*
           perform   pmt-tip-slp-000      thru pmt-tip-slp-999        .
      *              *-------------------------------------------------*
      *              * Codice listino                                  *
      *              *-------------------------------------------------*
           perform   pmt-cod-lst-000      thru pmt-cod-lst-999        .
      *              *-------------------------------------------------*
      *              * Data selezione min                              *
      *              *-------------------------------------------------*
           perform   pmt-dat-min-000      thru pmt-dat-min-999        .
      *              *-------------------------------------------------*
      *              * Data selezione max                              *
      *              *-------------------------------------------------*
           perform   pmt-dat-max-000      thru pmt-dat-max-999        .
      *              *-------------------------------------------------*
      *              * Codice cliente                                  *
      *              *-------------------------------------------------*
           perform   pmt-cod-cli-000      thru pmt-cod-cli-999        .
      *              *-------------------------------------------------*
      *              * Si/no stampa prezzi a zero                      *
      *              *-------------------------------------------------*
           perform   pmt-snx-pze-000      thru pmt-snx-pze-999        .
      *              *-------------------------------------------------*
      *              * Selezione su validita'                          *
      *              *-------------------------------------------------*
           perform   pmt-sel-vld-000      thru pmt-sel-vld-999        .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Codice filtro ordinamento e selezione per file   *
      *    *          [dcp]                                            *
      *    *-----------------------------------------------------------*
       pmt-fso-dcp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice filtro di selezione :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "       anagrafica prodotti  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-fso-dcp-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Tipo salto pagina                                *
      *    *-----------------------------------------------------------*
       pmt-tip-slp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Salto pagina da effettuare :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-tip-slp-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Codice listino                                   *
      *    *-----------------------------------------------------------*
       pmt-cod-lst-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Listino di riferimento     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cod-lst-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Data selezione min                               *
      *    *-----------------------------------------------------------*
       pmt-dat-min-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Periodo di riferimento dal :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dat-min-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Data selezione max                               *
      *    *-----------------------------------------------------------*
       pmt-dat-max-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "                        al :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dat-max-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Codice cliente                                   *
      *    *-----------------------------------------------------------*
       pmt-cod-cli-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice cliente             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cod-cli-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Si/no stampa prezzi a zero                       *
      *    *-----------------------------------------------------------*
       pmt-snx-pze-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Selezione sui prezzi       :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-snx-pze-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Selezione su validita'                           *
      *    *-----------------------------------------------------------*
       pmt-sel-vld-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Selezione sulla validita'  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "              dei prezzi    "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-sel-vld-999.
           exit.

      *    *===========================================================*
      *    * Accettazione  : Codice filtro per selezione e ordinamento *
      *    *                 per il file [dcp]                         *
      *    *-----------------------------------------------------------*
       acc-fso-dcp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-fso-dcp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-zos-dcp-ope      .
           move      rr-fso-dcp           to   w-cod-zos-dcp-cod      .
           move      05                   to   w-cod-zos-dcp-lin      .
           move      30                   to   w-cod-zos-dcp-pos      .
           move      05                   to   w-cod-zos-dcp-dln      .
           move      41                   to   w-cod-zos-dcp-dps      .
           move      "<B"                 to   v-edm                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   cod-zos-dcp-cll-000  thru cod-zos-dcp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-zos-dcp-foi-000  thru cod-zos-dcp-foi-999    .
       acc-fso-dcp-110.
           perform   cod-zos-dcp-cll-000  thru cod-zos-dcp-cll-999    .
           if        w-cod-zos-dcp-ope    =    "F+"
                     go to acc-fso-dcp-115.
           if        w-cod-zos-dcp-ope    =    "AC"
                     go to acc-fso-dcp-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-fso-dcp-115.
           perform   cod-zos-dcp-foi-000  thru cod-zos-dcp-foi-999    .
           go to     acc-fso-dcp-110.
       acc-fso-dcp-120.
           move      w-cod-zos-dcp-cod    to   v-num                  .
       acc-fso-dcp-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-fso-dcp-999.
       acc-fso-dcp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-fso-dcp             .
       acc-fso-dcp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura codice filtro selezione e ordina-   *
      *                  * mento per file [dcp]                        *
      *                  *---------------------------------------------*
           move      rr-fso-dcp           to   w-let-fso-dcp-cod      .
           perform   let-fso-dcp-000      thru let-fso-dcp-999        .
           move      w-let-fso-dcp-des    to   rr-fso-dcp-des         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione filtro          *
      *                  *---------------------------------------------*
           perform   vis-des-fso-000      thru vis-des-fso-999        .
      *                  *---------------------------------------------*
      *                  * Se codice filtro non esistente : a reimpo-  *
      *                  * stazione                                    *
      *                  *---------------------------------------------*
           if        w-let-fso-dcp-flg    not  = spaces
                     go to acc-fso-dcp-100.
       acc-fso-dcp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tipo ordinamento dal codice filtro  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiesta tipo ordinamento              *
      *                      *-----------------------------------------*
           move      "TO"                 to   f-ope                  .
           move      rr-fso-dcp-alf       to   f-key                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
           if        f-sts                =    "01"
                     move  01             to   rr-fso-dcp-ord
           else if   f-sts                =    "02"
                     move  02             to   rr-fso-dcp-ord
           else if   f-sts                =    "03"
                     move  03             to   rr-fso-dcp-ord
           else if   f-sts                =    "04"
                     move  04             to   rr-fso-dcp-ord
           else      move  01             to   rr-fso-dcp-ord         .
      *                  *---------------------------------------------*
      *                  * Preparazione default per tipo salto pagina  *
      *                  *---------------------------------------------*
           if        rr-fso-dcp-ord       <    3
                     go to acc-fso-dcp-800.
           move      1                    to   rr-tip-slp             .
      *                      *-----------------------------------------*
      *                      * Visualizzazione tipo salto pagina       *
      *                      *-----------------------------------------*
           perform   vis-tip-slp-000      thru vis-tip-slp-999        .
       acc-fso-dcp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-fso-dcp-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-fso-dcp-100.
       acc-fso-dcp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice filtro per selezione e ordina-   *
      *    *                   mento per il le [dcp]                   *
      *    *-----------------------------------------------------------*
       vis-fso-dcp-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      05                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-fso-dcp           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-fso-dcp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice filtro per selezione e ordina-   *
      *    *                   mento per il le [dcp], descrizione      *
      *    *-----------------------------------------------------------*
       vis-des-fso-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-fso-dcp-des       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-des-fso-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Tipo salto pagina                          *
      *    *-----------------------------------------------------------*
       acc-tip-slp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        rr-fso-dcp-ord       >    2
                     go to acc-tip-slp-999.
       acc-tip-slp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-slp-lun    to   v-car                  .
           move      w-exp-tip-slp-num    to   v-ldt                  .
           move      "NCGS#"              to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      08                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-tip-slp-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      rr-tip-slp           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-tip-slp-999.
       acc-tip-slp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-tip-slp             .
       acc-tip-slp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        rr-tip-slp           =    zero
                     go to acc-tip-slp-100.
       acc-tip-slp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-tip-slp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-tip-slp-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-tip-slp-100.
       acc-tip-slp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Tipo salto pagina                       *
      *    *-----------------------------------------------------------*
       vis-tip-slp-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-slp-lun    to   v-car                  .
           move      w-exp-tip-slp-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      08                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-tip-slp-tbl    to   v-txt                  .
           move      rr-tip-slp           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-slp-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice listino                       *
      *    *-----------------------------------------------------------*
       acc-cod-lst-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-lst-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-lst-ope      .
           move      rr-cod-lst           to   w-cod-cod-lst-cod      .
           move      10                   to   w-cod-cod-lst-lin      .
           move      30                   to   w-cod-cod-lst-pos      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-zls-cll-000  thru cod-cod-zls-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-zls-foi-000  thru cod-cod-zls-foi-999    .
       acc-cod-lst-110.
           perform   cod-cod-zls-cll-000  thru cod-cod-zls-cll-999    .
           if        w-cod-cod-lst-ope    =    "F+"
                     go to acc-cod-lst-115.
           if        w-cod-cod-lst-ope    =    "AC"
                     go to acc-cod-lst-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-lst-115.
           perform   cod-cod-zls-foi-000  thru cod-cod-zls-foi-999    .
           go to     acc-cod-lst-110.
       acc-cod-lst-120.
           move      w-cod-cod-lst-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-cod-lst-999.
       acc-cod-lst-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-cod-lst             .
       acc-cod-lst-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella [zls]                       *
      *                  *---------------------------------------------*
           move      rr-cod-lst           to   w-let-arc-zls-cod      .
           perform   let-arc-zls-000      thru let-arc-zls-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-zls-des    to   rr-cod-lst-des         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione listino         *
      *                  *---------------------------------------------*
           perform   vis-des-lst-000      thru vis-des-lst-999        .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-zls-flg    not  = spaces
                     go to acc-cod-lst-100.
       acc-cod-lst-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-lst-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-cod-lst-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-cod-lst-100.
       acc-cod-lst-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo selezione : Codice listino 1        *
      *    *-----------------------------------------------------------*
       vis-cod-lst-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-cod-lst           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-lst-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Descrizione listino               *
      *    *-----------------------------------------------------------*
       vis-des-lst-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-cod-lst-des       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-des-lst-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Data selezione min                   *
      *    *-----------------------------------------------------------*
       acc-dat-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dat-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      12                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      rr-dat-min           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dat-min-999.
       acc-dat-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dat-min             .
       acc-dat-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se zero : reimpostazione                    *
      *                  *---------------------------------------------*
           if        rr-dat-min           =    zero
                     go to acc-dat-min-100.
       acc-dat-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dat-min-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dat-min-100.
       acc-dat-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Data selezione max                   *
      *    *-----------------------------------------------------------*
       acc-dat-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dat-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      rr-dat-max           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dat-max-999.
       acc-dat-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dat-max             .
       acc-dat-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se zero : reimpostazione                    *
      *                  *---------------------------------------------*
           if        rr-dat-max           =    zero
                     go to acc-dat-max-100.
       acc-dat-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dat-max-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dat-max-100.
       acc-dat-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Codice cliente                             *
      *    *-----------------------------------------------------------*
       acc-cod-cli-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-cli-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-dcc-ope      .
           move      rr-cod-cli           to   w-cod-mne-dcc-cod      .
           move      15                   to   w-cod-mne-dcc-lin      .
           move      30                   to   w-cod-mne-dcc-pos      .
           move      15                   to   w-cod-mne-dcc-rln      .
           move      41                   to   w-cod-mne-dcc-rps      .
           move      zero                 to   w-cod-mne-dcc-vln      .
           move      zero                 to   w-cod-mne-dcc-vps      .
           move      zero                 to   w-cod-mne-dcc-lln      .
           move      zero                 to   w-cod-mne-dcc-lps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
       acc-cod-cli-110.
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           if        w-cod-mne-dcc-ope    =    "F+"
                     go to acc-cod-cli-115.
           if        w-cod-mne-dcc-ope    =    "AC"
                     go to acc-cod-cli-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-cli-115.
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
           go to     acc-cod-cli-110.
       acc-cod-cli-120.
           move      w-cod-mne-dcc-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-cod-cli-999.
       acc-cod-cli-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-cod-cli             .
       acc-cod-cli-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-cli-420.
      *                  *---------------------------------------------*
      *                  * Lettura file [cli]                          *
      *                  *---------------------------------------------*
           move      rr-cod-cli           to   w-let-arc-cli-cod      .
           perform   let-arc-cli-000      thru let-arc-cli-999        .
      *                  *---------------------------------------------*
      *                  * Lettura record [dcc]                        *
      *                  *---------------------------------------------*
           move      rr-cod-cli           to   w-let-arc-dcc-cli      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione ragione sociale              *
      *                  *---------------------------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     move  w-let-arc-dcc-rag
                                          to   rr-cod-cli-rag
           else      move  w-let-arc-cli-rag
                                          to   rr-cod-cli-rag         .
      *                  *---------------------------------------------*
      *                  * Memorizzazione codice valuta associato al   *
      *                  * cliente commerciale                         *
      *                  *---------------------------------------------*
           move      w-let-arc-dcc-vlt    to   rr-cod-cli-vlt         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione ragione sociale cliente     *
      *                  *---------------------------------------------*
           perform   vis-cod-cli-rag-000  thru vis-cod-cli-rag-999    .
       acc-cod-cli-440.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del valore impostato   *
      *                  *---------------------------------------------*
           if        rr-cod-cli           =    zero
                     go to acc-cod-cli-460
           else      go to acc-cod-cli-480.
       acc-cod-cli-460.
      *                  *---------------------------------------------*
      *                  * Se codice cliente impostato a zero          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-cod-cli-100.
       acc-cod-cli-480.
      *                  *---------------------------------------------*
      *                  * Se codice cliente impostato diverso da zero *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se cliente commer- *
      *                      * ciale esistente oppure no               *
      *                      *-----------------------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-cod-cli-560.
       acc-cod-cli-500.
      *                      *-----------------------------------------*
      *                      * Se anagrafica cliente commerciale non   *
      *                      * esistente                               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Deviazione a seconda se anagrafica  *
      *                          * cliente esistente oppure no         *
      *                          *-------------------------------------*
           if        w-let-arc-cli-flg    =    spaces
                     go to acc-cod-cli-540.
       acc-cod-cli-520.
      *                          *-------------------------------------*
      *                          * Se anagrafica cliente contabile non *
      *                          * esistente                           *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * A reimpostazione                *
      *                              *---------------------------------*
           go to     acc-cod-cli-100.
       acc-cod-cli-540.
      *                          *-------------------------------------*
      *                          * Se anagrafica cliente contabile     *
      *                          * esistente                           *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Emissione messaggio di errore   *
      *                              *---------------------------------*
           move      "Manca l'anagrafica commerciale per il cliente"
                                          to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                              *---------------------------------*
      *                              * A reimpostazione                *
      *                              *---------------------------------*
           go to     acc-cod-cli-100.
       acc-cod-cli-560.
      *                      *-----------------------------------------*
      *                      * Se anagrafica cliente commerciale esi-  *
      *                      * stente                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * A dipendenze da impostazione        *
      *                          *-------------------------------------*
           go to     acc-cod-cli-600.
       acc-cod-cli-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-cli-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-cod-cli-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-cod-cli-100.
       acc-cod-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice cliente                          *
      *    *-----------------------------------------------------------*
       vis-cod-cli-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      15                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "<B"                 to   v-edm                  .
           move      rr-cod-cli           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice cliente, ragione sociale         *
      *    *-----------------------------------------------------------*
       vis-cod-cli-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-cod-cli-rag       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cli-rag-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Si/no stampa prezzi a zero                 *
      *    *-----------------------------------------------------------*
       acc-snx-pze-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-snx-pze-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-pze-lun    to   v-car                  .
           move      w-exp-snx-pze-num    to   v-ldt                  .
           move      "NV#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      17                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-snx-pze-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      rr-snx-pze           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-snx-pze-999.
       acc-snx-pze-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-snx-pze             .
       acc-snx-pze-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Sa zero : reimpostazione                    *
      *                  *---------------------------------------------*
           if        rr-snx-pze           =    zero
                     go to acc-snx-pze-100.
       acc-snx-pze-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-snx-pze-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-snx-pze-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-snx-pze-100.
       acc-snx-pze-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Selezione su validita'                     *
      *    *-----------------------------------------------------------*
       acc-sel-vld-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione eventuale default              *
      *                  *---------------------------------------------*
           if        rr-sel-vld           not  = zero
                     go to acc-sel-vld-100.
           move      01                   to   rr-sel-vld             .
       acc-sel-vld-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sel-vld-lun    to   v-car                  .
           move      w-exp-sel-vld-num    to   v-ldt                  .
           move      "TVS#"               to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      19                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-sel-vld-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      rr-sel-vld           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-sel-vld-999.
       acc-sel-vld-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-sel-vld             .
       acc-sel-vld-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Sa zero : reimpostazione                    *
      *                  *---------------------------------------------*
           if        rr-sel-vld           =    zero
                     go to acc-sel-vld-100.
       acc-sel-vld-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-sel-vld-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-sel-vld-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-sel-vld-100.
       acc-sel-vld-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-800.
      *              *-------------------------------------------------*
      *              * Uscita per controlli tutti superati             *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Emissione messaggio di errore e set del flag di *
      *              * uscita ad errore                                *
      *              *-------------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di errore in uscita                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo salto pagina               *
      *              *-------------------------------------------------*
           if        rr-tip-slp           not  = zero
                     go to reg-ric-sel-100.
           move      01                   to   rr-tip-slp             .
       reg-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Data selezione min - max                        *
      *              *-------------------------------------------------*
           if        rr-dat-max           not  = zero
                     go to reg-ric-sel-200.
           if        rr-dat-min           =    zero
                     move  9999999        to   rr-dat-max
           else      move  rr-dat-min     to   rr-dat-max             .
       reg-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Normalizzazione si/no stampa prezzi a zero      *
      *              *-------------------------------------------------*
           if        rr-snx-pze           not  = zero
                     go to reg-ric-sel-300.
           move      01                   to   rr-snx-pze             .
       reg-ric-sel-300.
      *              *-------------------------------------------------*
      *              * Normalizzazione Selezione su validita'          *
      *              *-------------------------------------------------*
           if        rr-sel-vld           not  = zero
                     go to reg-ric-sel-999.
           move      01                   to   rr-sel-vld             .
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
           move      zero                 to   rr-fso-dcp             .
           move      spaces               to   rr-fso-dcp-des         .
           move      zero                 to   rr-fso-dcp-ord         .
           move      zero                 to   rr-tip-slp             .
           move      spaces               to   rr-cod-lst             .
           move      spaces               to   rr-cod-lst-des         .
           move      zero                 to   rr-dat-min             .
           move      zero                 to   rr-dat-max             .
           move      zero                 to   rr-cod-cli             .
           move      spaces               to   rr-cod-cli-rag         .
           move      spaces               to   rr-cod-cli-vlt         .
           move      zero                 to   rr-snx-pze             .
           move      zero                 to   rr-sel-vld             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Preparazione parametri per selezione stampa               *
      *    *-----------------------------------------------------------*
       pre-prm-stp-000.
      *              *-------------------------------------------------*
      *              * Flags di tipo selezione                         *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-tip-sel      .
      *              *-------------------------------------------------*
      *              * Codice stampante                                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-cod-stp      .
      *              *-------------------------------------------------*
      *              * Tipo di stampa                                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-tip-sta      .
      *              *-------------------------------------------------*
      *              * Codice modulo                                   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-cod-mod      .
      *              *-------------------------------------------------*
      *              * Tipo modulo                                     *
      *              *   - L : Libero                                  *
      *              *   - T : Tipografico                             *
      *              *-------------------------------------------------*
           move      "L"                  to   w-cnt-stp-tip-mod      .
      *              *-------------------------------------------------*
      *              * Ampiezza linea di stampa in caratteri           *
      *              *-------------------------------------------------*
           move      132                  to   w-cnt-stp-amp-lin      .
      *              *-------------------------------------------------*
      *              * Top margin in linee                             *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stp-top-lin      .
      *              *-------------------------------------------------*
      *              * Numero linee di stampa minimo                   *
      *              *-------------------------------------------------*
           move      30                   to   w-cnt-stp-lin-min      .
      *              *-------------------------------------------------*
      *              * Bottom margin in linee                          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stp-bot-lin      .
      *              *-------------------------------------------------*
      *              * Ampiezza caratteri                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stp-amp-car      .
      *              *-------------------------------------------------*
      *              * Altezza interlinea                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stp-alt-int      .
      *              *-------------------------------------------------*
      *              * Area riservata per espansioni future            *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-esp-fut      .
      *              *-------------------------------------------------*
      *              * Area riservata per espansioni speciali          *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-fnz-spc      .
       pre-prm-stp-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : No                    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-exe-rou-srt      .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Start filtro di ordinamento e selezione per il  *
      *              * file [dcp]                                      *
      *              *-------------------------------------------------*
           move      "ST"                 to   f-ope                  .
           move      rr-fso-dcp           to   f-key                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Se errore su Start : uscita con flag a Eof      *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-cnt-prn-flg-sub
                     go to prn-str-ini-999.
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessun prodotto da stampare entro i limiti assegna
      -              "ti !"               to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Read Next filtro di ordinamento e selezione per *
      *              * file [dcp]                                      *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Se At End : uscita con flag a Eof               *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-cnt-prn-flg-sub
                     go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura prezzo di listino                       *
      *              *-------------------------------------------------*
           move      02                   to   w-let-arc-lst-tip      .
           move      spaces               to   w-let-arc-lst-cod      .
           move      rr-cod-cli           to   w-let-arc-lst-cli      .
           move      c-sgl                to   w-let-arc-lst-vlt      .
           move      rf-dcp-num-pro       to   w-let-arc-lst-pro      .
           perform   let-arc-lst-000      thru let-arc-lst-999        .
      *              *-------------------------------------------------*
      *              * Test su valore determinato                      *
      *              *-------------------------------------------------*
           if        w-let-arc-lst-prz    =    zero
                     go to prn-sel-rec-900.
      *              *-------------------------------------------------*
      *              * Memorizzazione valore determinato               *
      *              *-------------------------------------------------*
           move      w-let-arc-lst-prz    to   w-det-prz-lst-prn      .
       prn-sel-rec-200.
      *              *-------------------------------------------------*
      *              * Determinazione prezzo di listino in vigore alla *
      *              * data minima                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione link-area                      *
      *                  *---------------------------------------------*
           move      "PV"                 to   d-prz-ven-tip-ope      .
           move      zero                 to   d-prz-ven-cod-cli      .
           move      c-sgl                to   d-prz-ven-sgl-vpp      .
           move      c-dec                to   d-prz-ven-dec-vpp      .
           move      rf-dcp-num-pro       to   d-prz-ven-num-pro      .
           move      rr-cod-lst           to   d-prz-ven-cod-lst      .
           move      rf-dcp-prz-lst       to   d-prz-ven-prz-lsb      .
           move      c-sgl                to   d-prz-ven-sgl-vlb      .
           move      c-dec                to   d-prz-ven-dec-vlb      .
           move      spaces               to   d-prz-ven-tfu-prz      .
           move      rr-dat-min           to   d-prz-ven-dat-rfp      .
           move      zero                 to   d-prz-ven-qta-rif      .
      *                  *---------------------------------------------*
      *                  * Richiamo del sottoprogramma                 *
      *                  *---------------------------------------------*
           perform   det-prz-ven-cll-000  thru det-prz-ven-cll-999    .
      *                  *---------------------------------------------*
      *                  * Memorizzazione valore determinato           *
      *                  *---------------------------------------------*
           move      d-prz-ven-prz-ven    to   w-det-prz-lst-pr1      .
       prn-sel-rec-300.
      *              *-------------------------------------------------*
      *              * Determinazione prezzo di listino in vigore alla *
      *              * data massima                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione link-area                      *
      *                  *---------------------------------------------*
           move      "PV"                 to   d-prz-ven-tip-ope      .
           move      zero                 to   d-prz-ven-cod-cli      .
           move      c-sgl                to   d-prz-ven-sgl-vpp      .
           move      c-dec                to   d-prz-ven-dec-vpp      .
           move      rf-dcp-num-pro       to   d-prz-ven-num-pro      .
           move      rr-cod-lst           to   d-prz-ven-cod-lst      .
           move      rf-dcp-prz-lst       to   d-prz-ven-prz-lsb      .
           move      c-sgl                to   d-prz-ven-sgl-vlb      .
           move      c-dec                to   d-prz-ven-dec-vlb      .
           move      spaces               to   d-prz-ven-tfu-prz      .
           move      rr-dat-max           to   d-prz-ven-dat-rfp      .
           move      zero                 to   d-prz-ven-qta-rif      .
      *                  *---------------------------------------------*
      *                  * Richiamo del sottoprogramma                 *
      *                  *---------------------------------------------*
           perform   det-prz-ven-cll-000  thru det-prz-ven-cll-999    .
      *                  *---------------------------------------------*
      *                  * Memorizzazione valore determinato           *
      *                  *---------------------------------------------*
           move      d-prz-ven-prz-ven    to   w-det-prz-lst-pr2      .
       prn-sel-rec-400.
      *              *-------------------------------------------------*
      *              * Test su selezione prezzi                        *
      *              *-------------------------------------------------*
           if        rr-snx-pze           =    01
                     go to prn-sel-rec-500.
           if        w-det-prz-lst-pr1    =    w-det-prz-lst-pr2
                     go to prn-sel-rec-900.
       prn-sel-rec-500.
      *              *-------------------------------------------------*
      *              * Selezione su validita'                          *
      *              *-------------------------------------------------*
           if        rr-sel-vld           =    01
                     go to prn-sel-rec-800.
      *              *-------------------------------------------------*
      *              * Test se presenti date di validita'              *
      *              *-------------------------------------------------*
           if        w-let-arc-lst-ini    =    zero and
                     w-let-arc-lst-fin    =    zero
                     go to prn-sel-rec-800.
      *              *-------------------------------------------------*
      *              * Data di sistema                                 *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       prn-sel-rec-520.
      *              *-------------------------------------------------*
      *              * Se solo prezzi in vigore                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rr-sel-vld           =    03
                     go to prn-sel-rec-540.
      *                  *---------------------------------------------*
      *                  * Confronto data iniziale                     *
      *                  *---------------------------------------------*
           if        w-let-arc-lst-ini    =    zero
                     go to prn-sel-rec-522.
           if        w-let-arc-lst-ini    not  < s-dat
                     go to prn-sel-rec-900.
       prn-sel-rec-522.
      *                  *---------------------------------------------*
      *                  * Confronto data finale                       *
      *                  *---------------------------------------------*
           if        w-let-arc-lst-fin    =    zero
                     go to prn-sel-rec-800.
           if        w-let-arc-lst-fin    <    s-dat
                     go to prn-sel-rec-900.
      *
           go to     prn-sel-rec-800.
       prn-sel-rec-540.
      *              *-------------------------------------------------*
      *              * Se solo prezzi scaduti                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Confronto data iniziale                     *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Confronto data finale                       *
      *                  *---------------------------------------------*
           if        w-let-arc-lst-fin    =    zero
                     go to prn-sel-rec-800.
           if        w-let-arc-lst-fin    >    s-dat
                     go to prn-sel-rec-900.
      *
           go to     prn-sel-rec-800.
       prn-sel-rec-800.
      *              *-------------------------------------------------*
      *              * Uscita per selezione superata                   *
      *              *-------------------------------------------------*
           go to     prn-sel-rec-999.
       prn-sel-rec-900.
      *              *-------------------------------------------------*
      *              * Uscita per selezione non superata               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di selezione non superata           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-prn-flg-sub      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-sel-rec-999.
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        rr-fso-dcp-ord       =    01 or
                     rr-fso-dcp-ord       =    02
                     go to prn-cmp-rot-300
           else if   rr-fso-dcp-ord       =    03 or
                     rr-fso-dcp-ord       =    04
                     go to prn-cmp-rot-600.
       prn-cmp-rot-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice pro-  *
      *              *   dotto                                         *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   prodotto                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione area per rottura classe        *
      *                  *---------------------------------------------*
           move      rf-dcp-cla-pro       to   w-rot-l03-cod-cla      .
      *                  *---------------------------------------------*
      *                  * Composizione area per rottura gruppo        *
      *                  *---------------------------------------------*
           move      rf-dcp-gru-pro       to   w-rot-l02-cod-gru      .
      *                  *---------------------------------------------*
      *                  * Composizione area per rottura sottogruppo   *
      *                  *---------------------------------------------*
           move      rf-dcp-sgr-pro       to   w-rot-l01-cod-sgr      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-cmp-rot-999.
       prn-cmp-rot-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice prodotto                           *
      *              * - Per descrizione prodotto                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione area rottura classe         *
      *                  *---------------------------------------------*
           move      zero                 to   w-rot-l03-cod-cla      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione area rottura gruppo         *
      *                  *---------------------------------------------*
           move      zero                 to   w-rot-l02-cod-gru      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione area rottura sottogruppo    *
      *                  *---------------------------------------------*
           move      zero                 to   w-rot-l01-cod-sgr      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-cmp-rot-999.
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Azzeramento totali generali                     *
      *              *-------------------------------------------------*
           perform   azz-tot-gen-000      thru azz-tot-gen-999        .
       prn-ini-cic-100.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo ordinamento       *
      *              *-------------------------------------------------*
           if        rr-fso-dcp-ord       =    01 or
                     rr-fso-dcp-ord       =    02
                     go to prn-ini-cic-300
           else if   rr-fso-dcp-ord       =    03 or
                     rr-fso-dcp-ord       =    04
                     go to prn-ini-cic-600.
       prn-ini-cic-300.
      *              *-------------------------------------------------*
      *              * Se ordinamento per Classe, gruppo e sottogruppo *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione numero di linee effettive im-  *
      *                  * pegnate dalla fincatura per il dettaglio e  *
      *                  * la relativa sottolineatura                  *
      *                  *---------------------------------------------*
           move      2                    to   w-cgs-det-idf          .
      *                  *---------------------------------------------*
      *                  * Preparazione segnali di richiesta intesta-  *
      *                  * zione per inizio classe gruppo sottogruppo  *
      *                  *---------------------------------------------*
           if        rr-tip-slp           =    02
                     move  "S"            to   w-cgs-cla-int
                     move  "N"            to   w-cgs-gru-int
                     move  "N"            to   w-cgs-sgr-int
           else if   rr-tip-slp           =    03
                     move  "S"            to   w-cgs-cla-int
                     move  "S"            to   w-cgs-gru-int
                     move  "N"            to   w-cgs-sgr-int
           else if   rr-tip-slp           =    04
                     move  "S"            to   w-cgs-cla-int
                     move  "S"            to   w-cgs-gru-int
                     move  "S"            to   w-cgs-sgr-int
           else      move  "N"            to   w-cgs-cla-int
                     move  "N"            to   w-cgs-gru-int
                     move  "N"            to   w-cgs-sgr-int          .
      *                  *---------------------------------------------*
      *                  * Flag di prima intestazione : non eseguita   *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-gen-fie          .
      *                  *---------------------------------------------*
      *                  * Flag di intestazione classe : non eseguita  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-cla-fie          .
      *                  *---------------------------------------------*
      *                  * Flag di intestazione gruppo : non eseguita  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-gru-fie          .
      *                  *---------------------------------------------*
      *                  * Flag di intestazione sottogruppo : non ese- *
      *                  * guita                                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-sgr-fie          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-999.
       prn-ini-cic-600.
      *              *-------------------------------------------------*
      *              * Se ordinamento per Codice o Descrizione         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Intestazione foglio                         *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                      *-----------------------------------------*
      *                      * Test se interruzione forzata            *
      *                      *-----------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-cic-999.
      *                  *---------------------------------------------*
      *                  * Fincatura per dettaglio                     *
      *                  *---------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-999.
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        rr-fso-dcp-ord       =    01 or
                     rr-fso-dcp-ord       =    02
                     go to prn-ini-lr3-300
           else if   rr-fso-dcp-ord       =    03 or
                     rr-fso-dcp-ord       =    04
                     go to prn-ini-lr3-600.
       prn-ini-lr3-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice pro-  *
      *              *   dotto                                         *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   prodotto                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati classe                         *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-cla    to   w-let-arc-zp1-cla      .
           perform   let-arc-zp1-000      thru let-arc-zp1-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione dati classe                 *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-cla    to   w-cgs-cla-cod          .
           move      w-let-arc-zp1-des    to   w-cgs-cla-des          .
           move      w-let-arc-zp1-mne    to   w-cgs-cla-mne          .
           move      w-let-arc-zp1-sqz    to   w-cgs-cla-sqz          .
           move      w-let-arc-zp1-sud    to   w-cgs-cla-sud          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di classe gia' inte-   *
      *                  * stata                                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-cla-fie          .
      *                  *---------------------------------------------*
      *                  * Azzeramento totali per classe               *
      *                  *---------------------------------------------*
           perform   azz-tot-cla-000      thru azz-tot-cla-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice prodotto                           *
      *              * - Per descrizione prodotto                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        rr-fso-dcp-ord       =    01 or
                     rr-fso-dcp-ord       =    02
                     go to prn-ini-lr2-300
           else if   rr-fso-dcp-ord       =    03 or
                     rr-fso-dcp-ord       =    04
                     go to prn-ini-lr2-600.
       prn-ini-lr2-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice pro-  *
      *              *   dotto                                         *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   prodotto                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati gruppo                         *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-cla    to   w-let-arc-zp2-cla      .
           move      w-rot-l02-cod-gru    to   w-let-arc-zp2-gru      .
           perform   let-arc-zp2-000      thru let-arc-zp2-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione dati gruppo                 *
      *                  *---------------------------------------------*
           move      w-rot-l02-cod-gru    to   w-cgs-gru-cod          .
           move      w-let-arc-zp2-des    to   w-cgs-gru-des          .
           move      w-let-arc-zp2-mne    to   w-cgs-gru-mne          .
           move      w-let-arc-zp2-sqz    to   w-cgs-gru-sqz          .
           move      w-let-arc-zp2-sud    to   w-cgs-gru-sud          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di gruppo gia' inte-   *
      *                  * stato                                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-gru-fie          .
      *                  *---------------------------------------------*
      *                  * Azzeramento totali per gruppo               *
      *                  *---------------------------------------------*
           perform   azz-tot-gru-000      thru azz-tot-gru-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-lr2-999.
       prn-ini-lr2-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice prodotto                           *
      *              * - Per descrizione prodotto                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     prn-ini-lr2-999.
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        rr-fso-dcp-ord       =    01 or
                     rr-fso-dcp-ord       =    02
                     go to prn-ini-lr1-300
           else if   rr-fso-dcp-ord       =    03 or
                     rr-fso-dcp-ord       =    04
                     go to prn-ini-lr1-600.
       prn-ini-lr1-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice pro-  *
      *              *   dotto                                         *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   prodotto                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati sottogruppo                    *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-cla    to   w-let-arc-zp3-cla      .
           move      w-rot-l02-cod-gru    to   w-let-arc-zp3-gru      .
           move      w-rot-l01-cod-sgr    to   w-let-arc-zp3-sgr      .
           perform   let-arc-zp3-000      thru let-arc-zp3-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione dati sottogruppo            *
      *                  *---------------------------------------------*
           move      w-rot-l01-cod-sgr    to   w-cgs-sgr-cod          .
           move      w-let-arc-zp3-des    to   w-cgs-sgr-des          .
           move      w-let-arc-zp3-mne    to   w-cgs-sgr-mne          .
           move      w-let-arc-zp3-sqz    to   w-cgs-sgr-sqz          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di sottogruppo gia'    *
      *                  * intestato                                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-sgr-fie          .
      *                  *---------------------------------------------*
      *                  * Azzeramento totali per sottogruppo          *
      *                  *---------------------------------------------*
           perform   azz-tot-sgr-000      thru azz-tot-sgr-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dei flags di intesta-  *
      *                  * zione gia' eseguita                         *
      *                  *---------------------------------------------*
           if        w-cgs-cla-fie        =    spaces
                     go to prn-ini-lr1-350
           else if   w-cgs-gru-fie        =    spaces
                     go to prn-ini-lr1-450
           else      go to prn-ini-lr1-500.
       prn-ini-lr1-350.
      *                  *---------------------------------------------*
      *                  * Se classe non ancora intestata              *
      *                  *---------------------------------------------*
       prn-ini-lr1-355.
      *                      *-----------------------------------------*
      *                      * Flag di intestazione eseguita per :     *
      *                      * - Classe                                *
      *                      * - Gruppo                                *
      *                      * - Sottogruppo                           *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cgs-cla-fie          .
           move      "#"                  to   w-cgs-gru-fie          .
           move      "#"                  to   w-cgs-sgr-fie          .
       prn-ini-lr1-360.
      *                      *-----------------------------------------*
      *                      * Se intestazione generale non ancora e-  *
      *                      * seguita                                 *
      *                      *-----------------------------------------*
           if        w-cgs-gen-fie        not  = spaces
                     go to prn-ini-lr1-370.
      *                          *-------------------------------------*
      *                          * Flag di intestazione generale gia'  *
      *                          * eseguita                            *
      *                          *-------------------------------------*
           move      "#"                  to   w-cgs-gen-fie          .
       prn-ini-lr1-365.
      *                          *-------------------------------------*
      *                          * Intestazione pagina                 *
      *                          *-------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * A test su suddivisione classe       *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-375.
       prn-ini-lr1-370.
      *                      *-----------------------------------------*
      *                      * Se intestazione generale gia' eseguita  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se richiesta comunque una intesta-  *
      *                          * zione ad inizio classe : ad inte-   *
      *                          * stazione pagina                     *
      *                          *-------------------------------------*
           if        w-cgs-cla-int        =    "S"
                     go to prn-ini-lr1-365.
       prn-ini-lr1-375.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se classe suddivi- *
      *                      * sa oppure no                            *
      *                      *-----------------------------------------*
           if        w-cgs-cla-sud        =    02
                     go to prn-ini-lr1-385
           else      go to prn-ini-lr1-380.
       prn-ini-lr1-380.
      *                      *-----------------------------------------*
      *                      * Se classe non suddivisa                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Intestazione per la sola classe     *
      *                          *-------------------------------------*
           perform   sta-int-cla-000      thru sta-int-cla-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-385.
      *                      *-----------------------------------------*
      *                      * Se classe suddivisa                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Deviazione a seconda se gruppo sud- *
      *                          * diviso oppure no                    *
      *                          *-------------------------------------*
           if        w-cgs-gru-sud        =    02
                     go to prn-ini-lr1-395
           else      go to prn-ini-lr1-390.
       prn-ini-lr1-390.
      *                          *-------------------------------------*
      *                          * Se gruppo non suddiviso             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Intestazione per classe e grup- *
      *                              * po                              *
      *                              *---------------------------------*
           perform   sta-int-gru-000      thru sta-int-gru-999        .
      *                              *---------------------------------*
      *                              * Se interruzione forzata : usci- *
      *                              * ta                              *
      *                              *---------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-395.
      *                          *-------------------------------------*
      *                          * Se gruppo suddiviso                 *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Intestazione per classe, grup-  *
      *                              * po, sottogruppo                 *
      *                              *---------------------------------*
           perform   sta-int-sgr-000      thru sta-int-sgr-999        .
      *                              *---------------------------------*
      *                              * Se interruzione forzata : usci- *
      *                              * ta                              *
      *                              *---------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-450.
      *                  *---------------------------------------------*
      *                  * Se gruppo non ancora intestato              *
      *                  *---------------------------------------------*
       prn-ini-lr1-455.
      *                      *-----------------------------------------*
      *                      * Flag di intestazione eseguita per :     *
      *                      * - Gruppo                                *
      *                      * - Sottogruppo                           *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cgs-gru-fie          .
           move      "#"                  to   w-cgs-sgr-fie          .
       prn-ini-lr1-460.
      *                      *-----------------------------------------*
      *                      * Se richiesta comunque una intestazione  *
      *                      * ad inizio gruppo                        *
      *                      *-----------------------------------------*
           if        w-cgs-gru-int        not  = "S"
                     go to prn-ini-lr1-465.
      *                          *-------------------------------------*
      *                          * Intestazione pagina                 *
      *                          *-------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
       prn-ini-lr1-465.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se gruppo suddivi- *
      *                      * so oppure no                            *
      *                      *-----------------------------------------*
           if        w-cgs-gru-sud        =    02
                     go to prn-ini-lr1-475
           else      go to prn-ini-lr1-470.
       prn-ini-lr1-470.
      *                      *-----------------------------------------*
      *                      * Se gruppo non suddiviso                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Intestazione per classe e gruppo    *
      *                          *-------------------------------------*
           perform   sta-int-gru-000      thru sta-int-gru-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-475.
      *                      *-----------------------------------------*
      *                      * Se gruppo suddiviso                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Intestazione per classe, gruppo, e  *
      *                          * sottogruppo                         *
      *                          *-------------------------------------*
           perform   sta-int-sgr-000      thru sta-int-sgr-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-500.
      *                  *---------------------------------------------*
      *                  * Se sottogruppo non ancora intestato         *
      *                  *---------------------------------------------*
       prn-ini-lr1-505.
      *                      *-----------------------------------------*
      *                      * Flag di intestazione eseguita per :     *
      *                      * - Sottogruppo                           *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cgs-sgr-fie          .
       prn-ini-lr1-510.
      *                      *-----------------------------------------*
      *                      * Se richiesta comunque una intestazione  *
      *                      * ad inizio sottogruppo                   *
      *                      *-----------------------------------------*
           if        w-cgs-sgr-int        not  = "S"
                     go to prn-ini-lr1-515.
      *                          *-------------------------------------*
      *                          * Intestazione pagina                 *
      *                          *-------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
       prn-ini-lr1-515.
      *                          *-------------------------------------*
      *                          * Intestazione per classe, gruppo, e  *
      *                          * sottogruppo                         *
      *                          *-------------------------------------*
           perform   sta-int-sgr-000      thru sta-int-sgr-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice prodotto                           *
      *              * - Per descrizione prodotto                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     prn-ini-lr1-999.
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           if        p-res                >    1
                     go to prn-liv-det-100.
      *                  *---------------------------------------------*
      *                  * Intestazione pagina                         *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                  *---------------------------------------------*
      *                  * Test se interruzione forzata                *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
      *                  *---------------------------------------------*
      *                  * Fincatura per dettaglio                     *
      *                  *---------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       prn-liv-det-100.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-200.
      *              *-------------------------------------------------*
      *              * Stampa                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice alfanumerico prodotto                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      rf-dcp-alf-pro       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Descrizione prodotto                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      017                  to   p-pos                  .
           move      rf-dcp-des-pro       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Codice cliente                              *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      059                  to   p-pos                  .
           move      rr-cod-cli           to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ragione sociale cliente                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      23                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      068                  to   p-pos                  .
           move      rr-cod-cli-rag       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Prezzo netto concordato                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           add       rf-dcp-dec-prz       to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BG"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      093                  to   p-pos                  .
           move      w-det-prz-lst-prn    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Prezzo listino 1                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           add       rf-dcp-dec-prz       to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BG"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      107                  to   p-pos                  .
           move      w-det-prz-lst-pr1    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Prezzo listino 2                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           add       rf-dcp-dec-prz       to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BG"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      121                  to   p-pos                  .
           move      w-det-prz-lst-pr2    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri intestazione standard    *
      *              *-------------------------------------------------*
           move      "STAMPA DI CONTROLLO PREZZI NETTI CONCORDATI"
                                          to   w-cnt-tit-des-tit      .
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-cnt-tit-dat-stp      .
           move      p-pag                to   w-cnt-tit-num-pag      .
           add       1                    to   w-cnt-tit-num-pag      .
       int-pag-sta-100.
      *              *-------------------------------------------------*
      *              * Richiamo subroutine di intestazione pagina      *
      *              * standard                                        *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
       int-pag-sta-200.
      *              *-------------------------------------------------*
      *              * Se uscita per interruzione forzata              *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-sta-999.
       int-pag-sta-400.
      *                  *---------------------------------------------*
      *                  * Sub-intestazione                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se il numero pagina da stampare non e'  *
      *                      * pari a 1 : no sub-intestazione          *
      *                      *-----------------------------------------*
           if        w-cnt-tit-num-pag    not  = 1
                     go to int-pag-sta-900.
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale subordinato    *
      *                      *-----------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Literal 'Periodo di riferimento :'      *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Variazioni dal"     to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Data minima                             *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      016                  to   p-pos                  .
           move      rr-dat-min           to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Separazione                             *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      025                  to   p-pos                  .
           move      "al"                 to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Data massima                            *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      028                  to   p-pos                  .
           move      rr-dat-max           to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     int-pag-sta-999.
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Fincatura dettaglio                                       *
      *    *-----------------------------------------------------------*
       int-fin-det-000.
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura                                       *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "             Codice e descrizione prodotto        
      -              "                     Cliente              Prezzo n
      -              "etto  Listino       Preced.     "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Intestazione listino 1                          *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      115                  to   p-pos                  .
      *
           if        rr-cod-lst           =    spaces
                     move  "BASE"         to   p-alf
           else      move  rr-cod-lst     to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Intestazione listino 2                          *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      129                  to   p-pos                  .
      *
           if        rr-cod-lst           =    spaces
                     move  "BASE"         to   p-alf
           else      move  rr-cod-lst     to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura                        *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "--------------------------------------------------
      -              "------  --------------------------------  --------
      -              "----  ------------  ------------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-fin-det-999.
           exit.

      *    *===========================================================*
      *    * Stampa intestazione classe                                *
      *    *-----------------------------------------------------------*
       sta-int-cla-000.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      8                    to   w-cgs-wrk-nln          .
           add       w-cgs-det-idf        to   w-cgs-wrk-nln          .
           if        p-res                >    w-cgs-wrk-nln
                     go to sta-int-cla-200.
       sta-int-cla-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Test se interruzione forzata                    *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-int-cla-999.
       sta-int-cla-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la fincatura       *
      *              *-------------------------------------------------*
           subtract  40                   from p-sel-als-sel
                                        giving w-cgs-wrk-pfn          .
           divide    2                    into w-cgs-wrk-pfn          .
           add       1                    to   w-cgs-wrk-pfn          .
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini superiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione classe                 *
      *              *-------------------------------------------------*
           move      w-cgs-cla-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione classe     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la classe          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione classe                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini inferiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       sta-int-cla-999.
           exit.

      *    *===========================================================*
      *    * Stampa intestazione classe e gruppo                       *
      *    *-----------------------------------------------------------*
       sta-int-gru-000.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      9                    to   w-cgs-wrk-nln          .
           add       w-cgs-det-idf        to   w-cgs-wrk-nln          .
           if        p-res                >    w-cgs-wrk-nln
                     go to sta-int-gru-200.
       sta-int-gru-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Test se interruzione forzata                    *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-int-gru-999.
       sta-int-gru-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la fincatura       *
      *              *-------------------------------------------------*
           subtract  40                   from p-sel-als-sel
                                        giving w-cgs-wrk-pfn          .
           divide    2                    into w-cgs-wrk-pfn          .
           add       1                    to   w-cgs-wrk-pfn          .
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini superiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione classe                 *
      *              *-------------------------------------------------*
           move      w-cgs-cla-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione classe     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la classe          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione classe                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione gruppo                 *
      *              *-------------------------------------------------*
           move      w-cgs-gru-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione gruppo     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per il gruppo          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione gruppo                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini inferiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       sta-int-gru-999.
           exit.

      *    *===========================================================*
      *    * Stampa intestazione classe, gruppo, sottogruppo           *
      *    *-----------------------------------------------------------*
       sta-int-sgr-000.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      10                   to   w-cgs-wrk-nln          .
           add       w-cgs-det-idf        to   w-cgs-wrk-nln          .
           if        p-res                >    w-cgs-wrk-nln
                     go to sta-int-sgr-200.
       sta-int-sgr-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Test se interruzione forzata                    *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-int-sgr-999.
       sta-int-sgr-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la fincatura       *
      *              *-------------------------------------------------*
           subtract  40                   from p-sel-als-sel
                                        giving w-cgs-wrk-pfn          .
           divide    2                    into w-cgs-wrk-pfn          .
           add       1                    to   w-cgs-wrk-pfn          .
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini superiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione classe                 *
      *              *-------------------------------------------------*
           move      w-cgs-cla-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione classe     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la classe          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione classe                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione gruppo                 *
      *              *-------------------------------------------------*
           move      w-cgs-gru-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione gruppo     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per il gruppo          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione gruppo                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione sottogruppo            *
      *              *-------------------------------------------------*
           move      w-cgs-sgr-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione sottogrup- *
      *              * po                                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per il sottogruppo     *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione sottogruppo                         *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini inferiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       sta-int-sgr-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali generali                               *
      *    *-----------------------------------------------------------*
       azz-tot-gen-000.
       azz-tot-gen-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali per classe                             *
      *    *-----------------------------------------------------------*
       azz-tot-cla-000.
       azz-tot-cla-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali per gruppo                             *
      *    *-----------------------------------------------------------*
       azz-tot-gru-000.
       azz-tot-gru-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali per sottogruppo                        *
      *    *-----------------------------------------------------------*
       azz-tot-sgr-000.
       azz-tot-sgr-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [cli]                         *
      *    *-----------------------------------------------------------*
       let-arc-cli-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cli-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-cli-cod    =    zero
                     go to let-arc-cli-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI"             to   f-key                  .
           move      w-let-arc-cli-cod    to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-cli-400.
       let-arc-cli-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-cli-rag-soc       to   w-let-arc-cli-rag      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-cli-999.
       let-arc-cli-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-cli-flg      .
           move      all   "."            to   w-let-arc-cli-rag      .
           go to     let-arc-cli-999.
       let-arc-cli-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cli-rag      .
       let-arc-cli-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dcc]                         *
      *    *-----------------------------------------------------------*
       let-arc-dcc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-cli    =    zero
                     go to let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI"             to   f-key                  .
           move      w-let-arc-dcc-cli    to   rf-dcc-cod-cli         .
           move      w-let-arc-dcc-dpz    to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcc-400.
       let-arc-dcc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcc-rag-soc       to   w-let-arc-dcc-rag      .
           move      rf-dcc-cod-vlt       to   w-let-arc-dcc-vlt      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcc-999.
       let-arc-dcc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcc-flg      .
           move      all"."               to   w-let-arc-dcc-rag      .
           move      spaces               to   w-let-arc-dcc-vlt      .
           go to     let-arc-dcc-999.
       let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-rag      .
           move      spaces               to   w-let-arc-dcc-vlt      .
       let-arc-dcc-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zls]                             *
      *    *-----------------------------------------------------------*
       let-arc-zls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zls-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice listino a Spaces                 *
      *              *-------------------------------------------------*
           if        w-let-arc-zls-cod    not  = spaces
                     go to let-arc-zls-400.
       let-arc-zls-200.
      *              *-------------------------------------------------*
      *              * Se codice listino a Spaces                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Descrizione listino                         *
      *                  *---------------------------------------------*
           move      "Listino Base        "
                                          to   w-let-arc-zls-des      .
      *                  *---------------------------------------------*
      *                  * Valuta per il listino, valuta base          *
      *                  *---------------------------------------------*
           move      c-sgl                to   w-let-arc-zls-vlt      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-zls-999.
       let-arc-zls-400.
      *              *-------------------------------------------------*
      *              * Se codice listino a non Spaces                  *
      *              *-------------------------------------------------*
       let-arc-zls-450.
      *                  *---------------------------------------------*
      *                  * Lettura per codice                          *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODLST    "         to   f-key                  .
           move      w-let-arc-zls-cod    to   rf-zls-cod-lst         .
           move      "pgm/dcp/fls/ioc/obj/iofzls"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zls                 .
      *                  *---------------------------------------------*
      *                  * Deviazione secondo l'esito della lettura    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-zls-550.
       let-arc-zls-500.
      *                  *---------------------------------------------*
      *                  * Se record esistente                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione listino                     *
      *                      *-----------------------------------------*
           move      rf-zls-des-lst       to   w-let-arc-zls-des      .
      *                      *-----------------------------------------*
      *                      * Valuta per il listino                   *
      *                      *-----------------------------------------*
           move      rf-zls-cod-vlt       to   w-let-arc-zls-vlt      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-zls-999.
       let-arc-zls-550.
      *                  *---------------------------------------------*
      *                  * Se record non esistente                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di uscita ad errore                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-let-arc-zls-flg      .
      *                      *-----------------------------------------*
      *                      * Descrizione listino                     *
      *                      *-----------------------------------------*
           move      all   "."            to   w-let-arc-zls-des      .
      *                      *-----------------------------------------*
      *                      * Valuta per il listino                   *
      *                      *-----------------------------------------*
           move      spaces               to   w-let-arc-zls-vlt      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-zls-999.
       let-arc-zls-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zvl]                             *
      *    *-----------------------------------------------------------*
       let-arc-zvl-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zvl-flg      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del valore della sigla va- *
      *              * luta                                            *
      *              *-------------------------------------------------*
           if        w-let-arc-zvl-cod    =    c-sgl
                     go to let-arc-zvl-200
           else if   w-let-arc-zvl-cod    =    spaces
                     go to let-arc-zvl-400
           else      go to let-arc-zvl-600.
       let-arc-zvl-200.
      *              *-------------------------------------------------*
      *              * Se sigla valuta pari alla valuta base           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Descrizione valuta in lingua italiana       *
      *                  *---------------------------------------------*
           move      c-des                to   w-let-arc-zvl-des      .
      *                  *---------------------------------------------*
      *                  * Descrizione valuta internazionale           *
      *                  *---------------------------------------------*
           move      c-din                to   w-let-arc-zvl-din      .
      *                  *---------------------------------------------*
      *                  * Numero decimali valuta                      *
      *                  *---------------------------------------------*
           move      c-dec                to   w-let-arc-zvl-dec      .
      *                  *---------------------------------------------*
      *                  * Tipo di coefficiente per cambio valuta      *
      *                  *---------------------------------------------*
           move      c-tdc                to   w-let-arc-zvl-tdc      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-zvl-999.
       let-arc-zvl-400.
      *              *-------------------------------------------------*
      *              * Se sigla valuta a Spaces                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Descrizione valuta in lingua italiana       *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-zvl-des      .
      *                  *---------------------------------------------*
      *                  * Descrizione valuta internazionale           *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-zvl-din      .
      *                  *---------------------------------------------*
      *                  * Numero decimali valuta                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-let-arc-zvl-dec      .
      *                  *---------------------------------------------*
      *                  * Tipo di coefficiente per cambio valuta      *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-zvl-tdc      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-zvl-999.
       let-arc-zvl-600.
      *              *-------------------------------------------------*
      *              * Se sigla valuta diversa dalla valuta base ed    *
      *              * anche diversa da Spaces                         *
      *              *-------------------------------------------------*
       let-arc-zvl-650.
      *                  *---------------------------------------------*
      *                  * Lettura per sigla valuta                    *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODVLT    "         to   f-key                  .
           move      w-let-arc-zvl-cod    to   rf-zvl-sgl-vlt         .
           move      "pgm/dcc/fls/ioc/obj/iofzvl"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zvl                 .
      *                  *---------------------------------------------*
      *                  * Deviazione secondo l'esito della lettura    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-zvl-750.
       let-arc-zvl-700.
      *                  *---------------------------------------------*
      *                  * Se record esistente                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione valuta in lingua italiana   *
      *                      *-----------------------------------------*
           move      rf-zvl-des-ita       to   w-let-arc-zvl-des      .
      *                      *-----------------------------------------*
      *                      * Descrizione valuta internazionale       *
      *                      *-----------------------------------------*
           move      rf-zvl-des-int       to   w-let-arc-zvl-din      .
      *                      *-----------------------------------------*
      *                      * Numero decimali valuta                  *
      *                      *-----------------------------------------*
           move      rf-zvl-num-dec       to   w-let-arc-zvl-dec      .
      *                      *-----------------------------------------*
      *                      * Tipo di coefficiente per cambio valuta  *
      *                      *-----------------------------------------*
           move      rf-zvl-def-tdc       to   w-let-arc-zvl-tdc      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-zvl-999.
       let-arc-zvl-750.
      *                  *---------------------------------------------*
      *                  * Se record non esistente                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di uscita ad errore                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-let-arc-zvl-flg      .
      *                      *-----------------------------------------*
      *                      * Descrizione valuta in lingua italiana   *
      *                      *-----------------------------------------*
           move      all   "."            to   w-let-arc-zvl-des      .
      *                      *-----------------------------------------*
      *                      * Descrizione valuta internazionale       *
      *                      *-----------------------------------------*
           move      all   "."            to   w-let-arc-zvl-din      .
      *                      *-----------------------------------------*
      *                      * Numero decimali valuta                  *
      *                      *-----------------------------------------*
           move      zero                 to   w-let-arc-zvl-dec      .
      *                      *-----------------------------------------*
      *                      * Tipo di coefficiente per cambio valuta  *
      *                      *-----------------------------------------*
           move      spaces               to   w-let-arc-zvl-tdc      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-zvl-999.
       let-arc-zvl-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zp1]                             *
      *    *-----------------------------------------------------------*
       let-arc-zp1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp1-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice classe a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-zp1-cla    =    zero
                     go to let-arc-zp1-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLA    "         to   f-key                  .
           move      w-let-arc-zp1-cla    to   rf-zp1-cod-cla         .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zp1-400.
       let-arc-zp1-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zp1-des-cla       to   w-let-arc-zp1-des      .
           move      rf-zp1-mne-cla       to   w-let-arc-zp1-mne      .
           move      rf-zp1-ult-sud       to   w-let-arc-zp1-sud      .
           move      rf-zp1-sqz-num       to   w-let-arc-zp1-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zp1-999.
       let-arc-zp1-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zp1-flg      .
           move      all   "."            to   w-let-arc-zp1-des      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-zp1-cla    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edm                to   w-let-arc-zp1-mne      .
           go to     let-arc-zp1-600.
       let-arc-zp1-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp1-des      .
           move      spaces               to   w-let-arc-zp1-mne      .
       let-arc-zp1-600.
           move      zero                 to   w-let-arc-zp1-sud      .
           move      zero                 to   w-let-arc-zp1-sqz      .
       let-arc-zp1-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zp2]                             *
      *    *-----------------------------------------------------------*
       let-arc-zp2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp2-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice gruppo a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-zp2-gru    =    zero
                     go to let-arc-zp2-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODGRU    "         to   f-key                  .
           move      w-let-arc-zp2-cla    to   rf-zp2-cod-cla         .
           move      w-let-arc-zp2-gru    to   rf-zp2-cod-gru         .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zp2-400.
       let-arc-zp2-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zp2-des-gru       to   w-let-arc-zp2-des      .
           move      rf-zp2-mne-gru       to   w-let-arc-zp2-mne      .
           move      rf-zp2-ult-sud       to   w-let-arc-zp2-sud      .
           move      rf-zp2-sqz-num       to   w-let-arc-zp2-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zp2-999.
       let-arc-zp2-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zp2-flg      .
           move      all   "."            to   w-let-arc-zp2-des      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-zp2-gru    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edm                to   w-let-arc-zp2-mne      .
           go to     let-arc-zp2-600.
       let-arc-zp2-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp2-des      .
           move      spaces               to   w-let-arc-zp2-mne      .
       let-arc-zp2-600.
           move      zero                 to   w-let-arc-zp2-sud      .
           move      zero                 to   w-let-arc-zp2-sqz      .
       let-arc-zp2-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zp3]                             *
      *    *-----------------------------------------------------------*
       let-arc-zp3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp3-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice sottogruppo a zero               *
      *              *-------------------------------------------------*
           if        w-let-arc-zp3-sgr    =    zero
                     go to let-arc-zp3-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODSGR    "         to   f-key                  .
           move      w-let-arc-zp3-cla    to   rf-zp3-cod-cla         .
           move      w-let-arc-zp3-gru    to   rf-zp3-cod-gru         .
           move      w-let-arc-zp3-sgr    to   rf-zp3-cod-sgr         .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zp3-400.
       let-arc-zp3-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zp3-des-sgr       to   w-let-arc-zp3-des      .
           move      rf-zp3-mne-sgr       to   w-let-arc-zp3-mne      .
           move      rf-zp3-ult-sud       to   w-let-arc-zp3-sud      .
           move      rf-zp3-sqz-num       to   w-let-arc-zp3-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zp3-999.
       let-arc-zp3-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zp3-flg      .
           move      all   "."            to   w-let-arc-zp3-des      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-zp3-sgr    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edm                to   w-let-arc-zp3-mne      .
           go to     let-arc-zp3-600.
       let-arc-zp3-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp3-des      .
           move      spaces               to   w-let-arc-zp3-mne      .
       let-arc-zp3-600.
           move      zero                 to   w-let-arc-zp3-sud      .
           move      zero                 to   w-let-arc-zp3-sqz      .
       let-arc-zp3-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [lst]                             *
      *    *-----------------------------------------------------------*
       let-arc-lst-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-lst-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spazi                          *
      *              *-------------------------------------------------*
           if        w-let-arc-lst-tip    =    01     and
                     w-let-arc-lst-cod    =    spaces
                     go to let-arc-lst-500.
           if        w-let-arc-lst-tip    =    02     and
                     w-let-arc-lst-cli    =    zero
                     go to let-arc-lst-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "LSTPRO    "         to   f-key                  .
           move      w-let-arc-lst-tip    to   rf-lst-tip-rec         .
           move      w-let-arc-lst-cod    to   rf-lst-cod-lst         .
           move      w-let-arc-lst-cli    to   rf-lst-cod-cli         .
           move      w-let-arc-lst-vlt    to   rf-lst-sgl-vlt         .
           move      w-let-arc-lst-pro    to   rf-lst-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-lst-400.
       let-arc-lst-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-lst-prz-lst       to   w-let-arc-lst-prz      .
           move      rf-lst-per-sco (1)   to   w-let-arc-lst-sco (1)  .
           move      rf-lst-per-sco (2)   to   w-let-arc-lst-sco (2)  .
           move      rf-lst-per-sco (3)   to   w-let-arc-lst-sco (3)  .
           move      rf-lst-per-sco (4)   to   w-let-arc-lst-sco (4)  .
           move      rf-lst-per-sco (5)   to   w-let-arc-lst-sco (5)  .
           move      rf-lst-per-pvg (1)   to   w-let-arc-lst-pvg (1)  .
           move      rf-lst-per-pvg (2)   to   w-let-arc-lst-pvg (2)  .
           move      rf-lst-per-pvg (3)   to   w-let-arc-lst-pvg (3)  .
           move      rf-lst-dva-ini       to   w-let-arc-lst-ini      .
           move      rf-lst-dva-fin       to   w-let-arc-lst-fin      .
      *                  *---------------------------------------------*
      *                  * Preparazione tipo funzionamento             *
      *                  *---------------------------------------------*
           if        rf-lst-snx-prz       =    "S"  and
                     rf-lst-snx-sco       =    "S"  and
                     rf-lst-snx-pvg       =    "S"
                     move  01             to   w-let-arc-lst-tfu
           else if   rf-lst-snx-prz       =    "S"  and
                     rf-lst-snx-sco       =    "N"  and
                     rf-lst-snx-pvg       =    "N"
                     move  02             to   w-let-arc-lst-tfu
           else if   rf-lst-snx-prz       =    "N"  and
                     rf-lst-snx-sco       =    "S"  and
                     rf-lst-snx-pvg       =    "N"
                     move  03             to   w-let-arc-lst-tfu
           else if   rf-lst-snx-prz       =    "N"  and
                     rf-lst-snx-sco       =    "N"  and
                     rf-lst-snx-pvg       =    "S"
                     move  04             to   w-let-arc-lst-tfu
           else if   rf-lst-snx-prz       =    "S"  and
                     rf-lst-snx-sco       =    "S"  and
                     rf-lst-snx-pvg       =    "N"
                     move  05             to   w-let-arc-lst-tfu
           else if   rf-lst-snx-prz       =    "S"  and
                     rf-lst-snx-sco       =    "N"  and
                     rf-lst-snx-pvg       =    "S"
                     move  06             to   w-let-arc-lst-tfu
           else if   rf-lst-snx-prz       =    "N"  and
                     rf-lst-snx-sco       =    "S"  and
                     rf-lst-snx-pvg       =    "S"
                     move  07             to   w-let-arc-lst-tfu
           else      move  zero           to   w-let-arc-lst-tfu      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-lst-999.
       let-arc-lst-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-lst-flg      .
           move      zero                 to   w-let-arc-lst-prz      .
           go to     let-arc-lst-600.
       let-arc-lst-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-let-arc-lst-prz      .
       let-arc-lst-600.
           move      zero                 to   w-let-arc-lst-sco (1)  .
           move      zero                 to   w-let-arc-lst-sco (2)  .
           move      zero                 to   w-let-arc-lst-sco (3)  .
           move      zero                 to   w-let-arc-lst-sco (4)  .
           move      zero                 to   w-let-arc-lst-sco (5)  .
           move      zero                 to   w-let-arc-lst-pvg (1)  .
           move      zero                 to   w-let-arc-lst-pvg (2)  .
           move      zero                 to   w-let-arc-lst-pvg (3)  .
           move      zero                 to   w-let-arc-lst-ini      .
           move      zero                 to   w-let-arc-lst-fin      .
           move      zero                 to   w-let-arc-lst-tfu      .
       let-arc-lst-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [zos] per [dcp]                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/lzosdcp0.lts"                   .
          
      *    *===========================================================*
      *    * Subroutines per l'accettazione codice listino             *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acodzls0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione codice cliente commerciale *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmndcc0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice valuta          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acodzvl0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice filtro ordina-  *
      *    * mento e selezione per file [dcp]                          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/azosdcp0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per determinazione prezzo di vendita          *
      *    *-----------------------------------------------------------*
           copy      "pgm/fat/prg/cpy/dprzven0.dts"                   .

